[
{"rating": 5, "title": "Terrific purchase", "review": "Nice value for mobile at 10999/-. Delivered in a day. \n\nFHD+ screen is delight for eyes.. \n\nCamera is good in ample lights and performs average in low light. Front camera is good than back camera. \n\nBattery backup decent and last a day on normal use without heavy use. \n\nApprox 22gb internal memory free on first boot.\n\ngood matte finish transparent white case provided in the box.\n\nsapphire blue color looks awesome.\n\nbuild quality is like premium phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Vaibhav Lalit"},
{"rating": 5, "title": "Super!", "review": "Very good product at this price range", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Paras  Prajapati"},
{"rating": 5, "title": "Perfect product!", "review": "Honor is very legend\nGood product in 11k\nWorld no 3 brand 👍", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Ahmad Gazali"},
{"rating": 5, "title": "Must buy!", "review": "100% honest review, used it fully for about 10 days now.\nFirst of all the build quality of the phone is awesome, feels premium.\nScreen is good though not completely bezel less but yes its impressive both on and off. The FHD+ resolution is really good,crisp,sharp and vibrant. Super smooth touch. Aspect ratio 18:9 provides good viewing experience especially videos and apps that supports it.\nNext, UI is pretty good, I personally feel that it is better than MIUI.\nSound quality of main speaker and the earpiece is very good, loud and crisp. It also has loud voice mode for calls for better sound.\nFingerprint sensor is good. Provides additional functions like pulling down the notification bar and scroll through photos. Clicking pictures is a standard feature now a days.\nNow come to the Camera which is one of the USP of the phone. The front camera is 'ACTUALLY' better than the rear camera. For the \"BOKEH\" effect you may have to struggle a bit while using the rear cam but it is quiet easy in the front cam. Some people are putting negative reviews because they can not take bokeh effect shots. Let me make it simple for you, in the camera interface, the top bar has options in which second one is the portrait mode. Turn that on.Then in the bottom right you have two options vertically aligned.\nThe first one in the option to turn bokeh effect on or off(second one is the beauty level with a icon of a female face). Remember bokeh effect only works in the portrait mode. The procedure is same for both front and rear cam.\nFacebook apps sometimes hangs the phone. (They do it in all phones,this is not an exception).\nBattery could have better, but it easily holds for a day on normal usage and may last even longer with minimal usage. Two power saving options are present. Ultra power saving may provide some more hours in standby mode which is actually good when you are travelling without power backup.\nPersonally speaking the 11K variant is best buy. 15K for 1GB extra ram and 32GB extra storage is not justified.\nLast but not the least, you will be satisfied by this phone. It is good.\nHOPE THIS REVIEW HELPS. THANKS ALL", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Feb, 2018", "reviewer": "Saurabh Vashishth"},
{"rating": 5, "title": "Worth every penny", "review": "Super mobile..!!", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "SACHIN S ALAVANDI  ALAVANDI "},
{"rating": 5, "title": "Fabulous!", "review": "Kudos to flipkart for fast delivery....\nHonor 9 lite has a good build quality with superb display and camera specially in good lighting conditions...", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Utsav Thakkar"},
{"rating": 5, "title": "Great product", "review": "Good phone yeah", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "PURUSHOTAM KAUSHIK"},
{"rating": 5, "title": "Worth every penny", "review": "Today I Got Honor 9 lite\nThanks for flipkart.... I got phone within 22hrs that's amazing. Review after usages\n📱📱📱📱📱📱📱📱📱📱📱📱📱📱📱📱📱\n\n \nPros-\nCamera 🎥.               10/🔟 (best selfie forever)\nDisplay. (FHD+)        9/  🔟 \nSound.                       9/  🔟 \nBuilt Quality.             9/  🔟 \nBattery 🔋.                9/  🔟\nCharging Speed.      9/  🔟 \nNetwork Strength    10/🔟(awesome with Jio)\nGaming  🎮.             10/🔟\nLooks.                       10/🔟 \nFingerprint sensor  10/🔟 \nDelivery.                    10 /🔟\n\n🆔 🆔🆔🆔🆔🆔🆔🆔🆔🆔🆔🆔🆔🆔🆔🆔🆔🆔🆔🆔\n\ncons-\n*No direct video calling option from main log\n\n*Hybrid Sim slot\n* TFT display \n\n🎰🎰🎰🎰🎰🎰🎰🎰🎰🎰🎰🎰🎰🎰🎰🎰🎰\n\nYou can take fingerprint sensor to browsing photo also many features. 🔟 \n\nGuys don't think only go for it....\nIt doesn't looks 11K phone....\nIf you buy it then you realized how awesome💯", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific purchase", "review": "Hello\n\nBefore purchasing this product I have used MI A1 and Redmi Note 4 . I will try to compare these 3 phones as per my experience.\n\nI used redmi note 4 for almost 9 to 10 Months. Overall experience was really good the only problem which I faced is the weight and even the front camera. Later on my birthday my wife gifted me the MI A1 .... Again the same issue the weight and the size of the device was more , But it clicks really good pictures from back camera. I felt MI A1 a very boring device because of its UI which was stock android. I really enjoined using MI devices because of its MIUI. Because of this reason I sold MI A1 and Purchased this lite weight beauty.\n\nAdvantages of purchasing 9 Lite:-\n\n1. Perfect phone for 1 handed usage and lite weight.\n2. EMUI loaded with lot of customization and Functionalities\n3. Front facing camera clicks really good selfies at this price range\n4. Display , Build and Design of the Phone is top notch.\n5. Network reception and call quality is perfect\n6. Medium level games like WCC2. Sachin Saga, Asphalt Nitro can be played without any lags.\n7. Fingerprint scanner unlocks the phone in fraction of a second.\n8. Last but not the least Back cover provided with in the box fits perfectly and does not make phone in hand feel bulky.\n  \nDisadvantages:-\n\n1. Back camera is average if compared with MI A1.\n2. Sometimes we can see a minor lag hope it will be fixed in upcoming OTA update.\n3. High end gamer has to rethink before purchasing !\n4. EMUI comes with some uninstallable bloat-wares \n\nI hope my review might help to decide whether to go for this device or not!", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "SUMANT GUDIHAL"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Honor 9 lite pros.\n1. Camera is good\n2. Battery performance is better then MIA1\n3. GPS connection is also good.\n4. Slim phone with light weight.\nI recommend you go for it midnight black suberb.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "Manish  Kumar "},
{"rating": 5, "title": "Excellent", "review": "Its very light....recieved in a day and delivery was spontaneous.....Will update more about performance in a month..... Mobile is a very feel good factor...... Updating again as i said before.. Performance is fantastic.. Battery is a letdown... Camera is average.... And after a month i am reselling this Mobile to someone else for redmi 5 pro coz i am more use to snapdragon...having said that doesn't mean this honor 9 lite lacks anything.But i am more technical and there is a slight advantage for redmi note 5 pro due to sd636 with kryo 260 which is usually found in 800 sd series....", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Fabulous!", "review": "Jordar phone\nAwesome camera \nAwesome display\nAwesome functions\nAwesome work \nAwesome look", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "Kalpesh Prajapati"},
{"rating": 5, "title": "Awesome Phone", "review": "after using this device within 10min i forget all devices. truly lovely phone😍😍😍", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "Ansari Aquib"},
{"rating": 5, "title": "It worth the money, low budget superstar", "review": "As I compare the phone at various sites and youtube, most of the sites were in xiaomi side, but still I went for honor 9 lite !\n\nCamera is very gud, it captures good pictures with details...\n\nEmui 8 with android oreo has much more features that you will luv to use them !\n\nMobile looks very costly in looks and mirror back glass is awesome, even its back cover has a top quality !\n\nMob worths the, 10999₹ price tag !\n\nMost of the websites and youtube channels and some comments are doing paid promotions for xiaomi, so don't pay attention to such fake news !\n\nGo for the honor if u want some different and new device with all features !!", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Mind-blowing purchase", "review": "Delivery very fast delivery by flipkart awesome  phone good but battery performance is low", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Saurabh  Tiwari"},
{"rating": 5, "title": "I just loved before seeing it", "review": "Awesome mob. Looks pretty cool and awesome camera but small battery life.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Vikas  singh"},
{"rating": 5, "title": "Brilliant", "review": "Awesome mobile with superb features..... Highly recommended for a 11k price segment...", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Venkatesh Sharma"},
{"rating": 5, "title": "excellent phone in 9900, cant be beaten at this price", "review": "This is 4th Honor phone in my family in last 1 yr...so good job Huawei to step up as a serious player in  India.\n\nnow abt the Honor 9 lite..Great Phone.. best deal in 9900 Rs paid after  citi bank discount.....\n\n1. Cameras: Simply awesome. nice colour balance some like saturated some dont ..but its better than honor 7x\n2. Size: Amazing....not exactly a single handed usable phone but very compact and superlight. I have honor 7x but thats  big and geavy\n3. OS: Typical honor style custom skin, and oreo features are visible here and there..u can t make out its oreo until u long press icons and they show menu. I would say, they should have provided  the geberic pixel launmcher as well for an oreo experience.\n4. Special feature: Face unlock hopefully to be available soon for this phone so big thumbs up.\n5. Battery: Very nicely optimized, lasts u 1 full day, I rxed phone battery was 67% that was 12 noon, By end of day it was 15% at 8 pm and by then I had the phone installed with 3+GB whatsapp data and 1GB apps downloaded. I started using battery saver then and battery was 3% at 10pm..sobig thumbs up.i got 4 hr Screen on time from 67% battery.\n6.Speed. : For unknown reasons it perform equallly good to my 4gb Honor 7x.with 30% low price.\n\nOnly down side it feels too fragile, its solid in build but it keeps me worried the glass back, so good looking back cover is must\n\nit came with no screen guard Back cover provided is a down for me...but its no biggie..the phone is awesome and ousines the price", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "Saurabh Verma"},
{"rating": 5, "title": "Awesome", "review": "Good prudect very happy", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Skander Sikander"},
{"rating": 5, "title": "Brilliant", "review": "Awesome. Mobile\nPros \nSignal and call quality awesome. Better than Motorola and redmi\nFront camera \nFinger print\nDisplay\nLooks\nVolume\n10k me aur Kya chahiye\nCons \nRear camera good but not great", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "abdul khan"},
{"rating": 4, "title": "Product is good but flipkart must have control over sellers.", "review": "Battery is not good. One more thing The seller has cancelled my item when product was dispatched. Flipkart is showing order cancelled by me. Customer care is not aware of these things saying seller cancelled my item.\n\nFlipkart has no control over Sellers very disappointing. \n\n4 * for product and no star for flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "Rohit Pal"},
{"rating": 5, "title": "Just wow!", "review": "Phone is just awesome and Amazing delivery got this phone in 12 hours", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Amit"},
{"rating": 5, "title": "Just wow!", "review": "Bang for the buck at ₹10999/-\nLooks - 10/10\nDisplay - 10/10\nRear Camera - 7/10\nSelfie camera - 8/10\nBuild quality - 9/10 \nUI - 9/10\nGaming - 9/10\nBattery - 7/10\nIf you love stock android experience then its not for you otherwise go for it blindly! The UI is very stable since the SoC (Kirin 659) is also made by huawei only, so the balance in hardware is perfect! Very good budget smartphone with bezel-less display! All in all i'm in love with this beauty! The black color looks killer! \nAlso thanks alot to flipkart for delivering it in just two days!", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Feb, 2018", "reviewer": "harshit  sharma"},
{"rating": 5, "title": "Fabulous!", "review": "Stunning design", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "Adithyan"},
{"rating": 3, "title": "Review post 1 week usage", "review": "OK now...Here is going to be what I call, a genuine and Honest review. I've read many reviews on this phone with people saying...\" Amazing Camera\", \"Great Battery backup\" and ...what not stuff. \n\nAfter using the phone for a week now...I feel:\n\n1. Quad cameras is a TOTAL MESS. Rear camera is so damn horrible ...that I have no words to explain. Front camera is somewhat better.\n2. Battery backup is reasonable as long as you don't end up playing huge games ( heating is also normal, not bad at all).\n3. 18:9 display is so majestic...that...I felt...I've paid this money ONLY for that display. So brilliant is its display.\n4.  Glass back gives you a premium feel ( Fingerprint magnet as well...this phone unless..you starting using a good back cover or the one supplied by Huawei ).\n5. No lag AT ALL on most of the applications I have used ( mind you: I am not playing DEAD TRIGGER or ASPHALT 8 which revealed frame drops).\n\nWith these observations...I want to say, for 10,999...you are getting a smartphone with decent performance. Rear Camera is HORRENDOUS....but with this kind of display and optimum performance...I guess...I am happy to live with it !!\n\nThanks for reading and...Good luck with these \"Flash\" Sales.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jan, 2018", "reviewer": "Antonio G"},
{"rating": 4, "title": "Nice product", "review": "mobile is very good my choice good product", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "MIR MD SAMIM"},
{"rating": 5, "title": "Fabulous!", "review": "Very good product .Nice looking. Light weight. Picture quality is good. Stylish phone", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Inderjeet Singh"},
{"rating": 4, "title": "Very Good", "review": "Honest review after 12 hours of usage from a previous MiA1 user.\n\nDisplay-8/10 \n\n fhd plus looks really bright and colorful but one thing i found a bit disappointing was lag in full screen mode in some apps and fonts are not sharp in chrome.\n\nCamera-8.5/10 \nMia1 wins above this only in portrait mode.rest this beast is a clear winner.Better color reproductivity ,Amazing front camera and smooth camera interface are its USP\n\nBattery7/10\n-Charging isn't that slow..2 hours for a full charge but battery is draining a bit gaster than Mia1.\n\nPhone sound-7.5/10\nThough louder than mia1 but sound isn't that clear.A bit difficult to comprehend what a speaker is saying while wathing movies but thats manageable if you lower the volume to half\n\nProcessing-8.5/10\nNo lag whatsover other than during full.screen mode in some apps.\n\nLooks-9.5/10\n18:9 aspect ratio and 2.5d glass back looks really classy but the phone looks very similar to honor 8 lite\n\n\nFinal verdict\nBoth Mia1 and honor lite are very good product\nIf you want a sleek looking,responsive phone without love for portrait mode,go for honor lite.\nBut if you want a stock android experience.with a better rear camer go for mia1.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Jan, 2018", "reviewer": "mahesh agarwal"},
{"rating": 5, "title": "Raghava rockzz", "review": "Superrrrrrrrbbbb phone more than MiA1 camera quality is Ooosmmmm speed performance is toooo Goodddd bestt mobile in 2k18...", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "RAGHAVA ROCKZZ"},
{"rating": 5, "title": "Must buy!", "review": "After full demonstration of Honor 9lite...\nPhone look(blue)-5/5.  Battery-4.5/5\nRear camera-4.5/5. Front camera-4.7/5\nCharging speed-5/5..gaming speed--4.9/5.. product value for money-5/5...\nOverall impression-4.8/5..\nNd I rate 5/5 to Flipkart for superfast delivered...", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Ankit  Singhal"},
{"rating": 5, "title": "Best phone you can get in this price segment.", "review": "What do you need in a phone costing at 11k?\n\n1.Body - Supeb body finish with 2.5D glass curve coated on a \n                metal. Premium look.\n2.Screen -  What should I tell about it. It's just mesmerising.\n                    18:9 display with minimum  bezel\n3. Camera - Good in light condition. Super fast shutter speed\n                      Great composer, balanced exposure with great \n                      colour  balance. Front Camera is just out of this\n                       World at this range. \n4. Finger Print Sensor -  Fast and Accurate everytime.\n5. Battery-  5-6 continuous heavy usage. 1 day complete \n                     average usage. 1.5 days low usage.Backup is good.\n6. Performance - Previously I was using Mi Note 4 and when i \n                               switch to it I felt no difference. Performance \n                               Is vey good and Ram management is superb. \nOverall this is the best phone you can have at this price range. \nDon't believe in reviews from YouTube channels like Sharma ji Technicals etc. \n They are paid to highlight Mi phones etc \nThey are paid. Just go for it. \nYou will be happy 😊 while using it. \nDo like if you feel it was a useful. \nThank you \nAmbuj Shuklaji", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Feb, 2018", "reviewer": "AMBUJ Shukla"},
{"rating": 1, "title": "Following Cons of phone and flipkart", "review": "1. No video call available from Native dialer. Jio VOLTE Video call not possible. \"Huawei suggested to use third party app like Skype, duo etc\" [problem with all Huawei phones ] \n\n2. No VOLTE on Airtel, only 4g available but Airtel has launched VOLTE in my city. \n\n3. Double tap to lock/wake screen is not working. DidFactory reset but same result. (check if all have the same problem)\n\n4. Slow charging, it took me more than 3 hours to charge from 20 to 100%, while phone was on standby.\n\n\n\nPros, all you know\n\nGo for it if you can live with above mentioned problems faced so far\nEdit 1\nPhone stopped working and now Flipkart 2 times denied my return request by giving lame excuses, now waiting from last 5 days for return window to open,  didn't expected that from Flipkart, delivery fast , but when you get into trouble, no solution", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Jan, 2018", "reviewer": "Deepak Kumar Sharma"},
{"rating": 3, "title": "Nice phone", "review": "Phone is nice. Good professional look in an affordable budget. Phone is pakka budgetwala phone.\n\nCons\nCamera is average don't have high hopes\nBattery is not that great just 3k mah\nHybrid slot\n\nPros\nFingerprint scanner is fast\nPerformance is good also on the 3gigs ram variance", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Jan, 2018", "reviewer": "Flipkart Cu"},
{"rating": 5, "title": "Brilliant", "review": "Best phone Honor 9 lite", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Jan, 2018", "reviewer": "Suraj Kumar"},
{"rating": 3, "title": "Just okay", "review": "Phone is excellent and may be competitor to Redmi Note 5, if camera is at least above average, but it will loose. \n\nIf you are selfie lover, don't buy this, even back camera is also not good.\n\nPhone is very handy,\nDisplay is excellent,\nBattery is excellent,\nBackside of the phone extremely well,\n\nOnly issue is camera.\n\nLittle worried about the price difference of  \n 4000/- between  32gb and 64gb. Which very bad at this price level. Better to decrease the of 64gb version to 12999/-.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jan, 2018", "reviewer": "Alekhya Achanta"},
{"rating": 5, "title": "Useless product", "review": "Pros-\nfeatures are good.\nFront Camera excellent. \nRear camera average. \nScreen quality excellent. \nLook premium. \nAudio output excellent. \nCall conversation excellent. \n\n\nCons-\nI am really disappointed with the performance of the handset. \nI had received a defective handset of honor 9lite.\nNever expected this type of service from flipkart. \n\nThis handset having following  main issues - \n\n1.Battery takes more than 3hours to full charge & battery starts immediate draining between 2-4 Hours on each day regularly.. \n\n2.Some times Call Drops issues in Sim slot2. \n\n3.fingerprint sensor some times doesn't detects the finger. \n\n4. Minor scratches  on handset body.\n\n5. Sometimes Gmail app & YouTube app shows blank half screen.\n\nI think it may be the issue with only my device  due to the defective handset that I had received. \n\n\nBut I hope flipkart will solve this issue and help me as soon as possible..", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Feb, 2018", "reviewer": "ABHIRAM  KUMAR"},
{"rating": 4, "title": "Very Good", "review": "Flipkart service   = 0\nFront camera      = 9\nRear camera       = 6\nRam     manag.   = 9\nUi                          = 10\nFingerprint sc.    = 10\nScreen quality     =10\n\nOverall package is wonderful at 9900.", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Jan, 2018", "reviewer": "Vikas  sharma"},
{"rating": 5, "title": "Must buy", "review": "Awesome design (5/5)\nsuper camera (5/5)\ndisplay (5/5)\nbattery (4/5)\n\nFlipkart delivery is appreciative", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Raheem Vk"},
{"rating": 4, "title": "Good quality product", "review": "Nyc phone...", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Umang  Manglik"},
{"rating": 4, "title": "Value for money", "review": "Stunning looks. Good battery backup (initial stage) . Camera is good(But takes lots of memory for saving a PIC). Overall good value for money. U can't feel regret after buying.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Deewakar Shaw"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "BEST IN CLASS FROM HONOR ....\nFULL GLASS BODY AWESOME BUILD QUALITY AT 11K... THANKS FLIPKART FOR FAST DELIVERY .....AWESOME PURCHASE CHEERS TEAM HONOR.....!", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "KARTIK JAGTAP"},
{"rating": 5, "title": "Highly recommended", "review": "Truely a great fone. I was a mi lover  but this fone is really awesome i t has a great build quality and quad camera in this price range is unbeatable camera is good\nPros\nCamera\nBuild quality\nDusplay\n\nCons\nAvg battery life not as giid as redmi note 4 but satisfactory thanks to kirin 659 which is a power efficient processor.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "junaid shafi"},
{"rating": 4, "title": "Good in overall quality", "review": "After 1 week of use i hve found that, the mob is good in overall quality.. As the smartphone is value for money so dont expect very high camera quality from it... M not a heavy user bt as i used it from last 8 days  so iam here to give my review so it can help you if u wann buy it...so we will start from its camera as it is highlighted by brand. \nOverall rating- 9/10\nValue for money... \n\n1.camera-8/10\nRear camera - 7/10\nAs the camera is good in light bt sometimes u will find that the edges are not clear cut as in mi a1 or in other smartphone from that budget.. \nLow light quality of camera is not so good bt yeah detailing is good in low light, as camera have the spe cial features for the low light it will improve the quality of pictures bt you have to wait it for some time, \nThe best feature of camera is light painting, if you have a skill nd if you are photography lover then this will be really helpful to you...\nThe depth mode nd the bokhe effects are good.. Bt in portrait mode you will find that somewhere edge's are missed up.. \nThe quality of video recordings is good bt as it doesn't have an optical image stabilisation the video unstable.. Bt overall quality of recording nd voice is good. \nFront camera-9/10\nI think this is the one of the best camera in 16k budget smartphones... You have a options like depth mode nd filters too, the overall quality is very good, detailing are also good, nd in low light screen flash option is there.. Portrait mode is better than rear.. \nThe depth mode is good enough.. Bt in low light quality becomes low than the normal.. \n\n2 Battery - 7/10\nAs it has 3000mah battery obviously you will find that it will drain fast as compared to other devices... The overall batteries life is average bt thanks to the company as there is inbuilt power saving modes are there which can improve battery life much better...if u wann then u can add 1 star for the power saving modes which really works good nd help you to save power upto good extent. \n\n3.  performance 9/10\nAfter 8 days of use... I hav find that therr is no lag when you're playing heavy games on high settings... The graphics is very good, nd games play smoothly...\nI have used asphalt xtreme, modern combact 5, shadow fight, gods of rome nd many other heavy games the overall graphics nd performance is  best in this price range...as it has a powerful kirin processor it makes the heavy tasks easier... Nd one of the  best thing is it already comes with the android oreo 8.0, which makes your phone smooth nd fast... \nSo overall quality of the performance increases \n\n4.scree.-9/10\nThough the screen is quite large enough u can easily handle it with your 1 hand, \nThe brightness is very good, 18:9 aspect ratio of screen is very good,\nBt some were you will find that the colours are warms than normal bt its fine.. \nOverall its better than other..\nThe display is full hd+ nd the quality of pictures is really jst an awsm..bezeless display increases the beauty of smartphone.. Once you hond it in your hand, you feel that its really a good thing... \n\n5.Look-9/10\nThe look of the mobile is really awsm you will enjoy it bt while enjoying make sure that it will not fall down..\nAs the back is also made from the glass so u have to take care of that.. I have deducted 1 star bcoz i didn't find that the building quality very high, bcoz as it has glass on both of its side, there must be gorilla glass at least 1 of the side bt u didn't find it...\nSo take care while handing nd use back cover which is provided by company... \nWhich is a goo6 thing...\n\n6. Charging-7/10\nAs it doesn't have a fast charging mode so u cant charge your mobile fast..... It will almost take 2hrs30mins for full charging from 0 to 100% which is not so good... \nSo the charging is slow..\nSo this is the overall review guys if you have some queries then reply.. I hope it will be useful to you...", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Jan, 2018", "reviewer": "Onkar Pardhe"},
{"rating": 4, "title": "Review this product", "review": "Beauty & The BEAST\n\nFirst impression is simple outstanding. It docent looks like a 11k Smartphone.  Look & feel is pretty impressive. I like the color Sapphire Blue.\nInside the Box :\n1. Smartphone\n2. Hard Transparent Back Case with a mat texture\n3. User Manual\n4. Warranty Card\n5. Data Cable\n6. Charger (5V-2Amp)\n7. Sim Ejector Pin\n\nPros:\nAwesome Design with premium look\nFast and snapy performance\nSuper Fast Finger print Scanner\nPretty Good Camera (Specially in day light conditions) - Not yet tested in night time\nAndroid Oreo & EMUI 8\n18:9 Display Looks Impressive\n\nCons :\nNo fast Charging takes a bit longer time to charge.\nHybrid Sim Slot (Sim+Sim or Sim+SD Card)\nSpeaker Sound is Loud but not clear\n\nNote : Its just an initial impression. Their are lot more to check.\n\nVerdict : I this this is only of the best pick at the price is 10999 3GB & 32GB Variant. 4GB & 64GB is overpriced.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Amit Das"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Value for money... Given 5stars for price range and design \nPros:\n1. Display crisp and sharp.\n2. 5.65 fullhd+\n3. Sleek design, aluminium side finishing. Front and back are glass.\n4. Front camera dual & nice options for portrait and bokeh effect \n5. Finger print opens in fractions. \n6. Signal receiver is really good. \n7. Voice clarity is good in mic. \n8. Single speaker but clear music \nCons:\n1. Back camera average, but it's okay for this price range.\n2. Not meant for heavy gamings\n3. Heating at finger print area while playing but optimal heat 41degrees\n4. Back cover given for name sake, not quality one.\n5. No fast charging, full charge took 2hrs 45mins.\n\nPlease like if it's helpful.", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Jan, 2018", "reviewer": "Niyamatullah Syed"},
{"rating": 5, "title": "Worth every penny", "review": "Ultimate phone.got in frst sell. Supar fast delivery.  Camera just awesome fabulous... sleek nd slim design. Grt bettery bakup. Thanku team flipcart. ☺", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Great product", "review": "Excellant Camera, awesome colors with pixels of 2160, and value for money product for just 11000/- only. \n\nThat glossy look of the phone make it a very rich look.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Rajat Bhalla"},
{"rating": 5, "title": "Terrific", "review": "Don't ask stupid questions, it's simply good for the price...", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "Fazu Zori"},
{"rating": 5, "title": "Excellent", "review": "Phone is amazing, it's very light weight, camera is great  and has many features.\nPerformance is pretty fast, multitasking is easy with split screen.\nBattery does last for one full day and it even has ultra power saving mode which can make phone last for 2 days.\nAt this price point the phone is unbeatable.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2018", "reviewer": "Bhaumil Shah"},
{"rating": 5, "title": "Worth every penny", "review": "Guys the phone is  awesome u can go for it but before there are some negative points u have to note that the camera is not so good n heating issue sometimes I didn't like this phone much \nBut now the baap of all phones is coming.......stay tuned for it guys", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Sulaiman Khan skf"}
]