[
{"rating": 5, "title": "Simply awesome", "review": "Excellent phone:honest review\nGot it for 9k , +10% discount on sbi,effective price was 8100 bucks which is amazing\n\nBuild: awesome and sturdy\nPerformance: it is very beautifully balanced between speed and stability,no app crashes and less load time\nI played dead trigger,asphalt, critical ops with out any lag,\n\nBattery : is just amazing ,it lasts a say without breaking a sweat\n\nHeat: it doesn't heat\n\nCharging time: is 1:50hrs in A.C\n\nScreen: gr8\n\nCamera : better than k8 note and is sharper,and faster.colour are so natural and front camera is good\nHowever macro shots have noice.\n\nJio: no issue highest speed recorded on internet speed meter lite:2.1mbps at some specific areas of my house.\n\nBIGGEST PRO: 🔊 1  is just amazing and if u are music enthusiast like me  and have expensive headphones u can just get lost in music\n2.the size of this phone is so perfect\n\nBIGGEST CON: front flash is like it is not there,both rear and front flash are out of sync and in low light u can't take pictures,all it captures is a black screen .but I bought this for it's multimedia features and smalls size and battery.\n\nLike The Review To Help Other People Too\nTy", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Sep, 2017", "reviewer": "Ajay Tripathi"},
{"rating": 5, "title": "Must buy!", "review": "Review after use of 5 days\n\nBattery-10/10\nCamera-8.5/10\nDisplay-10/10 (No screen flickering)\nSound-10/10(Just need one word Dolby Atmos)\nBuilt Quality-9/10\nIt also a VoLte phone\n\nNow Notification LED light is available with OTA update.....\nNow you can record Slow Motion Video...\n\nNo heating issue noticed till now.\nDepth mood is awesome in this price range.\nAnd I love the Stock Android experience.\nOnly issue is no notification dots on app icon. But search about it at web and it should fix at Oreo(8.0) update.\n\nI noticed some people saying one speaker working out of two they don't no well about it. There one is speaker and other is 2nd noise cancellation and it's designed like speaker for good look.\n\nLike if you find my review helpful.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Oct, 2017", "reviewer": "Sayantan Ray"},
{"rating": 5, "title": "Fabulous mobile phone", "review": "Actually I was confused between red me 4 note and Lenovo k8 plus. Some guys suggested me to buy red me 4 note but at last I go with Lenovo k8 plus.\nWhy Lenovo k8 plus?\n1) sounds quality is far superior then others phone within this range.\n2) Camera quality is very good and u will not find front 8mp with flash in this range.\n3) Though processor is not Snapdragon but it is ok \n4) display quality is far better.\n5) additional key for music is differentiate among all phones in this range.\nIf u r looking for good sound quality phone good camera and display go ahead. And if u are game lover then might be u disappoint.\nThank you \nIf u feel this review is helpful kindly like it. \nAll the best.. 👍", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Sep, 2017", "reviewer": "Naveen Tripathi"},
{"rating": 5, "title": "Super!", "review": "Awesome!! A premium phone in just pocket budget.\nLenovo did great Job. Really appreciating.\nDisplay is.. 10/10\nCamera.. 8/10\nBattery.. 10/10\nProcessor.. 10/10\nBuild quality... 10/10\nSpeaker.. 10/10\nVoice and call quality.. 9/10\nPerformance.. 10/10\nOverall... 9.5/10\n* People who saying no Volte in this phone is wrong. Actually they don't know about a smartphone. It has Volte and fast experience.\n** It's really really must have phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Sep, 2017", "reviewer": "Jamal Akhtar"},
{"rating": 4, "title": "Worth the money", "review": "A good battery phone with awesome sound clarity and HD screen..\n\nGot this phone for 9000 on B.B.Days \n\nLooks__ phone looks very premium in hand, you should prefer to choose for venom black colour bcoz that varient looks more premium and classy..\n\nScreen__ Full HD screen 5.2 inches which is easy to operate and if you love watching movies then your experience will be good due to curved Hd glass\n\nSpeaker__ this is the best phone I have ever used in terms of sound and speakers.. It's really very loud plus dolby Atmos works really well.  Music key is also very helpful.\n\nBattery last for almost 2 days with no use and 11 hours with constant 4G Jio usage..\n\nAndroid is 7.1 and is easy and fluid to operate. Plus you will get Android Oreo update which is a good thing..\n\nCameras are good but you should not expect any exceptional level of photo experience..\nDepth mode works well but camera clarity is average .\nFront camera is very good so this is good for selfie plus it has selfie flash for night time...\n\nOverall a good phone at price of 10000.\n\nPlease like my review, if found helpful.\nGod bless India", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Sep, 2017", "reviewer": "Suvansh Kesar"},
{"rating": 5, "title": "Perfect product!", "review": "Excellent", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "Kalmesh Sambrani"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Nice phone\nCamera also nice\nMust buy", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "It's been three months I'm using this phone and i must say I'm really impressed by what i got for just 8100rs. So i would divide it in pros and cons\nPros - \n1.Cheapest dual camera phone in market\n2.It's not hybrid (you can use memory card with dual Sims)\n3.It has full hd screen(it's not available in smartphones at this price range)\n4.helio p25 processor surprisingly surpasses my expectations, it works flawless never hangs\n5.selfie flash good for night selfies\n6. Finger print is very accurate and really quick\n7. It has single speaker but it's as loud as dual speakers\nCons -\n1.Slow updates Lenovo sucks at giving update\n2. No fast charger included\n3. No earphone in the box\n\n\n\n\n\n\nIf you found my review useful then hit like👍\nBye", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jan, 2018", "reviewer": "Deepanshu kumar"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "It's been a week since I am using this awesome thing...I would say I am fully satisfied with the it's performance and worth every penny..\n\nCamera: Rear camera (13+5 MP) can take some really sharp pictures. Impressed with depth mode pics(takes 2 secs to capture).Front cam(8MP) can take good selfie in low light.\n\nDolby Atmos: With good pair of headphones and HD music you get...lost..mobile loud speaker is just average n has some noise in full volume\n\nDecent Battery backup: 18hrs of battery backup With 2 hrs of video streaming,1 hr of music,browsing occasionally,connected to 4g all time.No heating issues while charging.\n\nDisplay is crisp n clear,with nougat the  UI experience is really smooth.Since doesn't have light sensor it's difficult to operate mobile in sunlight.\n\nPerformance: Till now didn't noticed any lag while playing games or while using multiple windows(8 to 10). Although 3GB(2.7GB usable) RAM is fair enough  but it's not sufficient if you are a gamer.\n\nStorage: only 24GB is available out of 32GB storage.No Facebook,whatsapp,insta etc are pre-installed.Dedicated slot for memory card which supports upto 128GB(finally you are getting rid of hybrid slot).\n\nFinally..if you are looking for good camera phone with great music,decent battery you can just buy it without second thought..", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Sep, 2017", "reviewer": "Sharath K C"},
{"rating": 3, "title": "Nice", "review": "The build quality is good. Metal body and finish feels premium. But if you are going after looks from design perspective it's not for you. It's a bulky and heavy device, check and compare dimensions. \nApplications are running smoothly. I read in articles that it doesn't have FM radio and 3.5mm jack but that is not the case. \nOne issue you might find is that it doesn't have inbuilt Gallery app. You have to download an app from playstore, which can have annoying ads. \nTouch is smooth, display quality is not that great but for 11k you can't expect more I guess. You might want to check MI 4 if your friend has one to compare.\nSharp images are captured with dual camera. But problem is that colors wouldn't be same in images as you see them with your eyes. For example tarquoise became Blue, Red became Pink. \nOverall rating would be 7 out of ten.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Sep, 2017", "reviewer": "Pradip Bhaumik"},
{"rating": 5, "title": "Best in the market!", "review": "Very nice...", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "MANIRAJ B"},
{"rating": 4, "title": "Value-for-money", "review": "Writing this review after 48 hours of using it.\n\n\nPros\n\nScreen: It's a full HD screen with beautiful colour saturation, perfect brightness and amazing viewing angles.\n\nBattery: My phone initially was dead or of the box, I had to charge it up first to use it. It charged to a full 100 in 2.5 hours... In which, it charged upto 35 in half an hour. I used it mainly for internet and videos, played a few games just to check the graphic performance and after one whole day (24 hours) I was left with 20% battery. It's amazing.\n\nAudio: Dolby Atmos. Enough said. You will know if you have a nice pair of headphones. \n\nGraphics: played asphalt 8 for 30 mins without any lag at all.\n\nSpeed: Didn't do any benchmarks. However, the animation scales, booting up time AND multitasking is smooth as feather. \n\nCons\n\nCapacitive buttons: the capacitive buttons on the phone are not backlit, niether are customisable.\n\nHeating: it gets a lil heated while charging and continuous gaming. Wasn't an issue for me but can be for people in extreme conditions.\n\nCamera: BIGGEST con of the phone. The camera takes fine ish photos in outdoors and in day times, but pathetic indoor photos. The torch is eye blinding bright, and I won't recommend this for phone photographers. Front camera is average.\n\nNo notification light.\n\nThere are two grills at the bottom for speakers but only the right one works. It would have been an amazing experience if both of the speakers worked.\n\nOverall the phone is a bang for buck. You can't possibly get better than this at this price point. \n\nCheers.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Sep, 2017", "reviewer": "Arnav Kashyap"},
{"rating": 4, "title": "Value-for-money", "review": "1. Awesome sound \n2. Awesome battery\n3. Awesome camera\n4. Average looks", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "Sunil Gandhi"},
{"rating": 4, "title": "Really Nice", "review": "A Very Good Device !\nHaters gonna hate !\n\nAnd who says Volte doesn't works !\nIt's working fantastically ! Jio 4G!\nDevice is fabulous !\nWorking as expected !\n\nOnly noticed one problem of screen flickering at low brightness ! \n\nElse is good !", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Sep, 2017", "reviewer": "Ritesh Yadav"},
{"rating": 5, "title": "Best in the market!", "review": "nice product in this price", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "shubham sharma"},
{"rating": 2, "title": "Value-for-money", "review": "Pls Don't buy this model,\n\n\n* No security patch updates yet 3 months completed .\n* No Led notification even while charging also.\n* Stability bugs like apps force close.\n* Lcd screen is flickering most of the times.\n*All the inbuilt software are based on moto but while copying from moto also Lenovo not performing well..\n\nIf u not satisfied with this information pls check lenovo Forums all the customers are writing thier problems but no one resolving queries..", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Sep, 2017", "reviewer": "FZS"},
{"rating": 4, "title": "Bad quality", "review": "Screen flickering Problem when brightness is low .....", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Sep, 2017", "reviewer": "Mantu Mandal"},
{"rating": 5, "title": "Pretty good", "review": "Good..in this price range\nBattery...just awesome\nDisplay quality too good\nCamera..... normal...just\nSOUNDS...\nIt has Dolby Atmos...Just awesome", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Pritam Mandal"},
{"rating": 4, "title": "Delightful", "review": "Bought at Rs 10999 on day 1, now available at 8999, within 10 days. :(\nPhone is nice. \n\nPros: \nGood battery life.  Last for one and half day for me. From 100 to 5 It was around 32 hours. During this I used it for calling, music and mostly as hotspot about 15 hours. It was still running and I was like wawww\nDisplay is also good. \nDedicated music key\nFront flash\n\nCons : \nRear camera is not that much good as the claim. Took too long to process Depth enabled images and still images lack details and don't have that depth mode effect . Looks like software twik. Normal images are good.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Sep, 2017", "reviewer": "parth zala"},
{"rating": 1, "title": "Did not meet expectations", "review": "Microphone not working. When on call, the other party is unable to hear.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Oct, 2017", "reviewer": "Akash Gaurav"},
{"rating": 5, "title": "Terrible product", "review": "Screen Flickering Issue", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Sep, 2017", "reviewer": "Ramakrishnan RK"},
{"rating": 5, "title": "Highly recommended", "review": "Best mobile...\nSeriously one of the best device in this range..got it in 8100/- in BBD...\nPros:-\n1.5.2 inch good Hd display (viewing angles r good) ,very handy\n2.better battery (easily last for one day with heavy usage)\n3.volte work like a charm(guys it's support jio sim,don't listen to the haters of this company)\n4.install latest update for notification light\n5.mediatek p25 processor,it's better than snapdragon 625 in benchmarking and cores score..(font know y YouTube reviewers making fool to customer that mediatek is worst than snapdragon, guys there r no1 cheaters who talk to defame mediatek)\n6.no heating guys(trust me,it heats at charging that too warmness as it can be ignored as many devices heats like this)\n\nCons:-\n1.capacitive buttons r non backlit (but can b ignore to this price bracket\n\nGuys please don't listen to negative reviews,I personally regret to buy this after seeing the negative comment's...this device can b buyed without any hesitation...and I'm happy to b d owner of this device..nd can happily buyed at this lower price...\nHope my review might help u,\nThanx for reading", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Dec, 2017", "reviewer": "Arun Kumar"},
{"rating": 1, "title": "Worthless", "review": "Screen light fluctuations problem", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Sep, 2017", "reviewer": "shaikh sohel"},
{"rating": 4, "title": "Highly recommended", "review": "It a good phone. Camera quality is good, heating is not there unlike the earlier version. Notification light is not there which is one of the cons", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Value-for-money", "review": "Camera is good.\nBody design is AVG.\nPerfect for entertainment and gaming.\nBack body is metal.\nGood battery backup.\nOnly one issue it heats a little bit,but the phone is overall good and have all the features.\nWith its price the phone is a must buy.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "Daina Devi "},
{"rating": 5, "title": "Highly recommended", "review": "People who say Depth mode is not good:\nThe depth mode is currently under beta version, hopefully the next update will roll out with the fully ready depth mode camera.\nFrom my personal use, the camera is working great for this price range.\n\nPeople who say VoLTE is not working:\nPut your jio Sim in slot number 1 it will work. Too bad you don't know that Jio Sim works only in slot number 1.\n\nPeople about heating issue:\nI kept my mobile in charge until it reached full charge, I experienced no heat issue. (It was in charge for more than an hour).\n\nThere is nothing wrong with the device, it is the best for this price range. Redmi Note 4 can't compete with this, I guarantee you that. \n\nCan thoroughly rely on this mobile, without any fear. There is no negative in this mobile.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Sep, 2017", "reviewer": "Rey Balajr"},
{"rating": 4, "title": "Best phone at reasonable price.", "review": "Using this phone from four days.\nI've read some comments before, so now writing this one.\n\n1. It is a VoLTE device means it enables call directly without turning the internet on. * *(some others are saying that it's not VoLTE. Though the network is showing LTE but that's VoLTE device.)* *\n\n2. It have notification light, but * *not functioning well,* * if you connect your phone to a charger and turn your phone off, white light can be seen.\n\n3. Used it for four hour continuously to watch movie, it stays cool. But heating while charging, that's OK.\n\n4. Performance very good. Dolby atoms and FHD display makes HD videos theater like.\n\n5. Rapid response, never found it running slowly.\n\n6. Camera is  very good.. * *but it's not a CMOS camera, so not provides Clearer photos at night.* * But best ever pics by day. *Debth sensor can take best pics by day.*\n\n7. * *Late focusing in rear camera.* *\n\n8. Battery is amazing, A whole day performance using videos, gaming and much more.. takes 3hr approx. to charge from 1% to 100%.\n\n9. You can use all three at a time, two sim cards and one memory card.(in redmi only two can be used at a time).\n\n10. Using it without screen protector, doesn't need and screen protector, it is gorilla glass 3, very hard (screen protector recommend for advanced safety) no fingerprints on screen because oleophobic coating.\n\n11. * *Memory card is not functioning properly. I'm using a SAMSUNG EVO CLASS 10 32GB. Sometimes a notification shows external SD card is missing, I also replaced it with a 2 GB card, that I have, same problem.* *\n\nNote: Box does not contain earphone or back cover.\n\n\nThat's all..", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Sep, 2017", "reviewer": "Shubham Agarwal"},
{"rating": 1, "title": "Absolute rubbish!", "review": "Display is blinking continuously. What's the problem? Very upset about the imperfect mobile", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Sep, 2017", "reviewer": "SUBASH M"},
{"rating": 5, "title": "Just wow!", "review": "I am going to review on this mobile, m using this last 8/9 dsys. first of all the battery is great id give 10/11 hours in nonstop using with 4g. charging speed also good,  in 2.5 hours its full charging. prossessor also better on this, u can run two windows at the same time. 2.5D carved with gorilla glass on paper but m doubting on gorilla glass. 5.2 inches full HD display. overall its better for me m recommended this mobile for all. thnx.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Oct, 2017", "reviewer": "Pranjal Sarma"},
{"rating": 5, "title": "Wonderful", "review": "A budget friendly premium complete phone...\nSnapier stock UI..\n3gb RAM is more than enough..\n32GB storage with 20Gb available and expandable upto 128 GB is more than sufficient..\nDolby Atmos Audio makes it music beast...\nGorilla Glass 3.. \nDual Camera with depth mode..\nWhat more to expect at this price point.. with Lenovo like quality brand...", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Must buy!", "review": "Its good but somehow heavy..\nI got it for just 8099/-\nSo its deal for me..", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "VAIBHAV SINGH"},
{"rating": 4, "title": "Worth It", "review": "Stock android , quick \nNo lag or stutters at all even at asphalt 8 .\nStock android tried to compete against my S8's heavy touchwiz or grace UI \nDoesn't heat much .\nJust warms up", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Sep, 2017", "reviewer": "Sravan S"},
{"rating": 1, "title": "Don't waste your money", "review": "I had ordered for K8 plus . The set i had received  had a network problem . signal strength is always showing minimum on display.\nsubsequently  i had requested for replacement  and set was replaced by flipkart , but same problem is there with new set also. I think product has some manufacturing defect in software etc. I had changed sim also but still no use. while the same sim is showing full strength in other handsets. \nNot sure what to do now.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Sep, 2017", "reviewer": "Sumeet wadhwa"},
{"rating": 1, "title": "Hated it!", "review": "I am facing screen flickering issue in low brightness mode even after disabling adaptive brightness and entering safe mode and hard reset.", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Sep, 2017", "reviewer": "M A KHORAJIYA"},
{"rating": 3, "title": "Just okay", "review": "The product is good wrt sound and display.\nISSUE:\nDoesn't support Jio 4G Volte.\nI enabled the Volte manuall using *#*#4636#*#* but it doesn't work.\nIt automatically disables the 4G Volte.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 2, "title": "Moderate", "review": "dual camera not upto the mark.giving gorila glass is a good decision", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Sep, 2017", "reviewer": "Shovon  Manna"},
{"rating": 4, "title": "My reviews after 7 days of use", "review": "Using this product since 7 days. My reviews are:\n\nPros:\n1. Speed\n2. Fast Response\n3. Android version\n4. Fast charging\n5. Battery life is more than 1.5 days in decent usage\n6. No lagging\n7. Music is very loud on speaker\n8. Finger scanner security\n\nCons:\n1. Model is slippery\n2. My JBL earphones are not giving proper output but getting very good sound on other devices.\n3. Colours seems a bit whitish\n\nConclusion: Over all worthy mobile in this price range with very good specification.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Sep, 2017", "reviewer": "Lovey"},
{"rating": 5, "title": "Super!", "review": "If yu need handy device with loaded Specs..... Go For it.... Far Better than Lenovo K8 Note.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "Ashok Pandian"},
{"rating": 5, "title": "Awesome", "review": "Nice", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "Santosh Varma"},
{"rating": 4, "title": "Nice product", "review": "good product awesome battery backup and ram management also good dual camera love it", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Sofi Faisal"},
{"rating": 4, "title": "Wonderful", "review": "Supar", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Utterly Disappointed", "review": "As per desperation products not volte\nPHONE automatically restarting\nWhile watching YouTube phone phones SPEAKER stop and automatically start\n\nNever buy from flipkart\n\nThaey cancel my returns policy\n\nI will never buy any thing from flipkart \n\nAnd tell my friends also never buy\n\nThey also say flipkart policy not approve than what to.do.of policy.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Unsatisfactory", "review": "Most 3rd class phone... Screen flickering prblm is beg...", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jan, 2018", "reviewer": "Mohabotulla Sk"},
{"rating": 3, "title": "Does the job", "review": "Phone is fine but there is no notification light even when you charge it there is no charging notification it's difficult to confirm it is charging or fully charged.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Power packed smartphone out there!!", "review": "Okay so let me tell you why I think this is the best smartphone for this price range..\n\n✓Processor and clock speed :\n If you are gadget geek like me than you will probably know how important these terms are when it comes to performance.This one comes with a mediatek processor which is not as good as compared to the Qualcomm Snapdragon but still it's pretty good..only difference is this phone is designed to reload the games if you have them in background and other phones may resume the game(doesn't mean processor is good ) but still I found this little irritating during gaming...rest assured the phone works pretty good and can handle almost any app or game for that matter..\n\n✓Camera : DONT EXPECT GOOD CAMERA HERE.. although it has 13+5 in the back but I am not sure if the second camera does anything..photos are not good in low light conditions and colour perception is poor.. Overall not a phone for you if you are a camera guy\n\n✓Music: yes this phone has Dolby Atmos..the audio through the headphones are crisp and tuned to your preference..I use Sennheiser cx180 in ear phones and this combination is deadly ...I spend hours every day listening to songs and so will you...360 audio clearance is totally awesome..also it as a music key that is basically for playing music but you can program it for a bunch of other things..\n\n✓O.S : this phone runs stock Android Nougat which means it comes without any skins and also promised update to Oreo(don't know when that is going to happen). multitasking is precise.\n\n*Okay so these are the things I look into before purchasing a phone..I got this one for 9k so no complaints at all.. overall the phone is really good and personally I found this phone better than redmi note 4..\nHope this helps..and if you find this informative, please give it a thumps up..👍👍", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Sep, 2017", "reviewer": "Nagraj Rk"},
{"rating": 5, "title": "Wonderful", "review": "My full review : ( update : volte is working perfectly in both sum slots !!)\n\nOver all a great device for the price !! But mixed views many pros and some cons \n\nI bought it in BBD for below 10k !! It's a great deal for that price !! No complaints !!\n\nPros : \n0: Better signal reception and no call drops !! \n1. Better build quality than redmi devices ( I personally have one so ) \n2. Corning gorilla glass 3 \n3. Dual cam ( performance is ok for the price I paid ) \n4. Good performance for medium to high users ( multitasking is just awesome) (Dono about intensive gaming)\n 5. Super fast fingerprint scanner ( Better faster and accurate than my RN3 )\n6. Great Battery Life ( 3.15 hrs of sot with 35% battery use)(mixed use on 4G/wifi and lil gaming) \n7. GOOD Speaker quality !!! ( Speaker out put is very much satisfactory )( 7/10)\n8: Good Display Quality Better than redmi phones I'm damn sure about it !! \n9: assured Oreo Update !! \n\nCons : \n1: more internal memory is consumed by OS !! 8 GB is consumed by OS very bad !! (UPDATE : 23.9GB is available for user space so good to go !! )  \n2: no led notification light (Update : it is present in between camera and sensor but not usable stupid Moto policy and no Moto display too Maybe provided in future update)\n3: Many blaotware around 8 apps all are Microsoft apps and true caller and Skype but can be disabled everything !!  And 2 Lenovo apps they can be disabled and muted !! \n4: headphone audio quality is not so great (midocre output seriously)\n\nNutral : \nCall quality is good !! Both mic and speaker quality !! But opposite side people say voice is not identifiable I mean not identifiable but Cristal clear !! They can't identify you easily\n\nThat's it overall it's a great phone for under 10 k but not worthy for 11K and above seriously !!\n\nInitial Impressions \n\nLooks : \nIt looks sturdy but dono wether it will survive some occasional drops it has Corning gorilla glass in front and the back is slippery like anything so buy a case immediately !! And lil heavy in hands but 4000 mAh battery and metal casing no complaints !! And the phone matches the size of my redmi note 3 !! Even though it's a 5.2 inch screen cud nee becoz of dual cam setup and non hybrid slot !! Kudos Lenovo for that stuff !!\n\nPerformance : \nEven though it's a mediatek CPU its just super cool with continuous usage of one to two hours with half brightness and auto brightness on  and 4G connectivity volte enabled which covers a bunch of apps download too \n\nThe phone gets lil warm but you can't hardly notice it ! Very less not noticable !!\n\nUi : \nUI is pure stock Android raw aosp with some minor tweaks it gives micro lag experience some times shud be UI fault !! Again it won't be a big issues just micron second !! Other than that it's fluid smooth and handles better all apps no Force closes !! I played some basic games great experience no lags and no over heating checked with CPZ , temperature maintained within 40 degrees after 40 minutes of play all mediocre games with medium brightness and auto brightness on and 4G on\n\nCamera : \nI'm not a pro potographer !! For the camera does great in good light conditions and decent in indoor light conditions and noisy in low light conditions !! So obviously budget camera performance !! \n\nThat's it guys !! Hope my review is helpfull but sorry for long discription !! \n \nRegards \nKesavvel", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "Kesav Vel"},
{"rating": 1, "title": "Must buy!", "review": "Dear flipkart nd flipkart customers,\n        I have placed order to the store INDIFLASHMART for LENOVO K8+ smart phone on September 8th. I received my product on September 11th. When I used my phone in dimlight for the first time with the Adaptive brightness option, I noticed heavy flickering on the display. Then I unchecked the Adaptive brightness option and kept the brightness to the minimum and checked the display, it was flickering continuously. But with brightness as maximum, the display was without any flickering. So to find the reason for this defect, I contacted Lenovo technician through chat through their native site. They suggested to restart the phone and use the phone in safe mode or perform factory reset. I tried both the option but still the defect was not resolved. So I decided to ask for replacement to the seller INDIFLASHMART on September 14 for the above mentioned defect . But I received a mail saying that my request was rejected and they gave the following reply - \n\n\"\"We are sorry to hear that you are facing a problem in the display for the above mentioned product. \n\nWe request you to follow these simple steps that?ll help to fix your issue. \n\nDrag down the status bar \nMove the Brightness slider \nOR \nTap Menu \nGo to Settings \nSelect Display \nTap Brightness Level \nMove the Brightness slider \nIf required, turn OFF Adaptive Brightness \"\"\n\n\nIs this the way ur sellers respond to ur customers????? The fault is with the phone's display and I was asked to adjust this defect with the settings...\n\nI have purchased nearly 5 to 7 phones from ur site. But this is the first time I am facing the problem like this. I am completely taken back by the irresponsible answer from the seller....", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Sep, 2017", "reviewer": "kartheeswaran"},
{"rating": 5, "title": "Perfect product!", "review": "This mobile very nice.\nBut camera 10\nSound 10\nBut mobile heating problem in normal times. \nI have a replacement. \nBut clearly check in use mobile.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "Rajavel Pandian N"},
{"rating": 4, "title": "Nice product", "review": "Good product", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "tanuj"},
{"rating": 5, "title": "Fabulous!", "review": "I used lenovo k8 plus, no heating issue, camera is very very awesome.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Sep, 2017", "reviewer": "sajid khan"}
]