[
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Dual Sim is a diappoinment", "Everything you want in a stable phone", "Best budget phone of the year", "A total bang for your buck!", "BANG for the BUCK!!!", "Redmi's One of Best product !!", "A great phone in the sub ₹10k range", "Redmi 4(3gb/32gb)-FASTEST&CUTEST", "Amazing Phone", "Amazon sale is to sale defective items only."], "review": ["my rating is very specifically based on \"dual sim\" feature.  \nA dual sim phone,for all intents and purposes,unless otherwise highlighted,\nshould work with any country sim.  \nI purchased the phone as i travel regularly and need a phone which would\nsupport my Indian sim as also the sim of the country I travel too.  \nHowever, I realised only after reaching the USA that the Redmi4 does not work\nwith any USA SIM (I tried more than 1 network provider). In todays global\nscenario the company should very clearly share this information with the\nbuyer.\n\n", "Ever wondered that \"I wish my phone had this feature then it would have been\nsomething more\" Well Redmi 4 got everything you would wish for a stable phone,  \n> better camera,  \n> fingerprint sensor,  \n> ir blaster,  \n> gyroscope,  \n> ambient light sensor,  \n> led notification customization,  \n> Both Sim slots supports volTE, 3 gigs of RAM, 32 gigs of storage,  \n> metal body with 2.5 D curved glass which gives a much premium look than any\nother phone even higher than this price range,  \n> 5 gigs free of MI cloud storage  \n> No heating issues at all (stay away from hoaxes)  \n> Can play heavy games and 1080p videos without any lag  \n> Can easily purchase original glass protector from mi.com @Rs 129 only  \n> Only one con as far that it has hybrid sim slots, Either 2 sims or 1 sim & a\nmemory card however they tried to nullify it by providing OTG support so yes\nit does support OTG  \nXiaomi nails it again  \nBest phone in the price range\n\n", "Xiaomi Redmi 4 key features  \nBody: Anodized aluminum back, 2.5D display glass. Black and Gold color\noptions.  \nDisplay: 5.0\" IPS LCD, 1,280x720px resolution, 294ppi.  \nRear camera: 13MP, f/2.0 aperture, phase detection autofocus; 1080p/30fps\nvideo recording.  \nFront camera: 5MP, f/2.2 aperture, fixed focus; 720p/30fps video recording.  \nOS/Software: Android 6.0.1 Marshmallow; MIUI v.8.2.7 custom overlay.  \nChipsets: Qualcomm Snapdragon 435: octa-core CPU (8x1.4GHz Cortex-A53), Adreno\n505 GPU.  \nMemory: 3GB of RAM; 32GB of storage, microSD slot for expansion.  \nBattery: 4,100mAh Li-Po (sealed).  \nConnectivity: DualSIM (micro+nano); LTE Cat. 6 (300Mbps/150Mbps); microUSB\n2.0; Wi-Fi b/g/n; GPS, GLONASS, Beidou.  \nMisc: Rear-mounted fingerprint reader; single speaker on the bottom; 3.5mm\njack; IR emitter, FM radio.  \nMain shortcomings  \nHybrid second SIM/microSD slot limits your options  \nAndroid Marshmallow, still?  \nNo fast charging so you can't top the 4,100mAh battery in a pinch  \nAll in all-  \nXiaomi's on a winning streak with them Redmis and the Redmi 4 is another in a\nlong list of super affordable 5-inchers that cover the basics without breaking\nthe bank. Love our flagships as we might, not everyone needs the latest\nhardware or has money to burn, and that's where the Redmi 4 comes in.  \n  \nXiaomi Redmi 4 review  \nYou get a bright display, which despite the otherwise average contrast is\nquite usable in the sun. You'd also appreciate the solid battery life - the 4\nmay not be the battery champ that the 3 was, but it'll be there for you on the\nlongest of days. We just wish charging were faster.  \n  \nSome may find MIUI too colorful, but Xiaomi's Android overlay is feature-\npacked and will save you a few trips to the Play Store for everyday tools.\nThere's plenty of room for customization too, and the privacy features are\ntop-notch. Oh, and you do get a fingerprint scanner, which some of the big-\nname brands cheap out on for their entry-level models.  \n  \nThe camera output won't necessarily win blind shootouts, but photos are sharp\nenough, and the FullHD videos are among the better ones we've seen, on a\nshoestring or otherwise. The selfies are decent too.  \n  \nThe thing is, it's hard to find competition for the Redmi 4, not at this\nprice. In fact, if you're eyeing the Redmi 4, it may be Xiaomi's own lineup\nthat you need to look at for alternatives. There's the Redmi 4 Prime with a\nFullHD display and a more powerful Snapdragon 625 chip. Going for the Redmi\n4a, you'd save a few bucks, but concede a gig of RAM and 4 CPU cores resulting\nin a tangible dip in performance. Also, no fingerprint reader on the 4a. Or,\nyou can go bigger and opt for a Redmi Note 4 - larger and higher-res display,\nmore powerful chipset, even better battery life.\n\n", "I am very happy with the device. It's fast, it's reliable, battery life is\namazing, camera is awesome. Touch is wonderful even with a tempered glass.\n(I've used phones that slow down on touch with tempered glass) but this one\nruns like a horse. I charge it once in two days with my regular usage, earlier\nI had an iPhone and I had to charge it twice a day. I love the connectivity\nthat the phone offers, I can even control my TV with the IR blaster! In all,\nvery happy that I switched from iPhone. The ability to send files from my\nlaptop to phone via bluetooth is something so simple, but god damn, I missed\nthese simple things on iOS.\n\n", "Kudos to amazon for delivery within 24hrs under prime,  \n  \nComing to actual product, after using it for a couple of days the followings\nare my opinions,  \n  \nPros:  \n1\\. Display - 7/10 good viewing angles, and color saturation, but blacks are\nnot deep enough given that its an LCD.  \n2\\. Battery - 10/10 monster of a battery for a 5\" 720p display.  \n3\\. UI - Easy to use and simple while being functional, MIUI 8 upgradable to\nMIUI 9.  \n4\\. fingerprint Sensor - 10/10 Fast and accurate 100% of the time.  \n  \nCons:  \n1\\. Charging - Takes forever to charge, should have given atleast fast charge\n2.0  \n2\\. Speakers - Its nitpicking but could have been better.  \n  \nHope this was useful, will update after a month.\n\n", "As per Usage of 2Months:  \n1) Camera Quality is Awsm: 9/10 both rear and front.  \n2)Sound Quality Is a bit Low!! 7/10  \n3) Design ...Awsm: 10/10  \n4)Battery: 4100Mah .... greatest pro.. Extreme usage = 1day😘😘:10/10  \n5) Processor and Ram: Not Upto Expectation after 2 months Usage because....a\nbit Hitch in clash of clans and a bit bug! 7/10  \n6)Storage: 32Gb variant @this price is Really good but available 25.8Gb: 8/10  \n7) Features Like Fingerprint, IR Blaster, Second Space, Dual apps....are\nExtraordinary!!😘😘  \n#Finally, I could recommend this Mobile For all....which is Better than every\nPhone @this price.\n\n", "I am using the 3/32Gb variant of the Redmi 4. The phone so far is great. There\nhave been no stutters or lags in the general day to day usage. The CPU and the\nGPU can keep up and do keep up to moderately heavy work loads. The battery\nlife is outstanding. Fingerprint sensor is quite accurate and relatively fast.\nThe only thing that lets this phone down is the screen resolution, but hard to\ncomplain at this price range. As long as the phone is updated, Xiaomi will\nkeep adding new and improved features. If you are in the market for a entry\nlevel android phone with good features, great battery life and moderately\npowerful chipset go for it.\n\n", "I have purchased this product before 1 month and this is my full review about\nthis product...  \n  \nSpecifications:  \n5 inch HD Display 2.5d glass protected(720p resolution)  \nI purchased 3gb ram and 32gb Rom model  \nSnapdragon 435 processor (most energy efficient processor)  \nRear 13mp camera (rocks)  \nFront 5mp camera (good)  \nFull metal body design  \nFingerprint (most fastest)  \nIr blaster (only phone that has it in this price)  \nSpeaker (superb)  \n4100mah battery (more than expectations)  \n  \nI'm personally using it more than a month and it feels very light and the\nmassive 4100mah relives me from thought of battery draining... If you are a\nmoderate user it will last you about 1.5 days.. Camera is the best part rear\ncamera rocks good focusing and front camera is of a good camera  \nDisplay viewing angles are sharp as the display is 5 inch it is very easy to\nuse and also clear in outdoor usage  \nThe black color rules the segment  \nCall quality is nice  \nHead phone jack output is nice  \nFingerprint is very quick  \nMiui is very nice and does it's job perfectly during multitasking and makes\nthe device run without a single lag  \n  \nPros:  \nDisplay  \nBattery  \nUpdates  \nSpeaker  \nMetal body  \nIr blaster  \n  \nCons:  \nHybrid Sim slot  \nFront camera is not too good but ok for this price  \nAs it comes with 2.5d glass finding correct tempered glass is a bit tuff\n\n", "Excellent phone...especially for heavy usage, Battery is very powerful...even\nafter continuously using it for data and call for more than 9 hours Battery\nfound drained upto 50%. Quick discharge of Battery was my only concern with my\nprevious mobile phone. Redmi 4 camera is also found upto the mark either\ndaytime or in the night. It is lightweight and compact which is perfect for\nround the clock usage for anyone. My only concern was its charger which was\nfound not working just after 3 days but thanks to Amazon they supplied me a\nnew charger free of cost. Amazing phone...if u are a heavy data user then go\nfor this phone.\n\n", "Amazon sale is to sale defective items only.  \nThe phone is not up to the mark.  \nNetwork issue did not catch 4g  \nSd card slot unmount automatically.  \nAlso n/w showing full but call did not connect.  \n  \nTried my sim on different phone and it perfectly working fine. Its an\ncellphone issue.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 October 2017", "on 17 August 2017", "on 6 March 2018", "on 14 October 2017", "on 8 January 2018", "on 5 October 2017", "on 31 August 2017", "on 15 November 2017", "on 23 September 2017", "on 13 October 2017"], "reviewer": ["Naila Ibrahim", "Jainendra Singh", "amrita", "Pallav", "JB6", "Poornesh B", "Matruprasad Chand", "Rohith Krishna", "Jugnu Kumar Thakur", "Prateek A."]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["the phone looks nice and handy", "Worth the price", "Not as good as I thought ram management and camera is not so good!", "Excellent produckt", "awsome", "Nice phone", "Bestie......", "Exellent phone, highly recommended!", "Bitter experience with redmi 4", "Its a winning deal"], "review": ["From the first look, the phone looks nice and handy. Sleek and not that heavy.  \nAfter using for couple days, excellent phone for the price. Fits pockets\nperfectly and does the job it is supposed to.  \nThe configs are comparatively equal to the high end phones at a very cheap\nprice. Bought this for my son and it seems to be more than enough for him.\nWhen i ordered, though he was not happy due to the cheap price, the moment he\nstarted using it, is could see his smile :)  \nRecommend this phone.\n\n", "Bought this phone during the sale for 9499 and I think it's totally worth it's\nprice the only drawback is heating issue but not to a very high extent... The\ndisplay is a decent size and clear, sound is good, speed is fabulous compared\nto any other phone in the price range finger lock is prompt camera is average\nbut then again considering the price range you can't expect a dual camera all\nin all totally worth the price and a good buy...and yes I did get the delivery\n3 days before the promised date so appreciate the efficiency of amazon\n\n", "The product is decent at its price but one who is seeking a good camera please\ndon't consider it besides this this in spite of 4 GB RAM the ram management is\nnot so good it's disappear from recent activity  \nAbove is a negative side besides this all on.\n\n", "Excellent quick delivery, excellent phone, gud battery backup, nice grip only\nissue is with the camera quality, at this budget this mobile is a good option,\n\n", "Before time delivery, nicely packed. The package was silled and fine.  \n  \nSmartphone is good, i am satisfied with the product. Gangster 4, real racing\n3, etc games are running without lag on high graphics, not facing any heating\nproblems, not at least for now. I would suggest to manufacturer to provide\nheadphones with the phone as we don't get headphones with the cellphone by\nmanufacturer\n\n", "Posting it after 3 months of usage  \n  \nPro:  \nAwesome battery  \nDecent camera and processor  \nValue for money  \nUnlike samsung, Not much space is utilised by system software  \n  \nCons:  \nHangs if space is less  \nHeating...If play heavy games for more than 15 minutes..  \n  \nOver all it is one of the best phones (can also call top phone) in this price\nsegment, value for money and a worth buy\n\n", "Best mobile under this price\n\n", "As expected from Xiaomi, redmi 4 sets high standards in mobile phone in this\nprice segment, With a fabulous black sleek and operation friendly design, it\nhas remarkably good performance and even long lasting battery life. The phones\ncamera couldve been a little better, but in my opinion this will be one of the\nbest phone in this price segment as of now. I personally recommend it and\nloved it when i got mine. Hope this helps :)\n\n", "While the look and feel of this phone is great. I seriously think our friends\nat MI jumped the gun without quality testing the product before its launch. A\ncouple of issues that has forced me write this negative review about this\nproduct.  \n  \n1\\. The phone stopped working for no reason -Which i think is a valid reason\nfor me to get upset expecially when its just 12 days old. Just doesnt stwich\non even though the battery is fully charged. And i learnt from the net that\nthis is a common problem with redmi 4.  \n  \n2\\. Not well thought UX - Onscreen menue like back, home, options are not back\nlit. Senior citizens find to it extremely hard to operate in low light.\nWondering how much $ did MI save by opting out to have a led behind them.  \n  \nRegret my decision to buy this product. I bought this phone as a gift to a\nfamily member :/\n\n", "Got this one after I water damaged my Moto G3. Love the feel when I hold it,\nvery smooth. The Black color looks really nice with the corner smooth edges.\nBeen using for last 6 months. Come with Marshmallow that was a fall back, but\nrecently got the MIUI 9 update with Nuget. I felt I would die waiting... LOL..\nPerformance is really good, no lag during playing games, display is good but\nnot Full HD. The 3 GB varient is good for 9K, I think you may get it in much\ncheap now. Finger print scanner works flawless and its bundled with lots of\nfeatures that comes with MIUI 9. I really liked the phone, worth the money.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 December 2017", "on 27 September 2017", "on 15 August 2017", "on 8 November 2017", "on 4 October 2017", "on 15 October 2017", "on 30 June 2017", "on 19 August 2017", "on 13 December 2017", "on 24 November 2017"], "reviewer": ["Sasi Kumar", "shyam punjabi", "Amazon Customer", "Anowar", "Amazon Customer", "jack sparrow", "Amazon Customer", "Prerit deshwar", "Amazon Customer", "Amazon Customer"]},
{"rating": ["3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Bloatware and above average support", "Perfect phone for price!", "Beasttt in 9k budget 😈", "Good Value for money. Not an El Cheapo.", "Good Product", "Speaker stop working after plug in Aux so don plug n play.", "Everything is fine except camera", "Punches well above it's weight", "Must buy phone", "Review after using 3 months."], "review": ["Two big problems with this phone:  \n  \n1\\. Its filled with google's bloatware apps with no way to uninstall them.\nThey take up to 20% or RAM. I don't know why we are not allowed to uninstall\nthem.  \n  \n2 [FIXED, the transferred me to superviser who helped me :) ]Whenever I\nconnect it my pc for internet tethering, my pc starts hanging and randomly\nblue screens. The problem is with rndis6 drivers. They give you no support at\nall.\n\n", "1) Phone doesn't heat.  \n2) Both front and secondary camera are decent for price.  \n3) Charges pretty fast.  \n4) Doesn't lag with more than 20 apps installed.  \n5) Call quality is awesome.  \n6) Display is great.  \n7) Phone is pretty slim and light.  \n8) Perfect size for even smaller hands.  \n9) MIUI 8 is awesome.  \n10) Black color makes the phone look like it's high end phone.  \n  \nHaven't tried games yet. I am sure simpler games won't have any impact on\nperformance. Not sure about heavy games but it shouldn't lag.  \nHas been the best purchase for price. Gifted it to dad. He's never been more\nhappy with a phone!  \nGot it from Darshita Electronics.  \n  \nThe only thing I was concerned about was that the phone wasn't packed inside a\nsturdy carton box. The phone was sealed. Overall the box was wrapped with\nbubble-wrap several times before being stuffed in a delivery packet. I am\nsurprised the phone didn't receive any damage. Either the handling of the\nproduct was just too awesome or it's my luck. Anyhow, I am extremely happy\nwith my purchase. Would recommend 10/10!\n\n", "Beast in this price budget.. great value for deal.. i wish i could get 7k\nvarient but.. unfortunately 7k varient gets sold out in just seconds.. this\nflash sale are really headache.. 😅 In 9k price you can't get a better phone\nthan this.. built quality is awesome and don't go for 11k varient as it is\nslightly overpriced.. Decent option in this budget .. 11k varient is also good\nbut 9k varient is the best.. and don't see negative review of people who are\nfrustrated of this flash sale .. just go for it.. this is best in 9k  \nN also you can use google crome extension like price tracker.. 😎 so that you\ndon't have to waste any tym in this flash sales.. Camera is best in 9k it has\nsnapdragon processor not an mediacore cheap processer, ram management also\nworks good.. tha only negative side of this phone is that the buttons don't\nbacklight.. N it has hybrid sim slot n notification led light is of single\ncolour (white)... Other than this is beast in this price budget.. 😈jst go for\nit..\n\n", "It is a good phone.My regular $500 mobile had become unusable. I ordered this\nafter due diligence as suggested by a friend. Find it superb. One charge lasts\nfor 3 days. And this handy 4GB 64 GB 4000mAh has the same features as any 15k+\ndevices. Very happy. Need to try for at least a couple of months for long term\nstability.\n\n", "Battery back two days although use 4 every time, play you tube. and fast\nworking. but screen size is small, if it come in 5.5'' then may be better to\nwrite emails and text . It screen is also good and strong, it felt two time on\nfloor but still remains undamaged.  \nUmesh Singh  \n7985367485\n\n", "Very nice lite weight..  \nFully functional and IR senson for making remote.  \nBut don't plug with audio woofers it being dump i mean after connecting aux\nspeaker not working.\n\n", "I have been using this phone from last 20 days. Good budget smartphone no UI\nlag till now. Battery life is awesome last almost 1.5 days with normal usage,\n10-12 hours screen on time. If you use it with battery saver battery last for\ntwo days in a single charge.  \n  \nNot mentioning pros as everything is fine except:  \n  \nCons:  \n1) Ambient light sensor not every well calibrated.  \n2) Camera performance good in outside conditions, but poor in low lights and\nartificial lighting conditions.  \n3) sound recorded with video is devastating not usable.  \n4) No EIS  \n5) Sound reduction is not calibrated through volume keys.  \n  \nHope this will help!👍\n\n", "This is decent budget product. Great stuff for the price. Snapdragon 430\npunches well above it's wait in day to day operations. It's decent device for\ngaming but not the best, if u want something better go for redmi note 4. Back\ncamera is decent enough, it's not gonna take pictures like iPhone or Samsung\nGalaxy series devices but justifies the price tag. I am actually impressed\nwith front camera since it has wider lens so u can accommodate more people in\nselfies. Looks are great, looks damn good in black colour and has 2.5d curved\nglass. Battery life is best in the class which is 1.5 to 2 days. Xiaomi is\ngenerally late in software update but MIUI is getting better and better. So go\nfor it.\n\n", "Mini iphone at the price of only 6999...omg...love that....thanks to\namazon..build quality is excellent...camera is very good..sound is adequately\nloud... display is also very good....i will give 8 oit of 10 to this phone as\na king of this price segment....only cons is that flash sale....it is annoying\n\n", "Just don't care about anyone's neg review.  \nI can gurantee you the phone is better than any other phone in this price\nrange.  \nCamera quality is far better than moto or samsung.  \nOnly issue I found it slightly heating while playing an high graphics game or\nusing camera for a long time.....  \nBut you can overlook this little issue.  \nEvery game is running without a single lag.  \nIts truely a great device...  \nClose your eyes,Go for it!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 October 2017", "on 10 August 2017", "on 25 August 2017", "on 23 September 2017", "on 13 September 2017", "on 31 January 2018", "on 21 January 2018", "on 25 August 2017", "on 22 September 2017", "on 3 December 2017"], "reviewer": ["Amazon Customer", "Swayam S.", "Amazon Customer", "N.V.Chalapathi Rao", "Amazon Customer", "T. Vashishtha|vastarun4400@gmaildotcom", "smart shopper", "Amazon Customer", "Arkendu ganguly", "Arg Biswas"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Wonderful product!", "Frequent Hangs and Freeze. Not able to attend calls", "My phone does not work well. It has got ...", "This has very bad heating issue and Return process and procedure is worst", "A great budget device", "Go for it", "at this price the best phone that one can afford", "Five Stars", "Five Stars", "Review of the Redmi 4 phone- good and bad features"], "review": ["I am writing this review after using it for a day.This is a Wonderful product\nof Xiaomi.  \n  \nPros:  \n1.Good battery can work for 1.5-2 days with heavy usage  \n2.Good processor sd435 1.4,ghz  \n3.4gb ram 64 GB internal memory  \n4.nice call quality and reception  \n5.good photo from front and rear camera.  \n6.touch smooth  \n7.5 inch screen with 294 inch HD display  \n8.No heating issue while in charging.  \n  \nCons:  \n  \n1Running on old marshmallow  \n2.charging time is around 3 hrs  \n  \nBut overall it's a good product with low budget and in this budget u won't\nfind much alternative with this specs.  \nI have used Redmi 3s prime this is extended version of the same,as it matches\nmost of the things.  \nWith 9500 u should go for it😊\n\n", "I bought it for my friend and he did not liked it.  \n  \nFirst day he experienced over heating and then it was fine, but it hangs\nmultiple times and we cannot even attend a phone call or disconnect it. Need\nto restart phone to make it work again. He experienced the phone very slow and\nsluggish. He said his lenovo phone was better than this.  \n  \nThe same phone is bought by another few friends of mine and they did not have\nany problems mentioned. So I guess its a hardware fault?\n\n", "My phone does not work well. It has got touch screen issue not only that there\nis even some problem with mic and speaker. When I asked for the return, app\nshowed me date 21th august but the person didn't showed up that day so I\ncalled to costumer service now they replied that they won't come to pick up\nthe product and we have to go and submit it then only any action will be\ntaken. If this was the situation I should have been made aware of it before\nwhy this late... frustrating it is...and very disappointing\n\n", "Gave single star because without that I can not rate and write review. This\nhas very bad heating issue and Return process and procedure is worst.  \nTo return, need to download an app then it prompts for a pin, for that we need\nto call from the mobile from which you have orderd (need both the phones to be\nat one place) then talk with customer care executive then bla bla bla . Worst\nworst worst\n\n", "A great budget device you won't regret.  \nThis thing is packed with features.  \n.  \nIt has enough RAM that you won't feel any lag in daily usage.  \nUI is clean but not stock.  \nThe camera is on par with other budget phones.  \n32GB of inbuilt storage so that you won't need a memory card unless you like\nto keep useless junk in your phone.  \nHybrid SIM tray.  \n5\" HD display. Not so bright. You might face issues outdoors.  \nNavigation keys are backlit.  \n4000mAH battery to get you through the day with heavy usage.  \nSpeakers are loud enough.  \n4G VoLTE enabled.  \nand the list goes on..............  \n.  \nWhat else are you expecting from a smartphone this cheap?\n\n", "I shortlisted 2 phones as a gift to my father who just completely shattered\nhis 4 year old LG G Pro Lite. Infocus Vision 3 was the slightly bigger 5.7\",\n2:1 near bezel less, dual camera option, but Redmi 4 was the 5\" beefier spec\noption. My father voted for the 5\" option citing portability.  \n  \nI must say, this phone does not disappoint. After initial charging, it has\nbeen through initial setup, all apps updated, fair bit of calling and 4G\nmobile data usage. After 18 hrs, the battery is still 53%. With moderate to\nlow usage, the battery will last 2 days easily.  \n  \nOne issue I am noticing as the call volume does not get loud. Its ok, but does\nnot get loud. Those wanting to gift this to elderly person with low hearing,\nlook for other phone. However, the loudspeaker is quite good. The other issue\nis the auto brightness feature, which is not quite reliable. Everything else\nis way better than its price point. It comes with MIUI 8, though MIUI 9.1 is\nexpected in the coming weeks. In the budget smartphone category you are\ngetting near mid-range specs. Would definitely recommend this phone.  \n  \nWould update this review with feedback from a weeks use.\n\n", "Worth for what you pay, at this price the best phone that one can afford.\n\n", "Liked this phone\n\n", "Nice phone in this price\n\n", "Sir, i am very much dissatisfied with the colour resolution of this phone,\nwhich is purchased by me at so much higher price of Rs8999/-, compared to\nother brand mobile phones like of Samsung, Vivo, Oppo etc. at this higher\nprice, whose colour resolutions are much better. .Also today i have got the\nmail from you that this 3GB RAM, 32 GB Memory is being offered to sell at\nRs.6999/- only. i have purchased the phone about 30 days back only. So i have\nincurred a huge loss by not waiting for this lesser price of the phone. I am\nalas! But the other various features of the Phone is very good and\nsatisfactory. If you kindly can compensate me for my unfortunate loss any way\nby any means , then I shall be pleased with your marketing policy. Thanking\nyou.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 October 2017", "on 2 December 2017", "on 24 August 2017", "on 27 September 2017", "on 6 January 2018", "on 30 December 2017", "on 29 October 2017", "on 4 December 2017", "on 17 July 2017", "on 30 November 2017"], "reviewer": ["Hemant Ganatra", "Malayalee_Techie", "Amazon Customer", "Amazon Customer", "Rajkumar Singh", "Mukhuti", "AskBhargavi", "Nikhil Dave", "amit kumar", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["The real catogory winner !!!!", "Awesome.............", "Highly recommended", "BEAST AT 4K", "Recieved an updated Jan 2018 made phone , Very happy", "He is disappointed. Maximum screen light in redmi is equal to ...", "The phone is good. Both of its cameras are good", "Its a Gift From Wifey and Its Awesome!", "Redmi 4:Budget killer", "Best choice for the price range less than 10K"], "review": ["I have been using redmi4 3 gb version mobile for more than a week and my\nexperience is...  \nIt looks beautiful and fit well in the palm. As the display is 2.5D, i use\ntempared glass and cover.(easy to broke the display).The disply visibility in\ndaylight is good. I installed 10 more apps and still it working gently and its\nok(don't think it is fast as redmi note4)..I got 1.7 ram out of 3. The power\nof this phone is its battery. 30 minute call,watch a movie, took some video ,\nuse internet 2 house by mobile network..it costs only 45% of battery there are\nplenty to play..he he..  \nThe primary camera is good at daylight conditions. Amost reflecting good\ncolour and saturation is also pretty well. But in bad light conditions its a\nhard game.but I can say below inr 9000 its camera is better than any other\nmobile..and like any other mobile it is also heating up in heavy usage, but\nstill manageable comapare to its defenders. Any way redmi4 is the best mobile@\ninr9000\n\n", "Great Product.  \nEverything I need in one package.  \n  \nBought 3 such products for the whole family. YAH! Redmi 4 Family.......LOL.  \n  \nSeriously though, good product. No issues till date. It come with MIUI 8 but\nhas now got a MIUI 9 update (downloadable). The best part is the \"dual space\"\nfeature. You can literally separate you contacts & other stuff (if you are\nusing two sim. Its not a default scenario. You have to configure it yourself).\n\n", "Superb phone in this price range  \nHere is the detailed review:  \nCons first-  \n(1) metal back is much slippery , you have to be very careful while holding it\nback cover will obviously make it thicker and you will lose the feel  \n(2) miui is not upto my expectation feels laggy if you are android\nenthusiastic  \n  \nNow Pros:  \n(1) first of all its hold and design, most compact phone for a five inch\ndevice, minimal bezels makes it very handy, if you have small palms like mine\n, this phone is for you, weight is light and curved edges makes it feel\nthinner  \n(2)2.5 d curved glass makes it look very beautiful, screen is HD but looks not\nless than FHD , I have lenovo zuk 2 FHD phone , and I dont find any difference\nin resolution  \n(3) yes miui is pIn for me but if you know how to install custom rom and get\nlineage on it , it becomes a killer phone  \nI am enjoying it.. Satisfied and it will remain with me untill it expires..\n\n", "Mind blowing deal and fantastic phone , Thank you Amazon, Got it for 4k upon\nexchanging my used phone. Very. Good deal .  \nCouldn't ask for anymore at this price.  \n1\\. A premium look ( especially the Black one)  \n2\\. The battery, definitely beats any other phone in this price range, Lasts\nfor atleast 1.5 days after heavy usage.  \n3\\. Unlike the predecessors, no heating at all, only little warm while playing\nhigh end games.  \n4\\. You'll definitely feel awesome by the feel and touch of this item that too\nat this price change.  \n5\\. Only con is that it doesn't have a separate , but that isn't a deal\nbreaker, since 64gb is more than enough on a phone.  \n  \nJUST GO FOR IT AND I'M SURE YOU WILL LOVE IT.\n\n", "Received it morning. It is awesome. I purchased the phone after reading 100s\nof reviews here and lot more you tube reviews too.  \ni liked the feel of phone a lot , its metallic and stays in hand nicely.  \nHD SCREEN  \nLOOKS LIKE IPHONE  \nAnd to my surprise, i received an updated phone with ANDROID NOUGAT AND MIUI9\n, I was totally shocked . Thank you amazon\n\n", "Average phone..reminds me of my old intex aqua phone. I use Samsung J7 and my\nhusband bought this redmi 4. Compare to J7 redmi 4 is nothing. He is\ndisappointed. Maximum screen light in redmi is equal to 25% screen light of\nJ7.  \nFacebook videos are dull and overall below average product compare to lenevo,\nSamsung basic sets. RAM looks like 2GB but it shows 4gb RAM!.  \nWhat's app, Facebook, YouTube lovers don't buy this.. Invest 2k extra to buy\nbetter one. Don't believe the positive, promoting reviews of redmi4 buyers.  \nGood thing is the phone is stylish, curvy...  \nYou could see the liquid of Tempered glass in the 4 edges of the phone after\nyou place the glass. Shop keeper said its like that only!!!!...\n\n", "The phone is good. Both of its cameras are good. But I've faced some problem\nwith it's audio quality. When using VoLTE, I can talk easily with other VoLTE\nconnections, But I can't talk to user with 2G, 3G even 4G LTE. My voice\ndoesn't reach them. And 1 more problem is it's RAM usage. It's always above\n60%, even with factory default setting and no additional apps installed in it.\nApart from these problems this phone is ok.\n\n", "It's a gift from my wife. Have always been an avid fan of Xiaomi smartphones\nand other products. Xiaomi products have never disappointed me. Redmi 4 is\nalready a long player in the budget smartphone market loaded with competitive\nfeatures and a nice battery. The phone looks good too (doesn't look like a\nbudget smartphone if not informed). What is more interesting is that me and my\nbrother in law have earlier used redmi note 3 together. And now we have four\nredmi 4 smartphones in our family. My mom, my wife, my brother in law and now\nme, each of us are having one redmi 4 as our secondary backup phone.  \n  \nLet me tell you this makes an awesome secondary backup smartphone along with\nyour primary one. The jet black colour suits my taste and gives it a more\npremium look.  \n  \nI am also amazed to find Xiaomi has given us a smartphone with all metal\nanodised aluminium body and a massive battery capacity of 4100 mAh at this\nprice.  \n  \nThe phone runs smooth and lag free even with a mere 2GB of RAM. I think most\nof the credit for this should go to the better performing SD 435 octa-core\nprocessor. The display size of 5\" made it a perfect smartphone to hold\ncomfortably on my palm unlike the larger devices (5.5\"-6\") that tends to slip\nout of your hands often. The fingerprint sensor works fast enough.  \n  \nThe only con I have found till now not only about this smartphone but all\nXiaomi smartphones are the idea of a 'hybrid sim slot' that compels you to\neither run for increasing more space (which you'll do anyway considering this\nhas got a mere 16GB of internal memory) or use a secondary sim, but not\ntogether.  \nAnother con is the camera. I won't say the camera is bad but it is decent,\ngiven the price point. Moreover, I have always felt the photographers should\nrun after a professional camera if they want a perfect camera and should never\nlook for a pro level camera in a smartphone. Smartphones are smartphones, not\nDSLRs.  \n  \nTo sum up, Redmi 4 makes an awesome budget smartphone and deserves to give\nSamsung a run for their money in the low-end budget smartphone segment because\nanyway, Samsung smartphones are pathetic in performance in this segment. And\nof course, it is a perfect gift to have! Thank you Wifey!\n\n", "I am using redmi 4 since last 1 month.Redmi 4 was launched two months ago.it\nis the successor of redmi 3s and 3s prime launched last year.It comes in three\nvariants: (1) 2gb ram+ 16gb storage at ₹ 6999 ( 2) 3gb ram+ 32gb storage at ₹\n8999 and last 3gb ram+ 64gb storage at 10999.Here I am going to review it's\n3gb version-Display: it's screen size is 5 inch, size is low but it is more\nconvenient to use from single hand.it looks very much pretty in your\nhand.Performance: I am using it daily almost 18-20 hours.Mostly I prefer to\nbrowse facebook.You can easily run games like injustice 2 or asphalt 8 or\nmodern combat 5 on it.I found no lag while using this phone.let me talk about\nother phones which are available in market.In this range there is no any other\nbetter option than this phone.Memory: Out of 32gb, 25gb is available for\nstorage.it is sufficient enough for any user.Camera: It comes with 13\nmegapixel rear camera whose performance is satisfactory.There is also a 5\nmegapixel front camera without any flash.Camera performance is satisfactory\nnot good.Battery: It is the segment which is specially highlighted by xiaomi\nin advertisement.It comes with 4100 mAh battery.Battery backup is very nice.\nYou can easily use it for 14 hours continusously on 4g network in single full\ncharge.Fast charging is not supported.Only disappointment regarding this phone\nis that it is not available easily in market.Only few stores in delhi have\nredmi 4 in stock.it is available only online exclusively.\n\n", "4 stars for Redmi 4 mobile and 5 stars for Amazon and its delivery.  \n  \nAbout product : It is the best choice for the price range less than 10k.  \n  \nPros:  \n\\+ Slim and easily operate in one hand. Back cover is very slippery due to\nmetal finish, suggested to use case cover to avoid slipping from hands.  \n\\+ 2.5D curved glass and back cover metalic finish give premium look to the\nmobile.  \n\\+ It supports Jio 4G VoLTE. Voice call clearity is good and no issues with\nnetwork signal or wifi or wifi hotspot.  \n\\+ Good performance with the Snapdragon 435 SoC, didnt feel any lagginess.  \n\\+ Rear camera is 13mp shooter and good quality images in natural lighting.\nNot so great in artificial lighting. Front camera is 5mp and good for selfies.  \n\\+ Supports most of the apps and games.  \n\\+ Good finger print response, very accurate always. Built in security app\nused to lock the apps (using both finger print or pattern/pin), no need of\nthird party apps to lock/protect apps. Antivirus app comes built in, top of\nthat we can use other security protection applications also.  \n\\+ Supports OTG devices. GPS and Compass sensors are giving exact location\ndetails to use in the map.  \n\\+ Good battery backup, solidly it comes 1 to 1.5 days of dual sim (3G+4G),\nfb, whatsapp and checking mails usage, still there will be 25-30% battery left\nat end of the day. Heavy gaming - more than 12 hrs.  \n\\+ Custom friendly UI interface, thanks to MIUI developers.  \n\\+ Some people complaining about heating issues, but I did not feel any\nheating issue even with high graphics game usuage (Asphalt 8, Modern combat).\nFeel that they didnt do regular patch update. I do regular patch update\nimmediately when it comes on OTA, that could be reason that I didnt get\nheating issues.  \n  \nCons:  \n\\- No turbo charger with the package. It has regular 2.0 Amp charger only. We\ncan still use fast charger as the mobile has Snapdragon 435 processor which\nsupports fast charging.  \n\\- No screen production like Gorilla glass 3/4 or Ashahi dragontrail. Within a\nmonth, my mobile got hairline crack in screen for accidental drop from less\nthan one feet hieght. So only they didnt mention anything in description about\nscreen protection.  \n\\- MIUI consumes more RAM. Always it shows 1.5GB RAM usage (out of 3GB) even\nthough when no apps running in background.  \n\\- No regular Android OS version upgrade. Still in Marshmallow based MIUI 8.5.\nReceiving regular MIUI patch update for 3 to 4 months once, but not OS version\nupgrade. Shortly we will get Android orea in other mobiles, but Redmi 4 is far\nbehind and stuck with Marshmallow. It is only problem with MIUI based\nproducts. MI has to think about this.  \n  \nAbout amazon.in and its delivery:  \n\\+ It is great as it is always.  \n\\+ Good packaging.  \n\\+ Delivered even before the estimated.  \n\\+ I bought it in Tuesday flash sale, the product claim went 100% within 2\nminutes, but I was added in the queue for waiting list and placed the order\nwhen my turn comes.  \n  \nThis is review of the Redmi 4 mobile after 6 months usage.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 August 2017", "on 23 December 2017", "on 16 September 2017", "on 23 December 2017", "on 21 January 2018", "on 27 December 2017", "on 6 August 2017", "on 5 March 2018", "on 15 October 2017", "on 17 October 2017"], "reviewer": ["Amazon Customer", "Tufan Saha", "vishwadeep", "Patri Prudhvi Krishna", "Sathvik Shetty", "Rekha", "Amazon Customer", "Subho Mitra", "sanjeev suman", "Divya"]},
{"rating": ["3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Wifi Tower coverage is issue by purchasing date onwords", "Amazing Product and value for money", "Above average phone", "Worth for every penny....", "Best phone under 10K, a must buy !!", "Mi is best!!!!", "Great deal block buster budget smart phone of the 2017", "Younger brother of RN4", "Go for it but at your own risk", "Xiaomi Redmi 4 is Best Budget!"], "review": ["Wifi Tower issue, router to mobile 1 meter full tower, but 2 meter distance\ntower is 0,iam not satisfied this product, my 3s prime all so covered same\nWiFi network around 10 to 15meter working good, plus give me a solution, IAM\nnot using mi4 purchase date to 15days,iam Chek normally display and future, no\ntime for backup 3s prime to MI 4, so not use, please replace new handset,\npurchase day to till now this issue ( product production issue) iam veary\nfeeling every time this product seeing\n\n", "Amazing Product and value for money. Amazon shipping service is awesome as i\ngot the order the next day. The product was perfectly packed and works\namazingly good. The camera quality is okay but the in-build features are\nwonderful. Overall user friendly and super cool product. Worth every penny and\nrecommended to other buyers. 8/10 rating for product.\n\n", "This phone is above average in build quality, performance, sound and display\nquality. If they have added backlit keys then it will make the phone looks\neven better. Also I advise Xiaomi to provide screen protectors with their\nphones always. Very difficult to find screen protectors for such type of\ndisplays.\n\n", "Pros  \n-Perfect as a daily driver  \n-Call quality is premium  \n-No heating ,but gets slightly warm  \n-UI is user friendly and transitions are smooth  \n-MIUI is very customisable  \n-Build quality is amazing  \n-Supports JIO VOLTE  \n-Great battery backup  \n-Clear and accurate enough display with good viewing angles.  \n-Super fast and very accurate fingerprint scanner.  \n-Good pair of cameras for the price. PDAF works flawlessly  \n  \nCons:  \n-No gorilla glass protection(I know it's too much to ask for this price tag, But at least the 10k version should have had it)  \n-Battery takes time to charge because of its mammoth 41000mAh battery. Although ,faster than I expected it to be.  \n-Hybrid sim slot can be a con for some people.As you can't use Two sim cards and 1 memory card at the same time.  \n\\- Speaker- audio bit low.\n\n", "Pros:  \n1\\. Best phone in this price range, I bought it after doing loads of online\nresearch and reading through thousands of reviews and I am not at all\ndisappointed. Go for the 32 GB model priced at 8998, don't buy the 16 GB\nmodel.  \n2\\. This phone looks awesome too, similar to iPhone 6S just without the home\nbutton. Its pretty sleek and stylish.  \n3\\. Camera is pretty good, good colour reproduction in proper light.  \n4\\. Screen quality is good, bright and vibrant. Touch is smooth, accurate and\nfast, no lag.  \n5\\. Doesn't get slow because of the 3 GB RAM, great performance.  \n6\\. Battery life is good, about 1.5 - 2 days if you use wisely and charge\nwisely.  \n7\\. Have not experienced any heating problems so far.  \n8\\. Finger-print sensor is fast and accurate.  \n9\\. MUI on top of Android looks pretty decent and attractive, doesn't slow\ndown the phone. MI has added many extra features on top of Android which are\nuseful for aggressive users like me.  \n  \nCons:  \n1\\. Speaker loudness is bit less, but that shouldn't be a problem. If you want\nto hear very loud music use bluetooth speakers!  \n2\\. Low light photos are bit poor, but better than most mobiles in this price\nrange. It serves the purpose perfectly fine. You can't expect photos like\ndigicam from a budget mobile!  \n3\\. The home, back and menu buttons at the bottom of the phone doesn't glow.\nThis isn't much of a problem as you get used to the keys in a few days and you\nknow where they are.  \n4\\. Some preloaded apps can't be removed. This also doesn't matter much\nbecause the ram and processor is enough to keep the phone running blazing\nfast.  \n6\\. This phone has 2 SIM slots, 1 nano and 1 micro. The micro sim slot is\nhybrid which means you can either insert SIM or Memory Card in it. I hear\npeople complaining about that, which is foolish because 32 GB is a lot and\nthink if you really need memory card even after that!  \nAlso only 1 SIM can have 4G network activated, other will run in 3G/2G which\nshould be also fine because usually only 1 SIM is used for internet (like Jio)\nand other SIM is kept only as a backup number for calling / SMS.  \n  \nVerdict: Buy this mobile blindly if your max budget is 10K.\n\n", "Overall Redmi 4 is best under ₹7000 as it has fingerprint sensor which Redmi\n5a and Redmi y1 lite doesn't have and also it has better processor (Snapdragon\n435 which is octa core) and also 4100 mAh battery. I do not care about the 16\nGB internal as we can use external sd card upto 128 GB but I have given it 4\nstar because in 2 GB( approx 1836Mb) ram only 850 Mb ram was free. I got MIUI\n9 update as soon as I connected to WiFi!!!\n\n", "Multipurpose Phone!!  \nEverything is perfect.  \n  \nDesign :-With a unibody metal construction, the Redmi 4 follows the design\nlanguage of Redmi Note 4. There are curved edges with a curved 2.5D glass on\nthe front which aids the ergonomics. The highlight of the design is of course\nthe compact form factor owing to the 5-inch display. It fits quite well in\none’s palms and single-handed usage is a breeze.  \n  \nThe build quality is excellent and it feels solid, and the matte black variant\nlooks great and gives a very premium feel.  \n  \nHowever, the three capacitive buttons behind the display are not backlit. It\nis disorienting at first, but you impulsively know where your thumb needs to\ngo after a few days of usage.  \n  \nThe Redmi 4 might be a budget phone but there’s no compromise on the\naesthetics. In fact, with this outing – like before – the company sets the\nstandards for what affordable smartphones should look and feel like in 2017.  \nDisplay :-The Redmi 4 sports a 5-inch HD display with a 1280 x 720 resolution.\nThere’s a 2.5D curved glass, similar to the Redmi Note 4. It’s toughened\nglass, although there’s no Gorilla Glass protection  \nThe HD display nevertheless looks fantastic in terms of color reproduction and\nviewing angles. The images and text looks sharp, and it is clearly one of the\nbest displays on smartphones in this price segment. Maintaining a perfect\nbalance, it is a crisp and vivid display without the colors looking\noversaturated.  \nConclusion :-Starting at ₹6,999 ($108) for the base variant, the Redmi 4 ticks\nall the right boxes and there is hardly anything to complain. It’s a great\npackage with solid chassis, Qualcomm’s newer chipset, decent camera, and great\nbattery life. The only shortcoming of the device is lack of Android Nougat out\nof the box\n\n", "My father owns RN4 which is similar to this R4,fews things are missing in this\nlike  \n-5 inch screen  \n\\- notification light is in bottom  \n\\- no double tap to wake  \n\\- only single white LED light for charging, notification, etc  \n\\- no slow motion video recording  \nBut Overall build quality very good, buttons are sturdy, didn't like hybrid\nslot, (tenor is good in this case) I have Exchanged it with my old Samsung\ngalaxy note 2 for Rs. 2k this is my 3rd phone purchase on Amazon\n\n", "best quality and budget phone but always remember that if you are purchasing\nthe XIAOMI phone ,you should very careful about its screen/display. You should\nuse screen guard and back cover. The service center service is worst\n\n", "Xiaomi redmi 4 is the company's latest model in the sub-rs 10000/- segment.\nXiaomi has so far seen a string of successes with its redmi range with most\nmodels finding place in our periodic list of the \"Best Budget Phones.This new\nxiaomi redmi 4 will not onlyhave to take on the competition,but also live up\nto its predecessor in a lot of ways, and it certainly seems like an improvment\nwhen it comes to specifications.  \nXiaomi Redmi 4 specifications and software  \nXiaomi Redmi 4 features a 5-inch HD (720x1280) IPS display with 2.5D curved-\nedge glass. This seems to be the first time that Xiaomi is using 2.5D glass on\na Redmi smartphone priced below Rs. 10,000. There's a non-removable 4100mAh\nbattery which is the same capacity as the Redmi 3S's battery, and is being\npromoted as one of this phone's highlights. The phone is powered by an octa-\ncore Qualcomm Snapdragon 435 processor clocked at 1.4GHz. There are three\nvariants of the Redmi 4: one with 2GB of RAM and 16GB of storage; one with 3GB\nof RAM and 32GB of storage; and finally 4GB of RAM with 64GB of storage. Our\nreview unit had 3GB of RAM and 32GB of storage. The Redmi 4 supports\nexpandable storage using a microSD card (up to 128GB).You get a 13-megapixel\nrear camera with f/2.0 aperture, PDAF, and an LED flash. There's also a\n5-megapixel front camera with f/2.2 aperture. The new Redmi 4 will support 4G\nand VoLTE along with other connectivity options. When two SIM cards are used,\nonly the primary one will allow 4G calls and data while the secondary SIM\nfalls back to 2G calls only.The phone runs on Android 6.0.1 Marshmallow, with\nXiaomi's MIUI 8.2 skin. This is a stable build which is identical to what we\nsaw on the Redmi Note 4 and Redmi 4A. This means that the Redmi 4 has a lot of\nsoftware features that we have already seen, including Dual Apps, which lets\nyou create a second instance of any app and supports Facebook, Instagram,\nTwitter, WhatsApp, and more. The Quick Ball feature lets users assign\nshortcuts for features. One-handed mode shrinks the display to one corner of\nthe screen so that everything's easier to reach. The phone also gets a\nscrolling screenshot feature that will let you take screenshot of an entire\nWeb page. Child Mode lets users lock apps, and Second Space creates a separate\nprofile to help users manage business and personal data on the same device.  \nXiaomi Redmi 4 camera  \nThe 13-megapixel rear camera is quick at focusing thanks to the phase\ndetection autofocus feature. The camera app also has a face recognition\nfeature that can come in handy. Compared to the Redmi 3S Prime, we found that\nautofocus on the Redmi 4 was a bit quicker. Camera samples were detailed and\nsharp, with colours that were vibrant and truly popped. Landscapes had\naccurate colours for the most part as well as reasonable detail. Macro or\nclose-up shots had a slight haze when seen full-size on a desktop monitor,\nthough the HDR mode helped to some extent.  \n  \nUnfortunately, turning HDR mode on made image capturing and processing really\nslow, and this is one of our biggest complaints with the device. With HDR on,\nusers need to be steady for a few seconds to get a good shot, or else photos\ncome out looking awful.  \n  \nThe rear camera has a tendency to capture a lot of noise when there is no\ndirect light source. Some camera sample shots taken in the dark were very\npoorly defined and had too much motion blur. At night, the Redmi 4 managed to\ntake good photos only when we were close to the subject under a light source\nsuch as a streetlamp.The Redmi 4's camera app is minimalistic and easy to use,\nwith controls for various settings and features occupying only a small part of\nthe screen. HDR mode is just a tap away, as are the live filters. The phone\ncan record video at 720p and 1080p, and the videos came out decent overall.  \n  \nSelfies on the Redmi 4 can be an issue if you want a candid one, again because\nimage processing is slow. We ended up with a slew of blurred selfies just\nbecause we wanted to take one quickly. Other than this issue, our sample\nphotos taken in good light had a good amount of detail and decent colour tone.\nIn low light, we had a tough time, and faces came out looking too grainy.  \n  \nOverall, the Xiaomi Redmi 4's cameras are definitely an improvement over those\nof the Redmi 3S Prime (Review), in terms of focusing and results. There are\nfew issues like poor low-light shots and slow processing in HDR mode, which we\nhope can be fixed - or at least improved upon - with updates.  \nXiaomi Redmi 4 performance  \nGeneral performance of the Xiaomi Redmi 4 is decent, and the device handled\nmost tasks well. The MIUI interface at times felt sluggish, but this doesn't\naffect performance within apps such as when playing games such as Asphalt 8\nand Cut the Rope 2. We had no major concerns during the entire review period.\nThere was also no noticeable overheating.  \n  \nOur unit had 3GB of RAM, and there was roughly 1.2GB free at any given time,\nwhich means those on the 2GB RAM variant of the Xiaomi Redmi 4 might struggle\nwith multi-tasking on their units. Despite roughly 1GB of free memory on our\nunit, we didn't have to deal with any crashes or slowdowns, but we would\nrecommend opting for the variant with 4GB of RAM if you can spend a little\nmore.  \n  \nVoice call quality was decent, and the phone supports VoLTE. The phone doesn't\nship with a headset, so we checked the sound quality using our own earphones,\nand were quite impressed. You get several options to tweak music with the Mi\nSound Enhancer feature when using earphones. The Redmi 4 was also able to play\nour assortment of test videos with ease.The 5-inch IPS display is bright and\ntext appears sharp. The screen is crisp with decent viewing angles. However,\nthis isn't the best HD display we've seen on a Redmi phone. Colour\nreproduction is decent, but in our opinion, the Redmi 3S was better. The\nscreen was readable and usable under direct sunlight. Movies and games look\ngood on the 5-inch display, though some might prefer a bigger screen. There's\na Reading mode on the device that reduces background glare. Users can manually\ncontrol colours and saturation on the device through the Settings app.  \n  \nThe Xiaomi Redmi 4 scored 43,677 in AnTuTu and 22,996 in Quadrant. We also ran\n3DMark Ice Storm Extreme and GFXBench, where the phone scored 5,890 points and\n25fps respectively. These scores are on par with those of other phones powered\nby the Snapdragon 430 processor.  \n  \nThe Redmi 4 lasted for 14 hours and 20 minutes in our HD video loop test,\nwhich is impressive. We can partly credit the battery loop test performance to\nthe low-impact HD screen resolution. With regular use, the battery lasted over\na day. There are also power saving modes to help squeeze more life out of each\ncharge. The phone doesn't come with a fast charging adapter but Xiaomi's Jai\nMani told us that it does support fast charging. We can expect Xiaomi to sell\na fast charging adapter for the Redmi 4 as an optional accessory, or you could\nbuy a third-party one.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 August 2017", "on 29 September 2017", "on 31 January 2018", "on 19 November 2017", "on 20 August 2017", "on 10 December 2017", "on 21 September 2017", "on 7 October 2017", "on 15 August 2017", "on 17 January 2018"], "reviewer": ["LAWRENCE Rock Fort Rider", "Angel S.", "Gagan Ahuja", "Hariharasudhan", "Ratul", "Amazon Customer", "Raghu Reddy", "Nandita Das", "anurodh kumar", "deeppokar"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Great phone at this price range", "MUST BUY PRODUCT", "4100mAh battery in Redmi 4 phone & camera is just like DSLR", "4/5 here is the reason and a good review.", "Nice budget phone", "Worth of money", "Crazy deal mi for me 👌", "Best phone I've ever used under 10k", "Shandaar! Zabardast! Zindabad!", "Worth mobile except glass quality ."], "review": ["Great phone at this price range.using xiaomi products for more than 2 years\nand it almost works fine for 1and half years without any problems and after\ncertain periods of time it hangs a little bit.miui is doing its job well it\nflows like butter when using the software.But for some models software update\nturns ugly and it may stay as it or they may rectify it, that's where the\noneplus comes in which provides good spec at low or reasonable price and has\nless no.of smartphones on the market so that they could provide better\nsoftware support for their customers and i think oneplus is only the company\nwhich rectify their bugs in software quickly, But they don't provide\nsmartphone for less money whereas xiaomi does it. With more no.of smartphones\non their list xiaomi also does a wonderful job on software development.  \nSome common problems associated with xiaomi is overheating of their phones\nwhich they are rectifying in thier recent releases.\n\n", "The 4100mAh powerhouse is able to run up to 18 days on standby mode and up to\n2 days with heavy duty usage. What's amazing is that the large battery is\nhoused in a small metal frame with a 12.7cm (5) display that fits perfectly in\nyour palm. It also offers better, sustained performance on the Snapdragon 435\nocta-core processor. Expect better, faster, and longer performance with our\nnew Redmi 4. We pride ourselves on creating smartphone powerhouses that pack\nhigh-capacity batteries without sacrificing form. It's a challenge that our\ndesigners and engineers take on daily. In Redmi 4, our team has gone beyond\nthe extra mile to carefully plan the design, do in-depth battery research, and\nimplement system-level optimizations to present a powerhouse that excels in\nboth battery life and design. The new Redmi 4 is encased in a beautiful metal\nframe that is made of anodised aluminium. The back enclosure has gone through\na diamond cutting process that produces two bright strips, giving an\nadditional brilliant sparkle to the entire phone. Size matters. Redmi 4 comes\nwith a 12.7cm (5) HD display and size that sits on your hand snugly. Our\ndesigners have gone a step further to improve the ergonomics, dressing it up\nin a beveled metal frame with tapered edges that rests comfortably in your\npalm, even during marathon gaming or movie sessions. Comes with front 2.5D\ncurved glass that feels smooth when you tap or swipe your fingers across the\nscreen. We're obssessed with providing you an extended, fluid experience on\nRedmi 4. The 4100mAh powerhouse is fueled by the Snapdragon 435 octa-core\nprocessor that boasts better performance and consumes less power compared to\nits predecessor. Now you can play your favourite mobile games all-day, every\nday without experiencing any delays. Always in too much of a rush for passcode\nunlocking? Let your fingers do the unlocking. Redmi 4 comes with a fingerprint\nsensor that allows you to quickly unlock and access your private profile and\nfiles, fast. See the difference when you take a shot on Redmi 4. Photos taken\nare crisp, vivid on the 13MP rear camera that comes with PDAF for 0.3s fast\nfocusing. Comes with a whole range of built-in camera functions that help you\ntake effortlessly beautiful panoramic and clear night shots. You can even\napply our 36 built-in smart beauty profiles and whole range of filters in\nreal-time to enhance your photographs. Marvel at the gorgeous wallpapers on\ncarousel when your lock screen lights up\n\n", "I am using the RedMi Mi 4 phone. It is a very good phone. There are so many\nfeatures in this phone. I would also like to tell others that this phone is\nvery good for the budget of less than 8000. Read features.  \nWe pride ourselves on creating smartphone powerhouses that pack high-capacity\nbatteries without compromising on great design. It's a challenge that our\ndesigners and engineers take on every day. For Redmi 4, our team has gone\nbeyond the extra mile to carefully plan the design, do in-depth battery\nresearch, and implement system-level optimizations to present a powerhouse\nthat excels in both battery life and design. The 4100mAh powerhouse is able to\nrun up to 18 days on standby mode and up to 2 days with heavy duty usage.  \nSo if this review helped you please vote it helpful.\n\n", "First of all the reason for 4 star : Redmi Y1 is launched for same price which\nis better than this device from specs point of view.  \n  \nNow my point of view : the device is good for casual users, by casuals I mean\nlegit casuals like just using social apps, YouTube, some late night book\nreading, decent games. Basically anything except high end gaming or hd camera\nrelated. Since the camera isn't good imo but again I'm not into taking\npictures but for video calling and stuff it's good enough.  \nI Love this phone, do the get me wrong. It's perfect for me It has most of the\nthings I would prefer. And it's 5 inches so fits my hand perfectly since I\nhave small hands. Designs looks epic but I had a bulky case now but still good\ndesign. Over all it's a good device and yes it will heat but nothing to the\nextreme unless as I said you do heavy gaming or constant use where battery\nusage is more. Not sure if anyone even gonna read this but do think between\nthis and Redmi Y1. Another reason for 4 star is that this device came almost\nyear ago so not sure how many future updates it will get but since Y1 is new\nnow so it will get more updates than this device so go for it. I'm salty that\nY1 released after I brought this phone but anyway I still love this device.\nHave fun with yours. ;)\n\n", "The phone was delivered safe and sound. The battery lasts long when no heavy\nusages. The camera too is fine. It has 16 gb ROM however surprisingly only 8\nGB is usable but memory can be expanded at the cost of second sim card.\nOverall it is a nice budget phone.\n\n", "Positives  \n  \nGood display  \nImpressive camera performance  \nSmooth performance  \n  \nNegatives  \n  \nAndroid Marshmallow  \n  \nRatings  \n  \nBattery  \n9.0  \nDisplay  \n8.5  \nCamera  \n8.3  \nPerformance  \n8.7  \nSoftware  \n7.8  \nDesign  \n9.0  \n  \nIt is best phone I have purchased at affordable prices\n\n", "5stars. It's an amazing smartphone battery backup. Osm. Phn design 😮  \nOne negative point is. Dual speaker. Is given but only one z working. 🙁\n\n", "Best phone I've ever used under 10k. Don't know why al people scared of this\nproduct. For one faluty phone don't judge the company. It's still best company\nwith all packages in small price. Used this phone over 2 months. Works fine.\nNo heating problem. Camera quality is excellent. Volte supported. Long lasting\nbattery with rough use spend 1.5days easily.\n\n", "Redmi 4 is a great phone within budget of common man.  \nPros-  \nIt's looks are fab. 😎  \nCamera 📷 is awesome too.  \nWorks quite fast. 🚀  \nProcessor and GPU are in good sync.  \n64 GB is more than enough.  \n5GB free MI Cloud storage.  \nInterface is good, you enjoy using it.  \nBattery is more than enough.  \nCharges ⚡ quickly with Mi Charger.  \nSpeaker 📢 produces loud and crystal clear sound.  \nAnd many more..  \n  \nCons-  \nHybrid sim slot (i.e You can either use the phone as dual sim or can use it as\na single sim with memory card but you cannot use it as a dual sim with memory\ncard)  \nNo headphones 🎧 in the box.  \nNo USB type C port (but as the phone is cheap so not a big issue and doesn't\neven matter).  \nCan't think of anymore cons as of now.\n\n", "I upgraded from mi note 3 to redmi 4 .  \nNice mobile best specificationn with low price.  \nNo other brand gives 4100mah battery in same price. No need to buy power bank.  \n  \nOnly issue is delicate glass not gorilla. Because of curved you can't keep\ntamper glass. If you use without tamper glass it will break in one or two\nfalls. Glass price will be around 4k half of the mobile price and you have to\nwait for 2-3 hours in mi service centre queue. My previous mobile note 3 glass\nbroken 2 times finally sold in exchange after replacing glass.  \n  \nThis time I brought with 1 year insurance and backpanel safety added even I\ndon't like bulky.  \n  \nIf you buy iPhone for 30,000 it will give 3 years life even it falls many\ntimes.  \n  \nIf you buy redmi phone for 10000 it will give 1 year life. Both are same ☺️.  \n  \nMi could give spare parts strong panels with low price glass.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 November 2017", "on 27 February 2018", "on 16 January 2018", "on 10 November 2017", "on 29 July 2017", "on 2 December 2017", "on 3 September 2017", "on 17 September 2017", "on 15 November 2017", "on 28 October 2017"], "reviewer": ["dhayalan", "siraj k.", "Kamale farooque", "karan", "Ambi", "Mayank Bansal", "Babu", "Anindya Kumar Das", "Harshad Jadhav", "venkatesh"]},
{"rating": ["2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["I have buy RedMe phone from amazon but touch pad ...", "Every thing waste (money time & service)", "Best Budget Phone", "After Nokia 3, this phone is the best option in this price range.", "4days experience and...PROS wins", "1 Poor camera quality", "best phone in very good price with lots of features ...", "Good product and value material for the price", "Great phone", "Fantasticoo"], "review": ["I have buy RedMe phone from amazon but touch pad not working. i want to return\nthis faulty product but not able to return. I have complain to customer care\nbut amazon customer care not provide me solution. he says amazon policy\nchanged. but how to return faulty received phone.\n\n", "Purchased the product 3 months back.  \nRecently the battery has been bulged, there is no fault from my side, but the\nservice centre people said that such case (battery swelling) is not covered\nunder warranty.Actually if anything happened to battery for 6 months they have\nto replace it with new one.But they charged 1200 from me, one sad thing is\nthey showed my phone as out of warranty and charged 350 plus GST as service\ncharge.But my phone has still hardly 7 months of warranty 🙄🙄🙄🙄\n\n", "\n\n I'm loving this product. This mobile phone is the best low budget phone ever.\nGood camera with PDAF feature. Second space which lets you access 2 instagram,\nfacebook and any app for different accounts.  \nThe phone comes with system installed apps, such as mi scanner, data transfer,\nsecurity, compass, weather and mi remote which can control devices like, AC ,\nTV and microwave oven. It also comes equipped with fingerprint sensor...  \nOverall, it's the best budget phone.\n\n", "Pros -  \nBuild is the BEST at this price  \nWorks smoothly with the Snapdragon 435  \nThe camera is also on par with the price range  \nRAM Management is quite good, most of the apps keep loaded in the background\nand come up quickly when I reopen them  \nNotification LED  \nExcellent Battery Life  \n  \nCons-  \nThe Software is just ok (I prefer stock android over Xiaomi's heavily\ncustomized MIUI)  \nThe screen could've been FullHD  \nThe capacitive keys on the bezels don't have a lighting option. This is a big\ndisadvantage.  \nI don't like the hybrid-SIM thing that Xiaomi does in all of their phones. I'd\nlike to have 2 SIMs PLUS a microSD card on my phone.\n\n", "Best product in this price range.. using for only 4 days.. so my pros and cons\nare quite small and in detail but have a look.  \n  \nPros.  \n1\\. Nice battery back up , specially when u upgrade it to Nougat.  \n2\\. Smooth edges of screen is very handy.  \n3\\. metal body is also reliable.  \n4\\. Several inbuild Unique features of xiomi - like mi remote, one hand mode,\ndual apps, and many more.are working perfectly.  \n  \nCons.  \n1\\. Taking much time to full charge.  \n2\\. Finger prints sensor is not as fast as other lenevo, honor or moto phones\nbut it works .nodoubt.  \n3.due to curved glass local made tampered glass may not fit in it perfectly.  \n4\\. Camera quality is too low.  \n  \nThats it. Hope i may find its pros and cons in more detailed way in near\nfuture.\n\n", "Guys absolute worth the money for its price....  \n  \nWeakness:  \nOlder Android: Android 6.0.1  \nPoor camera quality...trust me a 5 megapixel samsung mobile will click better\npics.  \nPoor audio quality.....don't even think of comparing with Sony/Samsung.  \n  \nRest nothing comes close.\n\n", "best phone in very good price with lots of features due to customized android\nsuch as  \nauto power off and power on ,  \ntrash memory clearing and deep scan,  \ninbuilt app locks  \ndual space,  \ndual apps  \nnotification icon toggeling  \nfingerprint unlocking is amazing.. no need to draw pattern or remember it (but\npattern is required for every reboot so be careful)  \nusing since 4 months and liking it.....\n\n", "Good product, value for the price, when compare with other hybrid Sim slot\nmakes a draw back that we cant 2 sim and micro SD at same time. 64 gb make\nsufficient space but for additional increase memory we need to avoid one sim\nfor SD card usage. Better they provide separate slot for SD card. The other\nthing is pin provided to remove the sim slot from phone, if we loose the pin\nit will be very difficult to open the slot. All other are better.\n\n", "What a product man what a product. Mi does something like this and all other\nare left gasping . Good phone in budget . Perfect mid range config. Runs every\nthinks very fine. Good battery backup of 2 days in moderate usage. And\nsurprisingly regularly updated OS didn't expect this from min though. Overall\na very good buy for my mom.\n\n", "I am reviewing this phone in redmi 4. It is a fantastic phone. Great battary\nlife. Awesome touch sensitivity. Processor is great too. Camera perfect. I am\nvery happy with this device. I recommend anyone who is reading this ....go\nahead and don't be confused to decide. Coz there is an entire sea of smart\nphones.  \nUsing it for 2 weeks now and it's going great\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 September 2017", "on 12 September 2017", "on 21 December 2017", "on 15 January 2018", "on 23 January 2018", "on 11 October 2017", "on 22 September 2017", "on 14 August 2017", "on 14 January 2018", "on 11 January 2018"], "reviewer": ["Anjeev Kumar", "viswanadh kumar", "bhattnnidhii", "Divyanshu Mishra", "aaron banerjee", "Naveen", "amazonbuyer", "Aswin R", "Rajiv Paudel", "Kaustav Chowdhury"]},
{"rating": ["2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Good Phone, but heats quickly with bit heavy use", "Xiaomi Redmi 4", "Absolutely Amazing Phone for this price.", "Amazing delivery by Amazon got within 2 days", "Awesome worked by Multi Talented Mi Team", "Redmi4 - 32 GB - OK", "Perfect buy", "Best Smartphone", "Over all my experience is excellent strongly recommended", "Go for redmi👍"], "review": ["Well Happy with the phone.  \nFew things I would like if Xioami improves:  \n1) I've Max 2 and redmi 4, both the phone gets scratches on the screen (you\ncan find on high light) even with normal usage. So immediately get a toghened\nglass.  \n  \n2) MIUI is good OS but can improve notification bar to cop up with Stock\nAndroid. Here, you can not see notification extended details using single\nhand.  \n  \n3) Redmi 4 gets heated with slight heavy usage like hotspot. Battery is not\ntoo good as I found on Max 2.\n\n", "The phone is overall good and nice look with premium metal body.Both the\nCamera's are average.Snapdragon processor is also Average.You will get MIUI 9\nAndroid Nougat 7.1.2 update,RAM management is really nice with MIUI 9 which\nwas worse in MIUI 8.Now the free RAM goes around 1.5-1.7 GB which was\npreviously 1-1.5 GB.Speakers are great for the price.Its 2.5D curved glass so\nfinding appropriate Tempered glass is Difficult I recommend Plus Tempered\nglass which covered full Screen.Overall a good choice\n\n", "Pros.  \n1\\. Awsm Battery  \n2\\. Device Take 2:30Hours To Full Charge  \n3\\. No Heating Issue  \n4\\. Jio Working Flawlessly  \n5\\. Sound is more clear and more than REDMI 3S PRIME  \n6\\. Using 64 Gb  \n7\\. Rear camera quality is good. Front camera has got a way better\nimprovement.  \n8.. Double Tap To Wake  \n9\\. Getting Update Around 1.4Gb (Not Update Yet)  \n  \nNo issue till date , best phone i have ever seen!  \nNo other options !\n\n", "Amazing delivery by Amazon got within 2 days. Happy with it.  \npros-  \n1\\. Looks good.  \n2\\. Nice Interface in this price range.  \n3\\. Loved its Matte finish body colour.  \n4\\. Handy with 5\" screen.  \nCons-  \n1\\. No earphone provided , so you have to spend some more bucks. Increasing\noverall cost for this handset.  \n2\\. Heating problem after continuously playing games for 20 mins it get heated\nup.  \n3\\. You can either both sim or one sim and memory Card.  \nOverall a decent phone with this price range with decent features. But if you\nare a brand lover than off course this is not a good deal for you.\n\n", "Redmi series all phone are best on features & performance. Redmi 4 looks is\nsame like iPhone 6s.  \nWhat i like from MI brand phone is that lots of pre-built features more than a\nany android phone. You not need install app for ever use, MI team worked hard\nto integrate all features needed to use a smartphone.  \n  \nOne star less only for battery: Battery is not go long in compare of other\nphone's 3000mah like nokia 6. Redmi 4 has 4100mah but it's not better than\neven 3000mah.\n\n", "Its ok. Cant use both sim because 1 sim slot is used for storage space - or\nelse you cant save much and the phone will hang. A normal look. Camera quality\nis also ok. 2space is good so i can differentiate between my official sim &\npersonal sim. So all in all Ok as per the price goes. Posted pic to see the\nquality 1 in my car and second in a room .\n\n", "I am been using this phone from the past 1 month and here is my complete\nreview  \n1)Performance  \nAlthough it runs on Snapdragon 435 it handles day to day usage easily without\nany lag.  \nGames might lag a bit at high graphics but at medium graphics its quite\nplayable. I have played shadow fight 2 on this phone at the highest graphics\nwithout any lag.  \n  \n2)Storage  \nYou get around 8 GB of free storage on first boot which I feel is plenty\nenough to keep applications installed. For multimedia storage like movies and\nsongs I highly recommend you to buy a SD card. This phones come with a hybrid\nsim slot but you can easily convert it using a hybrid sim extender.  \n  \n3)Connevtivity  \nReliance JIO works without any issue and it also supports Volte  \n  \n4)Ram  \nAround 750 mb of ram is available for applications in 2gb ram vairent which is\nsufficient enough to handle around 5-6 applications at a time.  \n  \n5)Battery  \nBattery is just awesome. It easily last around 2 days on medium usage.\nAlthough charging time will take around 2hours 30 mins.  \n  \n6)Camera  \nIts pretty decent at the price point. Low light performance is average rest it\ncan handle every shots and also it can records vedio at 1080p  \n  \n7)Developers Community  \nThere are many custom roms available for redmi 4 based on nougat.  \n  \nDelivery by Amazon  \nExcellent delivery as expected.  \n  \nFINAL VERDICT  \nJUST GO FOR IT YOU WON'T REGRET.\n\n", "Best smartphone @Rs 9000.  \n13 MP Rear camera  \n5 MP front camera. Both working fine.  \nNo heating issue  \nGood battery life  \nNo hang problem  \nEnough 32 GB memory  \nBoth SIM slot supports 4G SIM.  \nFast internet.  \nOverall good mobile at this price.  \nNo other company provide these features at this price.\n\n", "Nice & classy look premium not low budget phone and talking about user\nexperience my experience with this phone is excellent no heating problem no\nHanging problem and long battery life and speed charging making this phone\nrecommendable the user interface this mobile is running on miUI beautiful\ndesign no need to download any other third-party software like applock anti-\nvirus etc... And color is pretty awesome I buy rose gold. Looks very\nexpensive. Over all my experience is excellent. So I strongly recommend\n\n", "Iam using 4gb 64 version first of all good  \n+ve -ve are in my experience.  \n+ve 1👍 good battery back up 2days charging time 3 hour  \n-ve 1. 👎Redmi 4 doesn't have navigation button light it more tricky in black colour model but redmi note 4 have this in same price  \n2\\. ,👎Doesn't have Multi colour notification light redmi note 4 have this  \nRedmi 4 4gb at 10999  \nRedmi note 4 4gb at 10999 slashed price  \n👍2.5 D curved glass looks elegant but tempered glass never sticks on ends only\nstick center . If u buy borderd glass it will stick side ways only center side\nno glue  \n..i got a new type temperd from local market at 350 ₹ it sticks both\nside,,👍loooks oe glass\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 October 2017", "on 7 December 2017", "on 7 January 2018", "on 23 November 2017", "on 1 November 2017", "on 12 December 2017", "on 18 August 2017", "on 27 August 2017", "on 13 September 2017", "on 26 January 2018"], "reviewer": ["Amazon Customer", "Vishal", "Ananth Ram A", "Manish Saini", "ZAFRUL HAQUE", "LOUIE", "Meet", "KARAN GROVER", "azher khan", "junu"]}
]