[
{"rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.9 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars"], "title": ["Awesome phone for the price range", "Best phone under 15K range, Just go for it!!!!", "I ordered this phone but received a defective piece. ...", "Almost a great product", "It worked good for 3 months then microphone problem", "Screen burn problem", "Best place to buy!", "Well but headphone jack is problemtic", "Good product but one amazing feature missing", "Not bad; satisfactory"], "review": ["I like the phone and its overall experience is good. Just the packing of the\nproduct by amazon was very bad. It didnt even look like it contain a 15k phone\nin it.  \nThe phone is working very well and is as promised. I have used it for a while\nnow and is working upto the expectation.  \npros: 1. good phone for light used  \n2\\. Fast  \n3\\. good display quality  \n4\\. music play back is also very good.  \n5\\. good camera quality for the price range.  \n  \ncons: 1. its battery life sucks  \n2\\. it is not so gud at gaming  \n  \nso overall this product is not for heavy user for gaming etc.. it can be used\nfor regular light use...\n\n", "It's been 4 months since I have been using this phone, and I will like to say\nthat it's was a really good experience. While ordering I didn't know how the\nphone will turn out to be but it was above my expectations. Amazon delivery\nwas within a week. It is user friendly and above all value for money.  \nPros: Good quality camera  \nFingerprint sensor is fast and accurate.  \nDoesn't get hang.  \nStrong battery life, gets full 100% charge in 1 hour.  \n  \nCons: Speaker volume is low when u used it for Video call.  \nOnly gets heated when u keep it for charging. Otherwise No heating problem\nfound.\n\n", "I ordered this phone but received a defective piece. Amazon did take the phone\nback and refunded the amount paid. I reordered the phone and again got a\ndefective piece. This time the camera was not working.\n\n", "Been using it for nearly a year.  \nGood points: nice phone, easy to handle, decent battery life when using low\nscreen brightness, decent photos, standard Android with minimum bloat wares.  \nNot so great points:  \nMajor problem of ghost touches when screen brightness kept high. Starts giving\nbattery problems also\n\n", "Bought this product in Jan. It worked good for 3 months then microphone\nproblem, Over heating problem, No battery backup. If you give your phone for\nservice they won't return your phone even after a month. Worst phone I ever\nused and the worst service by service center people.\n\n", "Bought this 1 and half year back.. but after sometime the screen burn is\nregular and camera lens is also gone.. front camera looks better than back\nnow.. had a good run..\n\n", "Awesome mobile....I use it continuously for 5-6 hours..neither heats nor\nbattery goes down.\n\n", "Phone is ok but I have found two disqualities i.e. 1) If I talked or surfing\nnet it's become very hot, even at the time of phone charging. I feel very\nafraid.  \n2) Headphone jack is very problematic. It's not working.\n\n", "Well it is late to post since it's been more than a week, the product and\nservice are extremely awesome. But buying such a costly phone it did not\nsupport screen cast, also Anycast dongle does not work. Rest all is fine.\n\n", "It is average though! It heats up a lot while playing games. Rear camera is\ngood and front is quite standard. Look is not so attractive. It's good sides\nare Corning's Gorilla Glass protection, turbo charging facility and you can\nupgrade to android Naugut as well.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 December 2017", "on 13 July 2017", "on 28 December 2017", "on 1 August 2016", "on 13 July 2017", "on 29 December 2017", "on 10 June 2017", "on 28 December 2017", "on 14 July 2017", "on 6 June 2017", "on 19 June 2017", "on 4 April 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Tanzi", "pavan jain", "AmazonCustomer", "Bhaskar Chowdhury", "Amazon Customer", "Sahan"]},
{"rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.9 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars"], "title": ["not satisfied", "Amazing product.", "Nice deal", "Not worth", "Value for money at 10.5K!", "Cemera is excellent..", "Good one", "Poor service backup", "Phone is so so.improvement is required.", "suffering camera flash problem and battery was good till 6 month after that battery performing badly"], "review": ["not that great..but \"ok\"for normal usage. screen flickers and touch responses\nitself on charging. Heating problem when u use too much.i used it for 10\nmonths...few months later after i purchased ,it stopped recognizing my\nfingerprint \" -_- \".\n\n", "Amazing product.. Aswm camera.. Aswm mobile.. Stock android experience..\nSmooth touch.. And call quality also good.. This mobile not for heavy user..\nBT u can average performance day to day usage.. So keep calm and go for it..\nThnk u team Motorola and amazon..\n\n", "Heat up issue is there and some time mobile hangs out and functions are not\nworking properly but overall its not good product.\n\n", "I was big fan of Moto phone, this is my 3rd Motorola phone and it is worse.\nCamera is value for money.  \nIt has lot of heating problem and hanging problem while charging and resource\nheavy app( camra, video recording, or some game).\n\n", "Pros:  \nLightweight  \nTwo Sim slots + expandable memory slot (not hybrid)  \nTurbo charging  \nFingerprint sensor  \n  \nCons:  \nNo notification LED  \nBuild is pretty weak. The back case resembles a paper sheet  \nNot water resistant, even though it's predecessors were!\n\n", "Cemera is excellent..... N battery is also good not best but overall\nperformance is also good. Only heating issue is there.... So if u are a heavy\nuser then don't bye it.....\n\n", "Satisfied with the product. After one month usage it's going good. Slightly\nhanging apps first time today but overall it's good product.\n\n", "After using for 3 months found the following issues  \nHangs too often  \nThe On/Switch broke and now the (rude people at service center) service center\nsays switch stock is not there.  \nPoor service backup\n\n", "Phone is some what O.k. Battary does not last more than 24 hours even use of\ndata and video is limited.phone screen remains on when not in use for about\nhalf a minute. Ram speed is O K. Price is somewhat on higher side when\ncompared with competitive phones\n\n", "suffering camera flash problem and battery was good till 6 month after that\nbattery performing badly..Side button problem requires more force to press ..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 December 2017", "on 13 July 2017", "on 4 June 2017", "on 30 August 2017", "on 14 November 2016", "on 9 April 2017", "on 9 July 2017", "on 2 March 2017", "on 13 May 2017", "on 21 April 2017", "on 1 April 2017", "on 6 April 2017"], "reviewer": ["Amazon Customer", "Subhajit k.", "Ankit", "HIMANSHU AWASTHI", "Amazon Customer", "Amazon Customer", "Rakesh T.", "lalit vashishta", "Amazon Customer", "Amazon Customer"]},
{"rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.9 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars"], "title": ["Heats up badly", "G4- A pocket friendly sidha Sadha phone", "itz a worst decision i had selected moto", "Worst product I had ever seen.", "Not good as like other Moto phones.", "Keeps restarting. Can't even last a year", "Average phone", "Otherwise cool product.", "Save ur money. Don't buy this phone, look for other options", "Lenovo killed motorola very sad but true"], "review": ["Overall performance is pretty average. Heats up badly if usage is heavy. If\nyou are someone who plays games on your phone, this phone is not for you.\nHeats up and battery drains pretty fast. It's an okay phone for moderate\nusage.\n\n", "It's been a satisfying 1 year woh the G4, only pros wil be the camera\ndegrading day by day and now it's almost like a VGA compare to the 16 MP\nshooter earlier, all and all if you are looking for an Android phone with good\nstock Android experience, MOTO is for you\n\n", "itz a worst decision i had selected moto... itz been ~6months i lost my fronte\ncamara. phone is hanging out terribly and heat generated by phone you can cook\nanything on it.. please never ever select option of moto same thing happed for\nme two times..\n\n", "Main problem is battery of this product, when charging will comes below 40%\nthen mobile is getting switch off unknowingly.  \npeople are not expecting this type of product from Amazon.  \nso please keep avoid such kind of products into the market.\n\n", "It's good phone but sometimes it behaves itself.  \nAnd that's very strange about the phone like it scroll down itself without\ntouching the screen.\n\n", "The product keeps restarting . Please seller get back to me and exchange the\nproduct . It's less than 6 months old. Please exchange it asap\n\n", "Yes there is heating issue with this phone while charging and playing game.  \nDisplay is not so bright.  \nGood Battery Backup for average used it will usually last a day.  \nCamera is good. Gives u really good Images.  \nFast finger print sensor. Works really well.  \nNo pre_installed gallary.\n\n", "It has a lot of heating issues while charging and while capturing photos.\nFingerprint doesn't respond every time. Otherwise cool product.\n\n", "After using the product for 6months. I would suggest not to buy this phone.\nCamera is good n the story ends here. Fingerprint scanner is very sluggish,\nbattery drains really quickly, hangs a lot. Look for other options in this\nprice range.\n\n", "Phone was good but the  \nMy charging cable not charging my phone  \n  \nManufacturing defect .......... Fornt camera having dust problem.....  \n6th time serviced my phone by moto  \nThey couldn't fix this problem till now  \nThey try all things....\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 December 2017", "on 13 July 2017", "on 6 June 2017", "on 15 August 2017", "on 3 May 2017", "on 10 May 2017", "on 6 March 2017", "on 29 March 2017", "on 31 August 2016", "on 1 December 2016", "on 27 May 2017", "on 21 September 2017"], "reviewer": ["Arun Venkatraman", "Agam Srivastava", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Gj", "Vinayak Sawnt", "Rutwik", "Rishabh K", "Amazon Customer"]},
{"rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.9 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars"], "title": ["Rear camera quality is worst", "Overall Good Phone", "The mobile is awesome..", "RAM usability is still good as like MOTOROLA's previous phone LIKE MOTO E and ...", "Good phone", "Is there any extended warranty for moto g4 plus 32 ...", "Playa in the house!", "@AMAZON TEAM PLEASE TELL ME, MY MOTO G4 PLUS ...", "Ghost touch problem", "NOT Recommended"], "review": ["Quality of rear camera is very worst now after the software updates... Rear\ncamera quality is excellent when I buy this mobile. Release a software patch\nto fix this issue... Many users are posting this issue in forum and community\npage. Do necessary action to fix this issue.\n\n", "It's nice smartphone, but picture quality of camera not so good. I have\nexperience that somehow the display gone. Thanks to your service center, they\nrepaired my phone without taking any extra cost. Gallery option must be there\nbut all the photos & video views in photo icon.\n\n", "The mobile is awesome... I have been using for the past 2 months... so far i\ndidn't find issues...  \nCamera quality, Speed everything is fine..\n\n", "Operating system , RAM usability is still good as like MOTOROLA's previous\nphone LIKE MOTO E and MOTOG(1,2,3rd gen) but since this phone come along with\nthe LENOVO spare parts, lots of issues are coming out ......  \nAudio jack issue  \nHeating issue and all..\n\n", "Good configuration under 15k with a brand name attached to it . Got hanged\nonly once but working fine .Processing is fast, good camera n video\nquality.Gets heated up a bit while phone is on charge.Battery life good too.\nOverall a nice phone with good configurations under brand name.  \n  \nAfter one year , charger is not working.\n\n", "Is there any extended warranty for moto g4 plus 32 gb mobile.......... as i\ncame across to see the extended warranty for the same product of 16 gb\ninternal memory.......... but not 32 gb mobile\n\n", "Performer in this range... Few things i had to deal with. Heating, ghost\ntouch, and no led notification else performs like a beast.. Throw any game at\nit and it will play smooth like a playa\n\n", "@AMAZON TEAM PLEASE TELL ME, MY MOTO G4 PLUS IS HAVING PROBLEM REGARDING\nDISPLAY THAT SOMETIMES IT GIVES AUTO-CLICK WITHOUT ANY TOUCH ON DISPLAY  \n  \nMANY TIMES IT HAPPENS, SO I HAVE TO SWITCH IT OFF AND AGAIN ON IT  \nSO TEMPORARY THE PROBLEM GETS SOLVED\n\n", "Apart from getting heated Mobile seems to be good one, but main drawback is \"\nghost touch\" . While charging if u operate the mobile seems to be acting\nweird. Screen icon gets operated by itself. Got replacement but same problem\noccurs in new mobile also\n\n", "Not worth it, buy xaiomi or one plus! Built quality is questionable, Screen\nflickers on charging, literally unusable while charging, phone heats\nfrequently, camera isn't that great!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 December 2017", "on 13 July 2017", "on 7 September 2017", "on 5 October 2017", "on 23 July 2016", "on 1 September 2016", "on 11 June 2016", "on 3 July 2016", "on 15 March 2017", "on 9 October 2017", "on 28 March 2017", "on 7 July 2017"], "reviewer": ["Amazon Customer", "Hemant", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Prshnt", "Mangesh Raut", "Ne Arun", "Pratik Chhatani"]},
{"rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.9 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars"], "title": ["Mobile is fine. but turbo charge is not work with me", "Not supports for jio video calls... worst features", "Worst product.", "Really amazing product. Camera is good", "Good up to some extent.", "phone is very good. camera performance and other feature are very good", "I WAS VERY WELL SATIFIED WITH THIS MOBILE WHICH YOU ...", "Nyc ph in nyc budget", "Better phones available at same price", "Mobile Not Work Properly."], "review": ["Mobile is fine. but turbo charge is not work with me. When i have been charge\nmy mobile it takes full charging time more than one hour. I thought turbo\ncharge used within half an hour mobile gets fully charged. otherwise finger\nprint is works very fast. battery drains also very fast. Mobile battery issue\npurpose i gave 3 stars only\n\n", "Dear friends don't purchase it never... 10 days back I purchased moto4g\nplus... first of all its not supporting for jio volte video calls... its\nsupports only jio audio calls... mi basic phones are supporting jio video\ncalls... 15000 is too much for this mobile.. please friends never go for this\nworst phone..\n\n", "Worst product ..I have seen...though features are good ...but product quality\nis very poor....service centres are worst ....I have emailed company but they\nprovide no response .....much heating issues .......though earlier phones were\ngood but this one is poor\n\n", "Really amazing product. Camera is good. Video clarity is really awesome. Turbo\ncharging is really helpful . Within .5 hour phone get 100% charged. While\ncharging we cant use the phone. Phone will get stuck for that time . Some\nheating issue is there. Totally its good. ):~\n\n", "Everything ok but battery drains very fast. Image storage setting is\npoor....it irritates...Phone overheats.\n\n", "phone is very good. camera performance and other feature are very good. in low\nlight camera is just okay. but during day is picture quility good. but i found\na problem in its wifi connectivity. its wifi disconnect automatically. moto e\ndownload 1.3 gb in night but moto g4 plus did only 150 mb due to its\ndisconectivity in all night\n\n", "I WAS VERY WELL SATIFIED WITH THIS MOBILE WHICH YOU HAVE SEND. IT HAS ULTIMATE\nAPPEARENCE. BUT WHAT I HAVE OBSERVED IS, FROM ONE MONTH  \n1\\. ITS GETTING HEATED  \n2.SOMETIMES WHEN CALL IS COMING, THE SCREEN IS NOT DISPLAYING  \n3.AND IT WAS HANGING ALSO\n\n", "Nyc ph in ths budget... Fst chrgng, nyc cam qulty, frnt cam also very gd..Nyc\nsound qlty ... Yes htng pblm is a issu,bt if u r nt a big gamer thn go 4 it..\n\n", "Not a very durable product. Build quality time s very cheap. The battery life\nif the phone is also not good. But the Moto x play instead.\n\n", "I not happy by this mobile.When I open any application it shows aplicacion not\nresponding. When I open camera it shows camera error restart again than I\nrestart camera it shows same think. My mobile not working properly. Please\nreturn this product. I face many problems in this mobile.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 December 2017", "on 13 July 2017", "on 8 July 2016", "on 17 October 2016", "on 9 August 2017", "on 16 November 2017", "on 19 May 2017", "on 1 July 2016", "on 30 March 2017", "on 8 May 2017", "on 7 August 2017", "on 7 April 2017"], "reviewer": ["Ramesh", "Rajasekhar", "Amazon Customer", "Amazon Customer", "rajiv ranjan", "Ravinder", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Amazon Customer"]},
{"rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.9 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars"], "title": ["Dont Buy", "One Star", "Not worth?ghost touch issue is very serious", "I like the phone", "Chinese quality experience", "Nice", "Performance is very good.", "Best product. I hv also purchase after so many ...", "Flickering Screen problem", "I bought a MOTO G4 PLUS mobile from this seller ..."], "review": ["Dont buy this product.My display is damaged in one month.even customer care is\ngiving reasonof physical damage.Ask me to pay RS 6500.In warranty documents\nthey say The display and embedded lens are warranted for 4 years.useless\nphone...Don't purchase ....\n\n", "Mobile totalii hang ho rha hai.or over heating ho rha hai.mene uske review\nache sune the but yh Sach nhi hai.. autometic on off ho rha hai.dispay change\nho rha hai.\n\n", "Device ia not working properly ..but Amazon app is saying device is fine..how\nto return it...please advice ans giude me how to return the Phone\n\n", "I like the phone. Its working satisfactorily. Though there are many phones\nwhich are offering similar or better configuration, I choose this brand\nbecause of the brand reputation. Moto enjoys a better branch appeal as\ncompared to other phones.\n\n", "First 3 months - great and then - you get experience of Chinese product\nquality left right center - heating, hanging, frequent need to restart,\ntouchscreen going wild etc.  \n  \nNot for this phone in particular but brand Moto in general.\n\n", "Some heating issues if you use it naked without cover but performance is\notherwise good and camera one of the best in this price bracket and artificial\nlighting performance and is good\n\n", "Quality is very good.  \nBut turbo charge is not work.  \nCharging period mobile is overa heated.  \nWhen charge is above 90% heat wil be reduce.  \nIt's a main defect is heating.  \nPlease reduce the heating issue for this mobile brand.\n\n", "Best product. I hv also purchase after so many research. U can go for it\nwithout any doubt. Worth of money.\n\n", "I have purchased this phone few months back after getting top reviews about\nit. But facing the Flickering screen problem. Even after doing the factory\nreset , the same problem persisting.Avoid this phone.This phone does not\nsupport multiple applications.\n\n", "I bought a MOTO G4 PLUS mobile from this seller and after 8 month of\npurchasing this mobile now the turbo charger is not working and i am unable\ncharge my phone.. So my suggestion don't buy any product from this seller and\ndon't buy anything from Amazon.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 December 2017", "on 13 July 2017", "on 9 April 2017", "on 29 January 2017", "on 6 May 2017", "on 25 March 2017", "on 29 June 2017", "on 15 December 2017", "on 7 July 2017", "on 7 August 2017", "on 19 March 2017", "on 7 March 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "ak", "Amazon Customer", "Anshul Gupta", "tanmay g.", "Suresh v", "Amazon Customer", "Amazon Customer", "Amazon Customer"]},
{"rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.9 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars"], "title": ["battery backup is good, works for an entire day without any issue", "Poor product", "The product is good, but the company policies are poor 2/10 when ...", "Not recommended", "Hang !Hang!Hang!", "WORST PRODUCT", "Awesome product..", "Rear camera glass quality , and handing issue during charging", "Satisfied but not happy with the product.", "Scrap in 3 months don't buy"], "review": ["Phone works as advertised.....battery backup is good, works for an entire day\nwithout any issue.  \nOnly problem is that when phone is on charge, the touchscreen response\nglitches where you cant use the phone.\n\n", "Poor product, heats too much. I bought G2 few years back and excellent product\nhence bought G4+ but poor camera images blurts on every single shot too much\nheating and when charging automatically performs opens apps do stuff.no Moto\nnext time\n\n", "The product is good, but the company policies are poor 2/10 when it comes to\nservicing or genuine replacement. The previous piece that was not replaced by\ncompany even while in warranty period has shattered all reputations of a\nreputed image.\n\n", "I will not recommend this product. It is automatically shut down during call.\nMay seller not provided me genuine product.  \n  \nI have reset this 10 times but still same issue.\n\n", "When I removed flight mode my bluetooth gets automatically on sometime gets\nhits except that it is excellent as mentioned by others\n\n", "DONT BUY THIS MOBILE  \nI AM USING THIS MOBILE  \nFIRST TWO MOTHS ITS WORKING FINE AFTER THAT ITS ATOMATICALLY SWITCHING OFF THA\nMOBILE WHILE PLAYING GAME  \nAND NORMAL USE  \nWORST PRODUCT\n\n", "Product is awesome..  \nBut  \nA problem of slightly laging after using camera for more than 20 mins..  \nCamera quality is really really good  \nValue for money product...  \n'''\n\n", "At the time of charging . We cannot operate phone screen filkaring... There is\nno way to switch of the phone.  \nRear Camera Glass quality not good, it is not scratch Free. Within 6 months I\nface this issue.\n\n", "Device performs well . Successfully upgraded to android N . Screen misbehave a\nlot when i use it while charging . Games performance is well but but sometimes\nit hets crashed and feels too annoying. Battery backup is good .Overall\nperformance is quite ok .\n\n", "I purchased the phone in February 2017. It started giving me issues with being\nheated up and ghost touch. It's hardly 3 months and I am repenting buying it.\nThe phone is under 1 year warranty but feeling helpless for investing in this\nphone.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 December 2017", "on 13 July 2017", "on 4 May 2017", "on 3 September 2017", "on 18 July 2017", "on 18 December 2016", "on 8 June 2017", "on 21 November 2016", "on 14 November 2016", "on 23 March 2017", "on 11 March 2017", "on 29 May 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Abhinav", "Vedanth", "Pavan more", "Amazon Customer", "Priyanshu SH", "Amita"]},
{"rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.9 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars"], "title": ["Waste phone.", "Too bad", "Replacement", "A very Average Phone.", "Not worth the money...", "Recently i booked Moto G Plus, 4th Gen (Black ...", "TOTALLY DISGUSTING OVERHEATING NO RESPONSE TO TOUCH CAMERA PROBLEMS I WANT ...", "Good Phone but Cons on some serious issue (Heat, camera) overlap good features.", "Often charging required for the phone which is really annoying. Only 1 advantage of less weight", "Worst battery backup a phone can have"], "review": ["Phone has started giving brightness issues after using it for 6 months.\nHeating issue is also there.\n\n", "Battery problem started within one month. Now the phone starts working by\nitself when connected to a charger. Battery life is becomes zero within 2hrs\n\n", "The phone keeps behaving weirdly whenever I put it on charge. Also, I don't\nthink it's been 1 year. I will need a replacement if possible.  \nThanks\n\n", "Pros:  \nCamera is really nice.  \nStock Android Experience.  \nNice Fingerprint sensor.  \nCons:  \nPerformance is not up to the Mark.  \nOut of 16 Gb only about 9 Gb available for the user.  \nHeating issue upon extensive use of camera.\n\n", "Phone is too slow to respond,not worth the money moto is charging for this\nphone... The only thing which is good is the speaker quality... Buy only if\nyou are a moto fan else buy xiaomi or apple which are miles ahead in user\ninterface and experience..\n\n", "Recently i booked MMoto G Plus, 4th Gen (Black, 32 GB)oto G Plus, 4th Gen\n(Black, 32 GB) not working properly hanging problem, auto dialing and so many\nproblem in our phone. what should i do please suggest me and solve our\nproblem.\n\n", "TOTALLY DISGUSTING  \n  \nOVERHEATING  \nNO RESPONSE TO TOUCH  \nCAMERA PROBLEMS  \n  \nI WANT MY MONEY BACK\n\n", "Good Phone, but heating issue on camera or on video recording or on playing\ngame is worst part!  \nCamera is not up to that satisfactory level if you are talking about 16MP\ncamera (my nexus 5 8MP camera was better than that).  \nFinger print sensor is good but doesn't work sometimes.\n\n", "Please don't buy this phone at all.  \nHeating problem is always there and also battery drains very fast. Often\ncharging required for the phone which is really annoying.  \nOnly 1 advantage of less weight.\n\n", "I have to charge it 3 times a day on normal use. On keeping data off it gives\nbackup of maximum 8 hours , Turbo Charging has stopped working automatically\nafter 2 months and it takes whole night to keep it fully charged\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 December 2017", "on 13 July 2017", "on 27 July 2017", "on 1 July 2017", "on 13 March 2017", "on 15 May 2017", "on 2 April 2017", "on 16 June 2017", "on 11 July 2017", "on 4 July 2016", "on 9 April 2017", "on 4 November 2017"], "reviewer": ["Divyanka", "Amazon Customer", "Amazon Customer", "aman gupta", "Amazon Customer", "Amazon Customer", "Saheli", "Ashish_R", "Amazon Customer", "Gaurav Mishra"]},
{"rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.9 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars"], "title": ["Poor service no interest in customer busy making money", "Does not Suit Motorola to Continue this Phone !!", "Worth the price", "... after a yaer of usage this phone is the worst phone ever the battery life becomes so bad that ...", "good product", "moto g 4 plus very very bad mobile.", "Decent phone", "The Specialist", "You will be lucky if this phone works properly for a year!", "Phone heats up a lot."], "review": ["Lenovo is degrading Motorola big time. Poor service no interest in customer\nbusy making money. I recommend not to buy any Motorola or Lenovo product.\n\n", "It is prone to overheating. As soon as you run youtube or video or shoot\nvideos, it simply shuts down to prevent damage.  \nThis review is after a year of usage !!  \nBuy at your own risk !!\n\n", "Heats up a little, other than That works well..  \nNice to know that the design has changed from the old Moto series. .  \nAnd The camera is good...\n\n", "Writing this review after a yaer of usage this phone is the worst phone ever\nthe battery life becomes so bad that within 07hrs your entire battery drains\n\n", "I've got the product on time, it's nice & definitely new, g4 plus's sound\nquality is really good there's no doubt about it, camera quality is OK not\nbad, as I was a Samsung user ( j7 2015), performance is good. Thank Amazon for\ntimly delivery.\n\n", "SVC after sale is very bad. My motog 4 plus not detecting the sim. As per SVC\ncenter there is problem in mother bord. They are asking to pay 8000/- Rupees\nhow ever phone is under warranty. Kindly do not purchase moto mobile. They are\ncheater.\n\n", "Decent mobile camera is good battery backup is neat it's display has ghost\nscreening issue maybe manufacturing defect there have been few problems after\nswitching OS Marshmallow6.0 to Nougat7.0 overall phone is good I'm using since\n10months thus I'm giving it 4 stars\n\n", "The product z very nice..after sales service z too pretty awesome... value for\nmoney...camera clarity z superb with apps... just expecting a glass body in\nnear future in this price range... earphone z very disappointing... otherwise\n5 star for the product\n\n", "After 7 months of the purchase, the phone's rear camera pic quality got\nruined. And many of the sets are facing the same problem. Even if it is in\nwarranty, the customer care is not ready to fix the problem. They charge ₹1800\nfor this ish! Worthless deal.\n\n", "The phone so excellent in navigation and performance, but this phone heats up\na lot and due to this very reason it is very inconvenient and uncomfortable to\nuse. I would suggest to spend some extra bucks and buy better phone which does\nnot heat very often\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 December 2017", "on 13 July 2017", "on 24 August 2017", "on 21 July 2017", "on 6 May 2017", "on 4 July 2017", "on 10 March 2017", "on 25 May 2017", "on 16 August 2017", "on 26 May 2017", "on 20 June 2017", "on 9 April 2017"], "reviewer": ["vipul choudhary", "Puneet Gandhi", "Amazon Customer", "Amazon Customer", "manas das sharma", "Amazon Customer", "Rohit B.", "Amazon Customer", "Amazon Customer", "GILBERT JOSEPH"]}
]