[{"rating": ["3.9 out of 5 stars", "|", "|", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "4.2 out of 5 stars", "4.1 out of 5 stars", "4.1 out of 5 stars", "3.8 out of 5 stars", "5.0 out of 5 stars"], "title": ["Greater than good", "Great Phone", "Five Stars", "Five Stars", "Is It Worth Buying Iphone 8? Pros And Cons", "Why iphone 8 is not iphone 7s ?", "Five Stars", "And super fast wireless charging 50%in 30 minutes", "Five Stars", "Xjxhx"], "review": ["Greatest", "The camera is too good ,The only thing is back panel is too slippery we’ll have to be a little careful while handling .", "Product is too good as it is iPhone and delivery on time.", "Superb Phone", "To Be Honest I Was Using Iphone 6s Before Buying Iphone 8 I Found No Big Diffrence Between Them But The Camera Quality Breaks All The Barrier Apple Took This To a Great Extent And The Battery Backup Is Awesome Jio Is Providing A Buyback Offer So You Should Check Up a Jio Store Before Buying It Because Thats A Pretty Cool Deal ! Coming to the pHone The display is awesome and the specs are great ! Phone is pretty fast as it is using a11 bionic chip it is the most powerful chip presented on a smartphone", "I am providing my views to the customers that don't get confused or disappoint  by the review of many other people in this item, that iphone should be known as iphone 7s because apple has launched the iphone 8 with some improved hardware and software.", "The iphone 8 now comes with glass back and not with aluminium back like in iphone 7 so it makes a major difference between iphone 7 and 8.", "No doubt ,that there is also many improventments in software.", "So dont get confused and if you like this iphone then go with it.", "If you find my viw helpful then press the helpful button below to support me.", "Look Cool.", "The iPhone 8!!! This is recently been launched by the apple store. This phone is water resistant for 30 minutes and a depth  of 1 metre. It's display is 16:9 ratio. It has the latest operating system ios 11. It has 2 GB ram. No extendable memory. It has stereo speakers. It has a 12mp camera. It has SIRI. And super fast wireless charging 50%in 30 minutes.", "Excellent product. Manjeet singh", "I hshs"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 December 2017", "on 29 December 2017", "on 22 December 2017", "on 3 October 2017", "on 30 October 2017", "on 16 October 2017", "on 4 November 2017", "on 25 December 2017", "on 4 November 2017", "on 9 December 2017", "on 22 October 2017", "on 2 December 2017"], "reviewer": ["Yashvant", "Rushyanth", "Danish khan", "KRIPAL SINGH", "aditya", "Aniket", "Deep", "Murtuza", "manjeet singh", "Ganesh sripathi"]},
{"rating": ["3.9 out of 5 stars", "|", "|", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "4.2 out of 5 stars", "4.1 out of 5 stars", "4.1 out of 5 stars", "3.8 out of 5 stars", "5.0 out of 5 stars"], "title": ["IPHONE 8 HITS SOME HIGH NOTES, BUT IT IS OVERSHADOWED BY IPHONE X, READ WHY?", "World’s best phone", "Five Stars", "Missing earpods from the I phone box - Highly deplorable", "No.1 in functionality", "Must buy!", "Just awesome", "One Star", "different IMEI No on box and phone *#06#", "If you don't want iPhone X but still want best iPhone then this is it."], "review": ["After reading highs and lows please check out my Opinion.", "There are some HIGHS and LOWS of Iphone 8 which are as follows:", "-------------", "HIGHS", "-------------", "● SPEEDY PROCESSOR", "● WIRELESS CHARGING", "● SLICK SOFTWARE", "● CLASS LEADING CAMERA", "-----------", "LOWS", "-----------", "● DATED DESIGN", "● FAST CHARGING COSTS EXTRA", "---------------------", "MY OPINION", "---------------------", "Thing is quite simple,", "● If you are an Iphone lover I would simply recommend you Iphone X over this, because you will regret yourself within 2 months of buying this phone. You will want an Iphone X badly.", "● And if you are not an Iphone lover and trying to buy this phone, believe me SAMSUNG NOTE 8 is just an awesome phone when you buy you will not regret it after 6 months too. Because Note 9 is no where near to launch within these 6 months.", "So simply I want recommend this phone, doesnt mean this phone is not good or something like that.", "● If you found my views helpful do let me know by pressingthe helpful button below.", "Thankyou so much.", "Best phone phone I have ever used this is great phone . If you are planning to buy a phone this is a must", "Excellent phone", "I have ordered an I phone 8. But the earpods are missing. It is absolutely deplorable from a firm like yours. We expect you to find a remedy as quickly as possible.", "Best for the people who love functionality & long term usage.", "Close all background apps if experience heating.", "Amazing phone and amazon trust an ideal pair!", "Excellent phone , upgraded camera features from iPhone 7 and reasonable price compared to its precedor", "Hi the box was unsealed and the head phones is missing inside the box", "Amazon provide me used phone which has different IMEI No. On phone and box seal. My phone used by some kiarah ghirdhari whose had login her a/c in play store app", "Purchased this directly from Apple store. Upgraded from iPhone 7 64gb. If you're Apple person, almost no learning curb. Price though is stratospheric though cheaper than iPhone X.", "Unit is blazing fast compared to my old iPhone. Screen is not OLED but still look wonderful with True Tone feature. Lost use of some software because developers did not upgrade their software from 32-bit to 64-bit. Speaker sound is much improved and really it is pleasure to listen while watching movie. Even though optical zoom is only 2x, it is nice to have. Digital zoom will go up to 10x but you pay in term of graininess.", "Guts are virtually same as iPhone X. Probably the last of \"old-style\" iPhone and most perfect in term of integration of software and hardware.", "Will do wireless charging but you'll have to pony up extra money for charger and stand. Unfortunately, it will not fast charge like some Samsung android smart phone.", "Best to invest in good case and screen protector as unit has glass back (to facilitate wireless charging).", "Snappy. Expensive. Camera Fantastic. iOS 11 very productive. True tone display easy on the eye. Wireless charging is awesome!", "I have a Note 8 and iPhone 8 Plus. Note 8 has many features and I love most, particularly Samsung Pay which works at way more places than Apple Pay does. Stylus is good to scribble stuff. Display is fantastic. iPhone 8 Plus with its execution (app performance) and Apple Watch Series 2 experience trumps Note 8 W/ Frontier S3 Watch.", "My old iPhone 7 Plus leather case from Apple worked just fine. The fast chargers I use with Note 8 work just fine with iPhone 8 Plus with the case on. This is my most favorite feature so far. True tone display and the snappy cameras with portrait lighting gives the extra edge over Note 8.", "iOS 11 is snappy. Migration of data from iPhone 7 Plus was made lot easy & quick with the new Apple Watch like transfer feature.", "All in all, great for productivity seekers, fashion statement & everything in between."], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 December 2017", "on 29 December 2017", "on 11 November 2017", "on 6 October 2017", "on 4 November 2017", "on 28 December 2017", "on 11 December 2017", "on 12 November 2017", "on 30 November 2017", "on 14 November 2017", "on 24 October 2017", "on 5 November 2017"], "reviewer": ["Desai Vimith |REVIEWER|", "Nimitt", "vaibhav vinkare", "Anilkumar Mannambeth Karikkan", "Amazon Customer", "raj_ankitraj", "Amazon Customer", " shiva", "Amazon Customer", "SwordFish"]},
{"rating": ["3.9 out of 5 stars", "|", "|", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "4.0 out of 5 stars", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "4.2 out of 5 stars", "4.1 out of 5 stars", "4.1 out of 5 stars", "3.8 out of 5 stars", "5.0 out of 5 stars"], "title": ["Fantastic early delivery by Amazon, very nice phone.", "Amazon is good", "Gift yourself an iPhone 8 this fall.", "Five Stars", "I give iPhone 8 a 4 🌟", "Defective piece", "Amazing Amazon Delivery", "Pathetic service, making fool of customers", "IF UR AN iPhone 6 or 7 USER", "Five Stars"], "review": ["Initial Review ( 30-Sep-2017)", "Received the IPhone 8 today. Very quick delivery by Amazon (got delivered way before the expected date). I got a very good deal on exchange offer for my previous IPhone 6s - Nothing wrong with it, however the latest IOS 11 update was taking a toll on the ageing battery, so is the upgrade).", "Since visually similar to 6s to 8, initially did not feel much difference (nowhere the number 8 written on the phone that can easily be seen). However when tried to take photos of fast moving objects the improvement in camera came into instance attention. The phone itself felt very snappy and raring to go on a rampage. Restoring from the previous backup, and take it on to a spin with whatever the daily chores it has to handle.", "Will come back with more updates once the things are settled a bit down).", "PS: I got a Spigen Liquid Crystal Case ordered and put on the phone. It looks much better than the previous Neo hybrid case - just in case anyone wants to know)", "03/SEP/2017", "Here is an update on the battery life. It is very good news, in fact tbe bettery drain is much much lesser than my 6s or a friend's SE.For comparison, I have restored all the settings from 6s and using all the applications.It is possible that after two years of use, 6s's battery is weak. However friend's SE is fresh ( hardly a month old).", "I have decided to add a tempered glass too , after watching iPhone 8 the 'fall tests' popping up in Youtube. Giving a shot to \"PowerBot PB901-i7 World's Thinnest 0.2mm Premium Tempered Glass Screen Protector for iPhone 7\" skipping all other famous branded solutions. Will post here how the experience is.", "Iphone 8 is as per expectations and Amazon delivery is also superb.", "iPhone 8 is the Best and the BEAST among all its rivals with a stunning Display and battery life.", "Having A11 Bionic chip into it’s heart, the phone is blazing fast and buttery. And let me tell you- I’m coming from 6S.. and the iPhone 8 is way better in terms of battery life and overall performance. It’s defin worth the upgrade if you are from 6S or earlier.", "Why you need to consider an iPhone 8 among others?  There you go..", "1. A11 Bionic Chip - (gone mad with numbers.)", "2. Great battery life. twice of 6S’s nearly.", "3. 2018-lined Flagship.", "4. Assurance for 3+ years.", "5. The best Camera on the Planet", "6. Supports wireless charging. (Right now May not be useful to many , but definitely in the forthcoming)", "7. Bluetooth 5.0 - A great fun with AirPods", "Best product", "iPhone 8 Review", "✔️ DESIGN:", "• The iPhone 8's aluminium rear has been replaced with a glass finish - which feels impressively grippy in hand - its overall finish is the same as that which debuted three years ago. This means it does feel somewhat dated, especially when placed down next to Samsung's Galaxy S8, although those fond of Apple's go-to design unlikely will have any complaints. ", "• ‎This dated feel is largely down to the chunky bezels that surround the 4.7in screen, with Apple's rivals - and even Apple itself - making the move towards full-screen, bezel-free devices. This does mean that there's room for Apple's trusty Touch ID sensor underneath the display, though, which has so far worked flawlessly every time.", "• ‎Like the iPhone 7, the iPhone 8 is waterproof too, thanks to the handset's IP67 certification which means, in theory, it should withstand being dunked into water up to 1 metre for 30 minutes. This has rung true for us so far, but we try and avoid getting the handset too wet given its exposed ports on the bottom. ", "• ‎The iPhone 8 is a tad heavier than last year's iPhone 7 at 148g, which we found made it feel more robust. It apparently is, according to Apple, which boasts that the glass on the phone's rear is the \"most durable glass ever on an iPhone.\" We haven't managed to drop our iPhone 8 yet, but it feels like it could withstand a tumble or two.", "• ‎Elsewhere on the handset you'll find the Lightning port on the bottom edge is flanked by a speaker and microphone, and there's nothing up top. There's no return for the 3.5mm audio jack, but Apple includes a Lightning to 3.5mm headphone jack adapter in the box.", "• ‎There's also updated stereo speakers, which make the phone around 25 percent louder than the iPhone 7.", "✔️ DISPLAY:", "• The iPhone 8's display is largely identical to the iPhone 7. And the 6S, and, er, the iPhone 6. This means that the 4.7in screen, with its 1,334x750 resolution, does feel somewhat old-fashioned, not to mention small, compared to the likes of the Galaxy S8 and Pixel 2, again, added to by the bezels that surround it. Quality wise, while it pales against its rivals on paper, we've no complaints, and it continues to be among the sharpest and most vibrant on the market.", "• ‎The only real change to the iPhone 8's screen is the addition of Apple's True-Tone technology that first debuted on the 9.7in iPad Pro. This True Tone alters the colour temperature of the display depending on the environment in which you're in, reducing the harsh blue tones typical of an LCD when you're in a dimly lit room.", "✔️ PERFORMANCE:", "• Apple's new A11 Bionic chip sits under the hood of the iPhone 8 and, as expected, it's incredibly fast.", "• ‎Specs-wise, the six-core CPU comprises of two low-performance cores and four high-performance cores, with the regular cores being 25 per cent faster than the previous A10 chip, and the high-performance cores being up to 75 per cent faster than the A10 SoC, according to Apple It also comes paired with Apple's first homegrown GPU, which offers 30 per cent more performance than the A10.", "✔️ SOFTWARE:", "• The iPhone 8 ships with iOS 11, naturally, which brings with it improvements to Siri, reworked lock screen notifications, a new-look Control Centre and Apple's redesigned App Store.", "✔️ CAMERA:", "• On paper, the main camera on the iPhone 8 is no different to that found on the iPhone 7, with Apple retaining the same 12MP sensor with built-in f/1.8 aperture and optical image stabilisation (OIS).", "• ‎The biggest changes come on the video side of things with 4K recording now available at 60fps and slo-mo video now 1080p at 240fps - both of which are double the iPhone 7 and the former is a first for any smartphone.", "• ‎I tried it out in a variety of different lighting conditions, indoor and out, and were impressed with the camera's capabilities - in particular when low lighting is involved, something our iPhone 8 struggled to cope with. This is aided by the always-on HDR, which increases saturation while retaining more natural and realistic colours than images shot on the Note 8, for example. ", "• ‎The biggest changes are seen on the video side, with 4K recording now available at 60fps and slo-mo video now 1080p at 240fps - double what the iPhone 7 has on offer.", "• ‎On the front of the phone you'll find a 7MP camera f/2.2 aperture, Retina Flash and 1080p video recording, and while this isn't as great in low-light as the rear-facing snapper, it's perfectly good enough for the occasional selfie and Snapchatting, or whatever it is you kids get up to. Unfortunately, however, you don't get Apple's new Portrait Mode on the iPhone 8, nor the new Portrait Lighting feature that the iPhone 8 Plus has.", "✔️ BATTERY LIFE:", "• According to Apple, the battery inside the iPhone 8 will last around two hours longer than the iPhone 7's, despite weighing in slightly smaller at 1,821mAh.This has proved accurate during my time with the iPhone 8 so far. It usually gets me to the end of the day - just, whereas I usually had to charge my iPhone 8 most evenings.", "• ‎It's much less of a hassle to charge the iPhone 8 too, as it - along with the iPhone X - is Apple's first smartphone to support wireless charging. What's more, whereas Apple usually requires expensive propriety accessories, the iPhone 8 supports the Qi wireless charging standard, which means it'll work with most third-party charges on the market. ", "✔️ VERDICT:", "• In short the iPhone 8 is an excellent phone and there are some great new editions to get excited about, such as the inclusion of wireless charging for the first time and Apple's new A11 Bionic CPU, which is benchmarks are anything to go by, is the fastest mobile CPU on the market right now. ", "• ‎Beyond that, though, the iPhone 8 is an incremental update over last year's iPhone 7, and its large bezels and three-year-old design mean it does feel somewhat dated compared to the likes of the Galaxy S8 and Pixel XL 2, despite carrying a similarly-expensive price-tag. ", "Thank You PEACE..", "( IF YOU FIND THIS REVIEW HELPFUL PLEASE HIT THE 'HELPFUL YES VOTE')", "Very disappointed with the product, the phone is defective and Amazon is not replacing it, they'll also not return my phone that I surrendered for exchange, be careful with high end purchases.", "Got it the same evening of India launch...amazing Amazon!!! Besides got the best exchange deals on my old iphone 6!!!", "horrible experience, product delivered faulty and when we called up immediately to inform them ,, they said please visit an apple store", "If ur an iPhone 6, 6s or 7 user and if ur rich  enough , you should probably get iPhone X and not iPhone 8 . For  those who are using iPhone 5s and below , upgrading to iPhone 8 is a good choice", "It’s amazing"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 December 2017", "on 29 December 2017", "on 30 September 2017", "on 4 November 2017", "on 20 December 2017", "on 26 December 2017", "on 5 December 2017", "on 23 October 2017", "on 16 November 2017", "on 18 December 2017", "on 7 December 2017", "on 4 November 2017"], "reviewer": ["Divyan", "Mahesh Yadav", "Prashanth MS", "Parv Khattar", "Toshi Aley", "Human carpenter", "Karan", "Vinay", "abhimanyu", "Amit"]},
{"rating": ["3.9 out of 5 stars", "|", "|", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "4.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "2.0 out of 5 stars", "|", "|", "4.2 out of 5 stars", "4.1 out of 5 stars", "4.1 out of 5 stars", "3.8 out of 5 stars", "5.0 out of 5 stars"], "title": ["Completely Avoidable Buying Experience", "Five Stars", "Is it Worth Purchasing ? Detailed Review with Battery Stats.", "FULL REVIEW OF IPHONE 8", "Great phone!", "Five Stars", "Five Stars", "Is the iPhone 8 for you?", "Dont stretch your budget too much ! Best in terms of body design and Processor.", "Two Stars"], "review": ["The phone has turned out to be a dud! My iPhone 8 is rebooting continuously and Amazon support asks you to contact manufacturer, who will send it to the repair facility in Bangalore. It's a whole new process that will take 7-10 days. My advise, never buy a phone online, always buy such phones from authorised stores.", "It’s a great mobile.", "NOTE :", "@ This is available at many online and offline stores, so check the prices before purchasing.", "@ I am Not mentioning Technical Specs, this Review is Purely from Normal User's Point Of View.", "@ Battery Backup of this phone is one of the best among high ends smartphones ( check the stats below for details )", "I used this phone for couple of weeks and following are the observations,", "● Build quality is Top Notch. Back panel looks similar to S8.", "* This acts like Finger print magnet as well.", "● Water Resistant atlast with certification ( IP67 ).", "* Though previous versions were resistant to water, but this is Certified.", "● Processor is Beast.", "* Though is has lesser cores or is numerically inferior on paper, its indeed Fastest in the market.", "* Multitasking is piece of cake.", "● Cameras are Best in class.", "* Rear camera has awesome output specially simultaneous 4K video and 8MP image recording feature.", "* Slow motion videos are outstanding.", "* Front camera too is good.", "● Battery Performance -->", "==================", "# Charges from 0 to 100% in approx. 2 hrs with stock charger.", "# With Fast charger it clocks 0-50% in just 30 mins.", "Usage Mode ---> Battery Performance(Avg.)", "===========================================", "@ Mobile Data(3g/4g) Used Continously ---> 6-7 Hrs.", "@ Normal Calling Only + Standby ---> 25 Hrs.", "@ Normal Calling + Music Playback( Continuous ) ---> 9-12 Hrs.", "@ Internet Usage on WiFi Only( No Calling ) ---> 8-9 Hrs.", "@ Gaming ( Wifi) ---> 5-7 Hrs.", "@ Gaming ( without WiFi ) ---> 5-8 Hrs.", "@ Video Playback ---> 10-12 Hrs.", "CONS :-", "---------", "●  First and most important is its Huge Price tag.", "* Its a great phone, but certainly not worth the price.", "● Design is Fragile and prone to Damage, the movement it falls on ground.", "● No Dual sim yet.", "● NFC of the phone has Limited applications in practical world.", "VERDICT --->", "-------------", "●● Should you Upgrade it from iPhone 7 or 6s ? ●● Is it Worth Purchasing ? ●●", "============================================================", "According to my usage I Do Not find appreciable reason to Invest this huge sum and Upgrade to it, just for slightly better performance.", "Indeed it is Symbolic piece of machine, but certainly not worth Upgrading to.", "If you want your first apple device and have ample to spare, then certainly go for it.", "If you want Luxurious smart phone with Definite Value for money, then Better go for Samsung S8.", "P.S. - I am huge Apple fan, having almost all iphones in possession, still I do not find this worth the tag.", "That's it, I hope this should clear your doubts, if not then drop them down in comment section & I will try to answer 'em.", "Thank You for reading this Review.", "The iphone 8 is the successor to iphone 7 which is same in much of the design but has grest improvements. Let me divide this review into pro’s and con’s", "Pro’s", "1.the display has increased significantly. The display is much crisp and brighter.", "2.the new apple chip with the dedicated bionic chip is lightening fast and hence the file tranfer speed has also significantly increased", "3. The new back is glass hence supports wireless charging", "4. The battery life has also significantly improved", "5. The camera is super good and with the new chip the processing quality is super good", "6. Has a improved speaker", "7. The water and dust resistance has also significantly improved", "Con’s:-", "1. Still the asthetics remains the same", "2. Has no headphone jack. Alas! Welcome to 2017", "3.the back is now glass so maintain a good quality case, chances of breaking is more", "4. Still the same battery and charger with no scope for  fast charging with the included charger", "FINAL VERDICT:-", "The phone is simply awesome but if money isn’t a problem buy the iphone X rather than 8", "IF YOU LIKE MY REVIEW PLEASE HIT THE HELPFUL BUTTON AND SUPPORT ME", "Super and awesome phone. don't read useless reviews and close your eyes then buy it.", "good", "Amazing phone. Worth buying just for battery life it provides", "Hey guys, if you are thinking of purchasing the latest iPhone 8, chances are that you already know it's best for you but if you wanna know some extra stuff, it's here. Just pay a look and you'll be glad you did.", "Let's get on with it.", "=====PROS=====", "-Body: Aluminum 7000 frame, reinforced glass front and rear, IP67 certified for water and dust resistance. Gold, Space Gray, and Silver color options.", "-Screen: 4.7\" 16M-color LED-backlit IPS LCD screen of 750p resolution, 326ppi, True Tone adjustment via four-channel ambient light sensor, wide color gamut, 3D Touch.", "-OS: Apple iOS 11.", "-Chipset: Hexa-core (2 Monsoon + 4 Mistral) 2.09GHz Apple CPU, tri-core Apple GPU, 2GB of RAM, Apple A11 Bionic SoC.", "-Camera: 12MP camera with F/1.8 lens, optical image stabilization, quad-LED flash with slow sync, phase detection auto focus, wide color capture.", "- Video recording: 2160p@60/30fps, 1080p@30/60/120/240fps video recording.", "-Selfie: 7MP F/2.2 front-facing camera with BSI sensor and HDR mode, 1080p@30fps video.", "-Storage: 64GB or 256GB of built-in storage.", "-Connectivity: 4G LTE Cat.12; Wi-Fi a/b/g/n/ac; Bluetooth 5.0; Lightning port; GPS with A-GPS, GLONASS, GALILEO, QZSS; NFC (Apple Pay only).", "-Battery: 1,821mAh battery, wireless charging (Qi compatible).", "-Misc: Stereo speakers, pressure-sensitive Home key with fingerprint scanner, Taptic Engine.", "=====CONS=====", "-Poor screen-to-body ratio (too much bezel for the size).", "-No 3.5mm audio jack (ships with a Lightning to 3.5mm adapter).", "-No microSD slotiTunes is still required for manual music upload.", "-No fast charger provided in the box (and the optional one is expensive).", "-Video camera still recording mono audio only.", "=====THOUGHTS=====", "This should have been a 7S. That simple. But it's complicated. Too complicated perhaps for Apple as we used to know it. On paper - and in actual fact - there's enough new stuff in that package. Yet, the Apple iPhone 8 doesn't go beyond the iterative upgrade we've come to expect from an S model. Is it because it's impossible to not take into account the iPhone X? Or is it the new all-glass design is looking too familiar?", "Maybe it's the way Cupertino handled some of the upgrades. Like the camera did get better thanks to a new sensor and larger pixel size but Apple isn't exactly verbose about the new imaging technology. There's fast-charging support too but with a caveat: you're not getting it right out of the box. Not with the supplied charger and cabling.That, and the steep price may give Apple a hard time justifying the iPhone 8, especially to iPhone 7 users. With no intention whatsoever to downplay the good stuff about the iPhone 8, the new model and its spec sheet are pretty predictable. The price is therefore a bit of a surprise - and not a pleasant one either. Then again, Apple's never had a problem getting the price it thinks is right. Plus, the iPhone 8 may turn out to be convincing enough. We're back right after the break to pop the box open and begin to find out.", "=====CONCLUSION=====", "No doubt, that's it's one of the best phones of 2017 but the fact that iPhone X is around the corner, purchasing this makes no sense but if the Home button and the Touch ID is a big deal for you, this is definitely a good choice.", "If this review was helpful, please consider clicking on the helpful tab. Thanks!", "Happy purchasing!", " i am reviewing this product on the basis of apple iphone user", "so that if anyone who is using apple phones can get as much", "help as i can possibly able to provide.", "Kindly note i am that guy who purchase things and review so", "that it helps you, i am not such kind of people here who do fancy reviews", "even they dont buy, i purchased this one and pictures are attached.", "Why to Go for iPhone8 now ?", "- Iphone X is Too costly", "- Fastest Apple chip , so its better to buy iphone 8 if you using iphone6 or 6s", "- glass design and aluminum back, better than iphone 7 and 6 models body.", "- i have most of my data to icloud , like pictures etc so iphone user will go", "with upgraded iphone not android.", "- lot of offers with iphone 8 which makes it accesible as X is too costly.", "I am attaching pictures and images for better help.", "thank you for your time", "stay fit stay strong", "Outdated and experience.Not worth buying."], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 December 2017", "on 29 December 2017", "on 29 December 2017", "on 29 December 2017", "on 6 December 2017", "on 29 November 2017", "on 22 December 2017", "on 14 December 2017", "on 15 December 2017", "on 11 November 2017", "on 17 December 2017", "on 27 December 2017"], "reviewer": ["Rajnish Sharma", "Mohammad Tariq", "Sameer Patil", "TECH NERD", "Abdul jaleel", "Dr.G.Inna Reddy", "Rahul Chowdhri", "TechSpace", "FITNESSINFINITY", "Mihir"]},
{"rating": ["3.9 out of 5 stars", "|", "|", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "1.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "4.2 out of 5 stars", "4.1 out of 5 stars", "4.1 out of 5 stars", "3.8 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Don't buy..", "Five Stars", "No cashback till date", "which is again a bad feature. I connected my Moto 360 watch but ...", "disgusting apple. phone is only for show off", "Five Stars", "One Star", "Five Stars", "Five Stars"], "review": ["Simply awesome", "Not worth buying as there are better alternatives for lesser price.", "Nice phone", "On purchase it was told that 10% cashback will be received on HDFC cards. More than 2 months have elapsed, I haven’t received the cashback and the executives aren’t even assisting.", "Absolutely ridiculous phone, Dont buy, Phone is single band, i though Apple might have improve it but they dont work on this issue. When a person goes behind walls, calls get disconnected, regarding the basement forget about the signal. Data channel gets lost during the phone rings, if you are working on your laptop or anything & put phone on Hotspot mode your work is lost, which is again a bad feature. I connected my Moto 360 watch but it gets disconnected every 10 minutes I need to tap my watch to connect again.  Apple says wireless charge but you will get wired charger again a cheating. i was using Lumai before that i never had any issues.", "Same old iphone with no new features. 720p screen, ios 11 bugs. this phone is not worth 64000 at all. disgusting apple. phone is only for show off!!", "Awesome", "Worthless.. not worth the price", "Such an enticing phone and the gold color is remarkable.", "Awesome deal and as usual product"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 December 2017", "on 29 December 2017", "on 6 October 2017", "on 16 December 2017", "on 5 November 2017", "on 8 December 2017", "on 14 December 2017", "on 9 December 2017", "on 11 October 2017", "on 16 November 2017", "on 16 October 2017", "on 2 October 2017"], "reviewer": ["Hemant", "Abhishek Gupta", "Amazon Customer", "Srishty goel", "Zahoor", "Pinak Bhusan Mohapatra", "Amazon Customer", "Amazon Customer", "Nishanth Krishna", "rohit"]}]