[
{"date": ["on 28 December 2017", "on 29 December 2017", "on 6 June 2017", "on 15 August 2017", "on 3 May 2017", "on 10 May 2017", "on 6 March 2017", "on 29 March 2017", "on 31 August 2016", "on 1 December 2016", "on 27 May 2017", "on 21 September 2017"], "reviewer": ["Arun Venkatraman", "Agam Srivastava", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Gj", "Vinayak Sawnt", "Rutwik", "Rishabh K", "Amazon Customer"], "review": ["Overall performance is pretty average. Heats up badly if usage is heavy. If you are someone who plays games on your phone, this phone is not for you. Heats up and battery drains pretty fast. It's an okay phone for moderate usage.", "It's been a satisfying 1 year woh the G4, only pros wil be the camera degrading day by day and now it's almost like a VGA compare to the 16 MP shooter earlier, all and all if you are looking for an Android phone with good stock Android experience, MOTO is for you", "itz a worst decision i had selected moto... itz been ~6months i lost my fronte camara. phone is hanging out terribly and heat generated by phone you can cook anything on it.. please never ever select option of moto same thing happed for me two times..", "Main problem is battery of this product, when charging will comes below 40% then mobile is getting switch off unknowingly.", "people are not expecting this type of product from Amazon.", "so please keep avoid such kind of products into the market.", "It's good phone but sometimes it behaves itself.", "And that's very strange about the phone like it scroll down itself without touching the screen.", "The product keeps restarting . Please seller get back to me and exchange the product . It's less than 6 months old. Please exchange it asap", "Yes there is heating issue with this phone while charging and playing game.", "Display is not so bright.", "Good Battery Backup for average used it will usually last a day.", "Camera is good. Gives u really good Images.", "Fast finger print sensor. Works really well.", "No pre_installed gallary.", "It has a lot of heating issues while charging and while capturing photos. Fingerprint doesn't respond every time. Otherwise cool product.", "After using the product for 6months. I would suggest not to buy this phone. Camera is good n the story ends here. Fingerprint scanner is very sluggish, battery drains really quickly, hangs a lot. Look for other options in this price range.", "Phone was good but the", "My charging cable not charging my phone", "Manufacturing defect .......... Fornt camera having dust problem.....", "6th time serviced my phone by moto", "They couldn't fix this problem till now", "They try all things...."], "title": ["Heats up badly", "G4- A pocket friendly sidha Sadha phone", "itz a worst decision i had selected moto", "Worst product I had ever seen.", "Not good as like other Moto phones.", "Keeps restarting. Can't even last a year", "Average phone", "Otherwise cool product.", "Save ur money. Don't buy this phone, look for other options", "Lenovo killed motorola very sad but true"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 29 December 2017", "on 28 December 2017", "on 1 August 2016", "on 13 July 2017", "on 10 June 2017", "on 28 December 2017", "on 14 July 2017", "on 6 June 2017", "on 19 June 2017", "on 4 April 2017"], "reviewer": ["Mohit tripathi", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Tanzi", "pavan jain", "AmazonCustomer", "Bhaskar Chowdhury", "Amazon Customer", "Sahan"], "review": ["It has a life of 8 months, I dragged it on to an year though", "Please find below the pro an cons", "Cons:", "1. Not worth the price listed here", "2. Heats a lot, the screen would malfunction within months and I could not absolutely use it outside under the sunlight", "3. The charger malfunctioned after 10 months,it just stopped with no damage to it, within the next 12 months had to replace 4 chargers, it somehow damaged all chargers", "4. Gave up on the phone when the power button broke after 12 months and 3 days, it just fell off.", "5. It is made to last an year, year and a half top, I had 3 of my friends using the same phone, all are on the verge of getting a new phone not because they got bored but because the phone became a drag", "Pro:", "1.Great camera", "2. Does not hang, ever", "3. Turbo charger", "I like the phone and its overall experience is good. Just the packing of the product by amazon was very bad. It didnt even look like it contain a 15k phone in it.", "The phone is working very well and is as promised. I have used it for a while now and is working upto the expectation.", "pros: 1. good phone for light used", "  2. Fast", "  3. good display quality", "  4. music play back is also very good.", "  5. good camera quality for the price range.", "cons: 1. its battery life sucks", "  2. it is not so gud at gaming", "so overall this product is not for heavy user for gaming etc.. it can be used for regular light use...", "It's been 4 months since I have been using this phone, and  I will like to say that it's was a really good experience. While ordering I didn't know how the phone will turn out to be but it was above my expectations.  Amazon delivery was within a week. It is user friendly and above all value for money.", "Pros: Good quality camera", "Fingerprint sensor is fast and accurate.", "Doesn't get hang.", "Strong battery life, gets full 100% charge in 1 hour.", "Cons: Speaker volume is low when u used it for Video call.", "Only gets heated when u keep it for charging. Otherwise No heating problem found.", "I ordered this phone but received a defective piece. Amazon did take the phone back and refunded the amount paid. I reordered the phone and again got a defective piece. This time the camera was not working.", "Bought this product in Jan. It worked good for 3 months then microphone problem, Over heating problem, No battery backup. If you give your phone for service they won't return your phone even after a month. Worst phone I ever used and the worst service by service center people.", "Bought this 1 and half year back.. but after sometime the screen burn is regular and camera lens is also gone.. front camera looks better than back now.. had a good run..", "Awesome mobile....I use it continuously for 5-6 hours..neither heats nor battery goes down.", "Phone is ok but I have found two disqualities i.e. 1) If I talked or surfing net it's become very hot, even at the time of phone charging. I feel very afraid.", "2) Headphone jack is very problematic. It's not working.", "Well it is late to post since it's been more than a week, the product and service are extremely awesome. But buying such a costly phone it did not support screen cast, also Anycast dongle does not work. Rest all is fine.", "It is average though! It heats up a lot while playing games. Rear camera is good and front is quite standard. Look is not so attractive. It's good sides are Corning's Gorilla Glass protection, turbo charging facility and you can upgrade to android Naugut as well."], "title": ["NOT WORTH THE PRICE", "Awesome phone for the price range", "Best phone under 15K range, Just go for it!!!!", "I ordered this phone but received a defective piece. ...", "It worked good for 3 months then microphone problem", "Screen burn problem", "Best place to buy!", "Well but headphone jack is problemtic", "Good product but one amazing feature missing", "Not bad; satisfactory"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "5.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 4 June 2017", "on 30 August 2017", "on 14 November 2016", "on 9 April 2017", "on 9 July 2017", "on 2 March 2017", "on 13 May 2017", "on 21 April 2017", "on 1 April 2017", "on 6 April 2017"], "reviewer": ["Amazon Customer", "Subhajit k.", "Ankit", "HIMANSHU AWASTHI", "Amazon Customer", "Amazon Customer", "Rakesh T.", "lalit vashishta", "Amazon Customer", "Amazon Customer"], "review": ["not that great..but \"ok\"for normal usage. screen flickers and touch responses itself on charging. Heating problem when u use too much.i used it for 10 months...few months later after i purchased ,it stopped recognizing my fingerprint \" -_- \".", "Amazing product..  Aswm camera..  Aswm mobile..  Stock android experience..  Smooth touch..  And call quality also good..  This mobile not for heavy user..  BT u can average performance  day to day usage..  So keep calm and go for it..  Thnk u team Motorola and amazon..", "Heat up issue is there and some time mobile hangs out and functions are not working properly but overall its not good product.", "I was big fan of Moto phone, this is my 3rd Motorola phone and it is worse. Camera is value for money.", "It has lot of heating problem and hanging problem while charging and resource heavy app( camra, video recording, or some game).", "Pros:", "Lightweight", "Two Sim slots + expandable memory slot (not hybrid)", "Turbo charging", "Fingerprint sensor", "Cons:", "No notification LED", "Build is pretty weak. The back case resembles a paper sheet", "Not water resistant, even though it's predecessors were!", "Cemera is excellent..... N battery is also good not best but overall performance is also good. Only heating issue is there.... So if u are a heavy user then don't bye it.....", "Satisfied with the product. After one month usage it's going good. Slightly hanging apps first time today but overall it's good product.", "After using for 3 months found the following issues", "Hangs too often", "The On/Switch broke and now the (rude people at service center) service center says switch stock is not there.", "Poor service backup", "Phone is some what O.k. Battary does not last more than 24 hours even use of data and video is limited.phone screen remains on when not in use for about half a minute. Ram speed is O K. Price is somewhat on higher side when compared with competitive phones", "suffering camera flash problem and battery was good till 6 month after that battery performing badly..Side button problem requires more force to press .."], "title": ["not satisfied", "Amazing product.", "Nice deal", "Not worth", "Value for money at 10.5K!", "Cemera is excellent..", "Good one", "Poor service backup", "Phone is so so.improvement is required.", "suffering camera flash problem and battery was good till 6 month after that battery performing badly"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 1 October 2016", "on 23 May 2017", "on 28 September 2017", "on 30 July 2017", "on 10 July 2017", "on 14 April 2017", "on 25 July 2017", "on 4 March 2017", "on 9 April 2017", "on 9 September 2016"], "reviewer": ["Amazon Customer", "Gourav Sharma", "HASEEB AHMAD SHADAB", "Amazon Customer", "Amazon Customer", "Robin Keshri", "swetachandan", "Amazon Customer", "Amazon Customer", "Amazon Customer"], "review": ["Phone performance is pathetic but don't know why it stopped taking charging now and it's very difficult to get it charged, seems most of the moto phone have this charging problem as I have g4 play and turbo edition mobile as well. I would like to hear back from moto person about it.", "Pros", "Camera is super", "Fingerprint sensor works fine", "Best phone for more than medium usage", "Stock android is a decent experience", "Cons", "Battery drains fast", "Heavy gaming is a bit lagging", "Hi.", "I have purchased this set 3 months ago.", "And I was so shocked to know that, exactly after 3 months passed its battery backup gone away.", "Now it's battery depletes like petrol.", "It's continuously depleting until needed replugin for power..", "Wrost product i have ever purchased,", "Major os concern.", "Mobile heats up too much.", "Apps keep on crashing.", "Bluetooth gets automatically on when switched from airplane mode.", "Screen burn issue outline of background app overlaps working app", "Heats a lot.. A lot means a lot. Behaves Strange sometimes and starts to click anywhere on the screen on its own. I won't recommend it to anybody.", "Charging problem started after 8 months of usage.", "Camera cover/glass full of scratches, as a result of which the resolution of the pics taken is worse than a VGA camera.", "Overall, feeling cheated. I would never buy Motorola product again.", "Worst phone.shows lots of problem like heating issue, automatic switch off , battery problem,Sim slot not working and many more.Even if you go to customer care they would take atleast 20-25 days for repair.After repaired same problem continues....", "Poor service. I already send feedback for Moto g plus.i faced the ghost touch problem When I charging my phone.i contact to your help line but your no response.they said download app for check your phone but in app ghost touch problem don't find..", "it is worst dont buy this. i am facing somany probloms like hanging, heat up , battery not good, camera worst than ever i seen .", "Worst cellphone ever. After 10 months of use. Battery is draining fast, mobile switched off regularly on its own mood. Useless product. Don't buy it. Motorola decreased quality with the help of lenovo. Don't buy."], "title": ["Very bad phone and not charging", "Decent phone but some points are a bit disappointing", "Battery backup after a few months very bad.", "Wrost product i have ever purchased, Major os concern ...", "Very Bad", "Lost my money on this phone.", "Worst phone of moto@lenovo#", "Poor service. I already send feedback for Moto g ...", "it is worst dont buy this", "Four Stars"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 4 May 2017", "on 3 September 2017", "on 18 July 2017", "on 18 December 2016", "on 8 June 2017", "on 21 November 2016", "on 14 November 2016", "on 23 March 2017", "on 11 March 2017", "on 29 May 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Abhinav", "Vedanth", "Pavan more", "Amazon Customer", "Priyanshu SH", "Amita"], "review": ["Phone works as advertised.....battery backup is good, works for an entire day without any issue.", "Only problem is that when phone is on charge, the touchscreen response glitches where you cant use the phone.", "Poor product, heats too much. I bought G2 few years back and excellent product hence bought G4+ but poor camera images blurts on every single shot too much heating and when charging automatically performs opens apps do stuff.no Moto next time", "The product is good, but the company policies are poor 2/10 when it comes to servicing or genuine replacement. The previous piece that was not replaced by company even while in warranty period has shattered all reputations of a reputed image.", "I will not recommend this product. It is automatically shut down during call. May seller not provided me genuine product.", "I have reset this 10 times but still same issue.", "When I removed  flight mode  my bluetooth gets automatically on sometime gets hits except that it is excellent as mentioned by others", "DONT BUY THIS MOBILE", "I AM USING THIS MOBILE", "FIRST TWO MOTHS ITS WORKING FINE AFTER THAT ITS ATOMATICALLY SWITCHING OFF THA MOBILE WHILE PLAYING GAME", "AND NORMAL USE", "WORST PRODUCT", "Product is awesome..", "But", "A problem of slightly laging after using camera for more than 20 mins..", "Camera quality is really really good", "Value for money product...", "'''", "At the time of charging . We cannot operate phone screen filkaring... There is no way to switch of the phone.", "Rear Camera Glass quality  not good, it is not scratch Free. Within 6 months I face this issue.", "Device performs well . Successfully upgraded to android N . Screen misbehave a lot when i use it while charging . Games performance is well but but sometimes it hets crashed and feels too annoying. Battery backup is good .Overall performance is quite  ok .", "I purchased the phone in February 2017. It started giving me issues with being heated up and ghost touch. It's hardly 3 months and I am repenting buying it. The phone is under 1 year warranty but feeling helpless for investing in this phone."], "title": ["battery backup is good, works for an entire day without any issue", "Poor product", "The product is good, but the company policies are poor 2/10 when ...", "Not recommended", "Hang !Hang!Hang!", "WORST PRODUCT", "Awesome product..", "Rear camera glass quality , and handing issue during charging", "Satisfied but not happy with the product.", "Scrap in 3 months don't buy"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 5 September 2016", "on 15 May 2017", "on 22 April 2017", "on 27 May 2017", "on 19 January 2017", "on 22 September 2017", "on 9 March 2017", "on 2 June 2017", "on 18 May 2017", "on 3 March 2017"], "reviewer": ["Vishal Singh", "Divyesh Patel", "Amazon Customer", "Sandip Sethuram", "Aashi Khaitan", "BMW", "Prince kumar", "Amazon Customer", "Arjun Patel (Kawardha)C.G.", "Amazon Customer"], "review": ["After using the phone for 6 months it's running smoothly though it does hang sometimes and opens and closes apps when I put it for charging unlocked. And the charger is not of a good quality mine stopped working after 6 months.", "Not worth. Get some other device in 15k range instead. Screen issues, charging issues. Already having a lot trouble with the device itself.", "It is good but not the best by price and facilities. There is no moto's update available and for many things u hve to use third party apps.", "For the price it's a good phone.", "Again Motorola hasn't enhanced the battery life a great deal. If you use both sims the battery drains even more faster.  So need to watch the apps consuming the battery.", "Horrible battery life along with severe heating issues. Also the battery was spoilt after 5 months only. The screen went blank and the phone wouldn't turn on. The fingerprint sensor stopped working. And to top it all off, the service centers were pathetic. Disappointed.", "appreciable camera quality...Heating n ghost touch problem while charging... Heated easily while using camera n apps contiously...Other than dat it's fine...bit costly... While thinking of camera all other negatives bcm nathing", "Very bad phone it consume approximately 400%battery and heating problem,and always hang....", "Plss dont by😢🙏", "This phone is getting hang while on charging and wifi is also not getting connected.", "I am having 2 moto g4 in my home...that is going great... but I dont know what happen with this device...I have a doubt whether the phone was genuine or not...", "Don't purchased this phone bcoz", "1. rear camera glass have plastic than scratch easily", "2. Heating issue", "3. New Charger price - 1250  if u have lost u r charger", "5. Camera quality is so poor  according to their 16 megapixel capacity", "Don't buy this phone I bought it 5 months ago. It has lots of problems like heating while charging, torch on, talking phone.", "Majour issues is recently my phone sim2 slot  doesn't  work mean no Sim card detecting.", "I strongly not recommend.."], "title": ["Average phone", "Waste of money", "Good but not best", "Value for money", "Pathetic battery and service.", "Appreciable Camera quality", "Very bad phone i used in my life..", "that is going great..", "rear camera glass have plastic than scratch easily 2. Heating issue 3", "Pathetic phone"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 8 July 2016", "on 17 October 2016", "on 9 August 2017", "on 16 November 2017", "on 19 May 2017", "on 1 July 2016", "on 30 March 2017", "on 8 May 2017", "on 7 August 2017", "on 7 April 2017"], "reviewer": ["Ramesh", "Rajasekhar", "Amazon Customer", "Amazon Customer", "rajiv ranjan", "Ravinder", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Amazon Customer"], "review": ["Mobile is fine. but turbo charge is not work with me. When i have been charge my mobile it takes full charging time more than one hour. I thought turbo charge used within half an hour mobile gets fully charged. otherwise finger print is works very fast. battery drains also very fast. Mobile battery issue purpose i gave 3 stars only", "Dear friends don't purchase it never... 10 days back I purchased moto4g plus... first of all its not  supporting for jio volte video calls... its supports only jio audio calls... mi basic phones are supporting jio video calls... 15000 is too much for this mobile.. please friends never go for this worst phone..", "Worst product ..I have seen...though features are good ...but product quality is very poor....service centres are worst ....I have emailed company but they provide no response .....much heating issues .......though earlier phones were good but this one is poor", "Really amazing product. Camera is good. Video clarity is really awesome. Turbo charging is really helpful . Within .5 hour phone get 100% charged. While charging we cant use the phone. Phone will get stuck for that time . Some heating issue is there. Totally its good. ):~", "Everything ok but battery drains very fast. Image storage setting is poor....it irritates...Phone overheats.", "phone is very good. camera performance and other feature are very good. in low light camera is just okay. but during day is picture quility good. but i found a problem in its wifi connectivity. its wifi disconnect automatically. moto e download 1.3 gb in night but moto g4 plus did only 150 mb due to its disconectivity in all night", "I WAS VERY WELL SATIFIED WITH THIS MOBILE WHICH YOU HAVE SEND. IT HAS ULTIMATE APPEARENCE. BUT WHAT I HAVE OBSERVED IS, FROM ONE MONTH", "1. ITS GETTING HEATED", "2.SOMETIMES WHEN CALL IS COMING, THE SCREEN IS NOT DISPLAYING", "3.AND IT WAS HANGING ALSO", "Nyc ph in ths budget... Fst chrgng, nyc cam qulty, frnt cam also very gd..Nyc sound qlty ... Yes htng pblm is a issu,bt if u r nt a big gamer thn go 4 it..", "Not a very durable product. Build quality time s very cheap. The battery life if the phone is also not good. But the Moto x play instead.", "I not happy by this mobile.When I open any application it shows aplicacion not responding. When I open camera it shows camera error restart again than I restart camera it shows same think. My mobile not working properly. Please return this product. I face many problems in this mobile."], "title": ["Mobile is fine. but turbo charge is not work with me", "Not supports for jio video calls... worst features", "Worst product.", "Really amazing product. Camera is good", "Good up to some extent.", "phone is very good. camera performance and other feature are very good", "I WAS VERY WELL SATIFIED WITH THIS MOBILE WHICH YOU ...", "Nyc ph in nyc budget", "Better phones available at same price", "Mobile Not Work Properly."], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 7 September 2017", "on 5 October 2017", "on 23 July 2016", "on 1 September 2016", "on 11 June 2016", "on 3 July 2016", "on 15 March 2017", "on 9 October 2017", "on 28 March 2017", "on 7 July 2017"], "reviewer": ["Amazon Customer", "Hemant", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Prshnt", "Mangesh Raut", "Ne Arun", "Pratik Chhatani"], "review": ["Quality of rear camera is very worst now after the software updates... Rear camera quality is excellent when I buy this mobile. Release a software patch to fix this issue... Many users are posting this issue in forum and community page. Do necessary action to fix this issue.", "It's nice smartphone, but picture quality of camera not so good. I have experience that somehow the display gone. Thanks to your service center, they repaired my phone without taking any extra cost. Gallery option must be there but all the photos & video views in photo icon.", "The mobile is awesome... I have been using for the past 2 months... so far i didn't find issues...", "Camera quality, Speed everything is fine..", "Operating system , RAM usability is  still good as like MOTOROLA's previous phone LIKE MOTO E and MOTOG(1,2,3rd gen) but since this phone come along with the LENOVO spare parts, lots of issues are coming out ......", "Audio jack issue", "Heating issue and all..", "Good configuration under 15k with a brand name attached to it . Got hanged only once but working fine .Processing is fast, good camera n video quality.Gets heated up a bit while phone is on charge.Battery life good too. Overall a nice phone with good configurations under brand name.", "After one year , charger is not working.", "Is there any extended warranty for moto g4 plus 32 gb mobile.......... as i came across to see the extended warranty for the same product of 16 gb internal memory.......... but not 32 gb mobile", "Performer in this range... Few things i had to deal with. Heating, ghost touch, and no led notification else performs like a beast.. Throw any game at it and it will play smooth like a playa", "@AMAZON TEAM PLEASE TELL ME, MY MOTO G4 PLUS IS HAVING PROBLEM REGARDING DISPLAY THAT SOMETIMES IT GIVES AUTO-CLICK WITHOUT ANY TOUCH ON DISPLAY", "MANY TIMES IT HAPPENS, SO I HAVE TO SWITCH IT OFF AND AGAIN ON IT", "SO TEMPORARY THE PROBLEM GETS SOLVED", "Apart from getting heated Mobile seems to be good one, but main drawback is \" ghost touch\" . While charging if u operate the mobile seems to be acting weird. Screen icon gets operated by itself. Got replacement but same problem occurs in new mobile also", "Not worth it, buy xaiomi or one plus! Built quality is questionable, Screen flickers on charging, literally unusable while charging, phone heats frequently, camera isn't that great!"], "title": ["Rear camera quality is worst", "Overall Good Phone", "The mobile is awesome..", "RAM usability is still good as like MOTOROLA's previous phone LIKE MOTO E and ...", "Good phone", "Is there any extended warranty for moto g4 plus 32 ...", "Playa in the house!", "@AMAZON TEAM PLEASE TELL ME, MY MOTO G4 PLUS ...", "Ghost touch problem", "NOT Recommended"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 24 October 2017", "on 28 November 2016", "on 30 April 2017", "on 3 February 2017", "on 13 July 2017", "on 20 May 2017", "on 7 May 2017", "on 8 February 2017", "on 8 October 2017", "on 16 October 2017"], "reviewer": ["Amazon Customer", "ajay verma", "ranjith", "Banka", "Amazon Customer", "Amazon Customer", "Amazon Customer", "senthil", "Rajkumar Patil", "Aldrine B."], "review": ["Some times switching off and switching on. Ringer will not coming some times. hanging complaint.I expendedmoney,but not satified. 1 Year worked excellent. i formatted  after that also same problem. my contactno; 9490411552. Please friends don't purchase..", "Dont use tempered glass it will heat more. Use simple screen gurad it will work perfect... But for gamers u have to burn ur finger.. the rest is fine...", "Superior camera performance with laser auto focus. Fingerprint sensor is good. But i mm having some software issues with the speaker.", "Previous purchased Moto g4plus has 2.85 A output and today I purchased another one  but it has 1.6A......Charging slow as compared to earlier one ....What do u do", "Very Good Product and well build quality... Though the Battery Capacity could have been more if compared to other phones in thus price range. But it is certainly one the best Motorola phones now-a-days", "please do not buy it, god ghost touch and head phone jack problem in 3 days after purchase !! yeah right 3 days, no i am returning it", "I AM NOT AT ALL SATISFIED WITH THE MOTO G4 PLUS PHONE AS THE TOUCH SCREEN SENSOR IS NOT UPTO THE MARK AND IT AUTOMATICALLY KEYPAD WILL BE UNLOCKED AND WILL ALL THE APPLICATIONS WILL OPENED AUTOMATICALLY.", "NOT WORTH TO BUY THE MOBILE", "The phone is nice and it's faster. The only problem I felt was that the radiation is bit high, especially while on the call I feel a bit of pain on ear.", "Worst piece of phone. Camera gets blur. Phone atomatically shutdown every 30 second. Battery discharge in 20 mins from 100% to 15% even if phone is not used and kept on table.", "I have been using with phone for the last one year. It was really nice when I bought it. 3months later it started to hang up and turns off suddenly. Poor battery. Low quality screen, after 3months of usage the display get damaged.", "  Waste of money."], "title": ["1 Year worked excellent. i formatted after that also same problem", "Three Stars", "Superior camera performance with laser auto focus", "Attention moto", "Very Good Product and well build quality", "please do not buy it, god ghost touch and ...", "NOT SATISIFIED", "The phone is nice and it's faster", "Worst product. Please don't buy it.", "Low quality"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 28 October 2017", "on 22 December 2017", "on 1 July 2017", "on 9 December 2017", "on 28 June 2017", "on 5 August 2017", "on 16 July 2017", "on 19 July 2016", "on 2 January 2017", "on 29 July 2017"], "reviewer": ["Balakrishnan", "Amazon Customer", "V john", "Amazon Customer", "Amazon Customer", "Kalpesh", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Sumedh"], "review": ["mobile is ok but gets lots of display problem within months i got my touch replaced under waranty but it works only for months again problem continues we need lots of patient to go to  moto customer care also  and takes a entire day in cu=  office in chennai", "Display faulty piece given by Amazon. After use of 2month  mobile gets restart automatically and even after servicing display gets problem to me when operating mobile. Then again I am submitted the phone for service, then I got it with good working condition", "This is my first purchase of a Motorola mobile. I am actually impressed. It's for my mom and what drew me to it was the large screen and good design. Even the layout is nice. The features are really good with this model. All in all I'm quite satisfied.", "Very bad phone ,ghost image in every single piece ,i bought two phones for my bro n sis ,both showing ghost image after 4-5 month or may b some phones show it after 1 month ,heat up very much ,and not a worth product to buy seriously ,", "Nice phone. but it heats alot while charing and also if charged by cable other cable than provided. it behaves wierdly..", "Should have the option to post video could have shown it.. but otherwise it is the best phone in the market..", "Not good phn...camera prob and also service is too poor....I m NT recommend Motorola phone....internal hardware on single pcb... If any problem in charging side u have to replace with mother board..and it's cost around 60 to 70% of ur phn cost...", "Plz do not purchase this phone worrest mobile ever in the all mobile phones I am facing so many problems with this mobile I will give zero rating", "The first few weeks that mobile worked like a race horse. With good speed and battery the battery life faded within a couple of months requiring constant power supply when used along with 4G sim. Wouldn't recommend motorcycle products anymore as they have lost their high performance and battery life standards.", "Moto g4 plus is very cheap mobile qualities. unsatisfied for moto g4 plus rear camera. to much scratches in 4 months. rear camera is blur.", "no one buy that mob.", "Good phone, but heats up a lot. Had got the screen replaced in March, 2017 due to burn marks. But the issue has cropped again in the last few days."], "title": ["mobile is ok but gets lots of display problem within ...", "then I got it with good working condition", "It's for my mom and what drew me to it was the large screen and good design. Even the layout is nice", "DONT BUY THIS BAD PRODUCT", "Good but read review", "Waste of money", "Plz do not purchase this phone worrest mobile ever in ...", "Starts on top but finishes at the bottom", "rear camera is blur", "Great features, but with an heating issue."], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 3 August 2017", "on 14 April 2017", "on 26 March 2017", "on 5 March 2017", "on 2 March 2017", "on 3 June 2017", "on 31 March 2017", "on 27 October 2017", "on 2 September 2017", "on 28 June 2017"], "reviewer": ["Jagpal singh", "Amazon Customer", "Amazon Customer", "NAROTTAM MANIHAL", "dinesh sindal", "Amazon Customer", "Priyank", "Sushma", "Subrat Sahoo", "amit"], "review": ["Nice phone... Recommended, i gifted to my wife... Agar camera quality chahiye..just give this phone.. Fir ni biwi bolegi... Janu apka phone denaa..", "Worst phone..For the first 6 months..There is no issue..But for past 2 months phone is getting switched off often . When phone is switched on again battery is drained out.This made me to decide not to buy smartphones in Amazon anymore", "The main draw back of this mobile is no specification for arragement of ringtone . Ring tone of the phone cant be change unless one should instal an addition app for that . No gallary .No album . There some more prblms i cant identify", "After one month the cellphone misbehaving. When it is on charging mode and want to use , the icons or screen starts moving in waves and fluctuating.", "It comes in its normal situation after a long time and often doesn't switch off.", "I received this product 1march looking good picture quality good but sim problem heating when charging ,battery discharge  and network signals  on and off and lost signals  camera quality hope less  both cameras. And back to apps problem", "Worst product...  Many issues with it", "Always going for moto care centres For replacement but not at all replaced", "Front Cam problem", "Charging pin failed not working with any charger", "Display hanging", "Even charger gets heated", "Pathetic product, I am using this phone from past 4 month and last week its motherboard defected, I have used this mobile very gently but I felt there was heating issue and application hang also, specially the motorola apps for torch and camera.", "This phone is a messed up one..It randomly opens up the application..Dials the number..Switching on bluetooth..Have no idea whether this moto g4 plus has got a hardware prob..Only good thing abt the phone is turbo charging..Nothing else..Regret buying it..", "Totally dissatisfied with the service. My phone had network issue, but after receiving it from service center, the camera does not work. Now the warranty period is over and they said me to change the motherboard. But before servicing camera works properly.", "Got a issue with display. There is known hardware issue of host touch. Plz check more online reviews as the hardware itself is faulty."], "title": ["recommended", "Switching off often", "Few draw backs with this mbl", "Screen fluctuating during charging", "Wrist to work thise phone heating problem and battery discharge in 2 hrs", "Always getting issues and repairs", "4 Months and motherbord of this phone dead", "Randomly opens up the application..", "Poor Service Center", "Got a issue with display. There is known hardware ..."], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 18 November 2017", "on 30 March 2017", "on 29 November 2017", "on 14 July 2017", "on 7 March 2017", "on 7 June 2017", "on 11 November 2017", "on 9 March 2017", "on 28 January 2017", "on 23 July 2017"], "reviewer": ["Dinesh S.", "Amazon Customer", "sanjay", "Sneha", "Amazon Customer", "shyam l.", "Big B", "Amazon Customer", "Amazon Customer", "Amazon Customer"], "review": ["HOPELESS PHONE. VERY BAD SERVICE TO RECTIFY THE MANUFACTURING DEFECTS. NEITHER I WILL BUY \"MOTO\"  PRODUCTS NOR I WILL RECOMMEND TO ANY ONE.  https://www.amazon.in/dp/B01DDP7GZK/ref=cm_cr_ryp_prd_ttl_sol_0", "Build quality is cheap. Prone to scratches and dents easily.", "Phone software is not handled correctly by Motorola this time. With Android update, phone started restarting anytime. And phone battery started giving problems, had to roll back.", "The Mobile is behaving weird, anytime anything will start automatically and you won't be able to do anything except hard reboot.it might possible is the piece is not good, but not sure, mobile ran good till few months and now the issue started.", "It worked very well fir first few months but the touch screen developed problems after that. Seeing ghost touches and lags in the screen making it almost impossible to use it....", "Would recommend to buy another phone instead of moto g4 plus", "Camera has developed so many scratches and also there is a problem shadow of the previous screen... not just me almost all phones have these  problems (check on moto official forum).", "Motorola does not reapond to any of those queries there.", "Don't buy this phone. I was using this phone last one year. It heats like iron box.If you use the camera 5 minutes then it will started to heat and hang.", "Nice phone. Good built and design. Cam quality is good. Speed is ok. Battery charge stays for about 6 hours if net surfing and gaming is done. Phone heats up if charge is low, games, video. But performance overall is good.", "Not hoto date its. .. getting switch off again and agian!!", ",But one huge problem!", "That is the heating problem of you use it too frequently or for a long time or while charging it's heat up a lot, it is not a very good mobile...Heating issue is very bad", "Phone was heating to much. Phone hanging some time. When I on off airplane mode Bluetooth automatically started. Battery drian fast. Not given at least one day backup."], "title": ["VERY BAD SERVICE TO RECTIFY THE MANUFACTURING DEFECTS", "Better options available in same price", "it might possible is the piece is not good, but not sure", "Would recommend to buy another phone instead of moto g4", "Camera problem after 2 months", "It heats like iron box", "Nice phone. Good built and design", "Not hoto date its... getting switch off ...", "Heating issue at it's max", "Not good phone"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 27 August 2016", "on 6 July 2017", "on 8 December 2016", "on 4 October 2017", "on 10 July 2017", "on 18 March 2017", "on 23 March 2017", "on 27 September 2017", "on 1 August 2017", "on 30 May 2017"], "reviewer": ["Amazon Customer", "Adarsha Hebbar", "Jaga", "Harshit", "Arpitha", "Amazon Customer", "Amazon Customer", "pankaj mishra", "Amazon Customer", "MADHAVAN S"], "review": ["Don't buy this phone...", "It has", "1. Display issues like screen burn.", "2. Issues like ghost touch.", "3. Phone overheats.", "4. Battery backup is poor only lasts for around 8 to 10 hours with moderate use and data on.", "5. Rear camera glass gets scratched easily even if you use your phone carefully.", "First of all mobile is heating very much like a iron box, and poor battery backup", "Except that", "Super stunning cam with slow motion video recording, great sound, awesome display,", "No lagging, turbo charging as well.", "Overall performance is good picture quality and great battery life! gaming smooth but has lots of bugs and hardware issues truns off while using overheats. Light users can go for it but everything depends of the product u get! Grt phone with someone issue's! Got tons of issues! So better buy something else!", "The product is definitely worth buying. I have been using this phone since a year and it works really well. The only problem i had is with the screen that after 3 or 4 months, it started showing impressions of the  bright fonts and wont go for like 10 minutes.", "this phone is not good for the money.i brought phone in jan 2017 and it started hanging after 2 months and in june 2017 it is completly stopped working.i was thinking that amazon provide the good electronic items but now i lost the hope.", "This phone is not working properly.screen is hanging on notification and Amazon refused to return it.im so sad with Amazon for this bad experience.", "overall good product but after updating to nougat phone is getting hanged whenever you are trying to use it while charging or whenever it is on usb mode connected to your pc i returned the product and got new one same problem exists in new one also", "Got defective piece , one sim slot was broken hence using just one sim , since discovered the defect after a month or two the return window was closed . Local Motorola service center denied to accept the defect . Now I do not know what to do next .", "The phone is impressive for the features that are offered. The Moto G4 Plus components a unique mark sensor and a 16-megapixel camera. The phone has a 5.5-inch full-HD show with Gorilla Glass 3. The back camera gloats of PDAF and laser self-adjust.", "Actually am a Motorola lover.. but this model is worst ever.. power/lock button is very poor quality. Heating issue..it is no doing the job of 3gb ram..", "only the good thing is camera quality."], "title": ["Don't buy this one....", "Maybe worthy and may not be too 😂😂😂", "Overall performance is good picture quality is great battery is good", "Recommended buying but beware of screen.", "was thinking that amazon provide the good electronic items but now i lost the hope.", "im so sad with Amazon for this bad experience", "hanging problem", "Defective piece .  service center not cooperating items .", "Heating issues with the phone.", "but this model is worst ever."], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 27 July 2017", "on 1 July 2017", "on 13 March 2017", "on 15 May 2017", "on 2 April 2017", "on 16 June 2017", "on 11 July 2017", "on 4 July 2016", "on 9 April 2017", "on 4 November 2017"], "reviewer": ["Divyanka", "Amazon Customer", "Amazon Customer", "aman gupta", "Amazon Customer", "Amazon Customer", "Saheli", "Ashish_R", "Amazon Customer", "Gaurav Mishra"], "review": ["Phone has started giving brightness issues after using it for 6 months. Heating issue is also there.", "Battery problem started within one month. Now the phone starts working by itself when connected to a charger. Battery life is becomes zero within 2hrs", "The phone keeps behaving weirdly whenever I put it on charge. Also, I don't think it's been 1 year. I will need a replacement if possible.", "Thanks", "Pros:", "Camera is really nice.", "Stock Android Experience.", "Nice Fingerprint sensor.", "Cons:", "Performance is not up to the Mark.", "Out of 16 Gb only about 9 Gb available for the user.", "Heating issue upon extensive use of camera.", "Phone is too slow to respond,not worth the money moto is charging for this phone... The only thing which is good is the speaker quality... Buy only if you are a moto fan  else buy xiaomi or apple which are miles ahead in user interface and experience..", "Recently i booked M", "oto G Plus, 4th Gen (Black, 32 GB)  not working properly hanging problem, auto dialing and so many problem in our phone. what should i do please suggest me and solve our problem.", "TOTALLY DISGUSTING", "OVERHEATING", "NO RESPONSE TO TOUCH", "CAMERA PROBLEMS", "I WANT MY MONEY BACK", "Good Phone, but heating issue on camera or on video recording or on playing game is worst part!", "Camera is not up to that satisfactory level if you are talking about 16MP camera (my nexus 5 8MP camera was better than that).", "Finger print sensor is good but doesn't work sometimes.", "Please don't buy this phone at all.", "Heating problem is always there and also battery drains very fast. Often charging required for the phone which is really annoying.", "Only 1 advantage of less weight.", "I have to charge it 3 times a day on normal use. On keeping data off it gives backup of maximum 8 hours , Turbo Charging has stopped working automatically after 2 months and it takes whole night to keep it fully charged"], "title": ["Waste phone.", "Too bad", "Replacement", "A very Average Phone.", "Not worth the money...", "Recently i booked Moto G Plus, 4th Gen (Black ...", "TOTALLY DISGUSTING OVERHEATING NO RESPONSE TO TOUCH CAMERA PROBLEMS I WANT ...", "Good Phone but Cons on some serious issue (Heat, camera) overlap good features.", "Often charging required for the phone which is really annoying. Only 1 advantage of less weight", "Worst battery backup a phone can have"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 9 April 2017", "on 29 January 2017", "on 6 May 2017", "on 25 March 2017", "on 29 June 2017", "on 15 December 2017", "on 7 July 2017", "on 7 August 2017", "on 19 March 2017", "on 7 March 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "ak", "Amazon Customer", "Anshul Gupta", "tanmay g.", "Suresh v", "Amazon Customer", "Amazon Customer", "Amazon Customer"], "review": ["Dont buy this product.My display is damaged in one month.even customer care is giving reasonof physical damage.Ask me to pay RS 6500.In warranty documents they say The display and embedded lens are warranted for 4 years.useless phone...Don't purchase ....", "Mobile totalii hang ho rha hai.or over heating ho rha hai.mene uske review ache sune the but yh Sach nhi hai.. autometic on off ho rha hai.dispay change ho rha hai.", "Device ia not working properly ..but Amazon app is saying device is fine..how to return it...please advice ans giude me how to return the Phone", "I like the phone. Its working satisfactorily. Though there are many phones which are offering similar or better configuration, I choose this brand because of the brand reputation. Moto enjoys a better branch appeal as compared to other phones.", "First 3 months  - great and then - you get experience of Chinese product quality left right center - heating, hanging, frequent need to restart, touchscreen going wild etc.", "Not for this phone in particular but brand Moto in general.", "Some heating issues if you use it naked without cover but performance is otherwise good and camera one of the best in this price bracket and artificial lighting performance and is good", "Quality is very good.", "But turbo charge is not work.", "Charging period mobile is overa heated.", "When charge is above 90% heat wil be reduce.", "It's a main defect is heating.", "Please reduce the heating issue for this mobile brand.", "Best product. I hv also purchase after so many research. U can go for it without any doubt. Worth of money.", "I have purchased this phone few months back after getting top reviews about it. But facing the Flickering screen problem. Even after doing the factory reset , the same problem persisting.Avoid this phone.This phone does not support multiple applications.", "I bought a MOTO G4 PLUS mobile from this seller and after 8 month of purchasing this mobile now the turbo charger is not working and i am unable charge my phone.. So my suggestion don't buy any product from this seller and don't buy anything from Amazon."], "title": ["Dont Buy", "One Star", "Not worth?ghost touch issue is very serious", "I like the phone", "Chinese quality experience", "Nice", "Performance is very good.", "Best product. I hv also purchase after so many ...", "Flickering Screen problem", "I bought a MOTO G4 PLUS mobile from this seller ..."], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 30 May 2017", "on 21 June 2017", "on 20 May 2017", "on 9 July 2017", "on 18 June 2017", "on 14 December 2017", "on 15 December 2017", "on 4 May 2017", "on 4 July 2017", "on 6 March 2017"], "reviewer": ["Amazon Customer", "akash tyagi", "Amazon Customer", "Yugal Singam", "Ponnmani", "Nikhil", "Abhishek Tripathi", "Manoj", "Amazon Customer", "Amazon Customer"], "review": ["Battery lasts barely for 5 -7 hrs on moderate use.", "Initially ghost touch issues while charging the phone, now the problem is while normally using the phone also and has aggravated so much that it has become difficult to use the phone.", "I ordered this product, It is having an issue within three months even I contacted different service centre of Motorola and Lenovo but they are making fool. Amazon is sailing very poor quality product. I am not satisfied with this product.", "Very worst phone in my life - This mobile is better than heating compare with my Iron box. Too much heating, Hanging, No restart option(only switch off mode), Sound clarity poor etc. Friends don't buy this mobile forever pls....", "God phone but heats up a lot. Camera is nice and the user interface is almost stock Android which gives a good experience. But I would go for Redmi note 3/4 over Motorola.", "Poor product. Better buy a China phone from Ritchie street. Screen got image burnt problem on 2nd month. Poor battery back up. Moto 2nd gen works far better than this product. Poor service centre assistance.", "I bought this phone on May-14 and it only has been 7 months and the screen is having problems, it is malfunctioning and it is very hard to use the device. now i have to run around the service center to get it fixed. very disappointed on this product.", "Worst phone of the era. Always hangs .Gets switch off during work. Battery also very poor not even lasts for half day when fully charged. Screen sensitivity issues. Battery drains like anything after one year. I think moto should stop making Mobiles.", "Worth the price, battery life one day, speed is also OK. There is problem of ghost touch while charging, so you can't use the phone while it is charging. I did exchange the phone but replacement also had same problem.", "In this price range worst mobile ever I don't like it hanging ,heating poor battery backup ...etc", "Very much satisfied in its performance.thanks moto g4+"], "title": ["Go for a phone having larger battery", "Amazon is sailing very poor quality product", "Worst phone from Motorolo-Lenova", "Decent phone", "DO NOT BUY", "Screen issues", "Worst phone of the era", "Worth the price, battery life one day, speed ...", "Don't buy moto g 4 plus", "Four Stars"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 11 February 2017", "on 20 April 2017", "on 7 March 2017", "on 18 March 2017", "on 5 October 2016", "on 23 May 2017", "on 7 October 2017", "on 16 December 2016", "on 4 September 2017", "on 18 September 2017"], "reviewer": ["Vishal Mohan", "Amazon Customer", "Kuldip Narayan", "Amazon Customer", "C Pahari", "Amazon Customer", "P", "janak", "Ritesh Kumar", "Amazon Customer"], "review": ["I Like it, But Some time create problem as...", "when we did connect to the charger.", "we use it when connect to the charger.", "Then some time a tectonic Occurance.", "sometimes is occur.............", "It's an ok mobile it's gets​really hot at the time of charging and if the call last long then also. Can't play game even if you play for ten minutes it gets hot. Mobiles touch has also gone  bad. Overall not happy with the mobile.", "I ordered G4 from Amazon. But product has felt faulty from beginning. Just after 1 month of use, it seems impossible to use the mobile.", "The top notification drawer comes out automatically and then it's not possible to type or use links.", "I have received Samsung ear phone instead of Moto g Why?", "Yes I agree it has slight heating issues. I normally turn off the wi-fi and then put it for charging.  Remaining the phone is working fine.", "Phone is awesome in terms of performance. But becomes heater and freezes when playing games for long time and camera usage gor about 10 min. However camera quality is one of the best in the category.", "Initially the product was having battery drain out problem.  This was got attended from authorised service centre.  Now working okay.", "this is very worst phone of motorola which i get many issue not resoled till i visited its service center it has manufacturing faulty product.", "I have bought this phone and still regretting. Too much of heating issue. While recording video or calling it start heating. Amazon has provided a defective and worst product .", "I will suggest not to buy any electronic item from Amazon.", "Nice phone using this from past 11 months but after almost 5 months the USB cable stopped working, and ghost touch while charging the phone but the camera, performance everything is good. I am happy with it apart from the ghost touch issue."], "title": ["I Like it, But Some time create problem as", "Mobiles touch has also gone bad. Overall not happy with the mobile", "Faulty screen", "One Star", "Working fine except the heating issue.", "Heats and freezes", "Initially the product was having battery drain out problem. ...", "screen is vibrating continuosly key pad automatically working touch is not good as compare to other phone", "Worst experience with Amazon", "Nice phone but while charging ghost touch problems"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 4 April 2017", "on 1 August 2017", "on 5 December 2016", "on 4 September 2017", "on 29 November 2017", "on 22 May 2017", "on 20 October 2016", "on 26 June 2017", "on 22 July 2017", "on 7 April 2017"], "reviewer": ["Rudrakshi", "Amazon Customer", "Braj", "Rakesh", "Amazon Customer", "Amazon Customer", "Nabhajit Pal", "Shahpoor Irani", "arabinda sahoo", "udaya chander subramaniam"], "review": ["Pls do not buy this phone.This phone started showing problems within six months of purchase.The battery would heat up ,the screen sensor would work on its own n you can't control it unless n untill you switch it off .Truly a waste of money!", "Never Buy Motorola products. They wont work. Display problems since beginning. No meaning for Warranty given. No service. Authorised service list is provided - but they charge for service. Amazon is helpless if any defective supply is made.", "Worst Product.defective in just 7 months..not a proper response fron service centre..", "pathetic", "Worst in terms of battery .... Performance is good ..We bought 4 phone within 14 month all have same problem...Try another phone in this price otherwise u will b frusted soon ..!!!", "9 months gone after purchasing this phone and I went to service around 6 times. Some and other issues are coming still.", "Issues:", "1) On of a sudden the phone got switched off while playing a song and doing something else.", "2) Shadow issue.", "Plz don't buy this cellphone it's very bad. Total wastage of money .I bought it 4  months back now it is not working. It is malfunctioning .", "Got a faulty product. IMEI number not match with the bill and also not enlisted with service centre. Seriously horrible.", "The second sim stopped working and Motorola said wasn't covered in the warranty.", "Last 10 months i got twice problem in sell phone .", "1.when I purchased mobile phone it was touch issue.", "2 after 3 months got problem in battery.", "3 now it has problem with automatically got switched off and hang problem also .", "very poor quality and also worst product by ,Motorola , Please don't buy this product. 3 people in our office got this product 4 months back all three facing display flicking issue, no service and no response for the mail sent to Motorola."], "title": ["Truly a waste of money", "Never Buy Motorola products. They wont work. Display ...", "Worst Product. defective in just 2", "Worst in terms of battery", "9 months gone after purchasing this phone and I went ...", "👎🏿bad product", "Seriously horrible.", "Bad quality.", "Last 10 months i got twice problem in sell phone ...", "very poor quality and also worst product by"], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]},
{"date": ["on 28 December 2017", "on 29 December 2017", "on 24 August 2017", "on 21 July 2017", "on 6 May 2017", "on 4 July 2017", "on 10 March 2017", "on 25 May 2017", "on 16 August 2017", "on 26 May 2017", "on 20 June 2017", "on 9 April 2017"], "reviewer": ["vipul choudhary", "Puneet Gandhi", "Amazon Customer", "Amazon Customer", "manas das sharma", "Amazon Customer", "Rohit B.", "Amazon Customer", "Amazon Customer", "GILBERT JOSEPH"], "review": ["Lenovo is degrading Motorola big time. Poor service no interest in customer busy making money. I recommend not to buy any Motorola or Lenovo product.", "It is prone to overheating. As soon as you run youtube or video or shoot videos, it simply shuts down to prevent damage.", "This review is after a year of usage !!", "Buy at your own risk !!", "Heats up a little, other than That  works well..", "Nice to know that the design has changed from the old Moto series. .", "And The camera is good...", "Writing this review after a yaer of usage this phone is the worst phone ever the battery life becomes so bad that within 07hrs your entire battery drains", "I've got the product on time, it's  nice & definitely new, g4 plus's sound quality is really good there's no doubt about it, camera quality is OK not bad, as I was a Samsung user ( j7 2015), performance is good. Thank Amazon for timly delivery.", "SVC after sale is very bad. My motog 4 plus  not detecting the sim. As per SVC center there is problem in mother bord.  They are asking to pay 8000/- Rupees how ever phone is under warranty. Kindly do not purchase moto mobile. They are cheater.", "Decent mobile camera is good battery backup is neat it's display has ghost screening issue maybe manufacturing defect there have been few problems after switching OS Marshmallow6.0 to Nougat7.0 overall phone is good I'm using since 10months thus I'm giving it 4 stars", "The product z very nice..after sales service z too pretty awesome... value for money...camera clarity z superb with apps... just expecting a glass body in near future in this price range... earphone z very disappointing... otherwise 5 star for the product", "After 7 months of the purchase, the phone's rear camera pic quality got ruined. And many of the sets are facing the same problem. Even if it is in warranty, the customer care is not ready to fix the problem. They charge ₹1800 for this ish! Worthless deal.", "The phone so excellent in navigation and performance, but this phone heats up a lot and due to this very reason it is very inconvenient and uncomfortable to use. I would suggest to spend some extra bucks and buy better phone which does not heat very often"], "title": ["Poor service no interest in customer busy making money", "Does not Suit Motorola to Continue this Phone !!", "Worth the price", "... after a yaer of usage this phone is the worst phone ever the battery life becomes so bad that ...", "good product", "moto g 4 plus very very bad mobile.", "Decent phone", "The Specialist", "You will be lucky if this phone works properly for a year!", "Phone heats up a lot."], "rating": ["3.4 out of 5 stars", "|", "|", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "1.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "4.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "2.0 out of 5 stars", "|", "|", "|", "3.3 out of 5 stars", "3.3 out of 5 stars", "3.1 out of 5 stars", "3.1 out of 5 stars", "3.3 out of 5 stars"]}
]