[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["good product", "I brought this zeb-g31 mother board from lamington road on ...", "Humara Bajaj... Go for it...", "Good product at reasonable price.", "One Star", "The design of iron is bad. In the middle of ironing", "Good for this price", "Nice Iron Box with Good Service from the  Service Center", "so didnt got time to return this item in recommended time frame", "So far good!"], "review": ["A very good product in reasonable price..  \nSatisfied☺..!!\n\n", "I brought this zeb-g31 mother board from lamington road on saturday 21-10-2017\nfor 1750 rs and after instaling it found out that the bios screen does not\nappear and there is no display on the monitor only the cpu fan comes on when\nthe power is pressed the is no problem with the 1.8 ghz core2duo processor and\nram ive installed since both are working in my old intel g31 motherboard.will\ngo to the dealer and service centre today to see if anything can be done ?\n\n", "This is the best product in this range I bought this in 2014 and again in 2017\nboth are working fine .  \n  \nThe only drawback could be cheap plastic body for the price it's worth every\npenny.  \n  \nHaving said that in electronics it's all about your luck if the product\ndoesn't fit your expectation you are welcome to reject but this product\nencouraged me to buy more Bajaj products which I did from oven microwave to\nother stuff.\n\n", "I had a heavy weight iron Box and did not believe in light weight iron Box.\nBut due to my age factor it was difficult for me to use it and so went for\nthis light weight Bajaj iron Box with much suspicion. But to my relief, it was\nworking great and easy to use. I will definitely recommend to others to buy\nthis. Simple, lightweight and efficient. I believed in Bajaj brand and it kept\nits word. As usual Amazon delivered the product in good packing and right time\nas said. Good product at reasonable price.\n\n", "Very Bad product...\n\n", "The design of iron is bad. In the middle of ironing, if you want to put it\nidle standing on surface vertically, the swivel cord comes in between surface\nand it is irritating. Often the iron falls as well.  \n  \nMy iron stopped working in just 50 days.\n\n", "The iron is pretty good considered to its price. Overall satisfactory. Serves\nthe purpose well. But the heating pallet was slightly defective at one corner.\nBut that won't bother much.  \nAmazon's packaging was very bad. It might damage the product. Next time try to\nimprove your packaging.\n\n", "Had an Issue after using the Iron Box for 6 Months It Stopped heating .Gave\nthe Complaint to Bajaj Customer Care .They Came on the Same  \nDay and Serviced the iron Box and it is working Fine Now.It comes with 2 Year\nWarranty.I am Totally Satisfied with the product.\n\n", "I placed order for dry iron and got steam iron instead. Steam iron is leaking\nand not at all usable. I went out of station after purchasing it, so didnt got\ntime to return this item in recommended time frame. Would not recommend any\none to go for this iron.\n\n", "Delivery: Before tentative time  \nPacking: was well packed with air pouches to avoid any damage  \nPerformance: Satisfactory  \n  \nPros:- 1. Plastic Body  \n2\\. Automatic switch off on heating  \n3\\. Convenient regulator  \n4\\. Light weight  \n5\\. Good look  \n  \nCons: 1. The edge is open and not covered with plastic or a covering and can\nhurt if not taken care  \n2\\. Heating can get high very early so proper caution needs to be taken  \n3\\. Takes a lot of time to cool down  \n  \nIdeally I would give it 3.5 stars. I bought it in ₹601 so it was quite\naffordable. I hope my review helps you. Happy Shopping  \nHit helpful if found this review enriching..!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 October 2016", "on 23 October 2017", "on 24 November 2017", "on 2 September 2017", "on 21 May 2017", "on 25 March 2018", "on 14 March 2018", "on 12 February 2018", "on 11 February 2018", "on 1 April 2017"], "reviewer": ["Amazon Customer", "allwyn", "Neeraj", "M.L.Narayanan", "Amazon Customer", "Amazon Customer", "Jb", "Amazon Customer", "shweta c", "ykp"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Dont Compromised with Quality", "Nice dry iron at this price point.", "Satisfied with the product for the decent price.", "Horrible quality... burnt two tops already", "Total Value For Money, Works Great", "Very good Iron Box from Bajaj", "Awesome Product at this range", "The heating is quick.", "Best Buy!", "Super product"], "review": ["When I was thinking to buy the iron for my daily usage it important to dont\ncompromised with quality I searched a lots and found the few product which are\nmeeting the my exceptions,  \n  \nI had selected the top of them which is BAJAJ DX71000 i have been using this\nproduct on daily since 31st Dec-17 and now i written the review so that i can\nshare my personal usage experience with you all,  \n  \nI found the below are few top key points which supports this product to buy as\nadvantages,  \n  \n= Non-stick coated golden colour sole plate, i have used on top power as well\nbut it not sticked with any kind of Clothes,  \n= Super clean finish with pleasant aesthetics,  \n= Cool touch body with comfortable hand grip you can use this from single hand\nyou will not need 2 hands to use it  \n= Light weight and 360 degree swivel cord as you are getting the product which\nis very reliable and light weight its very good option,  \n= Thermal fuse for safety  \n  \nFinally for Disadvantages i didnt find anything till yet & i will update in\nthis review if i find anything in future till the time its my recommdated Iron\nto buy without thinking anymore\n\n", "The iron is very good at this price point, I got it at Rs. 628.The iron heats\nvery quickly and the Teflon coating is of very good quality. Also Amazon\ndelivery was very fast, giving this iron 4 star because I still don't know the\nfunction of the green indicator, only the red one glows.\n\n", "> quick one day delivery  \n> Got original product as checked completely no scratches nothing with good\npacking.  \n> Got all the documents as in warranty card of 2years, manual and bill.  \n> looks good on white gloss touch, good length of cord and has all the\nfeatures as it states in product description.  \n> It instantly heats in less than a minute which is pretty much quick, and\ncools easily soon after you finish using which is safe.  \n> It is very light weight and comfy to use, got adjustable temperature levels\nfor different clothes and doesn't stick as it has non stick coated sole plate.  \n> It has 1000w and 230v ~50Hz and good ironing for long hours  \n> it has automatic off as soon as it reaches the desired level of heat, and\nturns again for further use.  \n  \nBest for price best quality and overall a very good product, I recommend to go\nfor it..👍\n\n", "Horrible Quality, it just gets overheated.. already burnt two of my favourite\ntops. I would recommend to buy brands like philips or morphy richards rather\nthan going for such a sub-standard product.\n\n", "First of all Amazon packing & 3 days delivery after ordering it was good.  \n  \nI got this product on a deal prize of 499rs, buyed it after reading some\nreviews & went for the trusted indian brand bajaj & I'm quite happy buying it.  \n  \nHere are some pros & cons I found out.  \n  \nPros:-  \n1.Light in weight.  \n2.It has nice design.  \n3.Different temperature controls with indicators.  \n4.Gold plated.  \n5.Heating is quick.  \n  \nCons:-  \n1.After the use settling time is too high.  \n2.It takes more time to reduce heat even after switched off.  \n3.You have to put a lil pressure on the iron box while ironing it cause the\niron is light weight.  \n  \nFor the prize i payed this product is total value for money & I'm satisfied.\n\n", "I was purchased it from the Amazon.in. It got it at very reasonable cost as I\nhave grabbed it at the time of deals. It was delivered even before estimated\ndelivery date.  \n  \nThe product looked very good interns of design and it is very light weight.  \n  \nIt will get heated within very less time. The temperature of the iron can be\nadjusted as per according to type of clothes. It has very good performance. it\nis flexibility to use. it has cool touch body with comfort handling. It is\nvery easy to use it also consumes very less amount of current. it was very\nmuch worth able for the price. I liked it very much which made my clothes look\nbeautiful. As I was using this iron box since 1 year I never felt upset for\nusing this. very good product from the BAJAJ. I liked to recommend this\nproduct for anyone looking to purchase good iron box at reasonable price.\n\n", "This dry iron comes with a non-stick coating which facilitates its easy\ngliding on all kinds of fabric. This non-stick coating ensures that the fabric\ndoesn’t stick and get torn due to excessive heat.  \nThe double indicator system in this Bajaj DX7 dry iron has been smartly\ndesigned to ensure additional safety and convenience. The red light gleams\nwhen the sole plate is heated and when the desired temperature is reached,\ngreen light glows.\n\n", "Excellent.  \nThough Iron is light in weight, ironing is satisfactory.  \nThe heating is quick.  \nQuick delivery.satisfied.\n\n", "This is my second iron from Bajaj. Was quite happy with the Bajaj iron product\nwhich I used earlier. It was working for around 5 years without any issues,\nfrom last week it didn't get heated. So thought of buying an iron box and\nsearched for the same product in Amazon and found it. Without any second\nthought, I just ordered the product under lightning deal. Very happy that I\nsaved few pennies.\n\n", "Super and my delievery was very quick overall the product was so good\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 January 2018", "on 3 January 2018", "on 16 September 2017", "on 11 May 2015", "on 26 September 2017", "on 23 October 2017", "on 12 January 2018", "on 26 August 2015", "on 6 October 2017", "on 27 June 2017"], "reviewer": ["Kailash Bangar", "Jaikishan Sahu", "EMINEM", "Ankita Agrawal", "Keerthi Kanth", "Mandik Goyal", "Harshit", "rdgreat", "Nandhakumar S", "Murali"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Good product", "Bajaj DX 7 1000-Watt Dry Iron", "Five Stars", "Go for it..", "Four Stars", "Nice Product", "Extremly bad packing", "Three Stars", "Nice Iron", "I love hemlata"], "review": ["It's a good product at this price. It's heat up so quickly. Only con is the\npackaging. It's look like broken box inside.\n\n", "Looking to buy an affordable and modern looking iron with all the basic\nfeatures you need to get the job done? Look no further than the Bajaj DX7 Dry\nIron is a very economical option with a trendy look and neat features. Bajaj\nhas been a trusted and reputed brand for electronics for years and years and\ngives a two year warranty for this product. Grab this great iron at a super\nlow price.  \n  \nNon-Stick Coated Sole Plate  \n  \nThe Bajaj DX7 Dry Iron has a non-stick coated soleplate which ensures that\nyour clothes do not stick to it even if there is any overheating in the iron.\nIt also allows the iron to glide smoothly along the fabric and makes your job\na lot less stressful.  \n  \nThermal Fuse  \n  \nThis iron has a thermal fuse which controls the amount of heat being supplied\nto the plate and shuts of the electric circuit in case of too much heat. This\nprevents damage to the iron and assures your safety while using the iron.  \n  \n360 Degree Swivel Cord  \n  \nThis iron with 360 degree swivel cord is very easy to use as it allows you to\nmove the iron in all directions and get at all those tough spots on your\ngarment. This handy feature makes the work a lot lighter on your wrists and\nhand for longer periods of ironing. It also makes it easier to store the iron\naway in standing position so it takes up less space.  \n  \nLightweight  \n  \nThis lightweight iron is easy to handle and comfortable to use. The Bajaj DX7\nDry Iron weighs a mere 789 gms and is perfect to carry along with you on\nholiday so you can neatly press clothes wherever you go!  \n  \nOther Paramount Features  \n  \nThe Bajaj DX7 Dry Iron has a unique cool touch body which insulates the iron\nwithin the chamber so it does not get too hot to hold. The ergonomically\ndesigned handle makes sure you have a comfortable and effortless ironing\nsession every time.\n\n", "\n\n", "One of the best in this price segments.  \nVery good delivery by Amazon.\n\n", "\n\n", "\n\n", "On dt 19th oct received item , Extremely bad packing and the red light not\natall getting off.\n\n", "\n\n", "Quality is great , perfect size and light waight.  \nCable quality is also premium.\n\n", "Good product this price i use this product very nice\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 October 2017", "on 28 October 2016", "on 15 January 2018", "on 23 November 2017", "on 13 January 2018", "on 11 January 2018", "on 19 October 2017", "on 20 December 2017", "on 23 October 2017", "on 8 November 2017"], "reviewer": ["Dilip bala", "Kamal", "SANJAY SHARMA", "Vikas verma", "Ruhail ahmad", "VIKASH KUMAR", "Gayatri", "pankaj", "Suman Mukherjee", "Mk"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Five Stars", "Four Stars", "Four Stars", "Exellent product", "Four Stars", "Wonderful iron to use.....", "Four Stars", "nice", "Five star", "Four Stars"], "review": ["Nice\n\n", "\n\n", "Nice product and usefull iron and result is best\n\n", "\n\n", "Good\n\n", "Remarkable purchase....👍👌 Loved it.\n\n", "Good\n\n", "very fine\n\n", "Very very good product thank you amazon\n\n", "\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 September 2017", "on 25 September 2017", "on 12 August 2017", "on 14 September 2017", "on 11 September 2017", "on 27 August 2017", "on 1 September 2017", "on 15 August 2017", "on 23 July 2017", "on 14 August 2017"], "reviewer": ["Amazon Customer", "im_darya", "Huzaifa Musani", "Amazon Customer", "Tarun bhowmik", "Puja Mondal", "Abhishek Patel", "neeraj Kumar singh", "Rameshwar pethkar", "Rajakaleeswaran"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Four Stars", "Nice product and in working condition", "Good working", "Four Stars", "Highly disappointed", "sir the Iron is stopped working which i had purchased ...", "I received the Iron, but there is Crack at ...", "Very very good timing to deliver.", "nice"], "review": ["Very good quality product with affordable price...  \nThanks to Amazon Group.\n\n", "Nice\n\n", "Nice product and in working condition. MRP was 949 and got for 650.\nManuacturing date was Aug 16.\n\n", "Nice product. I can use it. It is very smooth working & it will hit just few\nsecond. Over all this good product at this price\n\n", "\n\n", "Product has stopped working  \nAfter 4 months of purchase  \nDon't buy.. Such a waste of money  \nInstead go for morphy Richards\n\n", "sir the Iron is stopped working which i had purchased just 4 months back,\nkindly manage to replace the same . still the guarantee / warranty period is\nvalid is valid for another 20 months.  \n  \nORDER PLACED  \n25 August 2017  \nTOTAL  \n649.00  \nSHIP TO  \nSANGEETA SETHIA  \nORDER # 404-4130266-3103520  \nOrder Details Invoice  \nDelivered 29-Aug-2017  \nPackage was handed directly to customer  \n  \nBajaj DX 7 1000-Watt Dry Iron  \nSold by: Cloudtail India Private Limited  \nReturn window closed on 09-Sep-2017  \n649.00\n\n", "I received the Iron, but there is Crack at one Side. However its working, and\nhope it continues to work  \nBajaj DX 7 1000-Watt Dry Iron\n\n", "Awesome delivery time i receive my shipment within 5 days from Gurugram to\nSitamarhi.  \nBut the bolt by which iron is fitted has no any seal.\n\n", "Good\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 September 2017", "on 27 March 2017", "on 8 January 2017", "on 4 May 2017", "on 24 January 2017", "on 30 May 2017", "on 8 January 2018", "on 30 August 2016", "on 28 February 2017", "on 12 November 2016"], "reviewer": ["Upendra Singh", "Keshav", "Amazon Customer", "Sk Alauddin Mondal", "Amazon Customer", "Shubham jain", "punith sethia", "Wishwell Joshi", "M.K.S.", "Dilip choudhary"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Gud one..", "Working good.. Super hand grip", "Five Stars", "I like this", "best in this price", "There should be some negative rating option. Scratches on ...", "Five Stars", "Seems like a old stock or used product", "Easy to press"], "review": ["Good\n\n", "Happy with this experience..☺️\n\n", "Working good..Super hand grip...heating quickly..\n\n", "Thank you to the Amazon team for this very good product.\n\n", "It looks so nice and works as good as it looks.\n\n", "Nice product ...  \n  \nSuperb ... Every day i use it .... Great product .... Amazon always provide me\nbest product ..no issues yet ... Delivery is fast ... Thanx amazon\n\n", "There should be some negative rating option.  \nScratches on first usage itself. Scratches formed by\" plastic button \" in my\nshirt.!!!!\n\n", "Nice iron , amazing product\n\n", "Doesn't look like a fresh new product\n\n", "Nice products and light weight\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 October 2017", "on 6 October 2017", "on 29 September 2017", "on 30 August 2017", "on 29 August 2017", "on 16 December 2017", "on 9 July 2017", "on 13 September 2017", "on 4 September 2017", "on 9 September 2017"], "reviewer": ["Maya Diwathe", "Ankit Rai", "Amazon Customer", "Manoj Vedi", "Kante.hari K.", "Ankit Raj", "MOHAMMED RAFEEQU K C", "Hardik jain", "Anis kothia", "Madhusudan Dhakad"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Must buy no issues", "King of Budget Iron", "Best product by Bajaj", "One Star", "Very nice", "Five Stars", "One day use Looking good Material little bit", "Four Stars", "One Star", "- It has nice design. - Light in weight"], "review": ["Best iron box well finished stylish and best Bajaj company  \nGood performance\n\n", "Awesome design,low price,good seller ,2 years warranty by brand Bajaj  \nThis all makes the product good  \nVery fast heating  \nThe Review is given by (techm360.blogspot)\n\n", "Nice looking and nice working\n\n", "Received product is broken. Will change the rating after replaced and use.\n\n", "Comfertable & light weight in best price ...  \nValue of money\n\n", "Nice product\n\n", "One day use  \nLooking good  \nMaterial little bit bad\n\n", "good product.. review after 2 mth use\n\n", "Broken\n\n", "\\- It has nice design.  \n\\- Light in weight.  \n\\- simple to indication, whetere its power on/off and iron heating on/off.  \n\\- 1000W power consumption\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 October 2017", "on 10 March 2018", "on 15 November 2017", "on 13 October 2017", "on 15 October 2017", "on 21 November 2017", "on 7 October 2017", "on 13 October 2017", "on 2 November 2017", "on 18 July 2017"], "reviewer": ["Acchu", "Pradip Kumar Mandal", "shivam", "Amazon Customer", "Asfak Ahmad", "Prakash", "DILLEN KUMAR", "Rahul", "Amazon Customer", "nit v k"]},
{"rating": ["3.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Ok", "Three Stars", "Worst product", "Worth each and every penny.", "Four Stars", "DONT BUY THIS IRON BOX", "Good for daily use", "One Star", "Looks great! !", "Four Stars"], "review": ["ok\n\n", "\n\n", "Plz dnt buy this. Autocut is not happening. Green light is not working. Its a\ndefect in dx 7 model. Amazon , please stop selling these type of items  \nDnt buy dx 7 model\n\n", "Hi, I am Sayantani going to review this iron after more than 1 year of using.\nBasically me and my boyfriend have chosen this to gift to my mom as a birthday\ngift. We bought it on offer. Honestly in this price compared to other brands\nthis is better. Coming to the product description I would like to mention two\nbest points about the product.  \n  \n1\\. It has two indicator light one is red and one is green. The use of the\nlights are as follows:  \n  \nRed : This light is for understanding that if the iron is completely hot. Once\nthe heating will complete the green light will indicate that the iron box is\nready for use.  \n  \nGreen light: To understand that if the iron box is completely hot and ready\nfor use.  \n  \n2\\. Warranty: 2years  \n  \n3\\. You can set mode to iron different type of clothes. There is a wheel for\nchanging the mode for different product. You can opt for Linen, cotton etc are\nthe modes.  \n  \n4\\. The product is made of plastic and the ironing plate is made of non-stick\ncoated golden colour sole plate.  \n  \n5\\. Power required : Power: 1000 watts and Operating voltage: 230 volts\n\n", "Good Product with such Price\n\n", "Useless product. It didn't even work for four months. Please don't buy this\niron Box. It is of very low quality. It has cheap parts.\n\n", "Very good in this price range worth it\n\n", "Damaged piece\n\n", "Looks good.\n\n", "Thanks amazon  \nI like it\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 August 2017", "on 5 August 2017", "on 20 October 2017", "on 17 July 2017", "on 17 May 2017", "on 16 February 2017", "on 27 April 2017", "on 22 May 2017", "on 4 May 2017", "on 16 October 2017"], "reviewer": ["Supreme hero", "Amazon Customer", "Amazon Customer", "Sayantani", "Manas", "Amer Khan", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Best deal good quality iron box", "un happy and disappointed", "Worst quality", "Invoice", "Rating *", "Four Stars", "Five Stars", "Dameged product", "Five Stars", "Four Stars"], "review": ["Good quality iron box delivered so fast and cord length is so long very\nusable.light weight, good heating range so fast to hot good product i'm very\nsatisfied\n\n", "Received as damage product , un happy and disappointed.\n\n", "The quality is one of of the worst I would say. Since there is no option to\ngive zero rating so I an giving this rating.The neutral wire broke and got\nstuck in the switch board.\n\n", "This is the invoice I have received\n\n", "speed post Delivery is bad quality\n\n", "This is very good product\n\n", "Product is very good....\n\n", "This is the third time m receiving damaged product this is ridiculous the back\ncover of the iron box is damaged I am very disappointed with this purchase now\nit's time to sue...\n\n", "Very good product 👍🏻👌🏻\n\n", "\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 November 2017", "on 28 January 2018", "on 3 October 2017", "on 25 January 2018", "on 27 January 2018", "on 31 January 2018", "on 4 February 2018", "on 2 October 2017", "on 24 January 2018", "on 24 January 2018"], "reviewer": ["Amazon Customer", "Priyadarshini sv", "Amazon Customer", "Jai Singh", "ZAID KASIM ", "jaipal saini", "Saurabh Maurya", "saddam h.", "maulik patel", "Amazon Customer"]},
{"rating": ["3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["need some improvements", "Warranty issues..", "Awesome deal", "Bad quality broken iron box and packing is worst i want replacement qnd good condition", "Bad packing", "See Unboxing On YouTube", "Two Stars", "Short wire", "Nice", "Wire burned inside within 10months"], "review": ["performance is good but i'm facing some uncomfortable heat while holding\naround my thumb( i have circled in the image below). And after few hours of\nusing you may hear a sound, that made me to get little afraid and conclude\nthat iron box is getting damaged.\n\n", "I received product, manufacturing date is 7/2017, what should be warranty ????  \n  \nProduct packing was not as good as expected.  \nSomehow it looks like old packet or may be used one..\n\n", "Excellent product I like it best price for amazon.\n\n", "Broken iron box hand hold side.. worst packing.. dnt fake the people want\nreplacment or want refund my amount 650\n\n", "Good product received without any fault, but packing was not good.\n\n", "Awesome.. Want to see the unboxing of this product just search on YouTube\nOnline Shopping Guide Bajaj iron unboxing\n\n", "Scratch on sole plate\n\n", "Great working but wire is too short .It needs extension box.\n\n", "Very good quality and also lightweight. Easy to use\n\n", "I bought this product from amazon 10 months ago,I use it once in a week,it was\na good product.Last week while using it smoke comes inside the ironbox and now\nnot working.But it have a warranty of 2years.Now how can I replace or claim\nthe warranty?\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 January 2018", "on 20 February 2018", "on 23 May 2017", "on 24 February 2018", "on 9 March 2018", "on 12 January 2018", "on 15 March 2018", "on 5 February 2018", "on 4 February 2018", "on 27 August 2017"], "reviewer": ["praveencat", "Jalaram", "Tarun Singh", "Amazon Customer", "Eashan Koley", "Amazon", "Good guy", "narendra", "Aakash Parashar", "Amazon Customer"]}
]