[
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Sound Quality Concern", "It is a very good headphone with excellent sound that gives you great hearing ...", "Grest", "Bose the name says it all, only thing missing ...", "Low noise cancellation", "Five Stars", "These have the worst battery life and feel like a fake product", "DO NOT BUY", "Five Stars"], "review": ["Ammaaaaazzzzzingggg!\n\n", "Not really that of a masterpiece like the wired Bose Earphones. Visible lag\nand connectivity noise during telephonic conversation. Challenge in volume\nwhile talking over phone call.\n\n", "It is a very good headphone with excellent sound that gives you great hearing\nexperience. But i feel it is bit highly priced. Otherwise it is a great\nproduct to buy!\n\n", "One of the best but yes the price can be decreased.\n\n", "Bose the name says it all, only thing missing noice cancelation... rest\neverything is up to the mark, u can also change and skip songs . Press play\npause button Double click next song triple click previous song\n\n", "Great headphones..but if u r planning to use for gym you may hear the music\nplaying outside..  \nPassive noise cancellation is low. Also bluetooth streaming stutters for few\nmilliseconds at starting 2 minutes or so and work fine thereafter..  \nPleasant for the ears..bought from bose store at 10% off (republic day offer)\n\n", "First post ever... these speakers are beast value for money.\n\n", "These have the worst battery life and feel like a fake product. Don’t buy\nthese! I am deeply disappointed from Amazon for this purchase.\n\n", "Please for god sake... DO NOT BUY THIS.  \n  \nEven the company had not been successful in replacing this faulty piece of\nproduct.  \n  \nI approached multiple time for it.\n\n", "Value for money 5 star product\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 March 2018", "on 27 October 2017", "on 5 October 2017", "on 8 January 2018", "on 24 August 2017", "on 30 January 2018", "on 30 December 2017", "on 19 October 2017", "on 20 September 2017", "on 13 January 2018"], "reviewer": ["Amazon Customer", "Sam Chowdhury", "Amazon Customer", "Amazon Customer", "anthony", "Ambrish Deshmukh", "Akshay Sundaram", "Rajshree", "Himanshu Sengaonkar", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Five Stars", "Excellent product...Go for it..", "Four Stars", "Very good fitting earphones", "Five Stars", "Great for regular use and for gyming.", "Average product .. choose a cheap product", "Review a Bose?  Seriously?", "One Star", "Best wireless option bar the air pods"], "review": ["Best bluetooth earphone\n\n", "Excellent sound and controls...Very quickly connect to Bluetooth device. Happy\nto have this.\n\n", "Its a good option. Nice sound and speedy connectivity but cant change songs\nthats the only flaw i found.\n\n", "Very good fitting earphones.. they look bulky but are very light and\ncomfortable on the ears.. good to use outside on the roads since it allows\nsome ambient noise to pass through.. sound quality is up to the mark as one\ncan expect from a bose product..\n\n", "Great product\n\n", "Pros  \nSound is clear and crisp (although not ear canal so do not expect excessive\nloud sound.)  \nBass is above average.  \nCons  \nNone really. It's worth the price.\n\n", "Good backup is not that good as I expected...  \n  \nWasted my money\n\n", "As usual great product from Bose. A star less as the qc30 is better due to the\nANC.\n\n", "Only pricey, no quality\n\n", "Best wireless option bar the air pods..Music n bass s good..But can't wear it\nfor a long time as ear starts hurting..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 October 2017", "on 16 August 2017", "on 18 July 2017", "on 2 March 2017", "on 2 October 2017", "on 24 May 2017", "on 20 March 2018", "on 4 July 2017", "on 2 September 2017", "on 23 May 2017"], "reviewer": ["Puneet B.", "SHRADDHA", "Amazon Customer", "sahil", "Shruti", "Tathagata Bhattacharya", "Abhishek g.", "Does it matter?", "Shivam agarwal", "BHARATH B S"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["One of THE best wireless earplugs from BOSE", "Bose suggested me to buy even better version which can handle Dust", "Very Good...but could have been even better given the fact that its a BOSE", "Best bluetooth earphones at this price range!!", "Amazing product.", "FUN SOUND & BASS", "The real disappointment came when I was made aware that you could ...", "The best comfort and the best sound.", "I have been using BOSE products from past 7 years ...", "Good for gyming and running but not for cycling"], "review": ["Over the years I frequently get asked what the best Bluetooth sports headphone\nis. My stock answer is that none are perfect, all have their drawbacks, and\nthe handful of top models may fit you well and work great -- or they may not.  \n  \nBose's SoundSport Wireless, the company's first Bluetooth sports headphone,\nisn't perfect either, but it may just be the best Bluetooth sports headphone\ncurrently out there.  \n  \nI mean you don't jam the earbud into your ear and completely seal off your ear\ncanal (that type of headphone is referred to as a \"noise-isolating\" in-ear\nheadphone). Thanks to Bose's eartips, which come in three sizes -- small,\nmedium, large -- the bud sits loosely in your ear yet remains securely in\nplace.  \n  \nThe SoundSport Wireless comes with three sizes of ear tips.  \n  \nThis model is equipped with a special sport version of the tips that's\ndifferent from the tips included with Bose's earlier in-ear headphones, so\nthey aren't interchangeable. I should also point out that because the\nearpieces extend out from your ears you'll probably have some trouble wearing\nthese under certain helmets.  \n  \nThe ear pieces are somewhat bulky, but not so bulky to feel heavy on your\nears. However, if there's a criticism of this headphone's design, it's that\nthe ear pieces could protrude out a little less and be more discrete-looking.\nEasier said then done, of course -- today's battery technology is holding back\nminiaturization efforts.  \n  \nRival headphones -- such as Jaybird's X2 and Freedom, Beats' Powerbeats 2\nWireless and Monster's Adidas Sport Adistar -- give you the ability to shorten\nthe cord length (or cinch up the cord) for those who want to wear the cord\ncloser to the neck. With this headphone, you can't adjust the cord length, but\nwhat Bose has done is provide a clip you can hook on to the back of your shirt\n(at the top) to keep the cord from flopping about. It's a smart design and I\nthought it worked well; the cord remained fairly stable, even while I was\nrunning.  \n  \nThe only downside to the floating-fit, open design is that ambient sound does\nleak in: this isn't a great headphone for noisy environments. (If that's your\npreference, Bose's upcoming QuietControl 30 is a wireless model that features\nactive noise-canceling.) But if you're out running or biking, you'll be able\nto hear cars coming, which is why a lot of runners and bikers prefer their\nheadphones to have open designs.  \n  \nAs you might expect, the headphone is sweat- and water-resistant and there's\nan inline mic and remote that lets you skip songs, adjust volume, and take and\nmake calls. Bose is touting its quality as a headset for making calls, as well\nas how reliable the Bluetooth connection is. I can attest to experiencing only\nminimal Bluetooth hiccups and was satisfied with how it performed as a\nheadset, though the QuietControl 30 and QuietComfort 35 offer superior headset\nperformance. Those models have noise-reduction features that muffle ambient\nsound, including wind and street noise.  \n  \nJust as importantly I had no trouble pairing and repairing the headphone with\nmy iPhone 6S and Samsung Galaxy S7 Edge (the Bose features near-field\ncommunication tap-to-pair technology for devices like the Samsung that support\nthis feature). I also simultaneously paired it with my iPhone 6S and MacBook\nAir and had no trouble switching between the two when a call came in as I was\nwatching a video on the computer.  \n  \nBose Connect, a free app for Android and iOS, allows you to manage your\npairing list, upgrade the firmware and change the auto power off settings (the\nheadphone powers down if you don't use it for a certain length of time, which\nis a good battery-saving feature). When you turn on the headphones, a female\nvoice alerts you how much battery life is remaining and with which devices\nyou're paired. That information is also available in the app.  \n  \nBattery life for the SoundSport is rated at 6 hours, which is fairly decent\nfor this type of small headphone (though not great overall), and 5 hours for\nthe SoundSport Pulse. Both SoundSport wireless headphones come with a simple\nneoprene carrying case, but Bose will also sell an accessory case that has a\nbuilt-in battery for on-the-go charging that'll cost $50. That battery case\nprovides three full charges, or up to 18 hours of battery life.  \n  \nBose will sell a separate accessory case that has a built-in rechargeable\nbattery for 3000 rupees.  \n  \nI used the the SoundSport Wireless for over a week, taking it to the gym,\nusing it on the streets of Mumbai and doing two runs with it on Lodha Palava.\nI used the large eartips and was able to get a comfortable, secure fit.  \n  \nWith a lot of in-ear sports headphones, I find myself having to make little\nadjustments to relieve some discomfort or get a more secure fit, especially\nwhile running, but with this headphone the adjustments I had to make were\nminimal. They were easy to put on and take off, they powered on and paired\nquickly to my phone, and worked as well as any Bluetooth headphone I've used.  \n  \nThe sound quality is very good for an in-ear sports Bluetooth headphone.\nThere've been some complaints about it not playing loud enough, but I didn't\nhave that issue with the iPhone 6S or Samsung Galaxy S7 Edge I tested it with.\n(Bluetooth performance on computers tends to be a little dodgy and perhaps\nsome of the volume complaints are related to computer connectivity.)  \n  \nThe headphone doesn't sound as good as Bose's SoundTrue Ultra wired\nheadphones, which I like a lot and offers cleaner, more dynamic sound, with\nbetter defined bass. But that's the nature of Bluetooth. You lose a little\nsomething. In the case of the SoundSport Wireless, the loss isn't huge.\nThere's some clarity missing (the highs are a little recessed), but you get\nlots of bass and the midrange sounds pretty natural and warm. It's also a\nfairly open-sounding headphone.  \n  \nWhat's interesting about the sound is that this headphone seems to be\noptimized for outside use. Inside, in a quiet room, the bass can sound a\nlittle bloated, which gives everything a slightly dull edge. But when you're\nwalking around outside, the bass sounds toned down because it's competing with\nambient noise, whether it's the wind or traffic or whatever. If you didn't\nhave that extra bass the headphone would sound thin outside. The way it's\ntuned, it sounds smoother and better balanced outdoors.  \n  \nI didn't think it sounded better than the Jaybird Freedom, which also delivers\nexcellent sound for an in-ear Bluetooth headphone -- though that model costs\n33 percent more. But it bests the Beats PowerBeats 2 Wireless, Plantronics'\nBackBeat Fit and Monster's Adidas Sport Adistar. The latter two models cost\nless than the Bose.  \n  \nAll that said, what ultimately makes the Bose the superior headphone and easy\nto recommend is its fit and comfort level. No, it's not perfect -- and it\nwon't be a perfect fit for everyone -- but it's one of the few \"premium\" in-\near Bluetooth headphones that I think will work for the vast majority who buy\nit.  \n  \nThe SoundSport Wireless' highlights:  \n  \nAvailable in two colors at launch (black, aqua). Choose your pick!  \nPrice: 13k  \n6 hours of battery life  \nWater- and sweat-resistant  \nAuto-power off feature  \nAccessory charging case costs around 3000 extra  \nWorks with Bose's free Connect app for Android and iOS devices  \nNFC tap-to-pair technology for devices that supports it.  \n  \nNote:  \nSoundSport Pulse Wireless with built-in heart-rate monitor that comes in red\nand has 5 hours of battery life  \n  \nGood: The SoundSoundSport Wireless is a very comfortable in-ear wireless\nBluetooth sports headphone that's sweat-resistant and sounds great. The\nearphones fit securely in your ears thanks to winged tips. The headphone works\ndecently as a headset for making cell-phone calls and has an auto-off feature\nto preserve battery life.  \n  \nBad: The ear pieces protrude noticeably from your ears (they're a little bulky\nthat don't feel heavy); battery life tops out at 6 hours.  \n  \nCrux: The Bose SoundSport Wireless is the most comfortable, best overall in-\near Bluetooth sports headphone you can buy right now.\n\n", "Very frustrating experience with Bose, TWICE IN A ROW.  \nBought earphones and just after the warranty period, the cable started to\ncorrode.  \nBose suggested me to buy even better version which can handle Dust, Sunlight\nand Sweat, guess what ?? Same thing happened !!  \nEven my 500 rs earphone had better life than this.  \nNow I will have to put more money to buy another. But I WILL NEVER GO TO BOSE\nEVER AGAIN !!  \n  \nWASTED 25,000 IN TOTAL !!  \n  \nHATED HOW THEY HANDLE THEIR CLIENTS.  \n  \nMOST IMP : BOSE DID NOT HELP ME IN ANY CASE, THEY DONT CARE ABOUT THEIR\nCUSTOMERS.  \n  \nTOTALLY WASTAGE OF MONEY. INVEST IN SOME OTHER BRAND.\n\n", "I am using this headphone for last couple of days. Please find my review below  \n  \n1\\. Packaging - the packaging is top class. Like BOSE. But, it’s a bit big in\ncomparison to the product size. However, they have given the extra buds to fit\nyour ears and also a small pouch, which is very nice and has a hook which you\ncan loop it to your trouser hook or to your bag etc. It also includes a\ncharging cable but no charging plug  \n  \n2\\. The look and feel - It has a anti tangle cable which is good. The colour I\nhave is black, so it looks pretty run of the mill and dull. The headphone has\na clip which you can remove and replace depending on where you want to clip\nit. The earphones are large in comparison to the ones you get in the market.\nWhen you put it inside your ear, the outer part (where BOSE is written)\nprotrudes and make look a bit odd by no big deal. The material is rubbery and\non the right part of the earbud, you have the power switch as well as the\ncharging micro USB port. On the left bud, there is nothing. the cable has a\nmic as well as volume up/down button. Which is bit unusual and rubbery. But it\nworks well, just that, you need to press it hard to make it work. But, you\ntend to get used to it. Its not one of those soft touch ones.  \n  \n3\\. The pairing and BOSE app - There is a BOSE app (I downloaded the iOS app).\nThe BOSE connect app shows you the battery percentage and you can also control\nthe volume from the app. It also has features like product help, feedback,\npolicy/settings and a link to connect to bose.com. It also gives you the\noption to activate or deactivate the voice prompt option and prompt language.\nIt also enables you to share music between 2 BOSE headphones (Bluetooth ones I\nguess, since I haven't tried). It pairs well and fast. You can also get\nmultiple devices paired at one time.  \n  \n4\\. The music quality - I have tried few Bluetooth headsets before, including\nnoise cancelling bose wired headset. I must say, the quality is very good, if\nnot excellent. The bass is superb and it tells you, you are listening to a\nhigh end device.  \n  \n5\\. Battery - The battery is just OK. From the time, I paired the headphone\ntill the time I got the low battery alert, it took me approx. 9 hours. And I\nwould have used the headphone for approx. 2 hours of talk time paired to my\nphone. Haven't tried with music only listening time, but, I guess it will be\nmore at a stretch.  \n  \n6\\. Ease of use while walking / running - The earbuds fits quite well and you\nhave choice of size, which comes part of the package. While walking, it just\nstays in the ear with no fear of falling off. If you clipped it to the back of\nyour collar (which while walking isn't needed), its better, but without it\nalso, it’s pretty firm to both your ears. While running, you may clip it or\nwithout. I did a 2kms run with the Bluetooth earphone plugged in and I would\nsay, almost all the time, I felt it to be in place with once or twice pushing\nit back in more from the perspective of being sure as the earbuds showed no\nindication of falling off due to running. So, a thumbs up here. If you are\nable to clip it well, then it will stay in place even better while running.\nJust that, if you clip it to the back of your collar, the shirt tends to get\npulled as you run, and it may make you feel as if the earbuds are getting\nlose. So, get the clipping right, and you may not have issues. It's water\nresistant but to what extent I wouldn't know since didn't test it.  \n  \n7\\. Final Verdict - Bose is expensive. So, you can get a shade lower quality\noutput by paying less than half. But, then BOSE is also about brand and also\nfor those, you are very particular about finest quality audio (which may not a\nbig deal for music while you are walking or running). Overall, if you can\nspend for a BOSE, go for it, but if you are ready for a slight compromise, you\nmay remain happy for an earphone half the price.\n\n", "I’ve been using Bose products for a while and I’ve always awed at their\nquality - both in terms of build quality and sound.  \nSame is the case with Bose Soundsport Wireless! They deliver punchy sound\nnotes along with good base. You won’t find better bluetooth in-ear earphones\nat this price range. They may look bulky, but they sit comfortably in your\nears with the Stay Hear+ tips and never fall off while working out. They don’t\ncancel out the ambient noise, but that’s a plus point while running / jogging\nin the roads, making a person aware of the surroundings. It can connect to two\ndevices simultaneously, thus, you can jump from one device to another\neffortlessly!  \n  \nOverall, a good buy and a value for money! You might want to look into Jaybird\nX3’s too to make an informed choice.\n\n", "At first I was not happy , though I had wasted 13275bucks in getting a sound -\nany my previous leaf earphones of 2000 we’re giving me same sound and better\nfit . It took 30 minutes to upgrade the firmware - now the sound was\nunanticipated unmatchable- now that’s what you call the charm of Bose\nearphones. I won’t say the fit is great - it’s not . But sound of Bose will\nnot betray you - every beat of the sound will have an impact . But this - to\nhear every treble and beat .\n\n", "Actually I'm Sony Fan for frequency and details  \nThe Bose sound is perfect, powerful, extended bass and make music sound lively\nbest sounding wirless in ears.  \nBOSE SOUNDSPORTS WIRLESS IN EAR  \n  \nTHE BOTTOM LINE: Strong wirless performance.  \nThis earphone perfect for running and style.  \nEverything song personally EQ system of any volumes . The bose sound is\nenlightened and high but no pressure ur ears.  \nBass:10*true and alive  \nTreble:7*mostly natural  \nVocal:10*lifelike  \ncomfort:10 *bose significant earbuds long time listening  \nverdict: value for money.  \nProblem:7* less battery life  \nMy suggest :Bose is Bose. World no 1 better audio performance than others\nbrand. \"small body but big sound.\"U can buy it. Then everythings becomes wow!  \nNote :depends on ur device\n\n", "Bought these pair of headphones in a real hurry as a birthday present for one\nof my friend , although I was researching about the product since past couple\nof weeks.  \nThe real disappointment came when I was made aware that you could really not\nget a hands experience with the quality of the sound. And also build initially\ndid not impress me .  \nBut when the moment came , I was taken a back, I didn't mind the price nor my\ndecision after that.  \nBrilliantly engineered sound system fits well.\n\n", "These are the most comfortable bluetooth earphones.  \nOnce worn we totally forget its physical presence and sound just images in\nfront of us. The sound quality is one of the best out of many blueetooth\nearphones i have heard so far. when it comes to comfort, its the bose\n(universal opinion and i do amend). Though sony (nwz-s615) is cheaper, having\nan option at home, I always pick this bose against the sony everyday to use.\nIt would have been more comfortable if the earphones were as thin as the bose\n1st gen in-ears, which i could wear at night, sleep and roll with it and wake\nup next day to find it in my ears (not falling) only after the wires pull\n(meaning you dont know its sitting in your ears, its that much comfortable).\nSince the bose blueetooth ear buds are bulky, they protrude and hinder when\nyou roll over.  \nApart from that these are one of the best choice. I already have the bose 1st\nin-ears which still my 1st choice over the many many renounced earphones i\nhave and the customer service that i experiences when its (1st gen bose in-\near)wire were almost broke(though working) did a very good job of exchanging\nwith new one's for 2000rs(may be the cost of re-wiring)  \nSo absolutely the best choice, but the pricing should be half of what they ask\nfor...\n\n", "I have been using BOSE products from past 7 years and this is my recent\npurchase. As a music lover, I tried couple of other brands and I have to say\nthis. I personally think Apple ear set does similar job as this product does\nin terms of quality of sound. The only difference lies in the minor musical\nsounds which you can pick in BOSE but not in other ear set. To this small\nadvantage, I think it is priced very high.  \n  \nI requested to return the product as headset never stayed on and was popping\nout as I was jogging. Highly disappointed with this.\n\n", "The product is good but not as per my requirements:  \nPros:  \n1\\. Sound quality is good, which is obvious, it's BOSE  \n2\\. Even though they looks big but when you'll wear them they are very light.  \n3\\. Pretty good for gym.  \n  \nCons:  \n  \n1\\. You can not use them for cycling and motorcycle, due to it's big size  \n2\\. As i mentioned mentioned \"cycling\" above because there's too much wind\nnoise coming when you are riding a cycle or a motorcycle.  \n3\\. they do not cancel outside noise, you will still be able to hear people\naround you, it can be considered good or bad to some, but for me, i did't\nreally liked it, as at gym you will be able to hear other noise too except the\nmusic.  \n  \nOver all it's good, they are meant for gym but if you are looking for\nsomething to use during biking or motorcycle multipurpose, it should not be\nyour choice!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 July 2017", "on 13 March 2017", "on 27 June 2017", "on 31 August 2017", "on 13 January 2018", "on 14 January 2018", "on 25 December 2017", "on 15 November 2017", "on 2 December 2017", "on 12 April 2017"], "reviewer": ["Arka Bhattacharjee", "Rishi", "Mee Mumbaikar", "Siddhant Bahuguna", "Mohammad Shariq Irshad", "Sajal Mandal", "Yashodar", "Sai", "Ramanuja Swamy Saketha", "Gourav G."]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Five Stars", "Boss ... Bose", "Five Stars", "Five Stars", "Five Stars", "The best!!!", "Five Stars", "Best headset till date", "Five Stars"], "review": ["Superb sound and clarity\n\n", "These are priceless!\n\n", "Truly boss....I mean Bose. Love the sound quality and seller services too.\n\n", "Simply Superb\n\n", "Very nice one... compared to beats sound quality is too good...\n\n", "Fantastic sound quality and range!!\n\n", "Mind blowing music very addictive.\n\n", "its an amazing product..\n\n", "Excellent product. I did not buy it here but wanted to share for interested\npeople. Loud music with perfect clarity. Something I was looking for quite a\nlong time. Simply go for it.\n\n", "200% worth the value,\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 May 2017", "on 2 January 2018", "on 1 April 2017", "on 3 May 2017", "on 7 March 2017", "on 31 March 2017", "on 30 March 2017", "on 4 April 2017", "on 25 June 2017", "on 12 November 2017"], "reviewer": ["Mahender", "Abhinav", "sandeep Arora", "Dr PRADEEP JOHN PROMOD", "Deepthee R", "Sukanya Rengaswamy", "Abdul W.", "Amazon Customer", "Amazon Customer", "Rohit T."]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Focus on your gym workout", "But product is excellent from sound point of view with nice packing", "One Star", "Made In China Product", "Five Stars", "Outstanding product", "Five Stars", "Five Stars", "POOR QUALITY & SERVICE", "Bass bass bass...! Love it!"], "review": ["Very good product for use in gym. Does not come out of the ear so you focus on\nyour workout only. It's comfortable to wear and has an awesome sound quality.\nThe gym noise is not heard when music is played on it. Decent battery life.\nEasy gives 4/5 days of 2 hrs workout each.\n\n", "Before putting order I was bit apprehensive that being costly I may be cheated\nby company or courtier Co........ But product is excellent from sound point of\nview with nice packing.... Let's wait n see its durability.....\n\n", "Received defective\n\n", "MADE IN CHINA  \nProduct sound quality is good but had I known it is made in China would not\nhave bought it thinking of returning it.\n\n", "Exceptional sound quality\n\n", "Love it. Extremely simple and easy to set up and use. Best in class sound\nquality and comfort. The app can be improved though.\n\n", "Superb working\n\n", "Coolest headphone I have ever used :)\n\n", "surprising but true very poor service and quality, both left and right logos\ncame out and collar pin plastic broken.Not expected from Bose to compromise on\nquality.\n\n", "Awesome product and being an ardent Bose fan, these do not disappoint  \nPick these up if you're looking for bass.  \nYou will not find better sounding Bluetooth earphones than this.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 April 2017", "on 5 February 2018", "on 28 November 2017", "on 31 July 2017", "on 18 November 2017", "on 27 July 2017", "on 31 October 2017", "on 4 October 2017", "on 29 June 2017", "on 2 June 2017"], "reviewer": ["jai singh", "Anil Kumar Sharma ", "Amazon Customer", "Amazon Customer", "fahim mullaji", "Indrajeet Sengupta", "ankita panda", "Sutan", "puneet k.", "Abhijit Nair"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Excellent product!!", "Premium  wireless earphones comes at a premium price", "Live the quality of sound it gives😍😍", "PERFECTION", "Amazing sound experience", "Will contact bose import but I am greatly disappointed (I hate like beats as a brand", "It didn't fit in ears well", "Great set of earphones!", "Excellent ear phones", "Loved it when I had it"], "review": ["True to the name!!! Best ever I have used!!! Bass is really good... except\nthat u can hear the airflow sound and it's not completely soundproof of the\noutside ambience. For this budget some people do expect it has to be\ncompletely sound proof. Though it's a flaw I am ok with the result and like\nusing it. The back piece of the ear buds is heavy but it has to be heavy for\nthe kind of sound quality it produces.\n\n", "Awesome earphones it's very comfortable to waer sound quality is very good and\nit's sweat n water resistant so can't ask anything more just price is bit high\nbut there are premium wireless headphones so price is justified battery backup\nis around 6 hrs and it get full charge in about 45 mins so if u r going out\nfor a long trip charger will be required.  \nOverall I'm quite happy with this product.\n\n", "When it comes to audio quality only one company comes in my mind and thatz\nbose far superior quality audio easy to use and can be used with every\nBluetooth device\n\n", "WOW! I'm a BOSE fan and this product does not disappoint! Total quality in\nevery aspect. Fits in the ear better and feels more secure than any earphone\nI've ever worn, shockingly good sound quality, just perfect. Bose even has an\napp that updates the software. Like other reviewers have said. BOSE IS BOSS.\nDo not get dissuaded by negative reviews. Having owned a few Bose products, My\nexpectations were extremely high but this has managed to surpass even that.\nWorth every rupee. It was so good I immediately ordered a second for my wife!\n:)\n\n", "First of all let me tell you this is not for BASS lovers, Bose products are\nknown for music detailing. This headphone even in the form of bluetooth gives\npure music experience. You will have magical music experience, so detailed\nthat I missed some of the soft tones while using Sony or MI. I am loving it.\nNow the thing is that I don't prefer the other headphones after using this.\n\n", "Died after 2 months, sport 5 day a week... My previous beats wireless 2 lasted\n2.5 years 7 days a week... Will contact bose import but I am greatly\ndisappointed (I hate like beats as a brand!  \nWhile not dead: instant Bluetooth connection, good sound quality, stuck to\nyour ears even while running (better than the beats in that point), 6h\nautonomy seems what I got\n\n", "It didn't fit in ears well and I saw many users complaining about on the web.\nI hope Base fixes the issue\n\n", "Exceptional purchase. Stellar sound quality and the trademark bose finesse.  \nThe design could have been a little less clunky. Tends to stick out from the\nears and makes you look a little 'frankenstein'ish\n\n", "Bose quality is guaranteed. The fit is excellent and comfortable, the sound is\nsharp with good bass. Battery time is pretty good-better than I expected. This\nwas my 3rd Bluetooth earphones, the previous 2 I returned to amazon within a\nday of using as the quality was real bad.But after using these it was worth\nthe effort.\n\n", "Loved it when I had it. Replace it later with Apple AirPods. Nothing agains\nthe Bose but just the AirPods are one more segment of the  ecosystem that I'm\nin.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 August 2017", "on 27 August 2017", "on 5 March 2018", "on 3 May 2017", "on 26 July 2017", "on 1 August 2017", "on 6 February 2018", "on 15 December 2017", "on 24 August 2017", "on 9 December 2017"], "reviewer": ["Vigneshwaran Sureshkumar", "sandip sarkar", "Aftab khan", "Vishnu Rajam", "Sameer Patil", "Client d'Amazon", "Amazon Customer", "Steffi Sam", "Francis", "RH"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Just the perfect earphones. Build quality", "Five Stars", "Five Stars", "Okay types you should go for apple wireless pods", "Five Stars", "Four Stars", "Bose and nothing else!!", "It showed histroy of connection to oppo phone. Had ...", "Bose is awesome", "Five Stars"], "review": ["Just the perfect earphones. Build quality, sound, and ease of use, everything\nis perfect about it. The sound produced is very clear, unlike many of the\nBluetooth earphones where there is a constant hiss you can feel in the\nbackground. Do not hesitate to buy this one.\n\n", "Quality of sound is very good.\n\n", "Simply AWESOME\n\n", "Actually i am disappointed with specific this product of bose base is not that\neffective compared to speakers my opinion\n\n", "Nice 😘😍 love it\n\n", "Excellent product and amazing sound bose is always No.1 no one can beat it\n\n", "Brilliant as always! Bose is the best.\n\n", "It showed histroy of connection to oppo phone. Had it been sold to someone\nelse.  \nWhy i didn't get a fresh product.\n\n", "Sound quality is amazing.\n\n", "Worth buying ..Bose is boss 👍🤛\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 September 2017", "on 19 July 2017", "on 5 August 2017", "on 21 December 2017", "on 17 July 2017", "on 26 May 2017", "on 14 June 2017", "on 26 March 2017", "on 19 June 2017", "on 25 May 2017"], "reviewer": ["nihal", "Rajesh Sippy", "Amazon Customer", "Harsh", "Nilesh", "Rohit Konapur", "Gulzar", "Samir", "Sanjeev", "Mani"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["almost perfect if not for the build quality", "5 star product (Bose rocks!)", "Expect more from BOSE", "One Star", "Amazing clarity in sound as expected from bose", "Excellent sound and quality, lacks in isolation.", "Two Stars", "good sound quality and suitable for people looking for absolute ...", "Five Stars", "Four Stars"], "review": ["pros:  \ncomfortable in ear,  \nnever fall off,  \ngreat for sports, workout, yoga, running  \ngreat support/service  \ngreat sound  \ncons:  \nbuild quality  \nit is almost 2018 but bose has not moved on to usb type c yet.  \nnotes:  \nit is my 3rd replacement.  \n1st one went bad within a month  \n2nd one had material problem. the button's skin was coming off, exposing the\ninternals.  \n3rd one too seems to be having the 2nd one's problem. bose should pay\nattention to the materials used and build quality sucks.\n\n", "Fantastic product! Have been a bose user since 6 years and everytime i buy a\nnew one, I am more than impressed! This one is very easy to pair, has a great\nsound output (traditional Bose) and does not fall off during workouts. Havent\ntried running with them on but for other gym workouts, it stays in place\nwithout even dropping once! Love it!\n\n", "First Of All. I expected more from BOSE. The sound quality is not as good as I\nexpected it. Second of all I had to replace the item once which for me is of\nno problem. But what is making me curious is that the replacement that they\nhave sent me. The box was damaged. The seal was broken. The Headphone is\nworking fine so far(like the previous one) but I'm on doubt whether I should\nreplace it again or not.\n\n", "Product not working from the start.The box was looking old and the product\nseemed refurbished.\n\n", "Amazing clarity in sound as expected from bose. Pairs really quick download\nbose connect app for better usage. its not the loudest earphones but great\nclarity and good enough bass. 4 hrs continuous playback on a full charge.\n\n", "Excellent sound (crisp) and grip, doesn't fall out, great range but average\nisolation.\n\n", "not worth the money.\n\n", "delivers your expectations . good sound quality and suitable for people\nlooking for absolute base . battery runs for 6 hrs which can be a minor\ndrawback but charges soon enough to use it again .very compatible and will\nnever disappoint you .\n\n", "Excellent sound quality, Great product\n\n", "Good for gym\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 November 2017", "on 30 June 2017", "on 5 April 2017", "on 31 January 2018", "on 3 October 2017", "on 25 January 2018", "on 6 March 2018", "on 30 August 2017", "on 19 February 2018", "on 28 February 2018"], "reviewer": ["MrAmBig", "abhijitroy21", "Happy 007", "Alok Nanda", "Thomas C.", "Sidharth Thapar", "Amazon Customer", "kavi", "Ashok Kumar Yadav", "kkmishra"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["The product box was already broken inside the packing.", "Five Stars", "Battery life- 8/10 Finish- 8/10 Sound - 9/10 I took ...", "The best in its class both Amazon and Bose", "Five Stars", "A good pair of wireless earphones in this price range.", "BOSE.... Period!", "Very good product. Qualite and perfromance both are great", "Designed for sheer the love of music!", "This is really good. Sound quality is awesome and the bass is ..."], "review": ["The product box was already broken inside the packing. As the product is I\nordered it and got and intex headphone inside\n\n", "Excellent product by bose .....\n\n", "Battery life- 8/10  \nFinish- 8/10  \nSound - 9/10  \n  \nI took one star and one point for the fact it does not completely seal ear so\nthere is lot of sound leak and you will not appreciate music outside. Bass\nlacks punch. Mid and tremble is clear\n\n", "I placed the order on the 10th and received the product on the 11th with a\nperfect packaging, hats off to the amazon delivery service... Now coming to\nthe product, it’s a Bose and what else can u expect other than quality. The\nheadphones I bought was black. I immediately hooked to my iPhone and yes the\nsound quality was mind blowing and crystal clear. But when u compare with the\nBose wired earphones or the wireless QC overhead or the B&O headphones the\nbass seems to be a lil off the line but not a strong point to complain and can\nbe brushed off as a minor glitch. I bought it for 12k approx and my verdict is\nit’s worth every penny.  \nThe pros:  \nEasy pairing  \nGreat sound quality  \nStylish looks  \nBuilt quality  \nThe cons:  \nActually none but for namesake “low bass”  \n  \nHope it helps... great work Amazon and Bose\n\n", "Amazing Product! Worth spending. Bose is the best. Sound clarity is amazing.\nVery good punchy bass.\n\n", "Bose earphones/headpones are known for their clean sound signature.  \nThese are good earphones with outstanding connectivity and ease of use.  \nA few things that i liked:-  \n\\- Bluetooth 4.1 gives you the freedom to connect upto two devices at the same\ntime. The bose connect app is a plus as it opens up ways to alter/adjust and\nupdate your earphones. The app is userfriendly and interactive.  \n-These aren't for bass lover's, however they give you an accurate sound with decent amount of bass for that workout pump.  \n\\- Probably by far the most confortable wirless earphones. Sometimes you don't\neven realise they are there.  \n  \nThings i didn't like:-  \n\\- The battery life is about 6 hours. When you spend this kind of money, you\ndo expect a little more for your buck. Other wirleless earphones in this price\nrange are offering more for the same amount.  \n\\- The charging case would have been an awesome addition if given with these,\nbut unfortunately they cose another 3200/-\n\n", "First things first, Amazon delivered this product well on-time and when this\nwas not available anywhere else in India. This is the most precious and\npractical possession in my Bose portfolio.  \nThis was the first wireless earphone category offering by Bose and when not\navailable in stores last few months, the rumours were they are going to\nredesign. But the actual reason when I see the same product back on shelves is\nthe extreme demand which made the supply a big constraint.  \n  \nPros :  \n\\- Extremely user friendly be it the way we can hang in ears, to pairing.  \n\\- Sweat and Tangle Free. Wearing this on the go is a swift and stays the same\neven after an intense 2 hour workout.  \n\\- Battery life - atleast 10 hours of continuous play. Comes atleast couple of\ndays when used moderately.  \n\\- Last but not the least, Bose mark sound quality.  \n\\- The clip in the back is very thoughtful and functional.  \nCons :  \n\\- The voice over help interrupts an active call by announcing the full\nsentence and name of the caller. Though this option can be disabled.  \n\\- Yes, it is little bulky in looks on ears, but it never falls off very\neasily.  \n\\- Can pair only 2 devices at once.\n\n", "I wanted to buy headphone that can connect with two devices simultaneously. It\nshould connect to my phone for playing music etc & should also connect to my\nwindows 7 laptop for skype meetings. This headphone does it with out any break\nat all.  \n  \nNow i can freely listen my music and whenever there is a skype call it will\nautomatically ask you to pick up skype call. once call is done it starts\nplaying my music back.  \n  \nConnectivity is smooth. works very well and connects easily. battery life is\nok but its very new for me to comment of that. charging time is also under 2\nhours. which is great.  \n  \nI only found one issue that it doesnt have noise cancellation. so you cant\nhave calls in very noisy environment as it picks up all the sounds around you.\nbut if you are taking calls from office & home (less noise ofcours). than you\nwill not find any issues.  \n  \npackaging was good and delivered on time as promised by amazon.\n\n", "I became a headphone/earphone user due to my work and extensive travels. I\nexperimented with a various brands - Sony, Phillips, Audio Technica,\nSennheiser and Bose. I quickly realised that the in-ear earphones suited my\npurpose the best. So I gave up all my over-ear headphones, including my Bose\nSoundTrue.  \n  \nFor a very long time I relied on the Sennheiser CX 180 Street II In-Ear\nHeadphone (Black) and then moved to the Sennheiser CX 275 S In -Ear Universal\nMobile Headphone With Mic (Black) - both i loved very much, great quality.  \n  \nAfter some deliberation i decided to move on to a wireless headphones and was\ntorn between the Bose and the Jaybird but finally chose the Bose.  \n  \nI have been using the SoundSport for the past couple of months now and its\nsimply sublime.  \n  \nSound Quality, Balance of treble and base, Comfort, Fit and Looks - it scores\na 5/5 in every aspect.  \n  \nIt connects without any hassle to all my Apple products and is a perfect match\nfor the sound quality that iTunes Music is capable to deliver.  \n  \nIf you are wearing this while working, you will forget that you are wearing\nsomething in your ear - total immersion!  \n  \nThe only regret is that the battery could have been better, it says 6 hours\nbut it gives between 4-5 hours.\n\n", "This is really good. Sound quality is awesome and the bass is adequate. In\nfact I like the bass better on this than my QC25 Noise cancelling\nheadphones.Fits nicely in the ear and does not fall off during jogging or\nsprinting. Guess what, this is so good that its the second time I have\npurchased this as I had lost my previous ones on a flight.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 August 2017", "on 21 September 2017", "on 6 November 2017", "on 12 December 2017", "on 8 July 2017", "on 15 March 2018", "on 4 January 2017", "on 9 May 2017", "on 5 April 2017", "on 21 March 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "TK", "Vijay", "Amazon Customer", "shubham", "Ganesh", "Alok Upamanyu", "Sudipto Dey", "Rajiv"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["SATISFIED", "If you are looking for Bluetooth earphones this is worth a try!!!", "Large but comfortable", "Not recommended, not worth the price", "Range of bluetooth signal is also very good. On same floor i can keep my mobile ...", "Simple solution for the glitch in Bose soundsport( not in all devices but majorly in Android devices)", "A BaNg for a bUcK :)", "Disappointed with the experience", "Best wireless sports headphones.", "Thank god I'm not insane enough to buy such over-priced non-sense!"], "review": ["One of the best products I have ever used. I am very well satisfied with the\nbose product. But not pleased with the cover of the charging port in mere\nfuture it will come out. So to that bose has to make a change in the upcoming\nmodels\n\n", "The ones i got from amazon went rogue within 15 days. The headphones\ndischarged within 30 mins after changing for almost 2.5hrs. I reached out to\nbose CustomerCare and they were kind enough to replace it for me.  \nIt is excellent and the sound quality is great. You can connect upto 2 devices\nand the mobile app works like a charm. The design of the ear buds are\nbrilliant and they give you 3 pairs of ear buds(3 different sizes) to suit\nyour ear type. The volume control buttons are little hard but really does not\nmatter. The battery comes to almost 5hrs (4hrs continues usage) for staggered\nusage.\n\n", "Good but not the best by Bose  \nOverall good if you are really serious about your workouts.\n\n", "Not sure of the kind of benchmark people who are posting good reviews about\nthis product have but these are far below quality than the standard iPhone 7\nearphones. The sound quality is absolutely lo was grade and the fit ain’t\nproper either, have tried all the 3 ear tips and they keep falling. Hugely\ndisappointed for this price point, I’d recommend do not put your money in this\nif you are hoping that Bose experience will be awesome.\n\n", "I primarily wanted to use this headset for workout in GYM, both during cardio\nand weight training. I can now confirm it works perfectly in both conditions.\nThe huge size of earpiece is not an issue at all, during running or working\nout. Range of bluetooth signal is also very good.  \n  \nOn same floor i can keep my mobile 15 feet away and still no drop of any\nsignal, so it serves my purpose as why i bought this headset. Sound is also\nvery good and no complains on that front as well.  \n  \nIt was good that after spending time on choosing between Jaybird X3 and this I\nwent with bose.\n\n", "This is by far the best Bluetooth Bluetooth headphone that I have ever used.\nThe sound clarity is excellent. It does have a problem connecting to a few\nAndroid devices but otherwise works fine...I've read complaints that many\ndevices are not supporting the latest firmware but that can be undone in a\nsimple degrade of the device firmware. I myself facestthis problem and was\nrecommended to go to brush.bose.com after connecting my device to the\ncomputer. When in the website after installing a small document required the\nwebpage will direct you to the firmware part of your device ( the headphone\nmust be connected via USB to the PC) where you have the option of degrading\nthe firmware. To degrade the firmware one has to press A D V (up arrow) ( down\narrow ) specifically in that order to degrade. Once able to degrade it is\nrecommended to degrade it 2 versions for the best results. After I did this my\ndevice worked flawlessly.\n\n", "Its a bose. The sound quality is good. U can get that in most of the\nheadphones and at much lower cost. BUT and there is a big \"BUT\".. these are\nwell built too.  \nErgonomics are good, the fit is good, takes a while to get use to though.\nDefinitely recommend it. You get what you pay for.\n\n", "I recd the item before scheduled time. But on opening the package found that\nthe left ear piece was not functioning, also the sound quality is not what I\nwas expecting from a Bose product. The fit of the ear piece is also not good.\nI have initiated a replacement request, hopefully it will be resolved.\n\n", "A product par excellence. Sits comfortably in your ear canals for long without\nany discomfort at all. It just sits there no matter what you do. I usually use\nit in the gym everyday and during my runs and they never come off. In the\nsound department they are great too. Crisp with the right nuances of bass and\ntreble, although I wish it was a little louder or maybe that is something to\ndo with my Samsung phone. I also bought the charging case with this which is\nsuch a thoughtful product. It's literally a life saver because this pair last\nfor about 6 hours and I usually forget to charge them every other day but I\njust keep it on charge in the case everyday after Im done using it.\n\n", "Rs.13,275.00 for a bluetooth headphone which doesn't even have noise\ncancellation or IPX water-proofing...? Thank god I'm not insane enough to buy\nsuch over-priced non-sense!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 April 2017", "on 13 January 2018", "on 3 February 2017", "on 23 February 2018", "on 14 August 2017", "on 28 May 2017", "on 16 February 2018", "on 31 January 2018", "on 5 September 2017", "on 5 August 2017"], "reviewer": ["Amazon Customer", "Yamini", "Gagan", "Atul Gupta", "Amar", "Satisfied customer", "AshK", "D N.", "Samran Hannan", "T. K"]}
]