[
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Product is very good and advance.", "Very bad customer care", "Best food processor in the range!!", "I would say a nice way to sell the product", "disappointed!", "Inalsa fiesta 650 watt food processor is good product and easy to operate", "very good material and Excellent quality", "Very easy to use", "Excellent All in 1 Product", "Inalsa fiesta 650 watt food processor \" is genuine , good quality and easy to operate"], "review": ["Inalsa fiesta 650 watt food processor is good product and easy to operate.\nMore functions available at low cost with brand company product. Service is\ngood because service center are easily available in every city and quick\nresponse by Representatives.  \nThanks\n\n", "I bought the product on Nov 15 , 2007 and it was working fine for 2 weeks and\nthen the motor suddenly stopped working. I tried calling their customer care\nnumber for service, but I just kept getting response that someone would\ncontact me, but no one has contacted me till now even though it is more than 1\nmonth since filing complaint\n\n", "I hv been an owner of inalsa Maxie plus.Now, I hv bought inalsa fiesta\nwhich,in my opinion,seems to be the best option in its range.Quality seems to\nbe fine,it's cost-effective, efficient & powerful at the same time.Go for\nit!!!\n\n", "I would say a nice way to sell the product. What happens in such cases that\nmanufactures leave you high n dry on demo/functionality aspect but the CD\nincluded is really what fills the gap. So its not one shot tedious process of\nsearching online demo videos. N for product, so far so good. A reasonably good\nproduct in reasonable price.\n\n", "The spatula is weak. Started chipping on first use. Can't remove blades to\nclean them. It says turn the blade knob - with what? Hands? It doesnt turn.\nVery disappointed.\n\n", "Inalsa fiesta 650 watt food processor is good product and easy to operate. I\nhave a the product in white colour but my choice colour grey. I specially\nrequested to grey colour at call center but I recieved white colour. But\nproduct is very good in this price.\n\n", "The product is same as picture.. Got in excellent condition.. Packaging is so\nnice to carry..  \nMaterial is good enough and durable  \nI'm very happy with the product Now I can solve all my kitchen troubles in\nminutes\n\n", "Value for money one should buy this product.. Very easy to use... :)\n\n", "It's must have product for your kitchen which will serve all your need im form\nform of juicer mixer grinder shredder and lot more.  \nA bought this product and completely happy with the performance.  \nMaking my life much easier by taking much lesser time i used to spend in\nkitchen\n\n", "The product \"Inalsa fiesta 650 watt food processor \" is genuine , good quality\nand easy to operate. It has made kitchen work easy for my wife.The product\ndelivered is same as it looks in pictures shown in app.. It is value for money\nproposition . I recommend you all to buy this food processor from inalsa .\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 July 2017", "on 8 January 2018", "on 4 July 2017", "on 1 October 2017", "on 14 January 2018", "on 19 July 2017", "on 29 October 2017", "on 24 June 2017", "on 20 August 2017", "on 29 October 2017"], "reviewer": ["Jitender singh Saini ", "Vimal Ambat", "Jayant kumar", "Santosh Chaubey", "Mabel L.", "Amazon Customer", "Shweta jais", "shyam sunder bindal", "Anuj  Choudhary", "ADITYA AGNIHOTRI"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best ever for Indian Kitchen", "Had a problem, but they sorted it out!", "Nice product, works smoothly so far.", "Poor built quality and packaging", "Great Product !!", "Fantastic product. Fantastic build and quality", "Excellent product with an economical price tag!", "The mixer jar is the worst ever. the Juicer is of bad quality plastic ...", "ie=UTF8&psc=1 Nice product, Value for money", "good quality and easy to operate"], "review": ["After long research and reading lots of review on almost from all brands such\nas Philips, Havells, Bajaj, etc . finally my choice came at inalsa, but due to\nits brand popularity I little hesitating to buy but finally I chose this\ninalsa fiesta 650 watt Food Processor, with 5 year warranty on motor and after\nthis I am very happy to say it's my choice is very accurate , because it's\nattachments and user part are very useful for Indian kitchen.\n\n", "Its a good machine. However, their \"Unbreakable Jar\" broke in 2 weeks of light\n- moderate use (just kneading atta) and now, i'm struggling to get a\nreplacement. I just tried out the blender jar and am not appreciative of the\ndesign or fitting. It looks just too crude and I fear that the jar is just\ngonna jump off when i use it.  \n  \nI have been using the cutting blade for chopping my veggies and am rather\nhappy with it. Works like a charm on cabbage. Onions.. come out too thin and\nstringy. Havent really used the remaining fittings. so, even though i'm happy\nwith the performance, i'm not happy with the quality of the product.  \n  \nUpdate  \n  \nSoon after my complaint, the jar cap was replaced at no cost and my issue was\ntaken up at a war footing pace. Anyhow, even though I've had to experience a\nminor inconvenience, I appreciate their follow up and the performance of the\nfood processor!\n\n", "Writing the review after using this for almost a week. First of all thanks to\nAmazon for sharp on time delivery and nice packaging. After delivery\nsurprisingly on next day received a call fron Inalsa cust care about demo.\nProcess was smooth and demo person was quite prompt and polite. Coming to the\nfood processor, Here are some pros and cons.  \nPros.  \n1\\. Motor is powerful and does not make much noise.  \n2\\. Attachments are quite handy and useful, especially atta kneading, finger\nchips cutter and chopper are very effective.  \n3\\. Price is very much low as compared to other products.  \n4\\. Additinal attachments are easily available in the market.  \n  \nCons,  \n1\\. Main processor body could have been little more smoother. Some burrs are\nvisible.  \n2\\. So many attachments take some space to be stored. But it has nothing to do\nwith product.\n\n", "Extremely poor built quality, handle of main jar came off during shipping\nitself, plastic quality is bad and edges rough and smelly. Disappointed by\nquality of product and packaging (low quality cardboard, extremely bad design\nof packaging), Amazon too did not take any precautions during shipping.\n\n", "I bought this product for 3999/- which is one of the the best prices I could\nget. Moreover, my family is using Inalsa - Food Processor (older variant) for\npast 18 Years and still it works great. Now coming to the overall feedback:  \n  \nDelivery:  \n\\- Amazon delivered in real quick time. I got the product on 3 day after my\norder. The packaging was great and steps were taken to ensure that nothing\nhappens as it is a highly fragile product.  \n  \nPros  \n\\- All in One machine  \n\\- Quickly can get the work done. So delicious cooking is more easier now.  \n\\- Plastic and built in quality is perfect.  \n\\- Blades are just awesome does not require a change and are of Stainless\nSteel  \n\\- Overload Protector comes in very handy  \n\\- Nice Safety features  \n  \nCons  \n\\- Maybe at this price none with respect to the pros/benefits.  \n  \nRest the food processor is worth buying and specially when you want it and are\ngetting a good deal.\n\n", "Fantastic product. Fantastic build and quality. My mom and wife loved it. The\nproduct almost does there half the kitchen work for them. 5 stars.\n\n", "I bought this product couple of days ago after going through some of amazon's\nprevious review of the product and I must admit that the earlier reviews were\nreally very helpful to zero down my search for a good food processor within an\neconomical price tag. INALSA Food Processor is really working fine currently.\nPerforming all the jobs of a good food processor at ease and have not\nencountered any technical issues as of now. Though it is just a week now using\nthis product but I feel that food processor will continue to meet our\nexpectation of a good food processor. I must say that you should just go for\nthis product in case if you really want a smart product without spending too\nmuch on the purchase.\n\n", "Poorest of the lot!!! Not worth anything. The mixer jar is the worst ever. the\nJuicer is of bad quality plastic and I am damn sure it won't even last more\nthan 3 months. Extremely dissatisfied\n\n", "https://www.amazon.in/gp/product/B011B7WMN8/ref=oh_aui_detailpage_o06_s00?ie=UTF8&psc=1  \nNice product ,Value for money. It has all attachments for daily use in kitchen\nExcept chutney jar.\n\n", "The product \"Inalsa fiesta 650 watt food processor \" is genuine , good quality\nand easy to operate. It has made kitchen work easy for my wife.The product\ndelivered is same as it looks in pictures shown in app.. It is value for money\nproposition .\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 31 January 2018", "on 9 August 2017", "on 14 July 2017", "on 11 August 2016", "on 2 September 2017", "on 22 May 2017", "on 6 October 2017", "on 18 February 2016", "on 28 January 2018", "on 29 December 2017"], "reviewer": ["Skety", "Lewin", "Amazon Customer", "SushilM", "Sudeep Dutt", "Abhinav Jain.", "Barun", "Jatin", "Dr. Saif", "Srinath Sharma"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["LOVING IT!", "Easy on pocket", "Defective item", "Not a good product. I buy this product and within a ...", "put to use and satisfied with its performance", "Great product with great quality in an economical price range.", "Great product! Had a similar model from Inalsa which ...", "Cheap plastic that breaks", "One of the best food processor in this price range", "Would recommend"], "review": ["Purchased the product on 19 January, 2k18 and received the product on 20\nJanuary, 2k18.Free Home demo guy came on 25 January, 2k18. Since 25th, used\nthe product for about 7 or 8 times and explored all the features.  \nLoving it.\n\n", "The product is very good. It made kitchen work very easy. It is just easy to\nhandle.Overall the product is amazing. The product is as it looks in pictures.\nIt is value for money. I will recommend this to all the buyer seeking to buy\nfood processor to buy one from inalsa with a better price range.\n\n", "Received damaged product. The lid lock of 1.5 ltr. Jar is damaged and there is\ncrack on the speed number dial\n\n", "Worst product. I buy this product and within a week it started giving problems\nafter lot of calls technician will cum and also take the service charges even\nthough it's in warranty. If you are thinking to buy please go for other band\ncompany, this is totally waste of money. Please don't buy.\n\n", "Received the pack in tact, no damages. put to use and satisfied with its\nperformance. best fit for a small size family. carrot halwa for 20 persons\n-shredding took just 5 min for 2 kg carrot. ata kneeding for soft chapatis is\njust easy, with perfect blend. the right product at this price.\n\n", "Great Product and Quality is excellent. Demo was given by Inalsa Executive and\nthe executive's attitude was really appreciable. Overall, I loved this\nproduct. VALUE FOR MONEY !!!  \nInalsa manufactured a very quality product and all the features are working\nvery fine. You can go for it if you want a very good food processor with an\neconomic deal.\n\n", "Great product!  \nHad a similar model from Inalsa which was heavily used for 15 years without\nmuch issues. Have re-purchased the product and am satisfied.  \n\\- jars are of good quality  \n\\- basic functions - kneading,chopping etc work great  \n\\- Citrus juicer is OK  \n\\- Additional blades for slicing etc are not much used.  \n\\- Can be easily repaired locally as well\n\n", "The lock on centrifugal mesh for juicer broke on 2nd use. Machine itself is\nvery noisy. Build quality is quite cheap. It just looks glossy from outside,\nthe attachments, jars are poor quality. Waste of money for me\n\n", "In this price range, Inalsa Fiesta 650-Watt Food Processor is really\naddressing all the features it boasts for. So far we are very happy with this\nproduct. The customer service for Inalsa is very effective as well, I had a\nsmall issue with one of the jar cover, which was resolved swiftly. Overall we\nwill definitely recommend this product.\n\n", "Happy with the product, it's easy to use once you get a hang of it. I wish the\nquality of build was better though. During the first use the main knob broke,\nbut fortunately the guy coming the give the demo the next day fixed it by\nreplacing the broken part. Has been running properly since.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 January 2018", "on 23 October 2017", "on 18 August 2017", "on 20 December 2017", "on 21 October 2017", "on 15 February 2018", "on 30 October 2017", "on 9 November 2017", "on 17 October 2017", "on 7 October 2017"], "reviewer": ["Jagrati Negi", "Chetan Durga", "ashok singh", "Sangita bhapkar", "Mohammad Sayeed", "Sahil Kannojia", "Amazon Customer", "Amazon Customer", "Sanjib Sarkar", "pulak"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Caution: - its doesn't come with 3 jars, ...", "Nice product", "Fragile!! Not a good buy!!", "Value for money & quality products", "Great product! Must buy for all home needs.", "Inalsa fiesta 650 watt food processor is good product and easy to operate", "Awsome product and helpfull", "Worth the money", "It is working fine and options are very useful to fulfill our daily ...", "Good product and after sales service."], "review": ["Caution:- its doesn't come with 3 jars, the important jar which is size in\nsmall and required for small masala preparation is not come in the package.  \nInalsa must include this small jar, what if you want to prepare small things.\n\n", "Very nice and useful product. Blades are of good quality. Recommended product.\n\n", "The plastic articles are very fragile and have started breaking within 3\nmonths of product use even after utmost care.  \nThe juicer blade is also made of plastic and not steel which makes it less\nworthy.\n\n", "This is the second time i am purchasing Inalsa Products. My wife insisted on\nbuying Inalsa as she is using it since the last 6-7 years.  \nWith Amazon, i got the best price.  \nIn short, Win win for me.... :)\n\n", "Great multipurpose tool for all kitchen tasks. Does all that the description\nclaims. Got a great offer from Amazon on the purchase as well. Prompt delivery\nwithin 24 hrs.\n\n", "Inalsa fiesta 650 watt food processor is good product and easy to operate.\nMore functions available according to cost with brand company product. Amazon\nService is good because deliver at before time and packing was excellent\nthanks to Inalsa and Amazon team.\n\n", "I have recieved oreder 3 days before and i have used it seems very nice.  \nIt is more safe because of its safety and lock mechanism. Till now its working\nfine and very helpfull in kitchen it reduced work from half hour to 5 min\n\n", "Good product, worth the price from a trusted brand.  \nDifferent blades available for all sort of cutting,slicing and chopping needs.\nDough kneading also got easy.  \nGifted this one to my mother and she is really happy with it.\n\n", "Received the product on time. It is working fine and options are very useful\nto fulfill our daily needs. Product finish has to be improved. But performance\nwise, great experience. Better product at this price and with many options.\nCost effective product.\n\n", "Simple yet dynamic product.  \nBeen using this for quite sometime now and I haven't faced any issue.  \nInitial queries were promptly address by their customer care team.  \nAll in all a great product and after sales service.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 February 2018", "on 16 August 2017", "on 20 March 2018", "on 15 October 2017", "on 29 June 2017", "on 23 October 2017", "on 11 January 2018", "on 21 October 2017", "on 17 October 2017", "on 19 February 2018"], "reviewer": ["peeyush s.", "Puneet A.", "Tanu", "Amazon Customer", "S&P", "RAM LAL", "Vikas Patel", "Amazon Customer", "SASIKUMAR", "Amazon Customer"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["One Star", "Great product quality and perfect delivery experience", "Must have product", "This is a wonderful product if you are thinking of buying any mixer ...", "Worth buying", "Satisfied", "Very good working & so reasonablr", "One Star", "Awesome Product. Every Kitchen must have it", "Must buy for kitchen"], "review": ["Received a broken product...The jar was cracked and the handle was also\nbroken.  \nThe refund was initiated smoothly.\n\n", "The product was delivered in good qualoty at the right time. It was very well\npacked. Thank you Amazon and Inalsa. This is my second Inalsa food processor\nin 8 years. My first inalsa was also very good and served me for 7 years.\n\n", "The product by inalsa is perfect. Does the work very quickly, specifically\nkneeding flour, shredding vegetables, making finger chips. Mixing, grinding,\neverything happens so quickly.\n\n", "This is a wonderful product if you are thinking of buying any mixer grinder\nplease buy this as this food processor comes in the price of a mixer and can\ndo a lot more. I like the way it mixes the aata the roti se more soft than\never.  \nThe way this can be used for carrots and mulli is very time saving you can\nmake your gajar ka halwa daily.\n\n", "Worth buying\n\n", "This is my first food processor and I'm very happy with my choice of this\nbrand. Its really fuss free and does everything efficiently. I can knead\ndough, juice, vegetable, grinding.. everything possible. Would recommend it to\neveryone.\n\n", "It is compact in size & works wonderfully...With all useful\nattachments...Dough kneeding was my purpose of buying it & it's doing good\njob...Very very good for this much of amount.\n\n", "The motor stops working every now and then. Even though I have written to\nAmazon, there is no reply or action taken. The product I love but can't keep\nbuying new every 6 months. What's the use of giving warranty when no one is\nthere to contact for repair?\n\n", "Awesome Product. Every Kitchen must have it. After buying this product you\nwill be able to compress preparation time for almost everything you cook.\n\n", "Good product to get in this price. It's awesome. Works smoothly. Everything is\nprepared in a jiffy. A complete food processor.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 July 2017", "on 30 August 2017", "on 15 February 2018", "on 28 February 2018", "on 7 March 2017", "on 16 February 2018", "on 5 July 2017", "on 7 October 2017", "on 16 July 2017", "on 2 March 2018"], "reviewer": ["Amazon Customer", "Kapoor04", "Amazon Customer", "RKT", "Pankaj", "preeti chaturvedi", "suyash", "adhishchandra s.", "Amazon Customer", "saba"]},
{"rating": ["2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Product is gr8 but used!!!!", "It seems to be a good product at this cost", "Beautiful product. I am really happy to have it ...", "Excellent quality noise free operation", "Beast to dominate market", "Good for your days to day daily needs", "One Star", "Inalsa is a brand in food processor for years...", "Great product! Super impressed by the chopping and juicing ...", "Excellent Product with an Economical Price"], "review": ["It seem the product was used sent back to Amazon and Amazon shiipped it to me.\nThats not good way of doing biz.  \n  \nYou can make out by looking at product that it has been used. You can make out\nfrom the shine on new and used product.  \n  \nI might go ahead and return, but what if i get same used product again?\n\n", "My past experience with Inalsa Maxie Plus for the last 7 years, forced me to\npurchase Inalsa Fiesta 650-Watt Food Processor. It seems to be a good product\nat this cost. I am fully satisfied with the product.\n\n", "Beautiful product. I am really happy to have it in my wedding items. The best\npart is that I git this brand at such price. Hopefully the product will serve\nme for long duration. Thank you Amazon.\n\n", "This is a replica of earlier Inalsa which lasted 15 years. I am extremely\nhappy with its quality and its been 3 months. We are enjoying its all round\nfeatures mincing, grinding, grating, blending,shredding,kneading pne the the\nexcellent new features and whisking.  \nWe are happy with noise free operation of the processor.\n\n", "I search lot in big cities. But price is very high. So decided to buy\nonline.among all amazon is given low rate so I go for it.into small town\namazon give good service and packing. Inalsa is the best. Food processor very\ngood .power full n low noise  \nTotal satisfaction now my wife is very happy\n\n", "Good for your days to day needs, attachments & blades are enough for your\ndaily usage, more than that would only be decorative because u may not be\noften using it. Overall good product. It would be good if they make clear\ncoloured identification mark for locking the processor jar and improve the\nplastic quality.\n\n", "the product is not working properly just after 2 months and has a warranty of\n2 years\n\n", "Inalsa has more experience than any other brand in product development of food\nprocessor, price is competitively cheap. Product as usual longlasting and\ngood.\n\n", "Great product! Super impressed by the chopping and juicing features. Compact\nstructure doesn't occupy too much space on the kitchen counter and looks good.\nBought it on a great discount and really happy with the results! 5 stars for\nsure\n\n", "The product is very good.really it made kitchen work very easy.it is just easy\nto handle and low maintenance.the jars are of good quality. Overall the\nproduct is amazing. The product is as it looks in pictures. It is value for\nmoney 💰. I will recommend all the buyer seeking to buy food processor to buy\none from inalsa.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 June 2016", "on 6 March 2018", "on 28 September 2017", "on 17 February 2018", "on 16 February 2018", "on 9 February 2018", "on 1 July 2017", "on 16 February 2018", "on 18 July 2017", "on 26 October 2017"], "reviewer": ["SP", "N D.", "Amazon Customer", "Akash Popli", "Liyakat shaikh", "Arun Singh", "Amazon Customer", "Neeraj Thakur", "Aishani Laha", "Sanjay chavan"]},
{"rating": ["2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["OK sort product for the offer I got.", "Inalsa Fiesta - my Kitchen companion", "Nice product all is working fine until now works well ...", "Much better over my previous Maharaja one", "fits in budget , holds top rankings", "Excellent All in 1 Product", "Good food processor", "great product in great price", "There is good power to the motor and it worked like a ...", "Very happy with product"], "review": ["Not satisfied with build quality. Blades are of poor quality. Jar Plastic is\nnot food grade.  \nJust 2 pin power plug for a 650 watt motor?!!!\n\n", "I am using Inalsa Food processor since last so many years (about 7-8 years).\nNow I purchased a new Inalsa Fiesta Food processor since it is easy to use\nfood processor and a great help in kitchen. My cooking has been made easy with\nthis product. It also saves my preparation time for cooking.\n\n", "Nice product all is working fine until now works well with all jars. Locking\nsystem is quite difficult but once you know it would be fine after watching\nsome videos in YouTube . Over all good product\n\n", "Oh, its a real Jackpot !! Using its citric juicer regularly including regular\nattachments. Much better over my previous Maharaja one. Thumbs up for this\ncompact unit.\n\n", "Good product for daily kitchen work .when we compare food processor\ncategory,this product holds number one product in Amazon because of proce\nrange .inalsa have done a makeover of all products with better ever quality\nand service.  \nFiesta food processor,i will refer it to others to buy as lower the price and\nquality is better among other similar food processor .\n\n", "Book for my friend wedding gift, Received before schedule date. during test it\nrunning excellent . It is value for money .Inalsa manufactured a very quality\nproduct and all the features are working very fineInalsa Fiesta 650-Watt Food\nProcessor (White/Grey)\n\n", "Earlier we are used to mixer, this is our first food processor. Happy with the\npurchase as it does most of our manual jobs of cutting, shredding, dough, etc.\nTrying more out of it day by day.\n\n", "great food processor with a powerfull motor and a lot of attachments it can do\nany work i am also having a glen 600watt food processor and i can tell its way\nbetter than that\n\n", "The start was a bit shaky because it didn't work, then tried the dvd which\ncame with it and realised that it does not work to, but once it started to\nwork it was as smooth as a knife in butter. There is good power to the motor\nand it worked like a charm.\n\n", "A+ class food processor..... Very happy with product.... Now preparing food is\nbreeze......\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 November 2015", "on 20 October 2017", "on 13 February 2018", "on 10 January 2018", "on 26 October 2016", "on 21 November 2017", "on 5 December 2017", "on 15 October 2017", "on 11 September 2017", "on 1 September 2017"], "reviewer": ["Devanampriya", "S. C. Jain", "sudha", "Abhay Sharma", "Amazon Customer", "SHASHI SUMAN", "Giri", "Sarthak Vinchurkar", "Sebastian D.", "Rajesh Dutta"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["only worked ONCE. now will not even switch on ...", "Four Stars", "Good product!", "Great Product", "Nice product", "At starting it was a nice product but after use of a month or two", "The juicer strainer has a problem as it gets rubbed ...", "Good product", "Three Stars", "It is a great product by inalsa"], "review": ["only worked ONCE. now will not even switch on. i think lock / release button\nmalfunctioning. Whatever the reason it DOES NOT WORK. request Inalso to\nreplace this junk piece, not even 1 month since I bought it on Amazon.\n\n", "It is really good product on this price i chose it very carefully abn i am\nfully satisfied by my choice. I was searching for this type of food processor\non reasonsble price and finally i selected inalsa food processor i was so\nafraid about quality but believe me u will b thankful inalsa for this\n\n", "A very good product in its price range. Has all the features of a good food\nprocessor including kneading dough( although it needs a bit of practice before\nyou get used to it). It is also a powerful machine, chutney and dry grinding\nbecomes very easy.\n\n", "I have been using this product from the last 6 months i must state that this\nis a very good product and works perfectly. Even after a high usage it works\nperfectly smooth. If you want a food processor this is the best which one can\nget at this price.\n\n", "Surprisingly, it reduced the 90% manual work related with kitchen work because\none can make everything u need such as, potato chips in different designs.\nTruly, the worth of the product is not much as it is works for. It can also be\nbought with low budget family. Nice. Thank you so much.\n\n", "At starting it was a nice product but after use of a month or two, it started\nmaking noise . And now only mixer is working .\n\n", "The juicer strainer has a problem as it gets rubbed along the plastic lid of\nthe juicer. The inner edge of the strainer is a bit withered off. Please help\nit in case u can replace the strainer. Also the hole in which the pin of\nplastic lid pierces is a bit aide located.\n\n", "Good for the price. No complaints till now. Been using it for a while. Motor\nis powerful enough.\n\n", "working okay, but it is difficult to attach\n\n", "It is a great product by inalsa. Even got a demo at home after receiving the\nproduct and Inalsa's customer care ensured that it was up to my satisfaction.\nReally happy with this investment.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 February 2018", "on 29 January 2018", "on 21 February 2018", "on 22 February 2018", "on 13 October 2017", "on 23 October 2016", "on 25 February 2018", "on 27 November 2017", "on 28 October 2017", "on 21 July 2017"], "reviewer": ["Radha Kapoor", "Shailesh ", "Amazon Customer", "Chaitanya", "Mridul Singh", "zubair", "Amazon Customer", "Ritwik Anand", "Amazon Customer", "Surya Khanna"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["A must must buy specially for kneading dough", "Five Stars", "Deeply Disappointed", "Value for money", "Not a good product!", "Good deal awesome product", "VALUE FOR MONEY - Very Nice and Timely Delivery by Amazon", "If u have Inalsa Food Processor in your kitchen, you don't need any other gadget.", "Wonder of our life...", "Fantastic food processor"], "review": ["Best it is. I recommend everyone to you. I received in 2 days and was afraid\nwhen I read negative reviews. But it is fantastic. I specially wanted for\nkneading dough. Believe me in a minute my dough was ready for rotis. This made\nme so happy. Finally got relief from kneading a boring and time wasting job I\nuse to fill . Thanks inalsa. W's afraid to buy seeing cheap price but now no\nworries. Hurray\n\n", "Too good product. Now I can do every of my work in seconds without strain.\n\n", "An Inalsa Fiesta Food Processor was delivered to me on 8 Jan., 2018. I waited\nover a week to start using it because the processor bowl could not be removed\nfrom the base to be washed, as the joint was stuck.  \nRecently, I tried grinding idli batter in the bowl and found the consistency\nunsatisfactory even after repeated attempts. I therefore tried the liquidizer\nbowl and found it doing a better job. However, after the first lot was done,\nthe liquidizer bowl refused to get dislodged, as of it was stuck to something.\nThe machine could still be operated when in locked position. As I suspected\nthat the base of the liquidizer may have got heated, although I ran it\nintermittently, only for 6 minutes, I waited and tried again and again, till\nit finally came unstuck. However, I found scraps of white plastic at the base.\nIt continued to work for the remaining lots of batter, but I am disgusted that\nthis should happen so early. Two people have to work in unison to dislodge the\nprocessor bowl from the base.\n\n", "I bought this food processor around 5 days ago from amazon India at the cheap\nprice of 3779 only . I purchased this product mainly to make all the kitchen\ntasks easy like atta kneading aur shredding etc. The products does what\nexactly what it claims. I used this product for the first time for kneading\natta but I was not very successful as it became quite wet.But as I followed\nthe instruction CD available with it and the videos available on youtube, I\nbecame master in it. Thus, I would like to suggest you to go through all the\ninstructions before using it and you will be amazed by the results. The food\nprocessor really makes every task like a children's play. We can also take out\nhealthy juices in 2 minutes.It also comes with many safety features.At the\nlast, I would like to tell you that this is the best food processor available\nin this price range and you should definitely go for it. Its a value for money\npriduct and I am satisfied with it a lot.\n\n", "Product received as scheduled however the wire and other parts not that\nimpressive and we also tried to start the machine once it arrived but it would\nnot start at all!! We had purchased it based on some good reviews however we.\nHave not had a good experience with this little known brand...\n\n", "Amazing Amazon deal... Hard got all blades and fittings what was mentioned.\nValue for money. After reading multiple reviews have picked this food\nprocessor.. Have used for dosa batter.. and regular use.. All good to go... In\nthis pricing this model and all in all.. Is a lightning deal... Thanks inalsa\nand amazing. Hope no issues in near future.\n\n", "Very Nice and Timely Delivery by Amazon. Good Product and Quality is\nexcellent. Demo was given by Inalsa Executive by coming to our home and the\nexecutive's attitude was really appreciable. Overall, I loved this product.\nVALUE FOR MONEY !!!  \nInalsa manufactured a very quality product and all the features are working\nvery fine. You can go for it if you want a very good food processor with an\neconomic deal.\n\n", "Simply love this product. Every feature is just beautifully explained in the\nVideo DVD received along with it. My mom at the age of 60 had a very tough\ntime making dough for roties, but with this food processor, she can do it in\nbarely 5 mins. It seems you don't need anything else in the kitchen if you\nhave this product.\n\n", "Super quality😀😀😀,work like a wonder magic.. go for it.without any\nhesitation..loved it..every kitchen need diz wonderful food processor\nInalsa..it will save our valuable time...😗👌👌👌👌👌👍👍👍👍🍦🍧by Salma baig hyd.\n\n", "The product is very good.really it made kitchen work very easy.it is just easy\nto handle and low maintenance.the jars are of good quality. Overall the\nproduct is amazing. The product is as it looks in pictures. It is value for\nmoney 💰. I will recommend all the buyer seeking to buy food processor to buy\none from inalsa.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 June 2017", "on 10 January 2017", "on 7 February 2018", "on 15 February 2018", "on 12 October 2017", "on 6 July 2017", "on 24 October 2017", "on 2 August 2017", "on 28 December 2017", "on 6 July 2017"], "reviewer": ["9029299727", "Amazon Customer", "Somalatha Gopalakrishnan", "Danish M.", "Amazon Customer", "Amazon Customer", "Subhodeep Ganguly", "Amazon Customer", "Salma baig", "Umesh jain"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["They are giving 6 months extended warranty for reveiwing positive ...", "Best food processor *****", "Satisfied with product", "Good machiene for the price.", "First time very bad experience from Amazon Bought in lightning deal for 3400 ...", "A wonderful product at LOW orice", "Not a good quality product, not satisfied.", "Poor quality", "Good product I like this product personally I wanted to ...", "Very good product. Value for money!!!"], "review": ["They are giving 6 months extended warranty for reveiwing positive on amazon\nthat is why they have 3.5 stars rating\n\n", "Given 5 star, as I have been using Inalsa food processor for past 8 years and\nit is still going good. Ordered this one for my relative. If you want to buy a\nfood processor, don't think of any other company or brand. Best buy food\nprocessor. Just need to keep a watch on the price.\n\n", "Great product!  \nHad a similar model from Inalsa which was heavily used for 10 years without\nmuch issues (Normal wear an tear excluded). Have re-purchased the product and\nam satisfied.  \n\\- jars are of good quality  \n\\- basic functions - kneading,chopping etc work great  \n\\- Citrus juicer is OK  \n\\- Additional blades for slicing etc are not much used.  \n\\- Can be easily repaired locally as well\n\n", "Have been using 450w inalsa food processor from past 10 years. No complaints\nuntill now. But lately I was making peanut butter and I realised the motor\nused to overheat and stop. It must have fried or so. Since it was a 10year old\nmachiene I bought new one. So far so good. Only thing I feel is the built\nquality is not very premium. But it does the work. It contains all the jars\nand blades which you could possibly need.\n\n", "Inalsa Fiesta 650-Watt Food Processor...  \nTuareg Marketing Pvt Ltd (Purchased from Cloudtail). First time very bad\nexperience from Amazon  \n  \nBought in lightning deal for 3400 approx. But,  \na) Multiple Attachments were missing  \nb) Main jar was damaged  \n  \nIt was supposed to be a gift but thankfully, checked the contents and returned\nwithin 15 days\n\n", "I purchased from Amazon, this Inalsa product is much cheaper than any product\navailable in the market. This contains all the attachments required in the\nkitchen. Product is user friendly too. The product was delivered at the door\nstep within the committed time. I recommend all the user to try this product\n\n", "Not a good quality product. Motor gets hot within 3 to 4 minutes during\nkneading, requiring shut down for some time. Inalsa products were known to be\nsturdy, which this item is certainly not. Not satisfied at all.\n\n", "Item is of poor quality. The workmanship is poor with screws jutting out and\nthin tinny blades. The plastic feels weak and brittle. Ordered because this\nhad good ratings on Amazon but received a used unit with greasy jar and\nstained kneaders.\n\n", "Good product I like this product personally I wanted to own this product since\n2008 right now I have 2 inalsa food processor both are working very nicely but\none thing I don't like in inalsa fiesta food processor that is the centrifugal\njuicer is made of plastic which is creating some problems in fine juicing some\nfruit particles are left in juice....\n\n", "This is a good product in low budget. Does almost all the work of the usual\nfood processor. Best option in its price range. Motor is also powerful.\nPlastic quality could have been a little better but cannot ask everything at\nthis price. Overall all value for money.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 July 2017", "on 14 November 2017", "on 30 October 2017", "on 26 September 2017", "on 12 October 2017", "on 11 November 2017", "on 23 February 2016", "on 28 February 2018", "on 29 December 2017", "on 15 July 2017"], "reviewer": ["anonymous", "Amit G", "sandeep", "Ankur Singhal", "Amazon Customer", "Amazon Customer", "Amazon Customer", "kj", "Esmaeel", "Utshab Mukherjee"]}
]