[
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Previously am using honor 4X it's front camera is 100 % better than honor 6X", "Great alternative 4 RN4", "Sure, Go For This.", "Good mobile in this price range", "#Best mobile under 20k #cameo", "Bang on.. Mobile.. Very  happy", "DIFFERENT FLAWSS CHK THEN ONLY BUY...  Eat or vomit , DONT REPENT....", "Why Honor 6X has only one sim 4G and 2nd sim only 2G", "Best review ever", "Nice phone worth every penny you pay!"], "review": ["I have this one for camera only, but front camera is not up to the mark.  \nPreviously am using honor 4X it's front camera is 100 % better than honor 6X.\nIn 6X when am taking photos with front camera pixel is breaking & for some\ntimes pixel is breaking for back camera also. Other that phone is getting heat\nwhile charging(still now i didn't wear my SIM card in 6X mobile) more & more\ncompared to 4X.  \nFor look am giving 95% out of 100 for 6X.  \nPerformance also good.  \nBut my main requirement is camera for that only i moved to this one.  \nNow i have requested replacement for new product with out camera & Heat\nissue..... waiting for my camera(6X)  \n  \nAfter returning the 6X till now i didn't go for another mobile. Before\nreleasing 6X am waited eagerly for this. But am dissapointed with the camera.\nMy surrounding are consing me to buy another mobiles like MI note 4, Moto\nG4+....etc.. but my thought is always on honor 6X only.  \nAm planing to buy 6X again ....Please consider my requirement & make me happy\nwith camera....... honor will give better performance i know .......\n\n", "First of all, I had no plan to buy this phone, but because of redmis stupid\nflash sale, it forced me to do so  \nSo first the looks: Looks r pretty good and the dual camera (though the second\none is a sensor, not a camera), it pretty much captures the attention. Ppl\nstart to ask which brand and the price of the device(though most Indians r\nbrand conscious 😉😉😉). The in hand feel is gr8(I feel it's better than RN4\nsometimes) but the slippery back spoils it. The front looks bland, nothing\nflashy about it.  \nCamera: As this is a camera centric smartphone, you expect awesome camera, but\nthe reality is that it's great but no to that level. Main things r  \nLack of video stabilisation; Cranking up of ISO (too much😣) in very low\nlighting condition. I would suggest to use the camera in manual mode. Another\nthing is you have a lot of different modes (sadly u can't download additional\nmodes like Xperia). Your hands need to be extremely still during night mode\notherwise images would come out as blurred. It takes gr8 photos in outdoor\nconditions (with excellent light). The amount of details captured by the\ncamera is so stunning that there is no phone that can beat it (g5 plus to an\nextent can beat this phone because of better dynamic range). I would not\nrecommend this phone for videos as it lacks any stabilisation(that's cost\ncutting).  \nQuality : quality is excellent but the cost cutting is so evident that they do\nnot provide headphones(even the standard ones) with the box. What I am really\nimpressed is the screen quality, it's well lit and has modes which r\ncomfortable for eyes. Overall the phone looks pretty decent and can be\ncompared to redmis note 4. One thing I'm really surprised is that branded\nitems, especially Samsung doesn't provide gr8 quality with mid-range devices  \nPerformance : For those who want to know which chip it's using, it's Huawei's\nown Hisilicon Kirin 655chipset (having performance level of SD625). For\neveryday usage it's extremely smooth and it does not slow down even if we\nscreen mirror this. Haven't tested with any games yet, but don't play very\nhigh end games like modern combat 5. For gamers I prefer redmi or 4gb ram\nversion of this. Boot up speed is quick.  \nFingerprint sensor: This is one area where honor has drastically improved.\nFingerprint is accurate and quick. It blows me away with its speed. And the\nextra features like bringing down notification bar, browsing photos. The added\nfeatures become a bit tricky if you use a cover or case  \nBattery: Combined with Kirin 655, it has an abundant battery life. Though many\nclaim it does not support fast charging, it supports but only with 5V/2A\nchargers, not more than that. Battery charging time is OK. Battery life is OK\nwith gamers about 85% of a day's usage with single charge. Don't expect\nbattery like redmi note 4. But casual users may find it ok  \n  \nIs it worth, though it's pricier, it provides the required specs, unlike the\nJ7 Prime, which is priced exorbitantly and provides less features.  \nIf you can't wait for redmi, then go for this without any second thoughts\n\n", "The Honor 6X has changed my view towards Chinese smartphone brand, I was\npreviously using SONY Z2, Samsung Note 2, Tab 2, Iphone 5s.  \nLook:  \nThe Look is absolutely beautiful and impressive. Metal Body creates Strong\nImpression and bolder look.  \nUI:  \nThe EMUI has a better user interface than other chinese brand make. There are\nmany important and useful functions that other brand doesn't offer in their\nUI. however Icons are bit larger.  \nCamera:  \nDuring my Camera test, It performs above my expectation, Color saturation,\ncontrast, detailing and smart defocus with Apature adds more beauty to its\nphotographs, See attached non edited photos taken from this Honor 6X. It works\nin 4:3 ration on 12 Mega Pixels and 16:9 on 9 Mega Pixels. However The camera\nresult is better than my Sony Z2 contains 21 MP. 2 Mega Pixel additional\ncamera detects depth perfectly and photos can be edited to defocus even after\ncapturing it. Front Camera's result is also impressive as it takes stunning\ncrystal clear photos.  \nSIM Slots:  \nWell,both the SIM slots are 4G but you can use 4G in a single card at a time.\nhowever Its quite practical that we do not use 4G data from both the SIM at\nthe same time.  \nScreen:  \nWell, screen is much sharper however i felt that there should be an option to\nadjust contrast ratio. some colors looks 7-10% dull but its hard to find it\nunless u've experienced Sony's Mobile Bravia Engine.  \n  \nPerformance:  \nWell, the processor performance is noticeably fast while searching web, games\nand installing an app.  \n  \nBattery:  \nas per my usage of \"screen on time\" 5-6 hours a day I needed to charge it once\nin 15 hours. It takes 1 hour and 10 minutes to full charge.  \nFinger Print Sensor works very very fast to unlock the device and for other\nfunctions. I'll update this review time to time as I experience. I think one\nshould surely go for this phone.\n\n", "One of my friends buy this mobile and that performing very well.  \n  \nIn Packet:  \n\\-----------------  \n1) Mobile 2) USB cable 3) Power Adapter 4) SIM Tray Ejector 5) Warranty card\n6) Guide line  \n  \nDescription and it's Convenience:  \nStorage:  \n\\-------------  \n1) 3 GB RAM which is better to performance with multiple work at same time.  \n2) 32 GB ROM which is a large space to store your impotent documents and\nothers.  \n3) It support up to 128 GB SD card.  \n  \nNetwork:  \n\\--------------  \n4) Dual sim (nano 4G+4G) in which one is 4G and one 2GG networking. 4G support\nVoLTE which provide you better 4G call quality.  \nYou can change sim slots 4G to 2G. That mean you need not to open your sim to\nchange slots if you have bouth 4G sim, you can change it fron settings.  \n  \nSecurity:  \n\\--------------  \n5) Fingerprint reader whis is the best security tool now a days.  \nYou will get at backside of this mobile.  \n  \nPlatform:  \n\\---------------  \n6) Android OS, EMUI 4.1 v6.0 Marshmallow operating system with 2.1GHz + 1.7GHz\nKirin 655 octa core processor whis is good.  \nLatest mobiles expensive mobiles has snapdragon processor. But this mobile's\nprocessor is not bad.  \n  \nCamera:  \n\\-------------  \n7) Dual rear camera. It has one 12 MP and a 2 MP dual lens rear camera which\ntakes best moment of your life as real.  \n8) 8 MP front camera performance is also excellent.  \n9) Camera have many feature to shoot good photos. It has autofocus.  \n  \nDisplay:  \n\\-----------  \n10) It has 5.5\" LTPS HD display which is perfect and gives the best fell of HD\npictures.  \n11) It has 1920 x 1080 pixels resolution.  \n  \nBattery:  \n\\----------  \n12) It has 3340 mAH lithium-polymer battery capacity which is not bad, medium.\nCharge become fast.  \n13) Battery is non removable.  \n  \nOthers:  \n\\------------  \n14) It's design is very nice and very slim which desire by mostly.  \n15) It is looking gorgeous.  \n16) OTG supported.  \n17) In good price.  \n18) Sound quality is very nice.  \n  \nIn it:  \n\\------  \n19) You will get the power button and volume up down button at right side.  \n20) Sim card and sd card at left side.  \n21) Earphones point at top.  \n22) Speakers to button.  \n  \nBad things in my eyes:  \n1) It become heat after gaming and long time use.  \n2) It not provide any earphones.  \n  \nOverall this mobile is good for heavy working and performance is very well. If\nyou want to do multiple work and play games and more you can buy this mobile.  \n[...]. Thank you.\n\n", "First of all guys. I would like to say something that the honour 6x has the\nbest option if you are investing your money to buy a smartphone soo don't get\nconfused buy it without confusion.  \nI am using the 3/32 gb varient. The mobile performance pretty awesome.  \nPros - of the smartphone  \n1(Camera) -Aweasom rear Dual camera setup, pics are really detailed and I bet\nu non - of the smartphone under 20k compare to this.  \n2(performance processer and ram) - I am not a havey gamer but I installed\n#Asphalt 8 and subey surf both the game runs smoothly. I never faced the lack\never.  \n3(Battery)- The battery backup of this mobile is pretty awesome at least it\ngives u 1 day if u havey user and if you are a normal user than 1/5 half day.\nI tested this if u charged at night 12 o'clock and leaves and again use the\nmobile In morning than the mobiles backup will be more than 30 hours. Soo I\ncan say the battery performance of this device is awesome. In terms of usage.  \n4(Display) The brightness quality of the display is Waoooo even in high sun\nlight and full HD.  \n5(sound and earphones) - sound and the earphones are good no problem in that.  \n  \nCons-we all know that everything has the pros and cons no-one is 100% perfect.  \n1-(Jio to Jio calling) - The main hilighted cons of the device is it supports\nVolte but when you try to call Jio to Jio than it drops the call every time.\nBut this problem faced only on Jio others are good. Jio to airtel others\nVodafone anytother company call goes perfectly.  \nI think the company will solve this problem after the new update in Nougat.  \n2 (front camera) - The quality of the front camera is good at outdoor daylight\nconditions but at indoor it's noisy and washout. But overall good.  \n*Till now I noticed only these two cons.  \n  \n#Note- Overall conclusions of honor 6X is if you are searching for smartphone\nunder 20 K or 15 k must go for it without any hesitation. I bet you will never\ndisappointed.\n\n", "A bang on deal  \n7199rs for 32 gb version-July 2017 manufactured made in INDIA  \nSuperb rich feel  \nSlim can b Felt.  \nUpdate to 7.0 N and emui 5.0 rcvd when sim inserted  \n  \nWorking smooth  \nCharging is also not fast but.. Good speed..  \nBattery will last a day on moderate to more than moderate..  \nVery heavy usage may nid charger till evening  \n  \nBack Dual Camera is mind blowing..  \nAnd even front is dam clear  \nU wont get a camera in this price.  \nN fast shutter  \nwith many camera modes.  \nEven u cn buy 64 gb variant.if u nid more memory  \nU wont regret  \nForget MI note 4 in camera and UI feel...  \nCons:  \nNo front flash  \nSlippery back. - do buy a back cover  \nDnt expect fast charge as this mob was launched 1 year back..  \nThnx amazon..\n\n", "Thank u for this mobile. Amazon and green mobiles seller.  \n  \nA genuine review.E at it or swallow it , it's up to you...  \n  \nI m not putting the common issues and cons.  \n  \nOnly cons, doesn't mean that there are no pros.. it's a pretty good phone .but\nonly mentioning the faults...  \n1)- This phone software is not that advamced it only Chinese basic\nsoftware.not happy with user interface.  \n  \n2:: The phone internet doesn't works when u are making call , a small Damru\nbusy sign comes when any calls come or it changes from 4G sign to 2 G sign\nmeans during call u can't access the internet for any purpose whatsoever:\neg:-google or any internet.  \n  \n3:- Sound is very very low , when u keep in your pocket and u r outside u are\ngoing to miss the call.as many times it is not audible and vibration is also\nlowest.  \n  \n4:- Battery is OK types not extraordinary I am a 4 G power packed user it get\n30 percent done in 1 hour to 2 hour ...  \n  \n5:- It's a only rumour to increase sales that they are providing NOUGAT UPDATE\nAND EMUI 5, TOtal wrong statement I tried but updater says it's updated\nversion marshmallow , . So got it and understood that is a gimmick for sales.  \n  \nPeople and friends don't take me wrong I m not complaining , but a a daily\nuser I am pointing out the flaws which a HUAWAIE MULTI MILLIONAIRE COMPANY CAN\nTAKE CARE ITS NOT AM ASKI G GOLD OR PLATINUM , THANKS FOR MAKING THIS PHONE\nBUT PLS REVEIW MY MENTIONED REVIEWS....  \n  \nLet this reviews be published by AMAZON...  \n  \nRGDS  \nCUSTOMER.\n\n", "Hello All,  \n  \nToday i received the Honor 6X from Amazon, the services is ok. After spending\n2 hours on new phone; installing all related Apps, gaming and check the\ndifferent option which comes with this phone, i One of the mazor drawback i\nfound with this model that the SIM cards. I surprised to see that only one sim\nwe will use as 4 G and unacceptable this is the 2nd SIM is only 2G.........YES\nguys 2nd SIM is ONLY 2G.  \n  \nWe can use one sim as 4G one time the by default the 2nd move to 2G. I will\ngive this phone back to Amazon soon after 2 4 days more to use.  \nI am sharing screen shot below.\n\n", "I have purchased this product 12 days before see the best review  \nThe Honor 6X looks like a slightly smaller version of the Huawei Mate 9. It’s\ngot a metal back, plastic top and bottom edges, a dual camera in vertical\norientation and a fingerprint sensor on the back. The front is plain and all\nglass. It’s a simple, attractive design that’s more rounded and smoother than\nits predecessor, the 5X.  \n  \nIt’s well made, with very little flex in the body. At 8.2mm thick the 6X is\nthe same thickness as the 5X, but thinner by 1.6mm than the Moto G4 Plus. The\n6X is also shorter by 4mm than the 5X, but whether you could tell that by\nlooking at them is debatable.  \n  \nIt weighs 162g, which is actually heavier than the 158g 5X and the 155g Moto\nG4 Plus, but the curved back and rounded edges make it feel a lot nicer in the\nhand. It feels reassuringly heavy with good balance rather than being a lump.  \n  \nThe 5.5in 1080p LCD screen is very good for a smartphone costing under £250,\nand is improved over the 5X, although it doesn’t quite match up to the likes\nof Apple’s iPhone or Samsung’s AMOLED displays in its S range. It looks\nrelatively crisp, clear and colourful, with wide viewing angles. The included\nscreen protector is useful, but sort of ruins the smooth glass curve down to\nthe smartphone’s edges.  \n  \nSpecifications  \nScreen: 5.5in 1080 HD LCD (403ppi)  \nProcessor: octa-core Huawei Kirin 655  \nRAM: 3GB of RAM  \nStorage: 32GB + microSD  \nOperating system: EMUI 4.1 based on Android 6 Marshmallow  \nCamera: 12MP+2MP dual rear camera, 8MP front-facing camera  \nConnectivity: LTE, Wi-Fi, Bluetooth 4.1, GPS, dual-Sim  \nDimensions: 150.9 x 76.2 x 8.2mm  \nWeight: 162g  \nGood battery life  \nThe Honor 6X has no USB-C, only a microUSB.  \nFacebook Twitter Pinterest  \nThe Honor 6X has no USB-C, only a microUSB. Photograph: Samuel Gibbs for the\nGuardian  \nThe Honor 6X has Huawei’s own processor, the Kirin 655, which handled games\nand apps with aplomb. The in graphically-rich Real Racing 3, for instance,\ngameplay was buttery smooth and the 6X only got slightly warm while playing.\nIt was responsive and snappy throughout normal Android operations and in no\nway felt like anything other than a premium device in operation.  \n  \nBattery life was also very good. Using it as my primary device, even with the\nFacebook app installed, and receiving hundreds of push notifications, emails\nand messages, as well as browsing the web and using apps for around three\nhours, I would finish the day with about half the battery left. The next\nmorning it would only have dropped about 3% battery overnight and would last\nuntil evening.  \n  \nMost users will get somewhere between 1.5 days and well over two days of use\nbetween charges, more if you leave it alone for long periods as Huawei’s app\ncontrol prolongs standby time immeasurably compared to most other Android\nMarshmallow devices.  \n  \nIt also charges a lot faster than the 5X, which means when it does run out it\ntakes just over an hour rather than a good two to reach 100%.  \n  \nThe 6X also has dual-Sim support, for using two numbers or plans at the same\ntime with the same phone, but the second Sim slot also doubles as a microSD\ncard slot for adding more storage, which means it’s either or but not both.  \n  \nThe Honor 6X has a microUSB port, not the new USB-C port for charging, which\nis disappointing. It might be helpful in the short term to be able to use your\nexisting microUSB cables, but soon almost everything will use USB-C and the\nHonor 6X will be the odd one out.  \n  \nOld Emotion UI  \nEmotion UI is Huawei’s modified version of Android, and while other Huawei\ndevices such as the Mate 9 have EMUI5, the Honor 6X has the older 4.1.  \nFacebook Twitter Pinterest  \nEmotion UI is Huawei’s modified version of Android, and while other Huawei\ndevices such as the Mate 9 have EMUI5, the Honor 6X has the older 4.1.\nPhotograph: Samuel Gibbs for the Guardian  \nIf there’s one weakness to the Honor 6X, it’s the software. It has an old\nversion of Android 6 Marshmallow, not the current Android 7 Nougat, which for\na new smartphone going on sale over four months after Nougat was released is\npretty poor.  \n  \nAt the same time Huawei makes modifications to the basic Android experience\nwhich are a mixed bag. Some tweaks such as aggressive control of background\napplications and notifications when they’re draining your battery are good.  \n  \nThe removal of the app drawer in favour of every app installed having to be on\nthe home screen is not. Some people like Huawei’s so-called Emotion UI - EMUI\n4.1 in this case - but many do not.  \n  \nEMUI 5, which the Honor 6X is due to get relatively soon, is a big step up,\nbut for now it’s stuck with the same version of EMUI as the Honor 8 and Huawei\nP9.  \n  \nFor more information on EMUI 4.1, please see the Huawei P9 review.  \n  \nDual camera  \nThe camera on the Honor 6X works well even in low light.  \nFacebook Twitter Pinterest  \nThe camera on the Honor 6X works well even in low light. Photograph: Samuel\nGibbs for the Guardian  \nThe dual camera on the back produces really quite good images, with accurate\ncolour and a solid amount of detail in all conditions short of really poor\nlight. The 12-megapixel sensor captures the images and the auxiliary\n2-megapixel sensor below it captures depth information. Using the two, with a\nspecial wide-aperture mode, you can take a variable aperture photo for various\nblurring effects, but also refocus the picture after the fact.  \n  \nThe HDR mode is not built into the main shooting mode, and while it is easily\none of the best cameras for the price, it won’t trouble the best there is\navailable on a smartphone for sheer image quality.  \n  \nThe 8-megapixel front-facing selfie camera is fixed focus, which eliminates\nout-of-focus shots, but also means you’re unlikely to get anything with a\npleasing out-of-focus background. Nevertheless, it captures a really good\namount of detail in photos, even in poor artificial lighting conditions, and\nhas enough beauty modes to satisfy all but the most self-obsessed.  \n  \nObservations  \nThe fingerprint scanner on the back of the Honor 6X is very good.  \nFacebook Twitter Pinterest  \nThe fingerprint scanner on the back of the Honor 6X is very good. Photograph:\nSamuel Gibbs for the Guardian  \nThe fingerprint sensor is very fast and very accurate  \nThe fingerprint scanner can be used to swipe through photos or pull down the\nnotification shade  \nCall quality was good, and reception and data speeds were excellent  \nSome versions of the Honor 6X, including the India variant, do not have NFC\nand therefore no access to Android Pay and on-touch pairing\n\n", "\"Reviewing after 21days\" Trying to keep the review short with no\ncomplications.  \n  \nFirstly I would like to tell if you are a camera freak you have to buy this\nbeast its really compact and easy to use and well I have attached some\npictures which I have clicked using this phone.  \n  \nBATTERY- Battery is good but if you use continuously you might have to charge\ndaily otherwise it would last 2 days  \n  \nCAMERA- Awesome camera as it as dual camera . To be freak I really didn't like\nthe depth effect as if we are editing it in a cheap blurring app. And rest of\nthe camera is cool with do many features. But recording in slowmotion\ndecreases the resolution which is quite disappointing.  \n  \nLOOKS- It is good but its not upto the mark when compared to xiaomi Redmi note\n5 which comes with the same price range.  \n  \nPERFORMANCE- While coming to performance its not bad and at the same time not\ngreat but okay maybe sometimes it lags when you pay high end and online games\nwhich exceeds 2gb. I really don't play games. But you can manage  \n  \nSTORAGE- It as a whooping 64 gigabyte in which you get along 49gb to access,\nwhich is great thumbs up for this!  \n  \nRAM-It as 4gb ram in which you get song 2.5gb free works well  \n  \nOVERALL- Great phone under 10k if you are looking for a budget phone with good\nspecifications. I would recommend this to everyone who loves clicking pictures\nand which as a huge storage. Guys go for it\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 March 2017", "on 2 May 2017", "on 7 February 2017", "on 7 July 2017", "on 21 July 2017", "on 25 January 2018", "on 18 May 2017", "on 6 February 2017", "on 10 March 2017", "on 18 March 2018"], "reviewer": ["Raghu", "Vishnu Menon", "C. PANDYA", "Amit Chakraborty", "raghav", "Rinoy", "ABHISHEK PAL", "Ravi Uttam", "Monty", "Rahul.R"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Honor next budget friendly phone. How does is it compare to the 5x?", "Best at its range", "Thanks to Honor and Huawei for this amazing mobile. I have described about its working.", "Premium dual camera smartphone priced at one third of an iPhone", "Give me your reply or else I will return your item", "great product", "Simply Awesome", "Beast at its best", "Good performing phone in the range with specs", "The Super Juju Phone 😆"], "review": ["Honor 5x was the first true “budget” smart phone. Metal design and fingerprint\nsensor where rarely seen on any phone with close price tag at that time, are\nbecoming more and more standard now. That being said that device had some\nshortfalls. The performance with the snapdragon was lacking under pressure and\nthe EMUI android skin is not everybody’s cup of tea. Today we look at the true\nsuccessor of the Honor 5x with similar price tag. How did the devices rank\nagainst each other?  \n  \nUn-boxing and accessories  \nPretty standard boxes with nothing fancy for both. Accessories much easier to\nfind for 5x but 6x is just launched so I am sure it will catch up. Not much to\ntalk about here.  \n  \nDesign  \nBoth are gorgeous. I had the gold Honor 5x and now compared to the gray Honor\n6x, they both look way much more premium than their price tag.You could easily\nmistake them for a ₹40,000 phone. That being said the Honor 6x is more round\naround the edges, has more mate finish on the back (both has aluminum body)\nand feels more comfortable to hold. Honor did improve the design but not much.\nHonor 6x still is marginally better.  \n  \nProcessor, RAM and performance  \nHonor 5x had the more widely known Snapdragon 617, while Honor opted for the\nin house Kirin 655. Honor 5x had 2 GB of RAM and 6x has 3 GB (in USA anyway).\nOn paper, the Kirin outperforms the Snapdragon (it is actually more in line\nwith Snapdragon 625-650). This is confirmed by multiple benchmark tests\nalthough I will not bore you with the details (easily obtainable by googling\nboth processors). Kirin also seems more power efficient thanks to the more\nsemiconductor size (28 nm vs 16 nm) which should translate into more less heat\ngeneration as well. How did this translate into real life performance? Both\ndevices perform well for everyday use. You will notice a slight hiccups here\nand there for the honor 5x particularly when opening apps (Google maps seems\nto take few seconds) and this becomes more prominent when you install more\napps (I had 100+ apps installed). The 6x seems to handle this much better. The\nlag is almost non-existent and apps open up quickly (even google maps! I hated\nthose extra seconds of waiting on 5x when checking traffic in the morning\nbefore I head to work – no more with 6x!). Is it the new processor? Is the\nextra RAM? Being an in house chipset optimized more to work with the user\ninterface? Or is it simply that devices become slower with time and the 6x\nwill follow lead? Could be any of those, but for the time being I have to go\nwith the 6x as a winner!  \nOne last word: my only concern regarding the 6x is the GPU (which handles the\ndisplay and 3d part, gaming mostly). The GPU on the 5x is Adreno 405 – no\nmatch for much better GPUs in today’s flagships but performs OK and tried in\nand out. The Mali T830MP2 is not as much. They both seem to handle things\ncomparably now but will see how the Mali handles games released a year or two\nfrom now.  \n  \nScreen  \nBoth are gorgeous. Is this the best screen around? No. but for practical\npurposes both did great with a small edge for the 6x, colors seems more\naccurate. However, for the price range they may be the best you can get and it\nlooks amazing for watching a movie or displaying pictures. Given the slightly\nhigher price tag for he 6x, I would say this is a tie.  \n  \nCamera  \nBoth perform adequately. Both are poor in low light situations. Both will take\nOK pictures. Did the two lens format in the 6x make a huge difference? In my\npersonal opinion, no. The second Camera is not a monochrome camera like you\nsee in pricier phones, and mostly functions to give that nice background\nblurring but not much more. This seems odd as the two lens format seems to be\na selling point to Honor but the phone has more to offer anyway. This is a\ntie.  \n  \nSoftware  \nThis is where it gets messy. You will always hear bad things about EMUI. Let\nme get out of the way: It is not as bad as people make it look like. It is\njust different. It is somewhere in the middle of Android and iPhone and I\nthink it took some nice features from both (I like that you can search for\napps simply by swiping the home screen down like you can do on iOS). You still\nget the customizations of android, you get the widgets and you get the ability\nto run 3rd party launcher (Nova launcher seemed to make my honor 5x faster).\nBut it is not stock android. If you like android as it is, do not go for this\none. If you don’t mind Honor tweaks then I think you will do fine with both.\nFor what it is worth, I think the EMUI is one of the best android skins to\nprevent battery drains – it seems well optimized.  \nAs far as comparing the two devices: while it is disappointing that Honor 6x\nlaunched with EMUI 4 on android M, we are promised an update to Android N with\nEMUI within weeks. Honor kept their word re updating the 5x from android 5 to\n6 so hopefully they will keep their track record.  \nThis is also a tie.  \n  \nBattery  \nHonor 5x best selling point for me was the battery. No, it will not last 2\ndays, 3 days or longer. No you will not get 10 hours of screen on time. But\nthat is not what I am looking for in a phone. I am looking for a phone that\ncan give me few hours (3-5 at least of screen on time) to check my emails and\nbrowse internet, may be the occasional game or two, and not drain itself to\ndeath when I am not using it. Basically I want a phone I can use moderately\nwith no need to charge mid day. You would think this is easy to get but to me\nit was not. I tried several phones at this price range and higher since my\nnexus 4 died. I tried Lg g2, xperia z1 and z2, nexus 6p (yes), note 4 and Axon\n7. They all had one issue or the other. My biggest problem that I do not get\ngood reception in my work area where I spend several hours a day and this\nseems to suck the life out of every battery I tried. My phone would go from\n100 in the morning to 40 or so while not being used but rarely. Not with Honor\n5x. I finally would be able to go home with 50 – 60% + when I get home with\nmoderate usage and 2-3 hours screen on time. It may be the software or the way\nhonor handles the bad reception but that was why I stuck with the 5x for a\nyear. Honor 6x seems to follow lead as well and I have no issues using it for\n2 days with light use. It also lacks true quick charging but it charged to\n100% in about two hours. At the price range I really do not care about the\nextra 30 min it seems to take when compared to, say, Axon 7 which took me\naround an hour and a half to fully charge. So far both devices perform well. A\nslight edge for honor 6x.  \n  \nMiscellaneous  \nThey both have fingerprint scanner. For all intents and purposes is it\nexcellent and it does not get much better than this. I cannot remember last\ntime I had to try more than once to open the device. It works while screen is\noff (unlike older Samsung models where screen had to be turned on manually\nfirst). The honor 6x sensor is faster than the 5x  \nBoth are fully compatible with T mobile and AT and T. LTE is excellent: I get\naround 10-15 mg download speed in a major metro area. It does have band 12 on\nt mobile  \nBoth have double sim, the second sim doubles as an SD card slot in both  \n6x is reported to have an IR port but I am unable to get it to work yet! no\nbuilt in remote control app.  \nBoth have the much more available USB 2 for a charger. While this may become\nproblematic years from now for the time being, to me, this an advantage. You\ncan use any old android charger with no need for adapters  \n  \nVerdict  \nThis is an excellent phone. I am really happy that so called mid-range phones\nare getting better and better each year. It will not disappoint you and will\nperform more than adequately for everyday use and then some more. After few\nmore days of use the much better battery life, design and performance easily\njustifies the price difference. Good work Huawei!\n\n", "I was using honor 4x before this. With that satisfying is why I went for\nHonor6x. Whatever I expected on this product.. Be it camera, screen clarity,\nbattery, UI..... Everything was great. I would not compare this with other\nexpensive Android phones in market. But on its range, I would suggest people\nto go for this. Dual camera & finger print scanner were really good. Have\nattached few photo that I first tested..\n\n", "I love honor so so so much.. Honor is my love. I m a hardcore fan of Huawei\nand honor. I purchased honor holy and then I was amazed with its speciality.\nThen I unfortunately bought redmi Note4 in between but disappointed with its\nusage. Then opted this mobile which is honor 6x. It fulfilled all my\nexpectations and beyond my expectations too. It has great things which other\nmobiles dont have. It does things which latest mobiles fails to do. Even\nthough I have dropped it several times it didnt break. I dropped my phone from\na running bus, trust me Still worked awesome and no scratch too. It has so\nmany specifications really u will enjoy when u use it. Camera is good. It has\nmany options too. U can also have running video at the top to watch and use ur\nmobile simultaneously. It never hangs even if u use more than half space of\ninternal memory. Redmi mobiles and Samsungs hangs a lot. This phone doesnt\nheat up too. It has WiFi and wifi bridge too and another coolest option is\nwhen u shake ur mobile the wallpaper display will change automatically and it\nalso contains voice command calls too which means it detects ur voice and\ncalls that particular person. U can also change the color of the display And\nits size too. This mobile gives so many inbuilt applications to enjoy such as\nmirror, campus,health check and all UC apps. If u buy this mobile u will\nsurely enjoy. What I have said is very little. There is lot more to amuse us.\nThanks for those who read this.I have also attached few pictures which I room\nfrom this honor 6x mobile.\n\n", "PROS:  \n  \nHigh quality design, fit, and finish.  \nExtremely low price.  \nMicroSD expansion card.  \nLong battery life.  \nLoud mono speaker.  \n  \nCONS:  \n  \nNo NFC for wireless payments  \nNo water resistance  \n  \nWhile I personally tend to spend $800 or more on flagship phones, I thoroughly\nenjoyed using the $250 Honor 6X and think many people will be perfectly\nsatisfied with a phone priced a third of today's high end smartphones from\nApple, Google, and Samsung.There are some compromises that are made at this\nprice, but the masses may never even notice them. The pros far outweigh the\ncons and when you realize the Honor 6X is priced at just $250 you may even\npick one up for a friend.  \n  \nSPECIFICATIONS:  \n  \nProcessor: HiSilicon Kirin 655 octa-core.  \nDisplay: 5.5 inch 1920 x 1080 pixels resolution IPS LCD, 403 ppi.  \nOperating system: Emotion UI 4.1 built on Android 6.0 Marshmallow.  \nRAM: 3 GB.  \nStorage: 32 GB internal storage with microSD storage card.  \nCameras: 12 megapixel and 2 megapixel dual rear cameras. 8 megapixel front\nfacing camera.  \nWireless technology: FM radio, 802.11 b/g/n WiFi, Bluetooth 4.1.  \nBattery: 3,340 mAh battery with fast charging technology.  \nDimensions: 150.9 x 76.2 x 8.2 mm and 162 grams.  \n  \nHuawei stated that the Honor 6X should get the Android 7.0 and EMUI 5.x\nupgrade in the first half of this year. The one missing basic specification is\nNFC so you will not be able to use Android Pay for any wireless payments with\nthe Honor 6X.  \n  \nAs we get ready for the first pitch of Major League Baseball, it's nice to see\na FM radio on this device that will allow me to listen to the Mariners all\nseason long.  \n  \nHARDWARE:  \n  \nHuawei builds gorgeous hardware and their typical design language that\nincludes a brushed aluminum shell, snappy rear fingerprint scanner, curved\nglass edges, and rock solid construction is present here on the Honor 6X.The\nHonor 6X has a large 5.5 inch 1080p LCD display that looks great with vibrant\ncolors and good viewing angles. Honor implemented curved metal back sides so\nthat the Honor 6X rests very comfortably in your hand and presents a very\nclean appearance.  \n  \nThe cameras work well with the dual camera setup supporting bokeh effects like\nwe see on higher end devices like the Honor 8, P9, and Mate 9. You usually end\nup with limited camera functionality at this price, but the Honor 6X offers a\nton of modes and settings to give you the flagship camera experience at a low\nprice.  \n  \nYou can expand your storage with a microSD card. The mono speaker blows away\nwhat we saw on the low cost Moto devices and lets you enjoy music or make\nspeakerphone calls comfortably.Honor advertises a two day battery life and\neven as a fairly heavy smartphone user I am almost able to go a full two days.\nWe often see claims of multi-day battery, but I tend to kill a smartphone in a\nday. That just isn't the case with the Honor 6X and the 1080p display, Kirin\n655 processor, and large 3,340 mAh battery proves to keep you going through at\nleast a day or two.  \n  \nSOFTWARE:  \n  \nThe Honor 6X currently runs EMUI 4.1 on top of Android 6 Marshmallow. This\ninterface is fine, but the upgrade to EMUI 5 and Android Nougat will\ndefinitely be a welcome addition. Given that the price is $250, I think\nconsumers can enjoy the current version of the software without complaint.  \n  \nThis is sold as a GSM unlocked phone so it is free of carrier bloatware. There\nare a few Honor apps, but you don't have to use them and they don't slow down\nthe phone at all.  \n  \nThe Honor 6X is quite zippy and I never experienced any lag in my daily use. I\npersonally enjoy using the image editing tools found in the Gallery app while\nthe available settings let me easily customize the device to my specific\npreferences.  \n  \nPRICING AND COMPETITION:  \n  \nFlagship smartphones are priced at $700 to nearly $1,000, but over the past\ncouple of years we have seen lots of competition in the $400 price range. The\nHonor 6X is even more competitive at a low $250 price.  \n  \nLooking across the market for phones in this $250 range, we see the\noutstanding Moto G4 Play at $150 and Moto G4 and G4 Plus at $230 and $300.\nThese Moto phones are an outstanding value, but the fit and finish, rear\nfingerprint scanner, and dual camera of the Honor 6X are a bit more\ncompelling.  \n  \nDAILY USAGE EXPERIENCES AND CONCLUSIONS:  \n  \nWhile using the Honor 6X as my daily driver, I completely forgot it was priced\nat just $250. It feels like a much more expensive phone and performs at a\nlevel competitive with those at $500 or more.  \n  \nI'm a fan of the 2.5D curved glass on displays and this combined with the\ncurved back metal edges make the Honor 6X a real joy to hold in your hand. It\nhas a top headphone jack and a great sounding bottom mono speaker that I used\nto enjoy my podcasts and music.  \n  \nAt the end of my very long work day, I looked down at the remaining battery\ncapacity and saw the number 67. I couldn't believe that the phone had lasted\nthat long without being charged and was going to take me into the next day.\nMost of my phones are in the 20s or 30s at the end of my long work days.  \n  \nDual cameras from Honor and Huawei offer some fun effects and once you spend\nthe time to learn some of the different modes you will come to really enjoy\nusing your phone for photography. You can get creative with the camera and the\nimage editing software too.  \n  \nThe Honor 6X is an outstanding Android smartphone and is tough to beat at the\nlow $250 price. If I didn't write about phones for a job, I think I could\nhonestly do all I needed with the Honor 6X.\n\n", "U said this box contains 1 handset, 1 travel charger, 1 user manual, 1 data\ncable, 1 internal battery, 1 warranty card. But I didn't get my head phones\nand data cable . I want my head phones now.. what is Ur reply now\n\n", "Hi guys I am writing this review after 1 day usage and I am realy pleased to\nsay that this phone had got nougat and emui 5 update everything is good about\nthis phone till now expect if I play heavy game like asphalt 8 in highest\ngraphic setting then I found some lag in it.new emui update is good.I bought 4\ngb ram varient at 12999 and at this price this phone is best if you want good\ncamera.and for those who can adjust with average camera and want very good\ngaming performance then go for redmi note 4 .general day to day performance is\nvery good for honor 6x\n\n", "Simply awesome mobile and I cant stop fancying about it even for a single day.\nIt has every single thing what any one can look for in a mobile and Back\ncamera quality even some time exceeds HIGH END DSLR Cameras too. At the price\nof 11k its performance it similar to 40k Mobiles. I am using it for 4 months\nand not for a single second I felt its performance is down.  \nPros  \n1\\. Camera - Crystal clear image which does not get blur even zooming into  \n2\\. Speed - Every things is done within few micro seconds  \n3\\. Battery Life - almost 2 days with good usage  \n4\\. GUI - Super ease to use  \n5\\. Almost negligible heating even using mobile for long hrs(except GPS Map\nusage)  \n  \nCons  \n1\\. Speaker - Although its produces good sound, but its just fine  \n2\\. Front Camera - A bit lower side as compared to front camera  \n3\\. Dual sim or Memory card - we cant use both at a time\n\n", "Huawei Honor 6X is packed in a beautiful box of sky blue color. The box has\nits travel charger, data cable moreover the warranty card,user manual and sim\nejector pin is also present in the box. Now I'll talk about the each aspects\nof the device:  \nDesign  \n1) it is a slim and sleek device with the approx weight of 162 grams although\nit contains 3340 mAh non -removable battery.  \n2)The front screen is 5.5 inches which has ear piece, front camera and LED\nnotification light at its top.  \n3)Edges are packed with connectivity ports because it has fixed back cover.\nOne edge of has volume keys and power button while other one has SIM jacket.\nTop side of has mic and 3.5mm audio jack while down side has microUSB\nconnector version 2.0.  \nMemory  \nIt comes in two variants 32&64gb models respectively.The 3GB RAM is also a\nperfect choice as I have tested it in every section and got not delays and\nlags.  \n2)1.8 GB is available on ideal conditions.  \n  \nCamera  \nThe interface of camera is very easy to use and by swiping to the left side it\ntakes you to the general camera settings. Swiping right it will take you to\nits main mode settings which are beauty mode, night shot, manual mode and\nscanning documents.  \n2)The results are very brilliant because it has fast focus and captures very\ncatchy and impressive images.  \nFront camera  \nFront camera of Huawei Honor 6X has 8MP lens with screen flash light.Beauty\nmode does a wonderful job as it has adjustable options of brightness and\nsoftness.  \nBattery Performance  \nIt has a battery of Li-ion which is 3340 mAh and it is present inside the\nfixed back cover of device. The battery can easily last up to 1 day if you you\nuse your device heavily.  \nInterface  \nIt runs android version 6.0 (Marshmallow) with the interface of Emotion UI\n4.1.  \nMany bloatware applications are already installed on the device but you can\nuninstall them.Themes application is also available via which we can change\nthe look.eye mode is also present.  \nAntutu Benchmark  \nI have tested it and it has scored 55987 points which is very satisfactory.  \nConclusion:  \nHuawei Honor 6X is first mid-range smartphone with dual back camera lenses of\n12MP and 2MP. It has 2.1 GHz quad-core processor with 32GB ROM and 3GB RAM and\nmany other features. With all these extra oridnary features Huawei Honor 6X\ncan easily compete with any mid-range device.\n\n", "Hi,  \nHonor 6x 64 GB i got this phone from amazon with a best price of 9999. 64 gb\nwith 4 gb RAM with in the price range Honor 6x is the best phone.  \n1 Body and Design : good built quality and design is also great but shape is a\ncurved shape with a smooth surface so it will be chance to fall down from\nhand.  \n  \n2\\. Sound : sound quality is not great with compared to other phone just ok\nquality.  \n  \n3\\. Memmory : 4GB RAM working well 2.5 GB RAM remaining afer working with some\napplications.  \n50 GB of internal memmory after os activation.  \n  \n4.Battery: im getting a battery backup of one day with full time mobile data\nnetwork.  \n  \n5\\. Camera: Dual camera working well but DSLR blur wonking not great because\nimage blur not giving an original feel. And it has a good selfie camera. Also\nits a chance to getting scratch on back camera because of its possitioning.  \n  \n6.in the box : honor 6x 64 GB, charger adapter, USB cable, user manual and\nscreen protection guard.  \n(There is No Head phone offering from Honor)  \n  \nFinger print scanner working well  \n  \nOver all honor 6x offers a good performance and giving a good specificatons.  \nI felt only one drawback little heating while gaming online not as much as\nheating compared to other phones with in the price range.\n\n", "updated to nougat two days back..havent faced even a single tiny problem..but\nthis great indian sale just broke my heart..bought it for 13000 back in\nfebruary and now they have slashed the price straight by rs2000 😂😂😭😭😭😭😭😭\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 March 2017", "on 30 March 2017", "on 26 October 2017", "on 10 March 2017", "on 5 June 2017", "on 16 May 2017", "on 26 June 2017", "on 28 February 2017", "on 26 January 2018", "on 11 May 2017"], "reviewer": ["Baljeetsingh Chhabra", "Jaavuuu", "RAHIMUNNISSA", "Navneet Nishant", "Amazon Customer", "Sparsh", "Pritish", "Gaurav Thapliyal", "Alex", "Tanay Malvi"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["HONEST AND DEEP REVIEW - Read Before you Buy", "One Star", "Calling on Jio number is not possible", "Honor 6x does not support  video call", "**SHORT WHY TO BUY & WHY NOT TO BUY REVIEW WITH CONCLUSION**2017 REVIEW**BEST DUAL CAMERA PHONE BUT WITH 2 CONDITIONS**", "**CURRENTLY THE BEST CAMERA PHONE IN Rs.10999**FULL DETAILED REVIEW WITH DEAL MAKER & DEAL BREAKER POINTS**MAY 2017 REVIEW**", "4 Month Review - The Best and The Worst", "Layman's review ~7 Months usage", "Good phone for the price + Read comparison with other phones", "AVERAGE AT BEST"], "review": ["Hello friends  \nI am writing this reviews for Honor 6X (Inspired by GeekyRanjit Youtube\nChannel, watch the channel after this review). If you are considering to buy\nthis phone you must go through these following points to know the inside story\nof this phone and where it stands in front of its competitors. I have provided\npictures down below for better understanding and side by side relation to my\nreview. You can also see the camera comparison in the photographs.  \n  \nThis review will be a short and crispy quick comparison between it's biggest\ncompetitor i.e. Xiaomi Redmi Note 4.  \n  \n1\\. The build quality of both the phone is good, you can choose anyone\nregarding this point.  \nThe in-hand feel is almost comparative, but it's slightly better on Xiaomi\nRedmi note 4, due to its curved design integration from the previous model\nRedmi Note 3.  \n  \n2\\. They have almost same features, but the Redmi Note 4 has IR blaster, which\nis not present in Honor 6X. So buyers if you are considering to use your phone\nfor controlling any of your home appliances via a phone instead of remote,\nconsider Note 4.  \n  \n3\\. They have 1080 P i.e FULL HD screen quality, but If you are more into\nmovies and videos all the time, consider Honor 6X as it feels much better,\nNote 4 has also good screen but inside, by side comparison, the Honor 6X wins.  \n  \n4\\. One Con both the device have is, you simply don't know what kind of glass\nprotection you get in these devices. As the screens are made by multiple\nmanufacturers.  \n  \n5\\. Cellular call quality was good on both the devices. Both the devices have\nnice cellular connectivity, and yes both support RELIANCE Jio, without any\nissues.  \n  \n6\\. Speakers on these devices are pretty good. Both the devices have single or\nmono speakers at the bottom, and both are pretty good and loud, but if you\nhave to pick one the speaker on the Redmi note 4 was louder.  \n  \n7\\. Now coming to the audio output via a headphone or microphone, both were\ngood but Note 4 was slightly better, the amplification was good and base and\ndepth were better in Redmi Note 4  \nSo if Music is your highest criterion prefer choosing Redmi Note 4.  \n  \n8\\. Now coming to the camera, here things change completely, the Honor 6X has\nthe dual rear camera, whereas the Redmi Note 4 has a single camera at the\nback. The Honor 6X has definitely a better camera in comparison. In outdoors\nboth are almost similar but indoor the Honor 6X performs better.  \nEven the front facing Camera of Honor 6X is better than Redmi Note 4, the\ncamera is always where Redmi note series fails (generally).  \nAlso, the recorded videos are better by Honour 6X, as the sound recorded by\nRedmi Note 4 is tiny.  \n  \n9\\. Now coming to GAMING, the Redmi Note 4 completely steel's the show, the\nHonor 6X also played a lot of games, but when playing really heavy games it\nwas lagging sometimes, particularly with Asphalt 8 it lagged quite a bit,\nwhereas on Redmi Note 4 it played all the games easily without a lag, So of\nyou are a Gamer consider going with Redmi Note 4.  \n  \n10\\. Now coming to the fingerprint sensor, both have fingerprint sensor at the\nback, but it was a bit faster on Honor 6X.  \n  \n11\\. The battery on both the device is good, it will last you more than a day\non moderate usage.  \n  \n12\\. Now coming to screen on-time, the Honor 6X gives you around 6 - 6.5 hours\nof screen on time, whereas the Redmi note 4 gives you around 8 - 9.5 screen on\ntime, as it has a slightly bigger battery of 4100 mA. So if battery life is\nyour highest criterion better go with Redmi note 4.  \nNow coming to Charging time, the Honor 6X takes around 2 hours and 45 minutes\nto charge, whereas the Redmi Note 4 takes around 2 hours and 55 minutes\napproximately.  \n  \n13\\. One thing we will all hate is both simply do not support FAST CHARGING,\nAmazon claims that the Honor 6X has fast charging, but it simply doesn't\nsupport that.  \n  \n14\\. Now comparing to price the 3 GB variant of Honor 6X is of 13,000 and 32\nGB Redmi Note 4 is of 11,000.  \nSo if the price is the highest criterion the Redmi Note 4 is Rs 2000 cheaper.  \n  \nSo I think I was able to help someone and was able to clear some doubts and\ngive you quick insights of this product.  \n[...]  \nAs always  \nCompare before you buy, Enjoy.  \n  \n\\- Lokesh Karki\n\n", "I purchased Honor 6x on 12th April, 2017, but after one month of use the\nscreen was getting blurred from side and now screen blurred is increasing day\nby day. Also touch was not working properly.  \nWhat should I do ?  \nIs it cover-able under warranty ? and If yes then where is the service center\nin Gurgaon ?\n\n", "When you do call on Jio, call get auto disconnected in all honor 6x device.\n\n", "As I purchased this phone almost with huge 13000 rs. But I still not satisfied\nwith it because  \nIt's doesn't have video call option. If we spend that much amount then we want\nsatisfaction about phone. Amazon should explain each and every detail about\nfeature and draw back of the phone. So I felt cheated by the Amazon if they\ndoesn't show all the details abt phone\n\n", "\\---] I don't want to write a LONG-BOOKISH review. Read this review and you\nwill know ALL THE GOODS and BADS of this SMARTPHONE. This review has three\nparts ONLY! First, Why To Buy Honor 6X. Second, Why Not To Buy Honor 6X.\nThird, Conclusion and Final Rating.  \n  \n\\---] I GUARANTEE you these points are MORE THAN SUFFICIENT for you to KNOW\nwhether to buy Honor 6X or not. I REALLY THANK YOU for being smart a\nINTELLIGENT CUSTOMER as you are first RESEARCHING about the product and then\ntaking DECISION whether to BUY IT or LEAVE IT!  \n__________________________________________________________________________________________________________________  \nA) WHY TO BUY Honor 6X ::  \n  \n1\\. Huawei Honor 6X comes with battery of 3340 mAH which lasts up to 1-1.5\ndays with a single charge on NORMAL USAGE. For HEAVY USERS, battery will last\nfor NEARLY 1 Day with 5-10% battery left.  \n  \n2\\. The camera also works awesome with dual lens technology rear camera and\neven the front secondary camera also does great job to click pretty images.\nDUAL CAMERAS include 12MP sensor main shooting and another 2MP sensor for\ndepth of field.  \n  \n3\\. It has an OCTA CORE PROCESSOR made by Huawei which is ONE OF THE BEST\nPROCESSORS for this price range. It also has 3GB RAM which is MORE THAN\nSUFFICIENT according to me.  \n  \n4\\. It comes with 5.5 inch Full HD Capacitive Screen with 403 pixels per inch.\nThe screen is VERY GOOD in terms of QUALITY but NOT in terms of DURABILITY. I\nsaw a video in which a person did a SCRATCH TEST of the display and the\nresults for this phone were BELOW AVERAGE in terms of DURABILITY.  \n  \n5\\. It has Dual SIM 4G with VoLTE Support and runs Android 6.0 OS. The phone\nis REALLY SLIM and has a premium metallic finish body which looks quite GOOD.  \n  \n6\\. It comes with an REALLY FAST & ACCURATE Finger Print Sensor.  \n__________________________________________________________________________________________________________________  \nB) WHY NOT TO BUY Honor 6X ::  \n  \n1\\. It does not comes with gyroscope sensor. So, you cannot enjoy Virtual\nReality experience from this smartphone which can be a major drawback for some\npeople and have no significance for some other people. Thus, its up to you!  \n  \n2\\. This smartphone does not come with a IR BLASTER which comes with Xiaomi\nPhones. IR BLASTER allows you to remotely control electronics like T.V., A.C.,\netc.  \n  \n3\\. The DURABILITY of the display is BELOW AVERAGE. Therefore, you will have\nto put a TEMPERED GLASS on the screen to protect it.  \n__________________________________________________________________________________________________________________  \nC) CONCLUSION & FINAL RATING ::  \n  \nUnder Rs.13,000 Honor 6X is currently, the BEST DUAL CAMERA SMARTPHONE you can\nbuy if you are NOT into Virtual Reality and 32 GB internal memory is\nSUFFICIENT for you.  \n  \nFinal Rating = 9.12/10  \n__________________________________________________________________________________________________________________  \n\\---] Thank You VERY MUCH for reading this review. If you have ANY QUESTIONS,\nplease comment them below, you WILL SURELY get a REPLY from me, PROMISE!\n\n", "\\---] In my review, I have shared my DAY TO DAY EXPERIENCE of Honor 6X(32 GB).\nBelow you will find DEAL MAKER and DEAL BREAKER Sections, in case you do not\nwant to read the WHOLE review. That's too is SUFFICIENT to make a CORRECT\nCHOICE.  \n  \n\\---] Also, you can APPRECIATE my hard work in writing this review by pressing\nthe button given below(You know that button, don't you). The left one LOVES\nyou and is WAITING for your click. The right one HATES you, so why go there?\nAnd, YOU will have a GOOD DAY ahead, so DON'T WORRY(Really)!  \n_______________________________________________________________________________________________________________________  \nA) DEAL MAKER ::  \na) 12+2MP Dual Primary Camera  \nb) 5.5 inch IPS LCD FULL HD Screen  \nc) Finger Print Sensor  \nd) Choice of 3/4 GB of RAM  \ne) Qualcomm Quick Charging 2.0 Support  \nf) 2.0 + 1.7 Ghz Processor\n_______________________________________________________________________________________________________________________  \nB) DEAL BREAKER ::  \na) Built Quality- I saw a video where a person SCRATCH-TESTED the screen of\nthis mobile and the screen FAILED in it and got scratch at the Level-2 only\nwhere the average is Level-4. So, you will have to use a tempered glass to\nprotect the screen of Honor 6X.  \nb) No LED Flash for Selfies.  \n  \n(FULL REVIEW WITH CONCLUSION BELOW)  \n_______________________________________________________________________________________________________________________  \nA)FEATURES WHICH MATTERS AND NOT JUST SPECS SHEET ::  \n  \n(i) CAMERA-  \n  \n\\---] This mobile has a 8 Mega Pixel 77 degrees WIDE front facing camera\nWITHOUT LED FLASH. The front facing camera is ABOVE AVERAGE but due to NO LED\nflash for selfies, it CANNOT take good selfies at low lightning conditions.  \n  \n\\---] The DUAL PRIMARY CAMERA is a 12+2 Mega Pixel shutter. In terms of\nCamera, IT'S THE BEST CAMERA YOU CAN GET UNDER 11,000 INR. I think calling it\nBEST is enough and no more unnecessary lines are required to RECITE IT'S\nGLORY! 6X's camera is way ahead than that of it's COMPETITORS EXCEPT Coolpad\nCool 1 because Cool 1 also has Dual Cameras but it will cost you Rs.13999.  \n  \n\\---] So if you are a \"Camera Guy\" and your main concern is the PRIMARY camera\nof the phone, then I STRONGLY RECOMMEND you go with Honor's 6X. The camera can\nrecord FULL HD videos at 30 frames per second.  \n  \n\\---] There's also a AFTER FOCUS functionality in which you can change what\npart of image to focus and vice versa AFTER clicking the image so it is a\nvery-very USABLE FEATURE as now you don't have to worry about focusing things\nbefore capturing them.  \n  \nCAMERA RATING ::  \nPRIMARY CAMERA : 10/10  \nSECONDARY CAMERA: 8.5/10  \n_______________________________________________________________________________________________________________________  \n(ii) SCREEN-  \n  \n\\---] This device comes with a 5.5 inch FULL HD IPS display with 403 pixels\nper inch which is MORE THAN SUFFICIENT for GAMING AND DAILY USAGE and the\nscreen DOES NOT feel PIXELATED or LESS CRISPY at all.  \n  \n\\---] The SCREEN is IPS LCD and NOT AMOLED so colors are SLIGHTLY LESS\nsaturated & exposed as you might have seen in Samsung's Display. But\nconsidering the PRICE and its EFFECT on day to day usage, it is not much of a\nproblem!  \n  \nSCREEN RATING :: 9.2/10  \n_______________________________________________________________________________________________________________________  \n(iii) DESIGNING OF SOFTWARE AND PHONE-  \n  \n\\---] The phone looks VERY COOL AND ROYAL due to the dual cameras of 6X and\nthe metallic uni-body design. The design though is a matter of PERSONAL CHOICE\nso their is not much of reviewing it. The mobile weighs 162g and the phone is\nSLIM due to the use of latest technological equipment used in it.  \n  \n\\---] Coming to the SOFTWARE, I personally DO NOT love the Emotion UI 4.1 of\nthe Honor 6X but again, it differs from person to person and as it is an\nAndroid compatible mobile phone, you can CUSTOMIZE THE UI THE WAY YOU WANT TO\nand even replace the original UI completely. Any day.  \n  \nDESIGN RATING ::  \nAPPEARANCE : 9.5/10  \nSOFTWARE : 8.3/10  \n_______________________________________________________________________________________________________________________  \n(iv) BATTERY, SPEAKERS, VIRTUAL REALITY AND PERFORMANCE-  \n  \n\\---] This headset comes with a 3340 mAH BATTERY which can easily last 1 DAY\nif you are a HEAVY USER and Net Surfer. For NORMAL users like me, it lasts for\nan average of 1.5 DAYS EASILY with 10% Battery STILL LEFT! And Yes, it does\nsupport QUICK CHARGING. You have to BUY A QUICK CHARGER SEPARATELY.  \n  \n\\---] The SPEAKERS are NOT that great in bass but are CLEAR and LOUD. Even in\na price segment of Rs.20000, the quality of speakers in mobile phones is not\nthat great and so is the case with this piece also. It has 3.5 mm JACK and\nEARPHONES ARE INCLUDED IN THE BOX TOO which are not GREAT but GOOD.  \n  \n\\---] PERFORMANCE WISE, the phone NEVER HANGS OR LAGS when loading different-\ndifferent applications on daily basis and even IN MULTI TASKING or switching\nbetween HEAVY GAMES and APPS, IT DOES NOT LAG or HANG AT ALL because of the\n2.0 Ghz + 1.7 Ghz octa core processor. Performance wise, Honor 6X is the BEST\nin this price range, but SLIGHTLY less than the 4GB Version of REDMI NOTE 4,\nbut again, it COSTS MORE!  \n  \n\\---] It comes with a choice of 3GB RAM and choosing between 3GB/4GB RAM is\nagain a PERSONAL PREFERENCE and you should choose the amount of RAM after\noverlooking YOUR purpose of using the phone. It comes with 32GB internal\nmemory which CAN BE EXPANDED to 256 GB via micro SD card(Hybrid SIM Slot).  \n  \n\\---] It is a dual Nano SIM, dual standby phone(4G-4G) with VoLTE Support. It\nDOES HAVE A IR Blaster which works as a remote controller for many electronic\ndevices. It has FINGER PRINT UNLOCKING which is FAST.  \n  \nBATTERY RATING :: 9/10  \nSPEAKER RATING :: 8/10  \nPERFORMANCE RATING :: 9.4/10  \n_______________________________________________________________________________________________________________________  \n(v) UNIQUENESS-  \n  \n\\---] The availability of dual cameras at a price of Rs.10999 with a 2.0 + 1.7\nGhz processor is simply awesome!. Earlier, Coolpad Cool 1 was the cheap\nsmartphone to offer Dual Cameras but now, times changing and you get DUAL\nCAMERAS and an EXCELLENT PROCESSOR in just Rs.10999!  \n  \nUNIQUENESS RATING :: 10/10  \n_______________________________________________________________________________________________________________________B)\nCONCLUSION ::  \n  \n\\---] In MY OPINION, if you want to spend around Rs.11000 and want a camera\nwith BEST CAMERA, BUY HONOR 6X. But, if you are not OBSESSED with CAMERA\nQUALITY of the smartphone and want overall BEST PERFORMANCE, then go with\nREDMI NOTE 4.  \n  \n\\---] For Coolpad Cool 1, Coolpad Cool 1 is Rs.3000 EXPENSIVE plus does not\nhave a processor as good as that in Honor 6X. But, it has a tried and tested\nSnapdragon's Processor in it. So if you only want a Snapdragon's processor\nsmartphone, you can go with Coolpad Cool 1.  \n  \n\\---] I couldn't find anything wrong or something like that in the device\nwhich may become a problem in the future except for the fact that nowadays,\nall the manufactures's AFTER SALES SERVICE, save Samsung, Apple, One-\nPlus,etc., takes a time of about 15-20 days to RESOLVE the PROBLEM, if any.  \n  \nFINAL RATING :: 9.6/10  \n_______________________________________________________________________________________________________________________  \n\\---] Thank You for reading the review. Again, you can APPRECIATE my hard work\nof writing this review by pressing the button given below(You know that\nbutton, don't you). The left one LOVES you and is WAITING for your click. The\nright one HATES you, so why go there? And, YOU will have a GOOD DAY ahead, so\nDON'T WORRY(Really)!\n\n", "Update 5th October - The phone is going strong. Battery is still good. Despite\nthe fact that I am a very heavy user, it still lasts me full day - 24 hours,\neasily.  \nCamera after update is fantastic and that the phone will get Oreo update is\nMusic to ears. Great going, Huawei.  \n  \nUpdate 15th September - It is crazy but the phone keeps getting better and\nbetter. This is an amazing experience as compared to my experience with other\ncompanies - even much costlier ones. Huawei today provided a new Update that\nhas improved camera low light performance drastically and fixed bugs - if\nany!! I am still looking for other things that might have improved.  \nAlso, Huawei just promised an OREO update for Honor 6x. Way to go Huawei. This\nis the best phone in the market in price range due for the kind of support the\nproduct is getting from manufacturer. WishI could give 10 stars.  \n  \nUpdate 27th August - working awesome and battery is awesome. Nougat update has\nimproved the quality by many notches and phone is good to use. A recommended\nbuy and value for money. Dual WhatsApp feature is working great as well.  \n  \nUPDATE 28th July - Jio issue is resolved. I just got a software update for\nthis. So everything is Super - duper now. Rating from my side - 4.5  \n  \nFeel free to ask any questions after reading this review.  \nNow coming to specifics especially negatives-  \n1) Speakers - Phone speakers are just ok for media. Of course it is a Mono\nspeaker but does the job well. I hear Sufi a lot and songs sound nice. For\nheadphone output, you can download Ultimate Volume Booster or other apps.\nThese help.  \nThe real issue is if you take calls via phone speaker. That might not go well\nso much better to go for earphones with mic or a Bluetooth headset with mic.  \nSpeaker is the only negative part hence I gave 4 stars.  \n2) Only supports 2.4 GHz for WiFi but it doesn't matter because all routers\nsupport 2.4 GHz. Works perfectly fine for me. There is another functionality\ncalled WiFi+ that allows you to use your phone to form WiFi bridge in case\nother devices are having trouble connecting to WiFi.  \n3) Misses on Gyroscope due to which EIS - Electronic Image Stabilization is\nnot available for camera but very quick focus gets the job done. Videos are\ngreat but you need a Mobile tripod so that the shake can be reduced. This\ncould have impacted gaming but it seems Huawei has managed something as I did\nnot see any reviews impacting gaming much. I am not a game buff in any case so\ndoesn't matter to me at all - basically zero impact as compared to G5 plus\nthat misses on Compass sensor which is crucial to tell me the direction when I\nuse GPS especially Offline. Motorola - That was a big big miss.  \n4) Screen - Prone to scratch. Use a guard from Day 1. Good news is that phone\ncomes with screen guard in box.  \n5) Looks are good but phone structurally is not the best out there. Ensure\nthat you have a good case to protect the device and all will be fine. Case is\nabsolutely important otherwise things will go bad fast on even single bad\nfall. Phone does not look that way - looks great but I know this fact from\nintensive research.  \n6) Jio to Jio calls issue - This issue is real where Jio to Jio calls are not\nconnecting easily after Nougat update and Huawei Honor team is working to\nprovide an update for this issue - this has been officially confirmed. This is\na software flaw only and with company providing support, this should be\nresolved soon. Tentative date for fixing issue is 27th/28th July.  \n  \nNow coming to positives:  \n1) With Nougat update the Phone is much better than before. Twin apps\nfunctionality - Just like Xiaomi, there are two facebook and WhatsApp accounts\nyou can create and use for both SIMs  \n2) There are two basic themes and now with Nougat update homepages display is\navailable in basic choices. One choice is where all app icons are on pages -\nno app drawer and you can scroll pages. Another choice allows you to have an\napp drawer just like other phones.  \n2) Interface is much better and new additions are visible everywhere including\nCamera.  \n3) Camera - Camera is the best in this range - period. No focusing issues and\nthe pro mode is out of this world. You can control most of settings. Learn to\nuse pro mode and you will be taking pics that will put cameras on much\ncostlier devices to shame. Night shot is absolutely Awesome - just use a\nmobile tripod. You will be amazed how much light it can capture - how I wish\nat least EIS in this phone!  \n4) 4GB RAM is great, performance is flawless and phone has Excellent memory\nmanagement. Further, it gives you a lot of options as well such as background\napps you want to keep running or want to close if screen is locked etc.  \n5) I am a very heavy user of phone and Battery is absolutely excellent. It\nalmost touches 4000 MAH performance that my brother gets out of his Note 4\nthat is still waiting Nougat update. This is basically because of many battery\nmanagement functionalities Huawei has provided to users and also because of\nexcellent software to manage memory and screen.  \n6) 15 months of warranty with good service is icing on the cake as other\nmanufacturers offer only 12 months warranty.  \n7) New screen shot feature is awesome. In shortcuts bar (where you switch on\nWiFi, data etc.), Just click on screenshot icon and it takes perfect\nscreenshot. The bar closes and screenshot is taken. Screen recording is also\navailable.  \n8) Phone does not heat up even on extended periods of usage. Definitely a big\nplus.  \n9) Notifications - Don't like notifications of some apps? You can go to\nnotification panel/settings and bar these apps from showing notifications.  \n10) EMUI has an awesome feature. No need to search anything on phone. Just\nswipe down on home page screen in any blank part and a pop up appears that\nallows you to search apps, msgs, contacts etc from single place.  \n  \nAt price below 14000 for 64 GB storage and 4GB RAM, the phone is great and is\na value buy.\n\n", "I was using galaxy on7 8gb version and ran out of storage, so thought of\ngetting a 64gb phone. Coolpad was out of the scene as it had heating issues\nand battery issues. so left with redmi note 4 and Honor 6x, as i clicks around\n4000 photos a year, good camera is a must for me, along with poor flash sale,\ni was unable to get a redmi and finally bought Honor 6X 64Gb for a premium. I\nnever used any other brands other than samsung and old nokia. This is the\nfirst time i am using another brand.  \n  \nFirst Impressions:  \n  \nPackage: Just basic cardboard box which offers zero protection. Amazon should\nlook into this. Atleast a bubble wrap will be good.  \n  \nPhone: Phone looks good, though i felt like RN4 looks great in images, Honor\n6X also looks sleek and great in real life. Weight is also managed very well\nand lighter than my old samsung on7.  \n  \nDisplay: Display is also very good quality, People please dont compare it with\namoled displays. Also under sunlight, screen was excellent.  \n  \nSim slots: both are 4g sim slots but only one slot can be set to 4g at a time.\nIf you set 4g on first slot then second will be 2g and if second is set as\n4g,first one will be 2g.  \n  \nRam: Out of 4GB ram, almost 2.6gb ram is always free and ram management is\nexcellent.  \n  \nCPU: I dont play games on phone,so no comments on it. For day to day use, CPU\nis excellent and no lags at all.  \n  \nHappy to say that this phone supports 4k video playback using vlc without any\nissues. Zero lags. Didnt tried with stock video player.  \n  \nUI: UI is new for samsung users, Its lag free and feels very good,lots of\ncustomization options, though icons look a bit large which you can use 3rd\nparty launchers and solve this.so not a big deal.  \n  \nFingerprint Sensor: Fingerprint sensor and its features is excellent and very\nuseful. It detects very fast as mentioned by the manufacturer. Just a touch\nand its unlocked. Very Very Fast.  \n  \nSpeaker: Speaker volume is Average, Its not that low, but its not that loud\ntoo. Still you wont miss a call or something, not that low still its loud\nenough.  \n  \nFront Camera : I am completely satisfied with the 8MP front camera, its also\nexcellent.  \n  \nRear Camera: Rear camera is also great, Wide aperture mode at times looks way\ntoo artificial. still its great. Do have a look at the camera samples.  \n  \nStorage: we will get around 51.65GB available for storage.  \n  \nBuilt Quality: Saw a bend test video on youtube and i was very much worried,\nbut in my hand, i never felt like its too bad, build quality is very good and\nthe phone doesnt twist or bend easily, So dont worry about it. The cornering\nglass is not a scratch proof one, so always use a screen guard (this phone\ncomes with a company provided screen guard out of the box which is very good)\nor a tempered glass on the screen to keep it in good condition, I prefer a\ngood tempered glass. Also get a case for the phone to protect the camera bump\ntoo. I bought this case from a local shop here as there was not much options\non online stores as of now.  \n  \nHeating: Never felt any heating issues during use other than a bit warmth when\ncharging, which i dont care at all.  \n  \nCall Quality: Call quality is excellent and is a lot better when compared to\nmy old samsung, Very good call quality and speaker is loud enough and crispy\nclear sound too.  \n  \nSensors: Auto Brightness sensor works flawlessly and one of the best auto\nbrightness sensor out there.  \n  \nBattery and charging: Its performing very good,no battery draining issues,\nAfter getting the phone,battery was at 67% put the sim and started downloading\nand updating apps on RJio, alost about 1hrs and 15mins screen on and battery\nconsumed was around 12 to 13%.  \n  \nCharged to 100% at 7am ,turned on 4g rjio till night 9.30pm ,with screen on\ntime of 5.5hrs and temaining battery of 25%.great battery backup.it takes\n2.5hrs to charge it completely from 10% to 100%.  \n  \nAlso there is a protection mode for apps to prevent it from running when the\nscreen is off, which will not give you push messages until you turn on the\nscreen but it increases the battery backup to a great extend.  \n  \nHave a looks at the camera samples below and all those pics are taken at 8AM.\nDo comment if you have any doubts.  \n  \nAlso, Hi Suite comes with the phone when you plug it on to your pc, it will be\nshowed as a pendrive and you can simply double click on it and it will open a\nonline downloader, downloading size is only 25mb or so , you dont have to go\nto their site to download it every time. Its very simple and easy to use\nsuite.  \n  \nOverall am 100% satisfied with the phone.  \n  \nLatest Update after 7 months use, phone is still going great, no issues, solid\nperformer. great battery, even got better after latest update to emui 5.0.1.\n\n", "** First Impressions **  \n● The phone comes with Power Adapter, data cable and sim tool  \n● The phone in hand feels very premium, strong and sturdy. Its very\ncomfortable to hold as well. The phone is a bit heavy, but this adds on to the\npremium feel in hand. All the corners and edges are curved and smooth  \n● Its a full aluminium unibody design, with metal-finish plastic at the top\nand bottom. The body is brushed and doesn't take fingerprints. The front is\nall-glass and the side bezel is very thin, but the bottom bezel is quite\nlarge. Screen to Body ratio is more than 75 which is very good  \n● Power button & Volume buttons are on the right side and buttons are also\naluminium. There is the integrated 'two sim cards/ one sim card & a micro SD\ncard slot' on the left side, both supporting 4G LTE. The audio jack is on the\ntop and there is a mic as well there. The speaker grille, primary microphone\nand micro USB port is at the bottom. There is an infrared blaster on the top  \n● Two cameras, flash & fingerprint sensor are at the back and one camera is\nthere in the front  \n  \n** Honor 6X, Redmi Note 4, Moto G5 Plus & Cool 1 **  \n● Defintely, I find Honor 6X a good phone to own. But there are other phones\nthat is worth considering. I am trying to compare Honor 6X with Redmi Note 4,\nMoto G5 Plus and Coolpad Cool 1 that are closer to 6X in specifications and\nprice  \n● G5+ has got the smallest screen of 5.2 inches while all other phones have\n5.5 inch screen. G5+ has its body-to-screen ratio around 67% which is lowest\nand all other phones have got it more than 70% with Cool 1 having the ratio\naround 73%. Pixel density is the highest in G5+ with 424 ppi while other\nphones have it around 400 ppi  \n● Only G5+ has got Android Nougat while all other phones run of Marshmallow.\nThe advantage with G5+ is that the OS is very close to pure Android with\nalmost no bloatware  \n● All the phones have got good camera around 12MP or 13MP. 6X has a depth\nsensor in addition to the camera. This helps 6X to produce good portrait\nphotos will excellent bokeh effect. But when the overall performance of camera\nis considered, G5+ scores the best with good details, colour reproduction and\nsharpness. G5+ and Cool 1 can record 4K videos as well  \n● G5+ and Cool 1 supports dual band WiFi which is a big advantage if you live\nin an apartment with too many interfering WiFis. Note 4 and Cool 1 has\nInfrared Blaster which you may use to operate household devices with a remote\ncontrol. All the phones detect GPS and GLONASS signals while 6X, Note 4 and\nCool 1 can detect BeiDou signals in addition. This ensures those phones have\ngot more satellites to fix their geo position thus saving battery life if you\nare behind a building or under a tree. Fingerprint sensor is standard on all\nthe phones; G5+ has the sensor on the front while other have it on the back\nwhich is more convenient. Only Cool 1 has Type C USB port that enables\nsuperfast battery charging and quick data transfers. All batteries are non-\nremovable  \n● In speed and fluidity, Honor 6X has got noticeable lag when compared to\nCoolpad Cool 1, Redmi Note 4 and Moto G5 Plus. Cool1 has got Snapdragon 652,\nNote 4 and G5+ have got Snapdragon 625 while 6X has Kirin 655 under the hood.\nCool 1 is the best performing of these four due to the extra Cortex A72 cores\nof Snapdragon 652. Waiting time to load apps is clearly more in 6X than all\nother phones  \n● Antutu as well as Geekbench 4 benchmark scores rates 6X lower than Note 4\nand G5+ while Cool 1 got significantly higher scores. In Gaming Frame Rate\ntests as well using Gamebench, 6X scored significantly lower than the other\ntwo phones  \n● All these phones gives good battery life over a day easily. But in\ncomparison, G5+ and Note 4 lasted nearly 24 hours while 6X and Cool 1 needed a\nhalf an hour charging to make it to 24 hours  \n● Note 4 and G5+ are more or less similar with snappy & well-tuned performance\nand are fast. If you are willing to pay Rs.5000 more for an advanced camera,\nyou will not regret since G5+ is a well-balanced phone for that extra money.\nIf your focus is on performance, Cool 1 would be the right phone. Of all these\nfour, 6X is the cheapest on price.\n\n", "So i had a 2015 galaxy a7 before this new phone,i bought a redmi note 4 for my\nbrother last month but for myself i opted for honor 6x as i wanted a better\ncamera, so here is my review  \n*Display is fine but literally very fargile i broke the display on 2nd day itself and the damage came as a surprise as i didn't expect the screen to crack in a mere 1ft fall, i am a rough user so i know how sturdy devices are.  \n*Display is so damn refelctive more than redmi note 4  \n*Sound- loudspeaker is on par with redmi note 4(but still slightly louder on RN4)but the output from headphone jack is literally poor because the volume is low, i mean may be lower than even a sony smartphone or good feature phone, lows diminish the high's and not a worthy phone to enjoy music over good headset or 3.5mm home audio units.  \n  \n*Build quality and look- the redmi note 4 in black looks much more Premium, Sturdy and Durable.  \nIn builty quality Samsung>Xiaomi>Huawei  \n  \n*Battery: battery life is really very good with screen on time upto 7 hours when on wifi, no fast charging capability  \n  \n*Camera- both front and back definitely better than redmi note 4 but don't buy because of dual camera as that feature is gimmicky, it is better in terms of dynamic range, low light, shutter speed and manual controls plus inbuilt modes so we can say it is the best in this range( not considering g5 plus, because that phone is not in 5.5inch screen range and it looks ugly)  \n  \nMisc: Unable to register for extended 3 months warranty, Don't know what's\nwrong with the site of huawei  \nEDITED: well the device has 15month warranty by default but the warranty guide\nis confusing as it says to register for additional 3months of warranty, so not\na con, but lil bit confusing for sure  \n  \n*RAM management and proprietary features are good, though the battery saving features are irritating as that even warns you to close WhatsApp to improve backup. -_-  \n  \nNo Silicon/fiber cover within the box even when they are already saving money\nthrough no headphones, cheap display glass and normal charger.  \n  \nAnd now 2000rs deduction in value within 5 days of purchase, mind you amazon\ndoesn't provide price guarantee(Flipkart does), return guarantee.  \nThey provide you a phone that's a blessing itself :D  \n*Shipping is slower than it used to be years back.  \n*Mic of the phone doesn't seem to be as good as phones of today.  \n*Screen flash comes handy under late night situations  \n* No Equalizer in music player  \n*Only phone in this range with nougat(by end of may) except g5 plus  \n  \nI am just satisfied at best, not happy by any means because i know i have\nbought a cheap phone this time so i have to compromise a bit but what's the\nuse of 2.5d and bullshit when display can not survive even a 30cm fall?  \nAnd i miss those deep blacks of AMOLED.  \n  \nSo it's not just the brand name that tier 1company charges for, It is R&D and\nperfection.  \nI can't recall how many thousands of times a7 and Xperia X have fell from my\nhand but at most a scratch on frame or chip paint, phones should be designed\nin a way that consumers need to pay least amount of concern towards it well\nbeing.  \n  \nDISAPPOINTED with a pinch of satisfaction as the phone is not slow, camera is\nfine and battery too.  \nI do not recommend this over redmi note 4 if camera is not your priority, and\nif camera is your priority then please have a look at g5plus as well  \nBecause it has a equivalent camera(though warm) and better practicallity of\npre loaded 7.0 ,ability of dual sim cards with sd card so you can go with it\nif you are fine with slightly smaller screen.  \nAnd you can go with this one if you need 5.5 inch not so sturdy good camera\nphone with average sound, good but not the best battery lige  \n  \n*Amazon is arrogant i mean there is nothing left in favor or equality for customers because you can not return even in the most genuine case, no guarantee of delivery within promised days mostly they do deliver and if they fail they will simply Change the dates in order, you can not do anything against it even when they are at fault, no price protection policy, claustrophobic app and hidden t&c.  \n  \n*Cost of display is 5000INR and they need the money first, unlike tier 1brands where you have to pay after the repair work is complete.  \n  \n*still better than lava vivo oppo karrbon coolpad etc etc -_-  \nRegards  \nRajat\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 February 2017", "on 7 July 2017", "on 11 July 2017", "on 12 February 2017", "on 21 May 2017", "on 15 May 2017", "on 15 July 2017", "on 21 February 2017", "on 6 February 2017", "on 15 May 2017"], "reviewer": ["Worth It Reviews", "kamlesh rathi", "Alok Singh Chauhan", "Sushant", "Pavan", "Simple Person", "Raman", "Aneesh Satheendran", "Friendly Sparrow", "Rajat singh"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Super Heater", "Excellent camera phone", "No protection,  waste money for rough(medium) user", "honor 6x mobile review", "Honor 6X 4 GB 64 GB, my experience of first three days use.....", "I'm glad I purchased this phone over Redmi Note 4.", "**UPDATE** Honor 6x - A Little Beast under 15k", "Nice phone in 13000 INR... Value for Money..", "Superb phone..", "Worth buying phone if u want ur device to look good along with the good snapper."], "review": ["Heating issue, at the time of charging it feels like it gonna blast because of\nheating.  \nPoor camera quality.  \nNo option to return product. In second step of returning product they will\ndownload some app named smartchk which always says your phone is in perfect\nworking condition.\n\n", "Sleek, stylish and superphone..  \nWriting this review after using my honor 6x after 10 days..  \nReceived package within 3days of order and impressed with prompt service by\nAmazon.  \nThis beauty carries super performance, amazing camera, and great battery life.\nSpeakers are loud and clear.. Very easy and comfortable for all day usage. It\nfeels premium in hand. Built quality is super..  \n  \nPros  \n  \nSuper camera (check sample images)  \nDecent battery life  \nCrisp 1080p display  \nFast CPU for multi tasking  \nSlim  \nQuick responsive fingerprint sensor  \nAndroid marshmallow 6.0(upgradable to Naugat 7.0)  \n  \nCons  \n  \nSlow charging-takes nearly 2hrs 40 mins for full charge  \nDoesnt come with usb type c port  \nUser interphase is lil annoying  \n  \nOverall 4.5/5  \nMust buy for those who want pocket DSLR cam in 15 k price segment.. Value for\nmoney\n\n", "It don't have 5GHz Wi-Fi band and major is my friend also purchased honor 6x\naccidentally device dropped just 3 feet display cracks so display gone he lost\nhis half month salary like 5000(time,travel,new display etc.,)  \nNo gorilla glass protection  \nNo dedicated micro sdcard slot  \nNo quick charge feature  \nAudio output is very low  \nCheap build quality  \nand not fast focusing for video record  \nOtherwise device is good in performance, user interface etc.,\n\n", "http://amzn.to/2qYGSsW  \nHonor 6X (Grey, 32GB)  \ncopy and search this link to get extra discount.  \nproduct is best under this price range.  \n  \ni am happy to use this mobile.  \n  \nproduct details are there  \n12MP+2MP dual lens primary camera with auto focus camera, FF camera and 8MP\nfront facing camera with PDAF Focusing  \n13.97 centimeters (5.5-inch) LCD LTPS/a-si capacitive touchscreen with 1920 x\n1080 pixels resolution, 403 ppi pixel density and 16M color support  \nAndroid EMUI4.1 v 6.0.1 Marshmallow operating system with 2.1GHz + 1.7GHz\nKirin 655 octa core processor, 3GB RAM, 32GB internal memory expandable up to\n128GB and dual SIM dual-standby (4G+2G) with VoLte support  \nUser can use any SIM slot for 4G (In-fact he can insert two 4G SIM cards in\nboth the slots), Based on which SIM he choose for Data Connection, other SIM\ngoes onto 2G for Voice.  \n3340mAH lithium-polymer battery providing talk-time of 23 hours and standby\ntime of 650 hours  \n1 year manufacturer warranty for device, first 30 days screen breakage and 6\nmonths manufacturer warranty for in box accessories including batteries from\ndate of purchase.Honor 6X (Grey, 32GB)\n\n", "Great product!.... after 3 days of use, I am writing this feedback..... First\nI will write cons... then plus....  \n  \nCons:  \n1\\. Finger print sensor sensor stopped working within 3 months of use.  \n2\\. Back, Home etc. buttons are inside the 5.5 inch display... Was difficult\nto me for operate on first day...  \n3\\. Couldn't find how to change net data restriction limit period.. I have\nVodafone card and billing cycle is 22 to 21 of every month... It shows 1st to\nthe last day of the month...  \n  \nPlus:  \n1\\. Great Mobile under 15K..  \n2\\. Better than Redmi 4S Prime in alll the aspects...  \n3\\. Great Camera... As being a photographer, I am satisfied well... can have\npics like DSLR!...  \n4\\. Battery of 3350 mA is better than any 4k mA battery...Lasts me for at\nleast 2 days with net on and my max use... Lenovo K3 note, Lee Eco 1S was\ngetting drained before 24 hours.. Coolpad Note 5 battery was excellent... was\nlasting me for 60 hours.. I have used all these mobiles in last 2 years...  \n5\\. Great look and slim design compared with other 4 GB RAM and 64 GB memory\nmobiles... Could use max of the balance memory....  \n6\\. Great experience over its EMUI... Many innovative specialities than any\nother 4 GB RAM mobile... specially Redmi 4S Prime GB 64 GB....  \n7\\. And overall.. This mobile has become a centre point at my place and may\nhave cancelled their order of Redmi 4S Prime 4 GB 64 Gb... cos price is the\nsame for both.....  \n  \nFinally, If you want to have a great user experience, Speed, Cam, Look,\ntechnology etc.. get this one if it is under 15k.. I f you are a buyer of more\nthan 15k, please go for other higher mobiles...  \n  \nThis mobile was above 16k at everywhere.... I got this one on Amazon Mega\nsales under sell for 13k.....  \n  \nThe choice is yours.... Above is my experience!....  \n  \nThanks and regards.....\n\n", "I was pretty much confused over which device to buy between Redmi note 4 and\nHonor 6x. After a lot of research and thinking, I took a risk and bought this\none and now I didn't have to regret over my decision as this phone is a\ncomplete all rounder and far better than note 4 in many terms.  \nSome people were crying over the low performance CPU and GPU this phone is\nhaving but trust me guys, I personally tested almost all the high end games\nlike modern Combat 5, NOVA 3 and asphalt 8 and they didn't lag at all.\nMultitasking and ram management is awesome.  \n#Camera is said to be the key feature of this device and I can now accept that\nfact after trying it for over a week. Both the cameras did great job in\noutdoor and indoor artificial lighting conditions.  \nNow, let's move to the battery part, this smartphone comes with 3350 mAh\nbattery which is great in terms of daily usage and can easily last for about 1\ncomplete day with moderate use including 2 hours of gaming.  \nFingerprint sensor is astonishingly fast, just takes 0.3 seconds to recognize\nthe fingertips, which is damn fast as compared to note 4.  \nI personally recommend everyone to buy this smartphone, since the battery\nbackup is slightly lower than redmi note 4 but still 3350 mAh isn't bad. And\nI've seen some camera comparisons of both the phones and Note 4 has got really\npoor camera quality and no where near Honor 6x. Plus u should hear the #noise\nwhich Note 4 captures while recording videos.. 😂😂😂  \n  \nFolks be smart and don't get carried away with the Note 4 just for a few extra\nhours of battery backup. Trust me, you won't regret buying this smartphone.\n\n", "UPDATED:  \n*Usage Review after 1 Month*  \n  \nMy previous phone - Lenovo Vibe K5.  \n  \nThis phone is the best bet if you are considering the following:  \n1\\. Solid Build  \n2\\. Dual Camera  \n3\\. Octa-Core with 4GB/64 GB combo  \n4\\. Good Display  \n5\\. High on Memory Management efficiency(*Speed/Response test) - Easily beats\nLenovo K8, MI 4 by 21 seconds and 14 seconds respectively*  \n6\\. Don't need an Iron-Box feel when you're using a SMART-Phone  \n7\\. Decent Battery with 1.5 Days (4G + Browsing, Whatsapp, Gaming)  \n8\\. Budget is below 15k  \n  \nNow to my experience of both Pros-Cons  \n**Pros**  \nAs I had listed above, phone is very smooth, with beautiful UI & Memory\nmanagement. Camera is legendary for this price segment (*Thanks to Dual cam)\nFront cam is very good too.  \n  \nI am not an avid gamer over phone, but still I do have my own set of games :\nSim City, Cricket 2016, Plague Inc., Assassin's Creed - And be happy that the\nphone doesn't lag & heat!  \n  \nNow comes few cons:  \nFingerprint is not as fast as 0.3 seconds as they claim, it takes 2 shots to\nrecognize. And wetty fingers doesn't add good points to that.  \nGyroscope isn't good, so guaranteed you will not have a good VR experience. I\nam still fond of TheatreMax of my old Lenovo.  \n  \nBut.... You cant ask more off this little beast. My first Android phone was in\n2011 - Huwaei Ideos, since then I had experimented with a lot of buggers..\nAsus, iPhone 5C, MI, Lenovo. & My decision to go back to Huawei has paid me\nrich dividends.  \n  \nHuawei is the best in build is what I could say from my experience.  \n  \n-Hope this review helps!  \n  \n*And Thanks Amazon for a 16 hour Delivery!  \n  \nUPDATE:  \nSoftware:  \nThe phone is still a beast in every aspect with two software updates to the\naccommodate the latest Android version on your device.  \n  \nHeating Issue:  \nHeating?? What's that? Have installedPES2017, WWE2k17 and no lags at all and\nit doesn't get heated so much ! For me... Thats a WOOWWW Moment having been\nused to Lenovo previously.  \n  \nMemory Management & Swiftness  \nAs I said, Dont bother running heavy apps! Honor memory management is a jaw\ndropping feature it manages processors smooth and no lags at all!  \n  \nOne thing I hate -or-is hyped too much!  \nThe Fingerprint sensor.... It isnt that great! It takes 2-3 times for it to\nrecognize! Which gets me pissed off! But it is super fast in unlocking though!  \n  \nCamera -  \nBack - Dual is a boon ! Front is decent ... shall post few pics soon...\neverythin I have taken is personal so far ! :-p Also, I guess this the only\nphone to have Front cam panaroma in this price segment!... Just Awwwweeeesome!  \n  \n***Why are u still reading this review ! Get this in your cart & check out\nRIGHT NOW!***  \n  \n\\- A little beast under 15k & I'm juz lovn it!\n\n", "मैंने यह फोन The great Indian Sale मे लिया... और मुझे यह फोन 12 मई को मिला.. 2\nदिन के उपयोग के बाद  \n  \n1\\. Camera : दिन मे पीछे का कैमरा अच्छी Photos लेता है पर रात मे या कम रोशनी\nमे कलर थोड़े dull आते है |  \nFront camera और अच्छा हो सकता था पर ये भी बुरा नहीं है |  \ndual camera के कारण aperture(0.95-16) photo लेने के बाद बदल सकते है  \n2\\. Storage : 64 Gb मे से उपयोगकर्ता के लिए लगभग 52 GB space बचता है | hybrid\nsim है जिसमे memory card लगा भी सकते हैं |  \n3\\. Processing : 8 Cores के कारण काम करने मे कोई problem nhi दिखाई दे रही है  \n4\\. OS : Nougat Update भी आ गया है  \n5\\. UI : Update मे EMUI 5 साथ मे है जो दिखाने में बहुत अच्छा है ओर उसके साथ\nकुछ अच्छी themes भी available है  \n6\\. Calling: Calling के समय आवाज मे कोई दिक्कत नहीं है पर loudspeaker की आवाज\nबहुत loud नहीं हैं  \n7\\. Screen : इसका screen gorilla glass नहीं है जब फ़ोन मुझे मिला तो उसकी\nscreen पर 1 screengaurd लगा था जो शायद package का ही भाग है  \n8\\. Warranty :15 महीने की warranty है  \n9\\. Fingerprint Sensor : Fingerprint sensor responsive है इसे दूसरे कामों के\nलिए configure किया जा सकता है  \n10\\. Speaker : इसमे सिर्फ 1 speaker ही है जिसकी आवाज clear है पर बहुत तेज नहीं\nहै और शोरगुल में हो सकता है आपको सुनाई भी ना दे  \n  \n11\\. Rare camera Pro mode : इसमे आप shutter speed(8 - 1/4000) EV(exposure\nvalue - 4.0 to +4.0), ISO(1600) or focus को manually सेट कर सकते है साथ मे आप\nslow motion video भी record कर सकते है जिसका resolution 640 x 480 है  \n  \n13000 मे ये फोन अच्छा दिखता है\n\n", "Got this phone almost one and a half month back..  \nSumming up pros and cons:  \nPros:  \n1.Excellent camera: appreciable clarity, beautifully captures colors, wide\naperture mode is awesome. Night shots are bit grainy but still acceptable for\nthe price we pay.  \n2\\. Battery backup: Has fantastic battery life. I am a heavy mobile user and\nit's my first phone which I don't need to charge everyday. Easily gives full\nday battery backup with fullest use.  \n3\\. Feels super sexy in hand: Beautifully crafted design makes you feel\nawesome when you hold it in hand. One of the sleekest 5.5\" smartphone. Never\nfelt heavy to hold it.  \n4\\. No heating issues: Never felt it heating. Super cool..  \n5.No legging: I was a bit sceptical while purchasing this unibody phone\nthinking what would I do if it hangs. But surprisingly it didn't hang even\nonce till now.  \n6\\. Strongly built design and pre- protected : Now this is something which\neveryone desires but never gets. I was using Asus zenfone laser 5.5 earlier\nwhich I accidentally dropped once and its screen got broken badly. It costed\nme around 3500 to get that repaired. But my honor 6x came with a pre- applied\ntempered glass and it didn't break when I dropped it by mistake.. Not once but\nfour times till now. It is still d same. It's a blessing for d people like me\nwho happen to drop their phone quite often.  \nNow few cons:  \nThe one and only thing I disliked about this phone is that it doesn't support\nvideo calling feature in gio like my Asus one..  \nFew people may find its UI to be a bit complicated but I didn't face much\ndifficulty due to a different UI..\n\n", "This is my first time to write review on Amazon. I used to change my phone\nevery 2-3 months depend on the impression of the phone that gave me. But after\nusing honor 6x for a week I feel I may spend more time on this phone. Main\nhighlight feature of this phone  \n1\\. Dual camera set up which gives an impressive result.  \n2\\. The phone looks really good and lightweight.  \n3\\. Battery capacities is more than average. It can easily last a day for a\nnormal user.  \n4\\. This phone is value for money.  \n5\\. While holding the phone the device feels very slim.  \n6\\. UI of the phone is very good.  \n7\\. This phone is made for a low light shooting.  \n  \nHowever, I face some issue not actually an issue but I must say my dislike\nabout this phone.  \n1\\. Battery got heating up if u r charging for a long time.  \n2\\. If u r expecting too much in Bokeh effect or portrait mode pliz don't\nsince the bokeh effect does't came out expected result as that of one plus 5\nor iPhone 7. I should say the quality of bokeh effect is poor. U wound't get\nexpected result.  \n3\\. The processor of the phone is far lacking behind if u r a gamer never\nconsidered buying it. I play some simple game and it crashed.  \n  \nOverall this phone is worth buying.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 May 2017", "on 25 May 2017", "on 25 February 2017", "on 14 January 2018", "on 18 May 2017", "on 18 August 2017", "on 30 August 2017", "on 14 May 2017", "on 7 April 2017", "on 16 August 2017"], "reviewer": ["Amit", "BIREN SHAH", "NR", "Praveen bishnoi ✔️", "Jagdish Jadav", "Vick", "Sai Ganesh Radhakrishnan", "Sumit Bhawsar", "Prerna Sharma", "Gongz"]},
{"rating": ["3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Honor 6X non biased review!", "One of the best camera phones in this price range", "Better phone", "... concern is the bokeh effect it doesn't work much good at all the phone Really disappointed me in this ...", "Love the camera 😍😍😍", "Buy Now Regret later", "Will prove itself more than what you will expect from it!", "Honoe 6x - Photography mobile phone ( buy this and forget DSLR - I haven't take my DSLR bag out since I bought this phone )", "My Best Smartphone till date,would buy it again.", "Rear Camera Focus is not working properly after 2 weeks from delivery."], "review": ["Honor 6x is really a great phone with the best in class camera and the dual\ncamera setup! It's design really feels good in hand!  \n  \nPro :  \n• Camera the best part ! Low light is from back and front are really nice ! I\nhave attached some of them And I'll attach more in future too !  \n• call quality is excellent !  \n• built quality is pretty good !  \n  \nCons :  \n• EMUI is not smooth. It feels snappy for me because I'm used to the MIUI and\nit's smoothness !  \n\\- Removing application form The recent tab is really painful, swiping up is\nquite snappy !  \n\\- notifications of all covers 15% of your screen when pops and i totally hate\nit !  \n  \n• two nano SIM card slot but no micro SIM card slot and that too one is 4G\nwhile the other is only 2G. I mean who would use a 2G SIM these days ! People\nwould still prefer a 3G SIM for data if not 4G !  \n  \n• I'm personally a game enthusiast but this phone won't fulfill your needs if\nyou are a gaming nerd ! The games as light as clash Royale is laggy and feels\nslow ! It's an huge drawback !  \n  \nOther features :  \n• fast charging works good. Charges my phone 0-100% in 2 hours !  \n  \n• sound is decent but sounds grainy sometimes !  \n  \n• 2.5 D glass didn't provide any benefit though !  \n  \nThis a great camera phone.  \nOne should buy this one based for it's charging and camera ! UI is Snappy\nthough\n\n", "First of all thank you to Flipkart for the super fast delivery. I got my phone\nthe next day after placing my order.  \n  \nThere are many phones from many manufacturers in this price range and people\noften are confused when planning to buy a phone in INR 10K-15K range. I too\nwas confused before I decided to go with Honor 6x but I am glad I am went for\nit as I hadn't owned a Huawei device yet. Writing an in-depth review here\nwhich may help potential buyers in making a choice to whether go for this\nphone or not.  \n  \nFirst up, the box contents:  \n1\\. Phone (comes with screen guard installed. Please note its screen guard and\nnot tempered glass screen guard)  \n2\\. Charger (fast charging is NOT supported)  \n3\\. SIM tray ejection pin  \n4\\. Manual  \n  \nFirst looks & feel:  \nThe phone looks classy and feels very nice in hand. The weight is pretty\ndecent. No capacitive buttons at the bottom (they should have provided that).\nThe buttons are on-screen only. There is a LED notification light. No IR\nblaster. Phone has hybrid sim slot. Rear camera lenses protrudes out a bit (as\nis case in many phones).  \n  \nScreen & Display:  \nScreen is curved at the edges and gives a premium feel to the screen. Display\nis sharp. You can customize color temperature to warm, cool, or custom\nsetting. Auto brightness provided which works well. No problems in viewing the\nscreen in full sunlight also.  \n  \nCamera:  \nCamera is USP of this phone. Both dual rear camera and front camera take good\npictures. Honor 6x seems to be one of the best camera phones for its range.\nRear camera even takes decent pictures in low light conditions. Bokeh mode\nsupported. I found the beauty mode for selfie to be very good and not as\nunrealistic as other phones. One should not expect the camera to be as good as\niPhone or Samsung Note series at this price range.  \n  \nSpeakers: Speakers are bit of disappointing. No dolby stereo. Single speaker.\nNo bass at all. Lenovo K series phones are best for audio experience.  \n  \nUI: This is where people who love customization will love this phone. Huawei\nrun their proprietery EMUI over Android OS and provide quite a few\ncustomizations such as themes, fonts, screen display color temperature,\nadditional controls on lock screen, hovering menu on screen etc . The UI is\nfluid and very good. As I said, this phone is good for people who like\ncustomizing their phones. People looking for pure out of the box Android\nexperience can take a look at Mi A1  \n  \nFingerprint Scanner: Fingerprint scanner is located at the back of the phone.\nThe positioning is little too close to rear camera and you sometimes times\nkeep touching the camera inadvertently while unlocking the phone. The\nfingerprint scanner is however is extremely responsive and very accurate.  \n  \nPerformance: Has Kirin processor which does not really measure up to\nSnapdragon in performance. However for browser based, office apps, and light\ngame users you would not feel any difference. This is not a phone for avid and\nheavy gamers.  \n  \nSoftware Update: Has Android Nougat 7 update released officially that can be\ndownloaded and installed.  \n  \nBloatware: Honor has not put in any 3rd party bloatware but there are quite a\nfew Honor apps pre-installed. Not too many though. I actually liked the Hi-\nCare and Health app.  \n  \nRatings:  \n  \nCamera: 5/5  \nLook &Feel: 3/5  \nScreen: 4/5  \nRAM: 4/5  \nSpeakers: 2/5  \nPerformance: 4/5  \n  \nVerdict: Phone feels premium with metal body and 2.5D curved glass. Go for\nthis phone if you want an excellent camera at this price range. Phone is good\nfor users who love customizing their phones (pure Android fans can look at Mi\nA1). Speakers are disappointing, not a phone for hardcore music enthusiasts.\nPhone is also good for light gamers but Asphalt lovers can stay away.\n\n", "ADVANTAGES:  \n  \nCAMERA:  \nBack :12+2 = really superb looks like using 20- 30k mobile and editings are\nalso gd main thing is wide aperture  \nFront:8mp = BT not working as gd compare to other mobiles.i hv used Coolpad\nwhich edits very neaty in front cam bt in this it is nt good and pic will also\nappears in reverse mode to which we take  \n  \nSCREEN:5.5 inch which fits properly in hand bt there is no grip as it is very\nmuch smooth it slips from hand  \n  \nANDROID: Marshmallow version bt we have xpected for Nougat  \n  \nOS:2.1Ghz+1.7Ghz,octa core.processor is speed and doesn't even hang  \n  \nRAM:3GB  \n  \nROM:32gb  \n  \nBATTERY:it is giving very gd backup.i'll use pH continuosly vth net and songs\nat a time still it doesn't go down  \n  \nDUAL SIM:Dual SIM standby vth 4G  \n  \nFINGER PRINT :it is very fast n works in 0.3 seconds  \n  \nWEIGHT :pH is very much lighter we dnt feel it is heavy  \n  \n*It provides simcard tool  \n  \n*Never hangs even if u use continuosly n also by playing big games  \n  \nDISADVANTAGES:  \n  \n*In Front cam pics will appear in reverse of taken  \n  \n*Charges very slowly  \n  \n*No earphones provided in the box  \n  \n*We can't operate both Sims and SD card at a time nly 2sims or 1sim and SD card we can use  \n  \n*Cost is somewhat high it shd be around 11k  \n  \n*Extended warranty is nt provided to this like Honor 5C  \n  \n*if we use both WiFi and Bluetooth at a time WiFi won't be stable it goes on changing  \n  \n*It asks permission for each and every app after installation like accessing contacts, location,gallery etc which gives irritation  \n  \n*In shortcuts it provides only few shortcuts whereas in other pH we will have some more compare to this  \n  \n*Sound Quality:in earphones I can feel btr as I'm using JBL bt with loudspeaker ,sound has not reached my expectations  \n  \nOverall ratings is given above there are many disadvantages bt still it's k\nvth this mobile\n\n", "I was so exited to buy this phone however delivery was too late n phone is ok\nok no complain with the regular price that is 12000 but if ur concern is the\nbokeh effect it doesn't work much good at all the phone Really disappointed me\nin this cause I wanted to buy this phone for this special feature only n till\nnow I have faced just one issue which is while playing music with headphone it\nautomatically gets stopped sometimes don't know how will it be alright .. n\nsome have written speaker volume is low but I say it is moderate enough n\nsounds good n other thing the packaging of amazing was really bad n delivery\ntime is too much too 11 days n in this price range honor could have easily\nprovide a earphone at least ... I was considering buying Coolpad cool 1 for\nbokeh effect but then I choose it for it's expandable 128 gb .. cause we can't\nbuy mid-range phone that often .. however after using honor 6x if ur concern\nis the latest bokeh mode one should go for the Coolpad 1 .. however just been\n2 days .. hope it will run smoothly :) n let's hope for the best .. n guys\ndon't expect much from this .. it has an average type features nothing\nextraordinary so I m rating it 3 star as it disappointed me with the bokeh\nmode n headphone\n\n", "Great phone in budget better than redmi note 4  \nIf your priority is camera its best  \nGaming performance is good except in asphalt 8  \nBattery backup is awesome  \nRam management is good  \nI love the design very much (that's my thoughts)  \nFingerprint is good  \nActually my device charge very fast(didn't expect that)  \nSo many features in camera and i line pro photo mode, HDR mode  \nNow not so good features  \nDual camera feature is not so useful in daily use  \nScreen protection is unknown  \nCamera in very low light is very average but in low light its good if you know\npro mode  \nNo IR Blaster, NFC, WIFI 5.0 even not supported  \nSo many huawei apps  \n  \nIn this price range you can easily forget Cons\n\n", "It was obvious that honor 6x will never get oreo update. The 7x is in market.\nall focus will be on promoting 7x. And they had already given 1 major update\nfor 6x. The only thing I did not like was the fraudulent promotion of honor 6x\nin the second half of 2017. There were news about oreo update confirmed for\nhonor 6x with reffence of some company person's statement. After this price\nwas droped. and then after few months 7x was released. Looking at this, it was\nvery clear that news of \"confirmed oreo update for honor 6x\" by the end of\njanuary 2016, was a marketing stratergy to clear the stock of 6x befor release\nof 7x. Company was not openly denying the oreo update to 6x till now because\nthey don't want to affect the 7x sale. Not giving major android os update is\nimportant negative point for any company. So we were getting vague answers\nthat \"the update is under evaluation\".  \n  \nAgreed that they had given one major update for 6x, but the phone (released\nwith android 6) had many important issues such as volte connectivity problem.\nPhone was officialy released in feb 2017. in the current competition of\nsmartphones, users expect at least 18 months (if not 2 years) of update\nsupport. Also considering (false) marketing of confirmed oreo update for 6x,\nits expected that company shoud have given oreo update for 6x.  \n  \nI think 6x users, who were highly expecting oreo update, shoud take out at\nleast 2 to 3 min to post about this issue on social media and importantly in\nthe Amazon review of honor 7x. Spreadinig \"Huawei is the company which does\nnot give major updates\" is the only way to force them to rethink their update\nstratergy. Same thing had happen before with Samsung (The update policy was\nimproved from worst to average ;)  \n  \nNot only Android update, there are many minor and some major issues in honor\n6x. Heating, bleutooth syncing/connectivity Camera, etc.  \n  \nGood bye to Huawei - my first and last phone of Huawei company. And worst\nexpirience.\n\n", "Cannot even believe the power and potential of this phone. I am so Glad that i\nchoose this one over Moto G5 plus, as that phone has a problem of restarting\napplication after a lot of applications are in memory. But this, this is a\nbeast and it keeps all the apps in memory so you always start from where you\nleft no matter how many apps are running. Did everything in my power yet was\nnot able to get it to hang or lag. Coming from the Samsung S5, i can say,\nwithout hesitation that this phone beats Samsung's back anytime anyplace.\nBattery is really good and gets through the day like a pie. I will provide a\nshort list of pros and cons below and hopefully it will help you choose and\nmake a decision!  \nPros:-  \n1) Beautiful design, smart looks, and good build quality.  \n2) Superior camera than any other phone in the same price range.(Dual\nrear...WOW). Front camera is awesome too.(8MP)  \n3) Super smart and very well optimized memory management.  \n4) Ultra fast finger-print scanner. Faster than IPhone(Sister has an IPhone)\nand almost same as Samsung S8.  \n5) Brand trust of Huawei followed by 15 months of warranty, noticeably more\nthan Samsung etc.  \n6) Super smooth UI and not as bloated as Xiomi.  \n7) Got android 7 while alot other phones in same range are still at 6.\n(Talking about Xiomi redmi note 4 as it is considered as major competitor)  \nThere is a lot more good to it but i just mentioned what matters the most(to\nme). Now the other side of the coin, yes, the cons.  \n1) No gorilla glass. Make sure you never use the phone without a tempered\nglass protector or something better because a single drop is like a hammer for\nthe display.  \n2) Not a huge selection when it comes to accessories.  \n3) No headphones are included. Though most of the manufacturer don't provide\none now-a-days buy Samsung did.  \n4) Looks beautiful yet feels fragile when holding without any protective\ngear(Armored case. tempered glass).  \n5) Hybrid slot tray. You can either use a sim + sd card or sim + sim. Never\nall three. (Without any harmful modification).  \n6) No 4G dual stand-by. Only one sim will work as 4G and other one will be set\nto 2G(Which you cannot change but you can select which sim will work as 4G,\nsim1 or sim2)  \n7) No NFC and fast-charging. Can be a deal breaker for some. Few sites claim\nthat it has fast charging but that is false.  \nFinal conclusion :- If your budget is 15-17k, you need not look anywhere else\nas this is the beast who is ready for everything you throw at him. Better than\nmost of its competitors like Moto G5 plus(Memory management issue), Xiomi\nredmi note 4(Cheap build quality and horrible after sales service), and even\nNokia 6(just Snapdragon 430 for almost 16000). I was a little skeptical after\nlooking at the brand name when compared to Samsung and Nokia for example, but\nam so glad and thankful to myself that i choose this.\n\n", "One of the best mobiles within 15k or even I would say 20k !  \nI watch lot of mobile reviews and then decide which phone to buy.  \nTip : Always select a mobile phone based on your priority as no mobile phone\nis completely perfect. They have their own pros & cons.  \n  \nAbout Honor 6x :  \n\\------------------------  \nJust in one sentence : If you need a mobile phone where you are more concerned\nabout photography and good battery life along with snappy performance for day-\nto-day activities ( watsapp, facebook, youtube, calls ) then blindly go for\nHonor 6x. This phone beats Redmi Note 4 w.r.t photography only, but in a\nunimaginable / huge difference.  \n  \nPhotography : 10/10 ( for the price - performance ratio ). Dual cameras make\nphotos look awesome.  \nAdvanced Photography : 6/10 ( Like night mode - almost impossible to take a\nshot as you have to hold phone steadily for more than 5-8 seconds ! ). No OIS\n/ EIS. Hence other than Wide Angle Photography, I did not like any other\nmodes.  \nEdit option : 10/10 . After clicking photos, you can edit them in phone than\nusing any softwares / PC. Amazing options to make your photos taken\nbreathtaking !  \nNight Mode : 5/10 ( Average if photos are taken in a room with tubelight )\nDon't expect crisp photos taken in in-door. But in-door photos are much better\nthan Redmi Note 4.  \nSelfie Camera : 7/10 ( Much better than Redmi Note 4. Serves the purpose in\nday-light. Night shots are not good ).  \nSummary on Camera : Within budget of 20k, this is the best camera you can get\n( dual rear + 8mp front ) , I do not consider VIVO and OPPO mobile phones at\nall, as their processors are age-old with only stress on selfie camera !  \n  \nBattery Life : 9/10 ( atleast 2 days if you use casually . Basically 5-5.5\nhours of screen-on-time )  \nDay-to-day activities : 10/10  \n  \nWhat I have not tried with this phone : Gaming ( I am not into games hence I\nnever played any games till today ).  \n  \nOther features :  \n\\----------------------  \nSpeakers : 10/10 ( I see many people complaining about speakers. I agree\nspeakers were low initally, but once you start using them, after about a 2\nweeks, volumes started increasing, and now it is really loud. I have verified\nwith Hotstar and youtube videos. I know this explanation looks vague, and I\nalso don't understand this logic ! but it is true ! volume has increased over\nspeakers after using it for about 2 weeks ! now it is really loud that If I\nplay a video from Honor 6x then I can't hear anything from Redmi 4 which also\nhas very good speakers & also Lenovo K3 Note speakers( with dolby atmos) also\nbecomes numb in front of Honor 6x speakers!! )  \nFinger Print Scanner : 10/10 ( Fast compared to Redmi 4 ). Not sure about\nother flagships.  \nUltra Battery Saver : 10/10 . Just like how Samsung and Lenovo has, makes your\nphone as feature phone. But best part is even with UBS enabled, you can get 4G\nVOLTE calls for Jio ( basically your data calls over Jio works very well ! )\nLenovo doesn't has this option.  \nRam Management : 10/10 . Software is optimized and almost 1.4 GB of RAM is\navailable all the time when all apps are killed. RAM management is very good\nhence most of the apps running in background retain their data while resumed\nafter long time.  \nHeating Issues : No heating issues after received Android N update a month\nback. Phone gets charged quickly ( about 1 hour 45 minutes ).  \n  \nOverall :  \n\\----------  \nIf you see the review, I have given 10/10 for almost all points.  \nBasically, I have carefully chosen the phone based on my need and the chosen\nmobile has lived up-to my expectation.  \nThose ratings are from the man who is satisfied with performance against\nexpectation.  \n  \nHope the review is useful.\n\n", "Here's my honest opinion after using it for more than a month.  \nArrived a little late but in perfect condition.  \nPROS  \n1.Build quality and the material is good and very comfortable to hold in the\nhands.  \n2.The design of this​ phone is awesome with its dual camera,2.5 D curve\nglass,and curve edges.  \n3.The 5.5 inch full hd screen is awesome and bright and colour is nice.  \n4.The Hisilicon Kirin 655 is fast and lag free,web browsing is fast and high\nquality games can be played in this phone with ease,Antutu score is 57000.  \n5.Out of 3gb ram there is 1.8 gb ram available.  \n6.No heating issues.  \n7.The Camera is great ,the best camera at this price range,if you want good\ncamera phone at low price go for it better than Redmi Note 4,more details and\nbetter colour reproduction.  \n8.Battery is very good,it easily last a day with moderate usage,but for a\nheavy user like me it last 6 hours continuous usage(with minimal screen off)\nbrowsing watching movies on Youtube, watching movies it last about 12 hours\nlittle less than Redmi note 4.  \n9.Charging time is about 2 hours from 0 to 100 better than Redmi Note 4.  \n10.The fingerprint scanner is the fastest at this price far faster than my\nbrother's Redmi Note 4 and there​ are lots of additional features which are\nnot present on other phones.  \nCONS  \n1.Software update is not fast.  \n2.The speaker is not loud.  \n3.No earphone,no screen guard,no phone cover .  \nI don't really have more complain about​ this device ,buy it you won't regret\nit.\n\n", "I placed the order on 11th April and received by 12th April. Superb delivery\nfrom Amazon.  \n  \nPhone is awesome and all the features work fine.  \nBut after using the phone for 2 weeks suddenly to my surprise I observed that\nfocus in rear camera is not working properly and everything is blurred.  \nI contacted the customer care and they suggested few steps and procedure to\nget this fixed but to my disappointment nothing worked.  \nIt looks more like a hardware issue (not sure) as the front camera still works\nsuperb.  \n  \nI am totally upset as camera was the key feature, I went for this phone and\nthat only I cannot use now.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 April 2017", "on 3 November 2017", "on 29 March 2017", "on 11 July 2017", "on 10 April 2017", "on 15 March 2018", "on 27 July 2017", "on 24 July 2017", "on 20 May 2017", "on 2 May 2017"], "reviewer": ["Aditya Raj Behera", "Rahul K", "Neeraj Spiker", "Liza", "shivam", "Hima", "Nikhil S.", "Dinesh Shenoy", "Sawma Khawlhring", "Manisha"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Quality hardware yet again from Huawei!", "One of the BEST Smartphone in its Price Range", "MY HONEST OPINION ABOUT THIS PRODUCT", "Review after 3 weeks of usage", "Soooo much soft screen.. Very much fragile. Those who purchased handle it with care.", "HONEST AND DEEP REVIEW - Read Before You Make a Buying Decision", "Dual Sim 4g+4g?", "Best Camera and Battery phone in market", "Best in class .. 2 mnth review", "Deforms easily for minor drops & glare due to glassy screen"], "review": ["I am an old customer of Huawei as I also have Honor 7 that I purchased in 2015\n(has better camera quality than 6X). I bought this phone for Rs 15,999 and 64\nGB model because I needed a dual sim smartphone and ample storage which solves\nmy purpose. I was confused whether to go for Redmi Note 4 or Honor 6X but\nended up buying 6X just because the trust I have on Huawei brand. I have no\nissues either with Honor 7 and 6X.  \n  \nPros:  \n1) Great hardware  \n2) No heating issues (Huawei has its own processor named HiSilicon Kirin which\nis very stable)  \n3) Fast fingerprint sensor  \n4) Touch quality is nice and smooth  \n5) Nice call quality  \n6) No Type C port ( I put this in pros section as I can connect any micro usb\ncable which is easily available)  \n7) Separate 3.5 mm audio jack ( Le2 doesn't have separate audio jack which is\nquite frustrating for me. And yes, I own LE2 as well)  \n8) Good battery life. ( It has Li Polymer battery that lasts longer than\nlithium ion batteries)  \n9) Camera is decent (not as good as Honor 7)  \n10) Both sim slots can work as 4G but only one at a time. I saw some people\ncomplaining about another sim slot being 2G. This is because you can use 4G on\nany of the slots but one at a time.  \n  \nCons:  \n1) Pathetic front camera.  \n2) Speaker and earphone output is mediocre. It does not have a quality sound\nengine. I find sound quality of Honor 7 better than Honor 6X from both speaker\nand earphone.  \n  \nEdit:  \n1\\. Honor 6X after Android 7.0 Nougat update has improved its front facing\ncamera's picture quality. But I can still find some noise in low light\nconditions. I still find Honor 7 front camera better even after it is running\non Android 6.0.  \n  \n2\\. Jio to Jio call issues has been fixed via ota update recently.\n\n", "Before starting with the review let me just inform you, i asked my friend to\nlend this phone for couple of days for the review, this review is based on my\npersonal opinion and it can vary person to person, i hope you will enjoy this\nreview.  \n\\-----------------------------------------------------------------------  \nLETS START THE REVIEW  \n\\---------------------------------------------------------  \nLOOKS AND DESIGN _  \n==================  \nNow im one of them who appreciate good built quality and clean design, i\nreally like the ultimate clean design of this phone it looks and feels very\npremium on the front side you get 8MP of front camera which is capable of\ntaking amazing pictures you can even record in HD from the front facing camera\nit gets some amazing selfie features too, it doesn't not at all looks like\nthose of SAMSUNG similar design, you will actually enjoy watching videos on\nthe phone as the display it comes with is just brilliant in simple terms.  \n\\---------------------------------------------------------------------------------------------------------------------------------  \nUNIQUE FEATURES  \n\\-------------------------------------------------------------------------------------------------------------------------------  \nIt is only the Smartphone which comes with internal 64GB of space at a price\ntag of 13k it also comes with Dual camera setup which makes it again unique\nbecause this Dual camera feature only comes in higher end smartphones. it also\ncomes with 4GB of RAM which is sufficient for any task you give it will take\neverything with a smile, dual camera performs just great, battery comes pack\nwith 3340 mAh power which can serve you single all day with heavy usage and\none and a half day if used regularly at normal usage. ive also attached some\ncamera samples for your reference so that you get an idea what this Dual rear\ncamera capable of.  \n\\---------------------------------  \nMY FINAL VERDICT  \n\\------------------------------------  \nNow im sure you guys will feel as this is a PAID review, but let me tell you\nive used this just for the sake of reviewing it, i love technology and good\nproducts makes me write reviews for them, so that people get to know about the\nproduct, im amaze with the price it comes at that too 64GB as a internal is\njust im loving it now, it is surely better than SAMSUNG and Mi device in the\nsame price range it actually offers you things that comes in high end\nsmartphones, and you guys will actually be amazed with the quality it comes\nwith this was my final verdict definitely get it if you are looking for a Dual\ncamera lens smartphone with amazing features and in a tight budget.If you have\nany doubts or any questions related to this product mail me back ill surely\nhelp you out with your queries.  \n\\----------------------------------------------------------------------------------------------------------------------------------------------  \nIF YOU GUYS LIKE THIS REVIEW, BELIEVE ME IT TAKES TOO MUCH OF TIME TO REVIEW A\nPRODUCT IF YOU WANT TO THANK ME FOR BRINGING THIS REVIEW PLEASE PRESS \"YES\"\nBELOW. THANK YOU  \n  \nPEACE... :)\n\n", "I have baught this mobile 4days ago.And share my experience with you after\nuse. Under the hood, the Honor 6X comes with Huawei’s own mid-range processor,\nthe Kirin 655, backed by 3GB of RAM. There’s also a global version of the\ndevice available with 4GB of RAM. This is a significant upgrade in processing\npower and RAM when compared to its predecessor, and it shows in the\nperformance, which is impressive for a mid-range smartphone.  \nPerformance is as fluid and responsive as expected in everyday use, and the\ndevice also handles graphically-intensive gaming with little issue.\nPerformance is easily one of the highlights of the Honor 6X, especially when\nyou consider the price to performance ratio.  \n-:Hardware:-  \nAs mentioned, the Honor 6X comes with a hybrid dual-SIM card slot, which means\nthat users have the choice between dual-SIM capabilities or expandable\nstorage.Users have the choice between dual-SIM capabilities or expandable\nstorage.  \nThe single bottom-mounted speaker unit seems to be a lot quieter than most\nother smartphones I’ve used that feature single speakers. As is the case with\nany bottom-firing speaker, it is easy to muffle with your hand when using the\nphone in the landscape orientation. Apart from the weak speaker, another\nhardware miss is the lack of NFC, which means that if you are someone who is\nused to features like tap to transfer or various mobile payment systems, you\nare unfortunately out of luck with the Honor 6X.  \nOf course, there are some positives on the hardware side as well, starting\nwith the fingerprint scanner. Placed right below the camera unit on the back,\nthe fingerprint sensor is very fast and accurate, and I rarely had any issues\nwith it misreading my fingerprint. In fact, it would even be safe to say that\nthe quality of the fingerprint scanner is at par with what is found with most\nhigh-end flagship smartphones out there.Apart from unlocking the device, the\nfingerprint scanner can also be used to capture photos and videos, answer\nphone calls, stop alarms, bring down the notification shade by swiping down,\nand browse through photos in the gallery by swiping left or right, which are\nall useful features to have. These are the kind of small touches that make the\nphone much easier to use with one hand.  \n-:Battery:-  \nAnother plus for the Honor 6X is battery life, with the device coming with a\nlarge 3,340mAh unit. Huawei claims that the Honor 6X can last for as long as\ntwo days with moderate usage and for 1.5 days with heavy usage, which is\ncertainly a very lofty claim. I did get around 1.5 days of battery life quite\nconsistently though, with usage that involved a lot of gaming and a fair\namount of watching videos on Youtube.  \nThe Honor 6X can last for as long as two days with moderate usage and for\n1.57days with heavy usage .Not many smartphones live up to the battery life\nclaims of their manufacturers, and the fact that the Honor 6X manages it is\ncertainly noteworthy. It uses very little power when in standby mode, which\ncan be attributed to the efficiency of the Kirin 655 processor, but even with\nconstant use, the device can last a long time. Most of my days ended with the\nphone still having at least 50% of battery left. It’s quite a nice feeling to\nhave to charge your smartphone every other day, and not have to frantically\nlook for  charger at inopportune moments.  \n-:Camera:-  \nWe’ve seen a lot of smartphones release this year featuring dual-camera setups\n– many from Huawei itself – but what Huawei claims is impressive about the\nHonor 6X is the fact that it is the first smartphone in its price range to\ncome with this feature. Every dual-camera setup utilizes the secondary camera\ndifferently, and the Honor 6X comes with a 12MP primary shooter and 2MP\nsecondary unit, with the latter being used purely to capture depth information\nthat can be taken advantage of when using the camera’s wide aperture mode.  \nThe Honor 6X is the first phone in this price range to come with a dual-camera\nsetup  \n  \nThe wide aperture mode lets you dial in the aperture from f/16 down to as wide\nas f/0.95, which allows for a very large bokeh effect.\n\n", "Overall build quality of the phone is nice. You get a metallic body but this\ncomes at a cost of annoying sound that comes when you press power, volume up\nor down button. The placement of buttons compared to redmi note 4 isn't that\ngood. You can't just hold the device and turn volume up with one hand (This is\nin my case, I have medium sized hands :P )  \nComing to its main feature,i.e, camera, I must admit this is the one of the\nbest camera you can get in this price range. If you are comapring it with cool\n1 you don't get that much original looking picture with cool 1. The camera\napplication has wider range of functions with which you can get perfect\npicture for particular scene. You don't​ get that much functions on redmi note\n4. Front camera is also good. It has a function to flash the screen and gives\nyou decent picture in dark.  \nPlacement of fingerprint sensor is good. You get to access notification bar,\nscroll within gallery by swiping. Access app lock. But its lesser responsive\nthan redmi note 4.  \nComing to the speaker. It has one speaker grill and one mic grill. As you all\nknow with just one speaker, it will perform average.  \nWith the mini usb port, you can charge the phone from 0-100 within 1.5-2 hrs\n(with 5V 2A charger, comes with the phone). And yes it does support otg.  \nIf you are worrying about sensors, no need. It has all the required sensors.\nYou can use VR set.  \nCall quality isn't an issue for this device. You get clear sound using handset\nmode and even speaker phone quality is good.  \nNow comes the screen. Yes it does have best in the class screen. Quite bright\nscreen. Can read anything easily on screen in sunlight. But you get lesser\nscreen to use as the phone has on screen navigation buttons. Compared to its\ncompanion redmi note 4 which has navigation buttons on the body.  \nHeating issue. Yes it does heat up a bit. This is normal. Even Xiaomi claims\nredmi note 4 doesn't heat up which isn't true. Redmi does heat up a bit\nsometimes which is normal as compared to the issues in other devices. So no\ncomplaints.  \neMUi on this phone is stable and good just as MiUi. No bugs found till now.\nEven the battery backup turned good due to this light software onboard.\nBattery lasts for 1.5 day easily with heavy usage.  \nIn real world experience I didn't feel the phone is slower or lags. I am using\n3gb 32gb version, I get almost 1.5gb ram free. Again, its the eMUi which\nhandles this stuff so happy with that. I have played NOVA, NFS No limits, etc.\nheavy games on this phone but didn't face any lag or crash. Quiet a good\nperformance by the phone.  \nPS: I got this phone for 11k in sale. If I left anything out, do remind me.\n\n", "Never seen a phone like this one. Phone slip off from my hand fell on floor\nthe whole screen get cracked. Though there was a screen guard the display got\ntotally broken. The funny side is that not even a single scratch on the screen\nguard. At first I thought my screen guard is broken then realized the 150\nrupees screen guard is much better than the original screen of this phone.\nBiggest mistake done by me since date.  \n  \nN. B: I dropped it accidentally not for testing the hardness of the screen.\nAnd this is the 1st time I have dropped this particular phone. So buyer\nbeware. Purchased it on 09th February feeling screen broken.. ;)  \n  \nUpdate: Thank God I have submitted the phone to the service center on the 30th\nday. They changed the display. Now I am using the phone with fear of cracking\nand with utmost care.\n\n", "Hello friends  \nI am writing this reviews for Honor 6X. If you are considering to buy this\nphone you must go through these following points to know the inside story of\nthis phone and where it stands in front of its competitors. I have provided\npictures down below for better understanding and side by side relation to my\nreview.  \n  \nThis review will be a short and crispy quick comparison between it's biggest\ncompetitor i.e. Xiaomi Redmi Note 4.  \n  \n1\\. The build quality of both the phone is good, you can choose anyone\nregarding this point.  \nThe in-hand feel is almost comparative, but it's slightly better on Xiaomi\nRedmi note 4, due to its curved design integration from the previous model\nRedmi Note 3.  \n  \n2\\. They have almost same features, but the Redmi Note 4 has IR blaster, which\nis not present in Honor 6X. So buyers if you are considering to use your phone\nfor controlling any of your home appliances via a phone instead of remote,\nconsider Note 4.  \n  \n3\\. Now coming to the camera, here things change completely, the Honor 6X has\nthe dual rear camera, whereas the Redmi Note 4 has a single camera at the\nback. The Honor 6X has definitely a better camera in comparison. In outdoors\nboth are almost similar but indoor the Honor 6X performs better. And if you\ncompare it with CoolPad cool 1, this is the order - 6X>cool1>note 4.  \nThe Cool 1 performs better in extremely low light with decreased photo\nquality.  \nEven the front facing Camera of Honor 6X is better than Redmi Note 4, the\ncamera is always where Redmi note series fails (generally).  \nAlso, the recorded videos are better by Honour 6X, as the sound recorded by\nRedmi Note 4 is tiny. And if you add cool 1 to picture  \n. Here is the order for the front camera - Cool1>Honor 6X>Note 4.  \n  \n4\\. They have 1080 P i.e FULL HD screen quality, but If you are more into\nmovies and videos all the time, consider Honor 6X as it feels much better,\nNote 4 has also good screen but inside, by side comparison, the Honor 6X wins.  \n  \n5\\. One Con both the device have is, you simply don't know what kind of glass\nprotection you get in these devices. As the screens are made by multiple\nmanufacturers.  \n  \n6\\. Cellular call quality was good on both the devices. Both the devices have\nnice cellular connectivity, and yes both support RELIANCE Jio, without any\nissues.  \n  \n7\\. Speakers on these devices are pretty good. Both the devices have single or\nmono speakers at the bottom, and both are pretty good and loud, but if you\nhave to pick one the speaker on the Redmi note 4 was louder.  \n  \n8\\. Now coming to the audio output via a headphone or microphone, both were\ngood but Note 4 was slightly better, the amplification was good and base and\ndepth were better in Redmi Note 4  \nSo if Music is your highest criterion prefer choosing Redmi Note 4.  \n  \n9\\. Now coming to GAMING, the Redmi Note 4 completely steel's the show, the\nHonor 6X also played a lot of games, but when playing really heavy games it\nwas lagging sometimes, particularly with Asphalt 8 it lagged quite a bit,\nwhereas on Redmi Note 4 it played all the games easily without a lag, So of\nyou are a Gamer consider going with Redmi Note 4.  \n  \n10\\. Now coming to the fingerprint sensor, both have fingerprint sensor at the\nback, but it was a bit faster on Honor 6X.  \n  \n11\\. The battery on both the device is good, it will last you more than a day\non moderate usage.  \n  \n12\\. Now coming to screen on-time, the Honor 6X gives you around 6 - 6.5 hours\nof screen on time, whereas the Redmi note 4 gives you around 8 - 9.5 screen on\ntime, as it has a slightly bigger battery of 4100 mA. So if battery life is\nyour highest criterion better go with Redmi note 4.  \nNow coming to Charging time, the Honor 6X takes around 2 hours and 45 minutes\nto charge, whereas the Redmi Note 4 takes around 2 hours and 55 minutes\napproximately.  \n  \n13\\. One thing we will all hate is both simply do not support FAST CHARGING,\nAmazon claims that the Honor 6X has fast charging, but it simply doesn't\nsupport that.  \n  \n14\\. Now comparing to price the 3 GB variant of Honor 6X is of 13,000 and 32\nGB Redmi Note 4 is of 11,000.  \nSo if the price is the highest criterion the Redmi Note 4 is Rs 2000 cheaper.  \nSource - My testing and lot of research on the internet.  \n  \nSo I think I was able to help someone and was able to clear some doubts and\ngive you quick insights of this product. And personally speaking, if you want\nto Buy an Honor 6X go with the Grey one it looks great in hand than other\ncolor option.  \nPlease tap the helpful button if this review helped you, and in return, this\nwill help others in making their buying decision.  \n  \nAs always  \nCompare before you buy, Enjoy.  \n  \n\\- Lokesh Karki\n\n", "Specs says 4g+4g for dual Sim but phone has only 4g+2g.\n\n", "I did my comparisons with Redmi Note 4 and Coolpad Cool 1 before buying from\nthe First Sale. These are my first impressions after 2 weeks of Usage :-  \n1) Screen and Body :- The Screen is one of the best in spite of LCD screen the\nbrightness is best. The Auto brightness feature adjusts the brightness in\nsunlight and at night and conserves the battery. The body is metallic and\nslippery so please buy a back cover to protect the phone. The screen comes\nwith a screen guard which is not end to end so was disappointed.  \n2) Performance :- The Performance is breeze for day to day tasks and didnt\neven slightly heat up. Not tested for any games as I am not a gamer. The\nHiSilicon Kirin CPU performs the tasks almost efficiently and consumes very\nless battery.  \n3) Battery life : I am getting easily 1.5 days of battery life with Dual Sim (\n4G + 2G) so in comparision to Redmi Note 4 its almost same. See Screenshots  \n4) EMUI :- I was using the Xiaomi phones so was used to MIUI skinned interface\nso didnt find any difficulty of non app drawer. Infact it helps in arranging\nthe Apps in folder structure. The navigation is fairly smooth. Dont forget to\ndownload the HiSuite for Windows. Fingerprint scanner is fastest I have ever\nseen. Also it can be used for aother functions like photo shutter, Gallery and\nNotification Scroll etc.  \n5) Camera :- This is best part of Phone. I have used it to fullest. The Bokeh\neffect works like charm and my friends with Iphone 6 are envious of the camera\nperformance. Best part is you can change the post after clicking the photo.\nThe Light painting mode is another great add on. Please see the samples. The\nHDR mode is also great and focus on object is highlighted. The food more is\nfor all the socialites and food lovers If you are looking for Camera phone\nthen shut your eyes and buy this  \nCons :-  \nDual Card Management :- SIM1 is 4 G and SIM2 is 2G only. Who on earth uses 2G?\nIt has hybrid sim slot but the slot is for 2G :( and if you have two 4G sims\nthe you are in pickle. They have software mode to switch the sim to 4G slot\nbut its cumbersome.  \nNo official Accessories. The back cover is still not officially available on\nhonor website but I got a local one. Xiaomi usually launches Backcover\naccessories with phone and Huwaei should learn as its source of revenue.  \nNo USB type C :- All new phones follow this standard.  \nNo Fast Charging :- Takes 1.5 - 2 hours to charge phone\n\n", "I have been using this device for 1 month . Here are my opinions about this\ndevice  \n  \n1 . Display  \nDisplay is crisp and better than note 4 . It does not reproduce colour like\namoled displays .It is one of the best displays in this range. It does not\ncome with any type of protection  \n2\\. Audio quality  \nSpeaker delivers adequate sound . Not so loud but it is usable . Audio quality\nthrough headphones is good but not loud . It might improve with nougat update.  \n3.Software  \nEmui is not that appealing for everyone. But it provides lots of options . You\ncan use nova launcher for stock like experience. With nougat update It has\nbecome close to stock android experience .  \n4.camera  \nCamera is the best part in this phone . It has lots of modes and performs well\nin daylight . Low light performance is average as it is expected in the budget\nsegment.selfies are good.  \n4.gaming and multitasking  \nIt's performance is good . It has good touch response . No lags on\nmultitasking . Minor framedrops on high graphic games  \n  \n5.Signal reception and call quality  \nI have no issues with the call quality . It has better signal reception than\nother phones in this price range.  \n  \nPlease press helpful if you find this informative\n\n", "Bought this phone from Amazon, used for few months, not a great buy. Slippery\nphone, very first short drop, the camera glass cracked as it protudes above\nthe back surface. Second drop, it amazingly deformed, now my phone keeps\nrebooting on its own frequently as the on/off button got bent in & so the\nvolume keys. Had to use floating dock to turn on/off the screen. Poor material\nstrength like plastic. Have to drain more money now to get all this fixed.\nThirdly, regarding performance, after the OS update, some apps keep frozen\nwhile opening up, need to purge & reopen them 3-4 times to successfully open.\nFourthly, not good to see the home screen esp. for iphone pre-users (I was).\nPixel density or resolution or whatever, its no where close in comparison to\nthe retina display. If only iphones offer dual-sim, wouldn't haven ditch them.\nNow ditching this Honor & maybe trying my luck with redmi note 4. Honor needs\nto work on enclosure metal strength, camera protection and glassy display (too\nmuch glare/reflection on the screen due to light).\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 March 2017", "on 15 May 2017", "on 27 February 2017", "on 6 June 2017", "on 8 March 2017", "on 11 February 2017", "on 9 February 2017", "on 16 February 2017", "on 18 May 2017", "on 16 July 2017"], "reviewer": ["Arshad Parwez", "Karan Singh", "SAYAN", "Himanshu", "RAJU ADHIKARY", "Worth It Reviews", "MANOJ KUMAR K M", "Pushkar Potnis", "Lijo", "adithya"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["I would like to not to recommend who want to buy this ...", "Super stable phone", "Battery Good But Camera Poor.", "After 20 days of use I changed to P2 with snapdragon 625", "Nice feature rich phone", "Awesome Phone", "Since then it has been a joy ride with this gadget", "VoLTE not working in My Circle.", "GHANTA SWAG", "Superb mobile"], "review": ["This phone has some technical problems. I am not able to do call on JIO TO JIO\nnetwork. I would like to not to recommend who want to buy this phone for jio\nnetwork. It will work well on other networks but not on JIO TO JIO.\n\n", "I am writing this reviews for Honor 6X after 1 year (Inspired by GeekyRanjit\nYoutube Channel, watch the channel after this review). If you are considering\nto buy this phone you must go through these following points to know the\ninside story of this phone and where it stands in front of its competitors.\nYou must also check YouTube for more clarity.  \n  \nThis review will be a short and crispy quick comparison between it's biggest\ncompetitor i.e. Xiaomi Redmi Note 4.  \n  \n1\\. The build quality of both the phone is good, you can choose anyone\nregarding this point.  \nThe in-hand feel is almost comparative, but it's slightly better on Xiaomi\nRedmi note 4, due to its curved design integration from the previous model\nRedmi Note 3.  \n  \n2\\. They have almost same features, but the Redmi Note 4 has IR blaster, which\nis not present in Honor 6X. So buyers if you are considering to use your phone\nfor controlling any of your home appliances via a phone instead of remote,\nconsider Note 4.  \n  \n3\\. They have 1080 P i.e FULL HD screen quality, but If you are more into\nmovies and videos all the time, consider Honor 6X as it feels much better,\nNote 4 has also good screen but inside, by side comparison, the Honor 6X wins.  \n  \n4\\. One Con both the device have is, you simply don't know what kind of glass\nprotection you get in these devices. As the screens are made by multiple\nmanufacturers.  \n  \n5\\. Cellular call quality was good on both the devices. Both the devices have\nnice cellular connectivity, and yes both support RELIANCE Jio, without any\nissues.  \n  \n6\\. Speakers on these devices are pretty good. Both the devices have single or\nmono speakers at the bottom, and both are pretty good and loud, but if you\nhave to pick one the speaker on the Redmi note 4 was louder.  \n  \n7\\. Now coming to the audio output via a headphone or microphone, both were\ngood but Note 4 was slightly better, the amplification was good and base and\ndepth were better in Redmi Note 4  \nSo if Music is your highest criterion prefer choosing Redmi Note 4.  \n  \n8\\. Now coming to the camera, here things change completely, the Honor 6X has\nthe dual rear camera, whereas the Redmi Note 4 has a single camera at the\nback. The Honor 6X has definitely a better camera in comparison. In outdoors\nboth are almost similar but indoor the Honor 6X performs better.  \nEven the front facing Camera of Honor 6X is better than Redmi Note 4, the\ncamera is always where Redmi note series fails (generally).  \nAlso, the recorded videos are better by Honour 6X, as the sound recorded by\nRedmi Note 4 is tiny.  \n  \n9\\. Now coming to GAMING, the Redmi Note 4 completely steel's the show, the\nHonor 6X also played a lot of games, but when playing really heavy games it\nwas lagging sometimes, particularly with Asphalt 8 it lagged quite a bit,\nwhereas on Redmi Note 4 it played all the games easily without a lag, So of\nyou are a Gamer consider going with Redmi Note 4.  \n  \n10\\. Now coming to the fingerprint sensor, both have fingerprint sensor at the\nback, but it was a bit faster on Honor 6X.  \n  \n11\\. The battery on both the device is good, it will last you more than a day\non moderate usage.  \n  \n12\\. Now coming to screen on-time, the Honor 6X gives you around 6 - 6.5 hours\nof screen on time, whereas the Redmi note 4 gives you around 8 - 9.5 screen on\ntime, as it has a slightly bigger battery of 4100 mA. So if battery life is\nyour highest criterion better go with Redmi note 4.  \nNow coming to Charging time, the Honor 6X takes around 2 hours and 45 minutes\nto charge, whereas the Redmi Note 4 takes around 2 hours and 55 minutes\napproximately.  \n  \n13\\. One thing we will all hate is both simply do not support FAST CHARGING,\nAmazon claims that the Honor 6X has fast charging, but it simply doesn't\nsupport that.  \n  \n14\\. Now comparing to price the 3 GB variant of Honor 6X is of 13,000 and 32\nGB Redmi Note 4 is of 11,000.  \nSo if the price is the highest criterion the Redmi Note 4 is Rs 2000 cheaper.  \nNow redmi Note 5/pro launched and it might be better. Will update after\nusing.. But again wanna say this is a very stable phone..  \n  \nSo I think I was able to help someone and was able to clear some doubts and\ngive you quick insights of this product.  \n[...]  \nAs always  \nCompare before you buy, Enjoy.\n\n", "First i'm disappoint with its late Delivery. Its take 5 days to hand over....  \n  \nThere are many phones from many manufacturers in this price range and people\noften are confused when planning to buy a phone in INR 10K-15K range. I too\nwas confused before I decided to go with Honor 6x but I am glad I am went for\nit as I hadn't owned a Huawei device yet. Writing an in-depth review here\nwhich may help potential buyers in making a choice to whether go for this\nphone or not.  \n  \nFirst up, the box contents:  \n1\\. Phone (comes with screen guard installed. Please note its screen guard and\nnot tempered glass screen guard)  \n2\\. Charger (fast charging is NOT supported)  \n3\\. SIM tray ejection pin  \n4\\. Manual  \n  \nFirst looks & feel:  \nThe phone looks classy and feels very nice in hand. The weight is pretty\ndecent. No capacitive buttons at the bottom (they should have provided that).\nThe buttons are on-screen only. There is a LED notification light. No IR\nblaster. Phone has hybrid sim slot. Rear camera lenses protrudes out a bit (as\nis case in many phones).  \n  \nScreen & Display:  \nScreen is curved at the edges and gives a premium feel to the screen. Display\nis sharp. You can customize color temperature to warm, cool, or custom\nsetting. Auto brightness provided which works well. No problems in viewing the\nscreen in full sunlight also.  \n  \nCamera:  \nCamera is USP of this phone. Both dual rear camera and front camera take good\npictures. Honor 6x seems to be one of the best camera phones for its range.\nRear camera even takes decent pictures in low light conditions. Bokeh mode\nsupported. I found the beauty mode for selfie to be very good and not as\nunrealistic as other phones. One should not expect the camera to be as good as\niPhone or Samsung Note series at this price range.  \n  \nSpeakers: Speakers are bit of disappointing. No dolby stereo. Single speaker.\nNo bass at all. Lenovo K series phones are best for audio experience.  \n  \nUI: This is where people who love customization will love this phone. Huawei\nrun their proprietery EMUI over Android OS and provide quite a few\ncustomizations such as themes, fonts, screen display color temperature,\nadditional controls on lock screen, hovering menu on screen etc . The UI is\nfluid and very good. As I said, this phone is good for people who like\ncustomizing their phones. People looking for pure out of the box Android\nexperience can take a look at Mi A1  \n  \nFingerprint Scanner: Fingerprint scanner is located at the back of the phone.\nThe positioning is little too close to rear camera and you sometimes times\nkeep touching the camera inadvertently while unlocking the phone. The\nfingerprint scanner is however is extremely responsive and very accurate.  \n  \nPerformance: Has Kirin processor which does not really measure up to\nSnapdragon in performance. However for browser based, office apps, and light\ngame users you would not feel any difference. This is not a phone for avid and\nheavy gamers.  \n  \nSoftware Update: Has Android Nougat 7 update released officially that can be\ndownloaded and installed.  \n  \nBloatware: Honor has not put in any 3rd party bloatware but there are quite a\nfew Honor apps pre-installed. Not too many though. I actually liked the Hi-\nCare and Health app.  \n  \nRatings:  \n  \nCamera: 3/5  \nLook &Feel: 4/5  \nScreen: 4/5  \nRAM: 4/5  \nSpeakers: 3/5  \nPerformance: 4/5  \nBattery: 5/5  \n  \nVerdict: Phone feels premium with metal body and 2.5D curved glass. Go for\nthis phone if you want an excellent camera at this price range. Phone is good\nfor users who love customizing their phones (pure Android fans can look at Mi\nA1). Speakers are disappointing, not a phone for hardcore music enthusiasts.\nPhone is also good for light gamers but Asphalt lovers can stay away.\n\n", "Better buy Lenovo P2.  \n  \nI got this 64gb for 11000 with cashback  \n  \nSound is very very low, After android N update network issue auto disconnet  \nNo earphone, screen protector , seriously it hangs many times with small games\nlike Road draw.  \nCamera is just of normal quality not excellent, bokeh effect doesnt work\nproperly everytime or most of the times.  \nDesign is sleek and better but software is poor, specially camera part.  \n3340mAH battery , quick charger and even without quick charging support.  \nworst customer service, When i purchased this they mentioned free 30 days\nscreen breakage cover (removed from description now) and 3 months extended\nwarrantee , when i was registering for 3 months extended warrantee they said\nthis is not covered, and they have even mentioned it from Amazon description.  \nCustomer care is poor , all in one customer service for different companies.  \n  \nI got Lenovo P2 4 GB RAM (snapdragon 625) for 13k with instant discount from\nflipkart , you get a really good earphone , screen protector,  \nAmoled screen (personal preference, as black is great, white is yellowish) ,\nSound quality is awesome (though doesnt have dolby for this series but it is\nnot less than dolby),  \nother features like NFC (for instant payments) , theater max , front finger\nprint sensor with 3 in 1 touch pad.  \n5100 Mah battery, with 30 w super changer , OTG Adapter  \nCustomer service is great for Motorola and lenovo  \nI will say better buy 3 GB ram variant as storage capacity is same and it\ndoesn't make any difference in working if you dont play heavy games everytime.\nit was there for 11.2 K with instant discount of 1350 for HDFC users.  \nonly Cons are : 32 gb memory for both variant, hybrid sim tray even when phone\ncapacity is just 32 gb, amoled screen that I dont like (not as bright as IPS\nLCDs)\n\n", "Writing a review after using the phone for some time:  \n  \nPros:  \n1) The best part of the phone, camera. (Camera is simply superb. Takes\npictures very close to dslr camera.)  \nHad used the camera to shoot pictures for an event, the photos were very close\nto quality of the pictures taken by the photographer during the  \nevent. If you are looking for camera phone your search ends here.  \n  \n2) Battery life : Phone easily does 2 days without much of multimedia activity\nlike watching videos or playing games.  \nWith multi media activity it can easily do 1/1.5 days.  \n  \n3) Feel of the phone is really nice. Fits well in the hand, the finger print\nscanner is very well located and responsive. Phone is very thin.  \n  \n4) Phone is fast and responsive, have not noticed any lag what so ever.\nAndroid 7 is come yet to update the phone to it.  \n  \n5) No heating issue when you cast the phone screen. ( I used to use moto X, it\nused to heat up like a iron box)  \n  \n6) Video quality is also very nice but no 4k recording.  \n  \nCons :  \n1) The screen could have been better. The phone is so close to being perfect\nbut the screen is very bland.  \nI was used to super amo led display which is a bit over saturated by the\nscreen on 6x could have been better.  \n(Please improve the color quality on the screen and sure that phone would top\nthe reviews.)  \n  \n2) Should have option to remove all the default software's which are bundled\nwith the phone. We can remove a few of them but some can't be.  \n( I guess it would have to do with some contract between the phone\nmanufacturers and app companies)  \n  \nSummary : Very nice phone for its cost, colors on the screen could have been\nbetter.\n\n", "Bought it on Prime day at the price tag of Rs.10,999 with 15% cach back on\nHDFC card.  \n  \nAgain a very good offer from Amazon, feeling happy to own this phone.  \n  \nThe phone comes with Data cable, Power adapter, Sim Ejection Pin, Quick start\nguide and Warranty Card.  \n  \nPros:  \n  \nPhone built is really great, awesome look  \nBattery back up is good  \nCamera quality is good  \nDisplay is good  \nNo heating issue  \n  \nCons:  \n  \nSIM 2 supports only 2G  \nEarphone doesn't come with this phone  \n  \nAdditionally, if you want to put tempered glass then you can go for 'Azure\n2.5D curved Tempered Glass Screen Protector for Huwai Honor6x' which is\navailable in Amazon as well.\n\n", "I bought this phone for Rs. 13,000 in Amazon Big Sale in the month of May.\nSince then it has been a joy ride with this gadget. Throw any parameter for\nbuying a mid range smartphone and you will find this one is there.  \n  \nProcessor+RAM - Enough to handle daily work and heavy graphics. Videos played\nare crisp and without any lag.  \n  \nBody - It has got a Metal Body which looks premium.  \n  \nScreen - 5.5\" screen is vibrant in colour with 2.5D curved glass. There is a\nscreen coating from company which is already pasted on screen.  \n  \nBattery - I am a very heavy user with WiFi, Data, Video, Instagram,\nFacebook..., hence I get one full day juice. User experience may vary.  \n  \nSound - Is decent but not very high. No headphones in the bundle.  \n  \nCamera - Main 12 mp IMX386 sensor takes beautiful images. The 2 mp monochrome\nsensor helps creating Bokeh effects. Twin camera is good setup on this phone.\nSelfie Camera is good but without 'Beauty Mode' it gives good photos. Some\nphoto samples are added here.  \n  \nUpdates - Phone came with Marshmallow and updated to Nougat in June. Oreo\nupdate is lined up for January 2018.  \n  \nService - Huawei has service centers in major cities in India. So far have not\ngot any problem with phone, so cannot comment on that.  \n  \nPrice - At 14,000, its a best deal you can get any time.\n\n", "I am using this device since last three week, I am reviewing honestly  \nThe mobile phone worked perfectly for the first 10 days until return windows\nwas open, But now there is serious bug that makes my life miserable, I am\nusing Jio, but Can't call Any Jio Number the calls gets auto cancelled, I\ntried every single thing possible, from updating the device to nougat, to\ncontacting Jio customer care, When i contacting HUEWEI customer care they said\nproblem is identified and we are trying our best to solve this issue. Believe\nme guys this device is having serious issue when it comes to VoLTE in some\ntelecom circle, I am in no position to even return the phone, neither i am\nable to call any relative. I am tired of this device. There are many people\nfacing this issue but not everyone is using Jio and Not everyone have same\ncircle. Believe me think twice before getting trapped into situation like me.  \nI am very much disappointed.  \nIn case this issue get resolved i will Give 5 star.\n\n", "My moto g4 plus camera better than this,how let understand  \n1.In front camera-it takes so white photos so you becomes like A DUMMY OR\nPUPPET THAT SPREADS BEAUTIFUL-COMPLETELY ARTIFICIAL  \nAND ALSO HAVE BLUR IN GOOD LIGHTING  \n  \n2.BACK CAMERA IS GOOD BUT WHAT ABOUT DUAL CAMERA SWAG-MY MOTO G4 PLUS COMPETE\nTHIS IN A FANTASTIC MANNER.  \n  \n3.NO GORILLA GLASS PROTECTION.  \n4.VERY BAD LOUDSPEAKER-NOT. A SHARP VOICE  \n  \nEK NO KA HARAMI HONOR-MADE FOOL-THE SWAG PHONE-JUST COMPARE THIS WITH MOTO G4\nPLUS THAN YOU WILL KNOW WHAT CAMERA.  \n  \nF****R PHONE,GHANTA SWAG-NOT SUCH A GREAT CAMERA\n\n", "M received my mobile in 6july. only charger and a sim change tool accessories\nu got with this mobile.  \nDescription of mobile- PRONS  \n1.camera is awsone,no one beat this camera in this segment.  \n2.display is good,better than mi note and lenovo k4 note nice viewing in\ndirect sunlight.  \n3\\. Build quality is nice not so good,but not bad.  \n4.EMUI is very smooth to operate.  \n5.tones of good features in this phon.  \n6.Always 2gb ram is almost free.  \nCONS-  \n1.sound quality is Little low when m compare to my old k4 note.  \n2.no sound equalizer.  \n3.missing auto call recording feature.  \n4.hard to find tempare glass and cover in local market.  \nAdding some cam pic\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 July 2017", "on 27 February 2018", "on 10 November 2017", "on 12 August 2017", "on 25 June 2017", "on 15 July 2017", "on 8 September 2017", "on 12 July 2017", "on 8 February 2017", "on 14 July 2017"], "reviewer": ["Purnendu kumar", "saurab", "Arpan", "Ripudaman Kochhar", "Jithin M.", "Nandhakumar S", "Amazon Customer", "Ankesh", "Sachin Sharma", "Vivek b."]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["THE BUDGET BEAST😎👍", "Five Stars", "Great phn loves it", "A phone worth buying if you are photo geneic or photography with low budget!!", "A good product for its price!", "VFM Mid-Ranger with a  cool dual camera", "All you need to know", "Great product", "Way above expectations", "Quality as expected"], "review": ["CONFIGURATION-  \nOS- Android 6.0.1(upgradable to 7.0.1), EMUI 4.1(currently running on\nEMUI5.0.1  \nDual SIM  \n5.5 inches  \nProcessor- Octa Core  \nFull HD Screen  \nChip-Hisilicon Kirin 655  \n64gb internal memory expandable upto 128gb  \n4gb ram  \nFront camera- 8mp  \nRear Camera-12mp+2mp  \nBattery-3340 maH  \nFast charging  \n  \nI am dividing this review into pros and cons.  \nHere we go-to  \n  \nPROS:-  \nfast charging  \nVery good battery life even though it have 3340maH battery capacity but it\nlast longer.  \nYou will get around 5-6 hours of battery life.  \nIt runs almost lag free,it doesn't have any UI lag ,you easily play high end\ngames easily on it without any over heating or lag.  \nIt has got very good build quality as it has full metallic body.  \nIt has the best camera under 14k ,you can easily shoot full hd videos with it.  \nIt has lens blur mode which is almost same to potrait mode of flagship\nmobile's.  \nIt clicks very good selfie and beauty mode works really well on it.  \nRAM optimization is one of the best under 25k.  \nFinger print sensor is very accurate and pretty fast. Honor phones have one of\nthe best finger print sensor in industry. It has got almost every sensor in\nit.  \n  \nCONS:-  \nIt is little slippery use back cover to handle it well.  \n  \nFINAL VERDICT:-  \nBest phone you can buy under 14k.  \nNo heating issue, great gaming performance , brilliant rear and front\ncamera,lag free UI, fluid performance, good battery life all these make it a\ngreat buy.  \n  \nUPVOTE IF YOU LIKE IT 👍  \n(Sorry,if any information regarding configuration is wrong.)\n\n", "Awesome phone by Honor 6X\n\n", "Lemme give u a short n sweet review of Honor 6x.. Am using this phone for\nabout one week. Yes like everyone who plans to buy a gud phn (inturn low cost\nin mind) did many research, youtube videos,  comparison and finally convinced\nto buy dis phn.  \nAmazon was amazing in its promise as its delivers the product a day b4 the\ndelivery date.  \nPros:  \n1.U cant hide the wow expression while unboxing. Look very premium. I would\nsuggest u to ve a back case for it is bit slippery.  \n2\\. Display is awesome says HD but its way too gud.  \n3\\. Fingerprint sensor works great. It unlocks 9/10 times without hassle.  \n4\\. No heating issue. ( hey it does heats up while charging. Its normal\nthough)  \n5\\. Can play heavy games no lag at all. Can feel it warmsup after prolong\nusage.  \n6\\. Multi tasking is at ease no issues.  \n7\\. Lots of modes available for camera. Its fun. But if u ve knowledge in pro\ncamera funtionality thn dis phn has d ability to perform lot more in camera\ndepartment.  \n8\\. Calls Clarity are very Gud no issues with dat.  \n9\\. EMUI 4.1 n Android 6 was present out d box received update to EMUI 5.0 n\nAndroid Nougat (2.46Gb mind u). After update only i got Volte. I must say EMUI\nis userfrndly n has lots of features.  \nCONS:  \n1\\. The main reason i brought dis phn is bcas of dual camera. Its Gud but not\nupto my expectation. (yes keeping price in concern). In bokey effect object\nlacks sharpness in the boundary)  \n2\\. Its has dual 4G (they mentioned) but Its a 1st sim 4G/3G/2G n 2nd 2G sim\nNot even 3G. I dono y the heavens did dey designed like this.  \n3\\. Says Fast charging available but hey again why false promoting.  \nFinal Verdict:  \nU can see there is lots of pros n fews Cons(yes ofcourse)  i would suggest u\nto go for dis phn. Has a Gud battery backup. Best phone in this price tag.\nThank you.\n\n", "Perfect camera phone , dual camera is just good ya it's admittable that the\nportrait is not up to the mark because of the setup. But this kind of dual\nsetup helps you to get a better low light pictures. That's why OnePlus also\nSwitched to this setup in op5 T . And the front cam is just the best you could\nget at this price point, no other phone perfoms so well with front cam.  \nYa if you just need a 2x zoom and better portrait choose the Mi a1 , and need\na better low light, selfi mode choose this one and the pro mode is best part\nand no other phone would provide such a pro mode. Ya I know Honor 7x has come\n, but it's not a big upgrade as screen resolution is lower and beside the\ninfinity display the phone has nothing new , even the design is not good for\nregular use as could damage the cam setup. Processor is a bit upgraded not\nthat much.  \nBut I think proper care and covers may help & choosing that one is also good\nif you just need a new gen display. But if you want better resolution opt for\nthis or honor 9i (which is bit costly).  \nPerformance___________________________________the performance is good and can\nplay many of the graphic intensive games without lags and can store much of\napps and games . So performance is not a issue, sometimes now I get some\nframedrops in some of the games very rarely I think it's bcz I have loaded\nmore than 100 apps and games.  \nDesign_________________________________________design is good but very prone\nto scratch and damages as it is metal surfaced , a slight hit could get some\nstraches or bends and the screen is too delicate can break if you drop it down\n. So get a tempered glass and cover so that it doesn't get damaged.  \nMany say that the audio quality of speakers is not good . But actually it's\ngood and gives loud sound in indoors. Outdoors every phone just fails to get a\naudible sound tested with Mi a1 and Xiaomi note 4 .  \nBattery life is good due to the battery backup and software, for a normal user\nit's two days and a heavy users may get a battery life of 1 day.  \n___so at last the it's up to you, choose according to your needs and\npreferences & not according to friends or 3rd person advice or tte best value\nfor money phone_______________________________  \nI also on YT , channel name is TecH 16 and also there a fb page , any doubts\nor difficulty to choose a phone just msg me your budget, requirements and\npreferences of features and i would suggest you the best.\n\n", "This is my first time using a Chinese brand stepping outside of my\nconventional brand zone. Primarily because in this budget there's hardly any\nconventional brand phone being manufactured these days.  \nBut for what it's worth, I'm quite please with the end result.  \nWhen I read the reviews about the device before its launch, two things that\nreally struck me about this phone. They were:  \n1) Excellent battery management  \n2) Great picture quality, specially the front camera snaps.  \n  \nNow after using the device for a week, I must say I'm not at all disappointed\nabout the two striking features I just mentioned. But barring that, there's\nabsolutely nothing that's stands out about this device.  \nLet me list down the downsides of this phone.  \n  \n1) Cheap build quality. It doesn't feel comfortable to hold at all. Comparing\nit with Moto M or Moto G4 plus of the same screen size, they give a much\npremium feel. Also, the design is such, it is really difficult to have easy\none handed operations with this phone.  \n2) Not so efficient UI. I have faced app crashes on more than one occasion\nspecially with the apps requiring camera inputs. The apps would invariably\ncrash every time you launch the camera. This is fixed once you restart the\nphone but that's not ideal everytime.  \n3) Touch is overtly sensitive. I have accidentally made a number of calls\nwhile just scrolling my contact list. Touch responds way too quickly.  \n4) There's no option to change date and time format. It follows a pre set\nformat but then again, a lot of options to tweak android have been suppressed\nunder the UI skin. Hopefully EMUI 5.0 will allow more control.  \n5) Audio quality is really really poor. The speaker is a little above average\nbut the output of the headphones is very poor. I use premium Sony MDR\nheadphones and I couldn't sense good bass and treble balance even at the\nhighest volume level.  \n  \nThat being said, I'm very pleased to see that I don't have to charge my phone\neveryday and it gives me a very solid battery backup with average use. I'm\nable to get almost 8 and half hours of on screen time with mixed usage of 3g\nand WiFi, which is absolutely brilliant.  \nAll in all, it serves the purpose of a lasting smartphone really well and is a\ngood choice for its price range. If budget is not your constraint, then I'd\nadvice to consider Moto M or Moto G4 but I'd choose this phone over Xiaomi any\nday.  \n  \nHope this helps!!!\n\n", "Writing after Using it for a week. Bought after comparing with Redmi Note4,\nand reading a lot of reviews and agonising over a lot of choices in Mid Range\nsegment.  \nGreat Value for money . - Awesome battery life - 2 days with modest use like\nmine. Though it says no+ fast charging, yet I compared with wife and son's\nphone which have fast charging - it takes little less than 2 hrs for 0- 100%\ncharge, which is ok for me. Big plus is since it still has Micro USB an\nheadphone jack, all my Powerbanks, car chargers , cables OTG drive etc still\nworking. That is a big plus for me. Screen is big and bright, but I keep it at\nauto. I find lots of useful apps amongst the bloatware too( like phone\nmanager, gallery, health, app safe) - which I have retained. 4G works on both\nsims - but you have select, the other one goes to 2G. The Dual Camera is nice\nwith lots of settings/ features etc, which will keep the shutterbugs busy. The\nfingerprint sensor is fast and can be used to lock individual apps as well.\nThe EMUI takes a little while to get used to. Phone is fast with 4GB / 64 GB.\nOn an average 2.4 -2.8 gb remains free at any time. I hate the hybrid sim\nfeature, and wonder which idiot came up with the idea. Same for flash sales\nmodel. Overall, in 16000, a wonderful VFM phone.\n\n", "\\---------------------------  \nFirst Impressions :  \n\\---------------------------  \n(●) The phone comes with power adapter, data cable and sim ejector tool.  \n(●) The phone feels very premium while holding in hand, strong and sturdy\nmaterial. Its very comfortable to hold as well. The phone is a bit heavy, but\nthis adds on to the premium feel in hand. All the corners and edges are curved\nand smooth like a classy phone.  \n(●) Its made of full aluminium uni-body design, with metal-finish plastic at\nthe top and bottom like other devices at this price segment. The body is\nbrushed and feels matte kind and doesn't attract fingerprints. The front is\nall-glass and the bezels on the side is negligible, but the bottom bezel is\nquite large. Screen to Body ratio is more than 75 which is very good.  \n(●) Power button & Volume buttons are on the right side and buttons are also\naluminium where I got impressed. There is the integrated 'two sim cards/ one\nsim card & a micro SD card slot' on the left side, both supporting 4G LTE or\nVoLTE. The audio jack is on the top and there is a seconday mic there as well.\nThe speaker grille, primary microphone and micro USB port is at the bottom.  \n(●) Dual camera, flash & fingerprint sensor are at the back and one camera is\nthere in the front.  \n\\-----------------------  \nSpecifications:  \n\\-----------------------  \n(●) Screen size is 5.5 inches with FullHD resolution of 1920*1080 pixels.  \n(●) OS is based on Marshmallow with emotion user interface(EMUI4.1).  \n(●) Two nano sim cards, both 4G LTE or VoLTE.  \n(●) Octa-core processor from Hi-Silicon Kirin 655 chipset, graphics powered by\nMali T830MP2 GPU and 3GB RAM  \n(●) 32GB/64GB internal memory and expandable upto 128GB  \n(●) 12mp & 2mp cameras at the back and 8mp at the front, both supporting\nFullHD video  \n(●) Bluetooth v4.1 , WiFi a/b/g/n, Hotspot, GPS, GLONASS and BDS  \n(●) Hall effect sensor, Fingerprint sensor, Proximity sensor, Ambient light\nsensor, eCompass, Gravity sensor.  \n(●) Supports OTG and 3340mAh battery which is non-removable  \n\\--------------------  \nPerformance:  \n\\--------------------  \n(●) UI and apps performance,  \n1.) OS is Huawei's own Emotion UI 4.1 which is based on Marshmallow(6). Huawei\nhave said they will provide an update to Emotion UI 5.0 based on Nougat(7)  \n  \n2.) User Interface is cool and is more improved than previous Honor UI's. The\nOS has taken inspiration from ios on some aspects of UI like the notification\nshade as well as at many other areas. There is no app drawer and all apps are\narranged as before huawei has done with their UI. A search bar comes down if\nyou swipe the screen from the top.  \n  \n3.) There are a lot of opportunities available for you to tweak the UI as you\nlike it for daily purpose and to make it look better.  \n  \n4.) The navigation buttons are part of the display and notification LED is\nplaced at the top. Fingerprint sensor at the back is very fast and accurate\nthough not the fastest still does it's job easily and with perfection.  \n  \n5.) Applications loads quickly and performance is excellent in its class. I\nhave never observed any glitch or any lag during my hardcore usage before\nreviewing. However, graphic intensive games like Asphalt and Modern Combat\nwere not butter smooth even though playing experience was not bad in my\nopinion.  \n  \n6.) There is no heating issues, I did not experience overheating even while\nplaying games for a long time.  \n  \n7.) FullHD videos play fast and smooth and you can see the difference if you\nhave watched videos in HD(1280*720) devices.  \n  \n\\---------------  \n(●) Display:  \n\\---------------  \n  \n1.) Display is FullHD with 1920*1080 resolution. Watching movies is superb;\nthe blacks are deep and text edges are sharp almost like amoled displays.\nBrightness is comparable with similar phones of today.  \n  \n2.) Under sunlight conditions, instead of auto-increasing the brightness, the\nphone adjusts contrast and other aspects of the screen to provide a reasonably\ngood visibility of the contents and quite great visibility at sunlight.  \n  \n3.) The colors are rich and text is sharp, viewing angles are good and color\ngamut is awesome on this phone.  \n  \n4.) The screen is fingerprint magnet. The touches response is smooth & quick\nand sensitivity is excellent  \n  \n\\-------------  \n(●) Sound:  \n\\------------  \n  \n1.) 3.5mm audio jack is at the top. Even though there are two speaker grills\nat the bottom, there is only one speaker which actually works so it is mono.\nHowever on a phone, it doesn't make any sense to have stereo speakers if not\nfor loudness though this device is pretty loud.  \n  \n2.) Speaker volume for notifications & alerts are acceptable and loud enough.\nSound effects for movies is just fine; but excellent with headphones that rich\nbass and clarity makes it wow. However, speakers have enough loudness to play\nmusic and the sound quality is not bad either for a single grille speaker.  \n  \n3.) Video recording is done only in 1080p or 720p. There is a Slow Motion mode\nthat records video in 480p though drops frame sometimes  \n  \n\\---------------  \n(●) Camera:  \n\\---------------  \n  \n1.) There is one 12MP camera with Sony IMX386 sensor and another 2MP depth\nsensor at the back. The camera snaps DSLR like photos and the sensor gathers\ndepths clarity and details; the software then uses these detailinh to add\nvarious effects to photos. The pictures are excellent at the end in its class\nand you will get that boukeh effect with these lenses, well not like DSLR\nstill a good try.  \n  \n2.) Low light pictures are good with minimum noise, but the images are a bit\non the softer side and lacks saturation. Night shots tend to get blurred since\nshutter speed gets slower as sensors can't adapt quickly to dark and they take\ntime to focus.  \n  \n3.) You can shoot excellent portrait photos where the background can be\nblurred with a little focus and it creates that boukeh effect, all which are\ndone making use of the depth sensor and that's the awesome thing of this\nphone.  \n  \n4.) There is a Splash feature where you can highlight one color and make the\nrest in black & white.  \n  \n5.) Focusing is real quick and clicks quickly without noticeable lags.  \n  \n6.) The front camera is 8mp and is good for selfies and videos and for\nFacebook's live video also.  \n  \n\\--------------  \n(●) Battery:  \n\\--------------  \n  \n1.) Battery is 3340mAh which lasts more than 2 days on regular use. On heavy\nuse, it lasts around 7 to 8 hours. With Google navigation over 4G with online\nmusic streaming over bluetooth, the phone lasted for around 4 hours gaming was\nalso in the list.  \n  \n2.) With only 10% charge remaining, the Battery Saver mode can extend life to\nmore than 12 hours.  \n  \n3.) Charging speed is on the average. It takes more than an hour to charge\nfrom 0 to 50% and it goes from 0 to full charge in less than 3 hours, so no\nquick charging supported.  \n  \n\\----------------------------  \n(●) Other few things:  \n\\----------------------------  \n  \n1.) Even though both SIM's support 4G, only one SIM can connect to 4G at a\ntime, which can be switched in settings when needed.  \n  \n2.) Camera app will launch and a photo will be snapped if you double click the\nvolume-down button which is a great for sudden spy over someone and for\nsecurity and safety reasons. There is a feature in the camera app to include a\nwatermark in the photo.  \n  \n3.) The mic on top of the phone is used for the noise-cancelling function.\nThis feature is working well during phone calls and I asked the other one on\ncall he couldn't listen any other sound than my voice so it's great.  \n  \n4.) Audio for video recording is saved in stereo which is a real surprise\nwhile many expensive phones record audio in mono. So you can expect good sound\nreproductions  \n.  \n5.) You can expand the memory to up to 128GB using micro SD card while using\nonly one sim, in which case only one sim.  \n  \n6.) The phone supports GPS, Glonass and BeiDou which means your phone has more\nsatellites available to fix your geo-position more accurately.  \nPhone need not struggle to find enough satellites even if you are behind a\nbuilding or a tree thus spending less battery from the device.  \n  \n7.) Supports OTG to connect and transfer or stream from pen drives and\nexternal hard drive for direct data transfer.  \n  \n8.) There is support for Voice over LTE that enables making calls over 4G\nnetworks. This means you need not spend your voice call minutes for phone\ncalls, instead can use your data for the same.  \n  \n9.) The phone can memorize up to five fingerprints for more safety and multi\nuser unlocks. You can also perform functions like take photo, attend a call,\nstop alarm, etc. using fingerprint gestures which is a great feature though\ncommon now.  \n\\------------  \nCONS  \n\\-----------  \n(●) The OS Emotion UI 4.1 is too old operating system for such a nice spec\nphone; Huawei has said that OS update will come sooner via OTA.  \n  \n(●) The phone comes pre-installed with many apps and bloatware like Health\napp, News Republic, etc. where as most of these apps can be uninstalled easily\nwhich is a great relief.  \n  \n(●) The hybrid dual sim slot is a real constraint. If I use expandable micro\nSD card, I can't use the second SIM and vice versa. Another slot would have\nbeen beauty.  \n  \n(●) I would have been delighted if the phone had NFC. Usage of cashless money\nis going to be very popular for digital India and NFC devices may find its\nplace in many establishments very soon.  \n  \n(●) The phone did not come with a USB Type-C port. Apart from the faster data\ntransfer and ease of use of the pin, Type C supports extremely quick battery\ncharging though it doesn't charge with a good speed so it's a big step\nbackward.  \n  \n(●) IR Blaster would have been a nice feature that would help to operate\nhousehold devices with remote control cause most of the devices gets connected\nand it's pretty helpful.  \n\\-----------------  \nSummary,  \n\\-----------------  \n● The phone looks and feels premium and sturdy in hand, so thumbs up for\ndesign.  \n● It has most of the features you can find on a high-end smart phone; the OS\ndefinitely need an update still can be fixed later on.  \n● Dual camera is the best feature on it. This is one is among the two most\naffordable dual-camera phone that is currently available the other one being\nCoolpad Cool 1, I have reviewed both the phones. Smartphone photographers\nwould love this phone as you can very well produce DSLR like photos. However,\nI would say Cool 1's photos are a tag better than 6x's in richness, details\nand in color accuracy and sometimes noise reduction also. At the same time,\nnever compare this with the snaps produced from iPhone's dual camera which is\nin a different league cause it's sensor is no match for this device.  \n(●) Even though it lacks features like NFC, IR, USB Type C and 5GHz WiFi,\nthese are not deal breakers since these functions may not find extensive use\nand mostly not used by everyone on a daily basis.  \n(●) On the performance side, there is nothing that works against this phone in\nits comparison.  \n(●) Overall, one of the best phones you can buy below Rs.15,000 and I rate\nthis FOUR stars. One star off for the lack of features when compared with\ncompetition and those features if would be added then it is real 5 star class\ndevice.  \n  \n\\- Please give a thought to hit 'Helpful or Yes', if this was useful to you in\none way or the other.  \nThank you.\n\n", "* First Impressions **  \n● The phone comes with Power Dapter, data cable and sim tool  \n● The phone in hand feels very premium, strong and sturdy. Its very\ncomfortable to hold as well. The phone is a bit heavy, but this adds on to the\npremium feel in hand. All the corners and edges are curved and smooth  \n● Its a full aluminium unibody design, with metal-finish plastic at the top\nand bottom. The body is brushed and doesn't take fingerprints. The front is\nall-glass and the side bezel is very thin, but the bottom bezel is quite\nlarge. Screen to Body ratio is more than 75 which is very good  \n● Power button & Volume buttons are on the right side and buttons are also\naluminium. There is the integrated 'two sim cards/ one sim card & a micro SD\ncard slot' on the left side, both supporting 4G LTE. The audio jack is on the\ntop and there is a mic as well there. The speaker grille, primary microphone\nand micro USB port is at the bottom. There is an infrared blaster on the top  \n● Two cameras, flash & fingerprint sensor are at the back and one camera is\nthere in the front  \n  \n** Specifications **  \n● Screen size is 5.5 inches with 1920x1080 pixel resolution  \n● OS is based on Marshmallow  \n● Two nano simcards, both 4G with VoLTE  \n● Octacore processor with HiSilicon Kirin 655 chipset, Mali T830MP2 GPU and\n3GB RAM  \n● 32GB internal memory and expandable upto 128GB  \n● 12mpx & 2mpx cameras at the back and 8mpx at the front, both supporting Full\nHD video  \n● Bluetooth v4.1, WiFi a/b/g/n, Hotspot, GPS, GLONASS and BDS  \n● Fingerprint sensor, accelerometer, proximity sensor, compass  \n● Supports OTG and 3340mAh battery which is non-removable  \n  \n** Performance **  \n● UI and apps performance  \n\\- OS is Huawei's own Emotion UI 4.1 which is built on Marshmallow. Huawei\nhave said they will provide an update to Emotion UI 5.0 based on Noughat  \n\\- User Interface is cool and is more refined than previous Honor UIs. The OS\nhas taken inspiration from iOS on some aspects of UI like the notification\nshade as well as at many other areas. There is no app drawer and all apps are\narranged similar to that of iOS. A search bar comes down if you swipe the\nscreen from the top  \n\\- There are a lot of opprtunities available for you to tweak the UI as you\nlike, and its fun  \n\\- The navigation buttons are part of the display and notification LED is\nplaced at the top. Fingerprint sensor at the back is very fast and accurate  \n\\- Apps are quick to load and performance is excellent in its class. I have\nnever observed any slowness or lag. However, graphic intensive games like\nAsphalt were not perfect smooth even though playing experience was not bad  \n\\- There is no commendable heating problem; I did not experience overheating\neven while playing games for a long time  \n\\- Full HD videos play fast and smooth  \n  \n● Display  \n\\- Display is Full HD with 1920x1080 resolution. Watching movies is superb;\nthe blacks are deep and text edges are sharp. Brightness is comparable with\nsimilar phones  \n\\- Under sunlight, instead of auto-increasing the brighness, the phone adjusts\ncontrast and other aspects of the screen to provide a reasonably good\nvisibility of the contents  \n\\- The colours are rich and text is sharp, viewing angles are good and is\nnever a problem on our regular holding pattern  \n\\- The screen takes in a lot of fingerprints. The touches are smooth & quick\nand sensitivity is excellent  \n  \n● Sound  \n\\- 3.5mm audio jack is at the top. Eventhough there are two speaker grills at\nthe botton, there is only one speaker which means it is mono. However on a\nphone, it doesn't make any sense to have stereo speakers if not for loudness  \n\\- Speaker volume for notifications & alerts are acceptable. Sound effects for\nmovies is just fine; but excellent with headphones. However, speakers have\nenough loudness to play music and the sound quality is not bad either for a\nphone  \n\\- Video recoding is done only in 1080p or 720p. There is a Slow Motion mode\nthat records video in 480p  \n  \n● Camera  \n\\- There is one 12MP camera with Sony IMX386 sensor and another 2MP depth\nsensor at the back. The camera snaps photos and the sensor gathers depth\ninformation; the software then uses these information to add various effects\nto photos. The pictures are excellent at the end in its class  \n\\- Low light images are good with minimum noise, but the images are a bit on\nthe softer side and lacks vibrancy. Night shots tend to get blurred since\nshutter speed gets slower  \n\\- You can shoot excellent portrait photos where the background can be\nblurred; all which are done making use of the depth sensor  \n\\- I read that you can refocus and adjust depth of field even after taking the\nphoto using third party apps due to the depth information available with the\nphoto. But I could not find a way to do this, hence not sure whether this\nfeature exists or not  \n\\- There is a Splash feature where you can highlight one colour and make the\nrest in black & white  \n\\- Focussing is quick and snaps are completed quickly without noticeable lag  \n\\- The front camera is 8MP and is good for selfies and videos  \n  \n● Battery  \n\\- Battery is 3340mAh which lasts more than 2 days on regular use. On heavy\nuse, it lasts around 7 to 8 hours. With Google navigation over 4G with online\nmusic streaming over bluetooth, the phone lasted for around 4 hours  \n\\- With only 10% charge remaining, the Battery Saver mode can extend life to\nmore than 12 hours  \n\\- Charging speed is on the average. It takes more than an hour to charge from\n0 to 50% and it goes from 0 to full charge in less than 3 hours  \n  \n● Other few things  \n\\- Eventhough both SIMs support 4G, only one SIM can connect to 4G at a time,\nwhich can be swapped in settings as and when needed  \n\\- Camera app will launch and a photo will be snapped if you double click the\nvolume-down button. There is a feature in the camera app to include a\nwatermark in the photo  \n\\- The mic on top of the phone is used for the noise-cancelling function. This\nfeature is working well during phone calls  \n\\- Audio for video recording is saved in stereo which is a real surprise while\nmany expensive phones record audio in mono  \n\\- You can expand the memory to up to 128GB using micro SD card, in which case\nonly one SIM card can be used  \n\\- The phone supports GPS, Glonass and BeiDou which means your phone has more\nsatellites available to fix your geo-position accurately. Phone need not\nstruggle to find enough satellites evenif you are behind a building or a tree\nthus spending less battery  \n\\- Support to OTG helps to connect pendrives and external hard disks for\ndirect data transfer  \n\\- There is support for Voice over LTE that enables making calls over 4G\nnetworks. This means you need not spend your voice call minutes for phone\ncalls, instead can use your data  \n\\- The phone can memorise up to five fingerprints. You can also perform\nfunctions like take photo, attend a call, stop alarm, etc. using fingerprint\ngestures  \n  \n** After sales service & Warranty **  \n● After sales service is always a problem for these manufacturers since they\nalways have a monopoly mindset. Since they know you can't go anywhere else,\ncustomer-friendliness is quite unimportant for them  \n● As I learned drom their website, Kerala has the highest 'service center\ndensity' and there are a few states like Telangana, Manipur, Mehgalaya &\nNagaland where there is one or two centers only  \n● If within warranty, they will repair it free of cost. However if any part\nneeds replacement (for eg. display), its sure to take around a month since the\npart has to come from China  \n● To avail warranty, you need to submit the invoice from Amazon which was sent\nto you along with the phone or this is available for download at Your Orders  \n  \n** I dont like these **  \n● The OS Emotion UI 4.1 is too old an OS for such a nice spec phone; Huawei\nhas said that OS update will come sooner  \n● The phone comes pre-installed with many apps and bloatware like SMS app,\nHealth app, News Republic, etc. Thankfully, most of these apps can be\nuninstalled easily  \n● The hybrid dual sim slot is a real constraint. If I use expandable micro SD\ncard, I can't use the second SIM and vice versa  \n● I would have been delighted if the phone had NFC. Usage of cashless money is\ngoing to be very popular and NFC devices may find its place in many\nestablishments very soon  \n● The phone did not come with a USB Type-C port. Apart from the faster data\ntransfer and ease of use of the pin, Type C supports extremely quick battery\ncharging  \n● The phone does not support WiFi ac, which prevents this from connecting to\nultrafast 5GHz WiFi signals. This is most useful if you live in an apartment\namong many other interfering WiFi signals that may cause poor reception of\nWiFi by your devices. A 5GHz WiFi signal causes less interference since it has\ngot more channels  \n● IR Blaster would have been a nice feature that would help to operate\nhousehold devices with remote control  \n  \n** Summary **  \n● The phone looks and feels premium and sturdy in hand  \n● It has most of the features you can find on a high-end smart phone; the OS\ndefinitely need an update  \n● Dual camera is the best feature on it. This is one is among the two most\naffordable dual-camera phone that is currently available as I review this in\nFeb-17; the other one being Coolpad Cool 1. Smartphone photographers would\nlove this phone as you can very well produce reasonably good SLR like photos.\nHowever, I would say Cool 1's photos are a tad better than 6x's in richness,\ndetails and in colour accuracy. At the same time, never compare this with the\nsnaps produced from iPhone's dual camera which is in a different league  \n● Eventhough it lacks features like NFC, IR, USB Type C and 5GHz WiFi, these\nare not deal breakers since these functions may not find extensive use  \n● On the performance side, there is nothing that works against this phone in\nits class comparision  \n● Overall, one of the best phones you can buy below Rs.15,000 and I rate this\nFOUR stars. One star off for the lack of features when compared with\ncompetition  \n  \n\\- Please give a thought to hit 'Helpful or Yes', if this was useful to you in\none way or the other.  \n  \n● [...]\n\n", "Got this after a lot of research. From youtube to amazon reviews.  \nWell to start with, got the andriod 7.0 update as soon as switched on.\nTransitions are great and really looks great in hand. Back is a bit slippery\nwith out cover, and trust me getting the cover is hard from market. I tried in\ndelhi. Coming to battery life, with 4g data onn its provides a decent back up.\nFunctions like app twin for fb and whatsapp is great. Fingerprint scanner is\nalso pretty fast. At this cost the camera functions are too damn cool. With a\nsteady hand or tripod the night mode is awesome and the star track too.  \nRest every things sets this phone way ahead from the rest at the same price\ngroup.\n\n", "As I am current user of 4X, and I choose 6X to upgrade the one. I am happy\nwith the performance and am use to the build of Huawai user interface. So 6X\nis as user friendly as 4X, nothing much exciting.  \nPros :  \nNice Build and BEAUTIFUL by look.  \nStrong on Camera and features  \nLooks quite delicate  \nYou will get 64gb/54gb to use, 10gb used by build  \nYou will get approx 2.4gb free ram as 1.4 is been used by system.  \nGood at speakers, musics, video, camera.  \n  \nCons :  \nThis is not 4g+4g, this has hybrid sim slot (going to ask for sattle some\namount for wrong configuration mentioned on Amazon  \nNo fast charging - take approx 3 hours to charge full  \nMotion features are less compare to 4X, only flip to mute is there  \nBack body matirial definitely need cover to protect from scretches  \nTouch glass require protection, co screen gard is very thin and can just help\na little in Scretches.  \nAnroid 6 build need an upgrade to OS soon  \nNot as expacted for heavy gamers.  \nNo gorrila glass, but quality is really good  \n  \nCheck some pictures of 4x and 6x side by side\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 December 2017", "on 9 July 2017", "on 9 May 2017", "on 24 December 2017", "on 11 February 2017", "on 5 March 2017", "on 21 March 2017", "on 19 March 2017", "on 27 July 2017", "on 15 February 2017"], "reviewer": ["Avinash Kumar Singh", "Amazon Customer Sk Vikas", "Arvi", "vivek", "Hardeep Singh", "Deepak", "Srinjoynandan", "Kaustubh", "Anirban Datta", "Nirav"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Honor 6X honors your money !!", "Camera: Amazing, Rest: can live with it", "Best mobile honor 6x.. Just go for it...you won't get this specification anywhere...", "Phone is getting switched off without any reason", "||Good Value for money|| Best camera phone in this range||Go for good battery life||", "SPEAKER ISSUE", "Great Phone for the Price - Pay Extra and Grab the 4GB ram Variant", "After two days use", "Great camera phone with brilliant display. Lacks in audio department.", "Overall happy with the phone and delivery time."], "review": ["I am using this phone for around 2 weeks now, and I used Moto X Style, Mi4i\nand iphone 4 in the recent past. H6X is a very good phone under 15k.  \nPros:  \n1\\. Very good back camera, it has many features including Bookeh effect\n(blurring the background), DSLR features like lighting effect, taking pictures\nin the pitch dark without even using the flash and so on.  \n2\\. The Front camera is also good in normal lighting condition but does not\nhave flash.  \n3\\. Battery back up is superb, would run a full day even with moderately heavy\nusage (gaming, 4G, GPS, music, movies etc.) and charges also quickly.  \n4\\. The Kirin soc is very good, no lagging, no heating. I play COC, Boom\nBeach, Kill Shot etc. pretty often and did not feel any heating issues.  \n5\\. The EMUI is very good and has lots of custmoisation option. Personally, I\nfeel it is somewhat better than Xiaomi's MIUI.  \n6\\. Display is good as well, as it is FHD. Decent sun-light readability and\nnight reading mode to reduce the blue lights.  \n7\\. Though the display is 5.5 inch, it is pretty much easier to use with one\nhand. I can do it even with my short and fat Chimpz fingers. Also, the phone\nis much slimmer.  \n8\\. It has 15 months warranty as against the usual 12 months by other\nmanufacturers.  \n9\\. The Finger Print Sensor is quite good and I am pretty satisfied with its\nresponse.  \nCons:  \n1\\. The loud speakers are not that loud and clear. Though one can hear the\nring tones from another nearby room, but in a crowded place one may miss a\ncall or two. For music lovers, I guess with a good pair of head-phones, one\ncan overcome this issue.  \n2\\. The metallic body is bit slippery, especially in summer as the hand sweats\nand the phone tends to slip from hand. I am using a back-cover to overcome\nthis.  \n3\\. The display is not Gorilla glass, so need to use tempered glass. The phone\nis provided with a factory fitted tempered glass by the manufacturer but it is\nprone to keep the finger marks so need to wipe every now and then.  \n4\\. There's a minute problem with the contact search option. Sometime, when I\ntry to search some contacts and try to type the name, it does not detect the\ninput. But, when I close the contact and reopen it again and search, it\nreflects the name. Seems it is a software glitch which would eventually get\nsolved when they would provide SW update.  \n  \nThis is what I feel of the Honor 6X after using it for more than 2 weeks and\ntruly I am loving it. What more one can expect at 14k.\n\n", "I got 2 of this device. 1 for me and another for my GF. Both of them are 3gb\nram 32gb rom.  \n  \nBuying decision : After waiting for weeks through the frustrating Flash sales\nof Redmi Note 4 and redmi 4 I was desperately looking for an alternative.  \nIt was the amazon prime day. And I searched for any smartphone that can give\nme value for money as good as redmi devices. Then honor 6x was discovered. I\nnever had used any honor device before, though I knew that the company also\nproduces some quality products just like xiaomi. I ran through some youtube\nreviews of this device and the reviews were not bad. I decided if not a xiaomi\ndevice may be an honor. Let me give a try. I ordered it.  \n  \nThe device arrived before time as advertised (thanks to Amazon)  \n  \nHands on feel: Device looks really gorgeous. Though not as the redmi note 4,\nbut still its a beautiful phone. It has a full metal body design which has\nbeen pretty much standard in any midrange phn today. The grip of the device is\nalso great. I would say that we should use a backcover at least. As the device\nbuilt quality is not that good (courtsey: youtuber Jerryrigeverything. You\nshould check his channel).  \n  \nDisplay : The display is a curved one, but not 2.5D curved though. The device\nis shipped with an screen guard on top of display. The glass used on display\nis not scratch resistant( that's why it comes with a screen guard). It's a\n1080p full HD display. Display is an IPS one which is bright and color\nreproduction is good. Good for media consumption, gaming etc.  \n  \nPerformance : I ran through day to day apps with ease. No hiccups.The ram\nmanagement is excellent. It comes with some boats and they can't be\nuninstalled. It's quite frustrating as they consume precious phone memory.\nHonor should look into this.  \n  \nBattery : it has a 3340 mah. Though the battery is not that big it can easy\nhelp you last a day on moderate usage( browsing, FB, WhatsApp, moderate\ngaming, watching videos). Though it's not written in the box, but the phone\ncharges very quickly. I charge it for 1.5 hrs a day which makes it last for a\nwhole day. It has also some great power saving modes. Which helps you save\nsome juice when in need.  \n  \nCamera: I don't know where to start. This phone has a 12 MP sensor along with\na 2 MP sensor, both together serving as the primary camera. The front facing\nselfie camera has an 8 MP sensor. No flash light in the front side (it should\nhave been there).The The first thing you notice about the camera app is the\namount of extra features which can make you puzzle. But don't worry you will\nbe acquainted with it in a day or two. The camera is the main USP of the\ndevice(specially the back camera). I would rate the camera of this phone more\nover any redmi phone used by me till date. The dual camera at the back of the\nphone creates some amazing things. You can get wide aperture photos which can\nbe used to highlight front or rear objects. I really haven't seen such\nfeatures in any midrange phone till date. The camera app has some amazing\nmodes pre installed which can change the shutter speed and can help you take\namazing out of world pics (starry sky, moving trail light shots etc). I am\nattaching sample pics of photos taken by me.  \n  \nSummary  \nPros: Camera, Fast charging, android nogut, good performance.  \n  \nCons: Built quality, bloated apps, battery size( last one is just not much of\na concern).  \n  \nVerdict: Pro like photography in a midrange phone. Phone with everything good\nbut a great camera.\n\n", "Review after 6months...Awesome phone.. Same like day one. 6x is the boss.\nWaiting for oreo :)  \n  \nRam management became awesome. 2.8gb ram free out of 4 gb. Loving honor..  \n  \nBest mobile honor 6x.. Just go for it...you won't get this specification\nanywhere...  \n  \nDon't waste your time in reading reviews.. I have did that for you... Just\norder it and enjoy...  \n  \nPros  \n1) 1.5 days battery  \n2) Awesome camera  \n3) Best display  \n4) Jio 4g working awesome  \n5) No need for memory card I have 64gb... 50gb available for use  \n6) Best fingerprint sensor - No need to use buttons to locking or unlocking\nphone.  \n7) After Android 7 update, phone became fast to super fast.... Camera clarity\nincreased a lot after update.. Performance improved a lot 2.8gb free in my 4gb\nram... Jio volte received.. All jio calls works without issues..  \n8) very slim and stylish- I have 64gb Gold - curved display adds more beauty.  \n9) Bought on prime day so got for 12999rs + 15% cashback- best offer from\namazon  \n10) got iPaky back cover - bit costly but best one.  \n11) I have seen few negative comments as memory card not able to extend with\ndual Sim... Actually memory card not required since we get 50gb free in 64 gb\nvariant... Also memory card degrades phone performance in every phone brands.  \n12) Also headphones not included... Yes I have already used honor phones they\nusually won't provide it.. Even many brands won't provide... So not a big\nissue.  \n  \nCons  \nNothing except back case cover and tempered glass are costly.  \n  \nDon't wait order it soon:)\n\n", "To begin with,, thanks for spoiling the faith I had on Honor phone one of the\nworst customer care who serve without any acknowledgement (Complaint No -\n39727014)… I had purchased Honor 6X on Amazon.in and got it delivered on 7th\nMay 2017 ,,, the phone was operating good for couple of months .. but one fine\nday the phone gave an pop up for software upgrade,, as usual I connected it to\na WIFi network and started to download the software after 15 min the software\ngot downloaded 100% and it started installing, after couple of seconds I got a\nPop-up saying Software Install Failed! Reboot System Now. Once rebooted again\nI get a popup saying that Your device has failed verification and may not work\nproperly. I rushed to the Authorized Huawei Service centre, they flashed the\nphone reloaded the software and gave back the phone. Next after 15-20 days\nthere I got one more pop-up for an upgrade I downloaded the software and for\nthe second time the same problem occurred, again went to the Authorized Huawei\nService centre, they flashed the phone upgraded the software and ensured that\nthis won’t happen again. Third time again there was a software upgrade and I\nfollowed the protocol but the problem occurred again with a Pop-up saying\nSoftware Install Failed! Reboot System Now, again I approached the service\ncentre for the third time and the service centre personnel upgraded the\nsoftware and gave back the phone assuring that there won’t be any issue\nhenceforth, But when again I got a software update for the fourth time the\nsame old problem has occurred, but this time I contacted the Customer Care\nwith all the details and concerns but the customer care is saying that I need\nto visit the service centre to get the problem diagnosed, I raised a request\nto get the handset replaced but the customer care is not ready to take the\nrequest, I have also mailed the details but the customer care says that they\nhaven’t received a mail, after long conversation they took my\ncomplaint(Complaint No – 39727014) for which I still haven’t received a\nacknowledgement.  \nMy question what if the same problem occurs after I visit the service centre\nfor the fourth time and what kind of product does Huawei deliver to customers\nwhere for each software upgrade I need to visit the service centre. I have\nattached snapshot of the concerns.  \n  \nRegards  \nSachin Naik  \n9483897970\n\n", "Guys I am writing this review after using this phone for one weak so I have\nstudied almost all the aspect of this phone and I hope this will help you to\ndecide according to your priorities weather to buy or to not buy this phone.  \nThis is good valur for money product, specially if you are looking for a good\ncamera phone then you can go for this one without any hesitation. I have\ncompared the rear camera with Vivo V5S and trust me honor 6X is the clear\nwinner. Not only Vivo V5s but also many other products in this range lile\nRedmi note 4, J7 Prime, On nxt etc.  \nThe android version and UI in this device were 6.0 and 4.0 respectively out of\nthe box and on Day 1 I got a software update of 2.26 GB and the device updated\nto android 7.0 and EMUI 5.0 and that's a good thing about it.  \nI will give a huge thumbs up for its build quality and premium look.  \nThe battery life is average and is enough for single typical day use. The\nbattery life is of course better in Rrfmi note 4 but for single day use it's\nmore then enough, I would say.  \nThe multitasking is quite good, I didn't notice any lag in day to day usage.  \nThe storage and RAM as you can already see can never be an issue in this phone\nas you get 4 GB RAM and 64 GB of internal storage.  \nAbout the gaming this phone manages very well , heavy games like asphalt 8 and\nnova 3, It performs without any lag and the maximum temperature after 20-30\nmins gaming reaches about 39-40 degrees.  \n  \nApart from those good things I also noticed some bad things also about this\ndevice and one of them is it's Video call quality.  \nYes friends if you do a lot's of Video calls to your loved ones then\nabsolutely this phone is not made for you. This phone doesn't support direct\nvideo calling as Samsung does and I know this feature is missed in many other\nbrands also but in this phone call quality even through google Duo doesn't\nseems pretty enough so For Video calling I won't recommend this device for\nyou.  \nSecond thing that I noticed in this device is the keyboard issue. Yes it may\nbe a minor issue but I did notice few lags in Google Indic keyboard. Sometimes\nwhile typing it just hangs on and you can't type or do anything on the screen\nbut to tap to the home button.  \nSo guys this was my review for honor 6X after one weak usage. I liked this\ndevice over redmi note 4 because of its camera quality, build quality and\nDisplay quality. That's it for now  \nThanking you.\n\n", "i bought this mobile on 3/2/17... now only i came to know one speaker was not\nworking.... i dont know wt ti do.... kindly anyone give suggestion regarding\nthis issue\n\n", "Here is my review of the Honor 6X.  \n  \nCamera : Since a lot of people would be attracted to this device due to the\nDual camera setup, let's talk about that first. The rear camera is a 12MP Sony\nIMX386 sensor which is also seen in more premium devices like Xiaomi Mi 6, Mi\nMax 2, Meizu Pro 6 etc. However, there is a catch. The aperture of the lens on\nHonor 6X is F2.2 which is a bummer. Many devices these days ship with a\nbrighter F2.0 aperture or faster aperture. Due to this F2.2 aperture, when the\nlight drops, image quality takes a hit as the camera software bumps up the ISO\nto get the correct exposure resulting in grainy images with less detail.  \n  \nDual Camera Setup : The secondary camera on the back records depth\ninformation. If you take a picture in this mode, you can adjust the background\nblur. This is a software gimmick - for some shots it works, for some others it\ndoesn't.  \n  \nCamera Image Quality : The rear camera takes good pictures. If you are never\ngonna zoom in or take a look at the images on the desktop screen, you will be\nvery satisfied with the quality. However if you zoom in, you would notice, the\nimages are not that sharp often or are smudgy. Huawei's image processing\nalogorithms are not that great in my opinion. If you want better quality\nimages, use apps that supports RAW shooting like Lightroom Mobile and shoot in\nPro mode. The default camera has a Pro mode, but i can't see any option to\nshoot in DNG RAW in there.  \n  \nNight Mode : To shoot photos in this mode, you would need a tripod. Grab one\nof those tiny portable ones you can buy. You can take up to 32s long exposure\nand take some really cool images at night. Check sample shot below. Regular\ncamera mode performs really bad in low light.  \n  \nFront Camera : 8MP takes some good selfies in good lighting. Like many other\nphones, this too offers beauty mode.  \n  \nOverall Performance : The Kirin Octacore processor is quite a good performer.\nI never experienced any lags until yet ( I have 4GB ram model ). You might see\nit lag a bit when playing high graphics intense games. Multi tasking works\nwell, however sometimes the app gets reloaded even though there is enough free\nram.  \n  \nBattery : You can easily get around 5 hours Screen On time with this phone.\nRecharging the phone from 0 to 100 takes around 2.5 hours though. There is NO\nFast Charging technology built in, instead it ships with a regular 'Fast\nCharging' 2A charger.  \n  \nHeating Issues ? : I have noticed the device getting hot while charging once.\nHowever, i was downloading some apps at that time and it was using WiFi / 3G\nduring charging. During normal charging, without any usage, device doesn't\nheated up. It neither heats up when using camera for long periods.  \n  \nDisplay : It has a 5.5 inch Full HD screen which looks really good. However,\nthe screen doesn't have Gorilla Glass protection. It has some protection, but\nit not that good. It comes with a Screen protector out of the box. I would\nrecommend you leave it on as the device is prone to scratching to sharp\nobjects according to some testing. ( JerryRigsEverything ).  \n  \nOperating System : The device ships with EMUI 4.1 based on Android 6\nMarshmallow. They have started rolling out Android 7 Nougat based EMUI,\nhowever not all devices are getting the update. I waited and waited, and\nfinally i had to update to Nougat manually via Firmware Finder app ( Not\nRecommended unless you know what you are doing ). The latest OTA has Android 7\nwith EMUI 5 on board. It looks cool and better. Also, this OTA came with June\n2017 Google security patches applied.  \n  \nGraphics UI : I am not a big fan Huaewi's Home launcher. You can install\nGoogle Home launcher from Playstore or can manually install Pixel launcher if\nthat's what you like. Overall graphics UI is colorfull and Huawei has added\nuseful additions here and there.  \n  \nFingerprint Scanner : It is FAAAASSST. You can also setup this to take photos,\nto open the notification drawer and swipe left and right in Photo gallery.  \n  \nHandling : This is a big phone. You can use it with one hand if you want,\nhowever be careful, the metallic back is slippery. I really wish this was a 5\ninch / 5.2 inch phone instead of 5.5 inch.  \n  \nConnectivity : I am impressed with the network coverage this phone is able to\npull up. In areas My nexus 5x often struggles to catch a signal, Honor 6X\ngrabs on fast - both WiFi and 3G. 4G VoLTE is supported in the latest Nougat\nbuild.  \n  \nConclusion : If you are looking for a mid range phone with decent camera and\ngreat battery life under 15K, this is a good buy in my opinion. I am very\nsatisfied with the overall package, except that i am struggling to handle this\n5.5 inch one. I am sure i will get used to it.\n\n", "Worst phone I ever seen in my life. Volume sucks. I don't even feel like to\ngive 1 star. No return option is given.\n\n", "Took one star away because the packaging was abysmal. Just the phone box\ninside a wet, torn cardboard box.. No plastic or bubble wrap. I had good\nconversation with customer care for that  \n  \nAnyway, I bought Honor 6x (3gb 32gb) from Amazon and have been using it for\ntwo weeks now. I have to say , I am happy with the device. The other option\nwas Redmi note 4 (RN4) and I chose Honor because I liked the camera, display\nand ram management of Honor 6x than RN4. Honor 6x is not perfect though, so\nhere are the cons first.  \nCons  \n1\\. The only thing every reviewer agreed on was the audio output of Honor 6x\nwas not loud. And yes it is true. If you are a person who likes to listen to\nmusic at high volume and bass then this could be an issue. I have tried couple\nof headsets and the music is only enjoyable at max volume . At max it has good\nbass and details and no stutter or grainy sound . But considering RN3 provides\ngreat sound at half volume, output of RN4 should be great. However 720p and\nfhd videos seem to give slightly better audio output in 6x.  \n2\\. It's been two weeks and I have not yet received the android nougat OTA\nupdate.  \n3\\. No fast charging. It roughly takes 2 hours to fully charge and sometimes\nheats up while charging. It cools down really quick though.  \n4.It is really hard to find a tempered glass for the curved edge screen and\ntransparent back cover in local stores.( In trivandrum kerala) So buy the\n200rs Honor case from Amazon with your phone cause it's slippery like all\nmetal phones.  \n5\\. UI could be better. Instagram crashes sometimes . And settings page looks\nios like. All this could be solved in nougat update I guess.  \n  \nPros.  \n1.Brilliant display. It's a treat for your eyes. Best thing is that the\nViewing angles are excellent on this phone.  \n2\\. Camera. You won't believe the shots that this one takes. The 12mp lens\nalone is a great one. The dual cam mode gives decent bokeh effect. Check the\npictures I have uploaded.  \n3\\. Performance . Satisfactory. I haven't felt any lag in everyday use.\nMultitasking is pleasant. Ram management is good. Fingerprint scanner is good\ntoo. It misses sometimes, if you don't place your finger exactly inside the\nscanner area.  \n4\\. Call quality is really good. It is loud and clear.  \n5\\. With light usage battery lasts 2 days. Mid-to- heavy ,then one day.  \n  \nConclusion.  \nIf you need a phone with really good display and camera with fast performance,\ngo for it. Music lovers should give it a second thought. You won't get that\nhtc boom sound or Dolby quality with this. I chose camera over audio, so Honor\n6x suits me better than RN4 and also I hate flash sales. So there's that too.\n\n", "I was looking for a budget phone around 10K for basic usage. This phone looks\nclassy and fit perfectly in my budget.  \nLook and feel : Nothing fancy yet elegant.  \nPerformance: Well meets my requirements. I am not a heavy gamer or user of\nmany apps. So has worked perfectly for me till date.  \nBattery: Pretty decent for a days usage.  \nCamera: Tested the rear camera for low-light imaging and indoor clicks works\nbeyond expectation for the budget. Liked the after shot focus. Front camera is\nalso decent for the price range.  \nUI: Is comfortable indicates draining apps etc. Effective RAM utilization.  \nOS: Presently works on Android 6.0 Marsmallow but upgrade to 7.0 Nougat is\nrecomended by the manufacturer as soon as the phone is started.  \nDisplay : Does not strain the eye even in low light and has good visibility\nwhen using in sunlight.  \nBox contents: Come with a standard warranty card, phone, sim ejection tool and\ncharger. Headphones are not included.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 August 2017", "on 12 August 2017", "on 16 July 2017", "on 20 September 2017", "on 26 July 2017", "on 12 May 2017", "on 17 June 2017", "on 27 May 2017", "on 15 June 2017", "on 17 May 2017"], "reviewer": ["Abu Md Rajeeb", "Debargha", "Manjunath B.", "Sachin Naik", "Abhishek Pratap", "VIJAYAKUMAR", "Mac Reviews", "Amazon Customer", "Tom_93", "Rashmi"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["A phone that is exactly worth its price - and nothing more.", "compaq and looks like a premium device", "MOST HELPFUL REVIEW", "🔴#1 HONEST(Unbiased) REVIEW of HONOR 6X [after using it for 2 weeks] [Full Review]", "Its a BATTLE  of CAMERA & MUSIC", "trust. me the cameras image quality is worse bad no battery backup", "Camera+Performance+Affordable Price = Honor 6X. Know more about Honor 6X in this Review.", "At the price point of 12999 it is awesome smartphone , better than redmi note 4 if u r not a very heavy gamer", "Worst Ever Phone One Can Buy", "Very good for the price. But the devil is in the details."], "review": ["[ 📓📓Details of the photos are towards the end of the review ]  \n  \nI was looking for a phone that was fast, decent, and inexpensive. I was never\ntruly certain about the Mi brand, and when I saw that Huawei was launching the\nHonor 6x, I thought of plonking the cash to see if all the noise about\nHuawei's quality and VFM (value for money) proposition was all that it was\nmade out to be.  \n  \nThis is one phone that I think hits the price point bang on target. Since\nthere are fewer cons, I will list the cons first and go to the pros later.  \n  \n👎🏻 The Cons 👎🏻  \n  \n1\\. 📴The UI. Gods! do I hate it! I was never a fan of the Chinese UIs. If you\nare used to Mi, or Le, or some Lenovo phones out there, and are happy with\nthem, then the UI will not really be a problem. In fact, it has several\nhelpful apps bundled (like MiUI and LeTV UI) but for me, the UI is a deal\nbreaker.  \n  \nBottom Line: If you are used for MiUi and others, not a problem. If you are a\nbig fant of any of the flagships phones (S6, S7, Pixel, OP) you will find it\ntacky, and garish. If it was for personal use, I would not have purchased the\nphone purely because of the UI. But then, it is a personal thing.  \n  \n2\\. 💪 Build Quality. I should not be complaining at 13k, but this definitely\ndeserves a mention. The screen comes with a preapplied screen protector and it\nseems to be with good reason. The glass or whatever material that has been\nused on the screen seems to be made of a soft compound that seems to be prone\nto scratching. The back also seems to be more scratch prone than most other\nphones I have seen.  \n  \nIf you are one to use your phone without cases and covers while dumping it in\nyour pockets with keys, coins, and such like, be ready to have a fairly\nscratched phone in a very short while.  \n  \nThe Pros:  \n  \n1.✨ It looks really clean amd is easy on the eyes. (I opted for the Grey\nversion, since I was not sold on the other colour variants)  \n  \n2\\. 🔋 Battery life. Over the past few days, it has been really, really good. I\nhave used it with 4G all through the day, and towards the end of my usually\nvery long day (14hrs) I was left with about 20% juice.  \n  \n3\\. 📷 Camera. Please remember the price point. I use a couple of flagships as\nmy daily drivers (S6 and S7), while the photo quality is nowehere near as good\nas the flagships, the dual camera set-up seems to sort of work well, and that\nis saying a lot in a 13K phone that comes with a 3340mAh battery.  \n  \n4\\. 📶📶Dual Sim. Nothing different from the rest of the crowd, but it works\nflawlessly, so no complaints.  \n  \n5.🔆 Screen. I am not going to talk about the PPI or saturation or the colour\ngamut. All I will say is that it looks clear, and crisp and I do not see any\npixellation anywhere. I do not plan to use if for VR or even gaming, so the\nscreen does its job. Is bright enough inside and outside and serves the\npurpose.  \n  \n6\\. 🤙Fingerprint scanner. Fast and accurate. Whether the performance\ndeteriorates over time with use and with scratches, I can only tell in time,\nif at all. For now, it seems to be working as advertised.  \n  \nShould you buy this? 💳💳  \n  \nIf you are looking for a phone that has dual sim capabilities and are not sure\nabout the other Chinese handset makers, and are looking for decent photos and\nare not absolutely expecting flagship level camera performance, and can live\nwith the UI, then, this phone is definitely for you.  \n  \nIf you are planning on buying an Mi or a Le or some such phone, then, you will\nnot regret buying this phone in place of the others.  \n  \nPhoto Details:  \n  \n1\\. Photo of a bedsheet from about 2 inches away. Outdoor shot - evening. Auto\nMode.  \n2\\. Photo of text. Outdoor shot - evening. Auto Mode.  \n3\\. Pro Mode with Manual focus on Title - the phone had no trouble focusing.  \n4\\. Pro Mode with manual focus on the bottom right of the page - the phone had\ntrouble focusing on the image due to the maze of colours in the image.  \n5\\. Random shot - low light - a sample to look at the colour accuracy - good\ncolour accuracy - details are missing if zoomed.  \n6\\. Dual Camera set used to shot the side of the book to test the bokeh / blur\neffect. - Shows the real potenial of the camera.  \n7\\. Pro Mode with manual focus - the manual focus seems to be able to do a\nbetter job with clearly defined pictures.\n\n", "I am using Honor 6x from February 25th. The specifications are superb for a\nprice of INR.13000. Let me discuss the every aspect of the Device.  \n1\\. Built Quality:  \nThe built quality is excellent- it is slim, compaq and looks like a premium\ndevice.  \n2.Software- It's comes with Android 6.0 Marshmallow and the UI is fluid with\nno lags at all.Though we would like to see Android 7 out of the box!  \nI did not face any troubles during Multi-tasking. RAM Management is good, apps\ngets closed automatically after certain time. Though Some people might not\nlike this feature , but I find it helpful from the aspect of power\nconsumption.The finger print sensor is blazing fast and reliable.  \n3\\. Battery:  \nThe battery is one of the USP of this phone. The 3350mh battery is marvelous\nbacked with power efficient processor. I am a medium to heavy user and in my\ndaily usage I can finish up to 60% of the battery and during heavy usage my\nphone ends up with 20-25% juice left. I am quite amazed with the battery\nperformance.The battery charging time is pathetic, it takes more than two\nhours to get fully charged from 10 to 100%.  \n4\\. Processor:  \nHonor 6x comes with Kirin 655 chipset which is built on 16nm technology and is\nhighly power efficient and easily handles when the device is pushed to the\nnext level. There is absolute no heating , however during charging the device\ngets warm due to the metal back.  \n5\\. Camera: The camera is the most highlighting point of this Device. Most of\nthe people will find it excellent (Auto mode)but I personally feel the colors\nare bit over saturated.The pictures has good amount of details when shoot in\nAuto mode with less noise during ample lighting conditions but during low\nlight the pictures turns up grainy most of the time. For better picture I use\n'Pro photo mode' and adjust the color temperature, Exposure and the ISO. If\nyou have the idea you can really play with these.Again if you adjust the\nshutter speed, you won't believe the picture quality- it's just awesome. The\nlevel of noise is low with proper shutter speed and decent ISO. The night mode\nis superb and you need a very steady hand to take a perfect snap. However, the\ncamera is disappointing in the Selfie department. The pictures are grainy and\nwhitish. The modes which are given in Selfie are basically of no use. But if\nyou adjust the saturation ad ISO, you ae bound to get good selfies...  \n6\\. The Display is strictly average. I strongly believe that it could have\nbeen much better in terms of brightness and contrast. It's almost 40% less\nthan Samsung or Moto phones. However there is no protection in the Display and\nthe device comes with a pre-applied screen protector.  \n7\\. The call quality is excellent but I believe the sound could have been a\nbit louder. Network reception has been very good.  \nThe sound output via headphone jack is excellent and it has a in built\nBass.The speaker sound is low in terms of loudness and the output cracks most\nof the time.  \nLast but not the least , it's an absolute good device if the price is\nconsidered. Well, you can't compare with flagships but in every aspects it\ngets the job done.\n\n", "Verdict  \nThe Honor 6X is another excellent reasonably-priced smartphone from Huawei and\nis yet again a lot of smartphone for the money.  \nIt has a great camera, good build, dual-Sim and microSD card support, a snappy\nprocessor, a decent screen and good battery life. But it has an old version of\nAndroid without the latest security updates, an inferior version of Huawei’s\nEMUI and microUSB not USB-C.  \nIf those faults can be overlooked then the Honor 6X is a great .  \nPros: good cameras, good screen, dual-Sim, microSD card support, good battery\nlife, great fingerprint scanner, great value  \nCons: old version of Android, EMUI not to everyone’s taste, microUSB not USB-C  \n  \nDetailed Review  \nA lot of phone for the money, shame about the old software.  \nA big 5.5 inch screen, solid build and feel, a great fingerprint scanner and\ndual-Sim support means latest Huawei Honor is a solid, good value smartphone.  \n  \nHuawei’s Honor line has been making a name for itself by selling good yet\nreasonably priced smartphones. The Honor 6X is no exception, even if it isn’t\nperfect.  \nLast year’s Honor 5X offered a lot of smartphone for the money at a time when\nthe stalwart of the good-but-cheap smartphone market, the Moto G series, was\nfaltering. Now the Honor 6X has a lot to live up to.  \n  \nSmoother design  \nThe Honor 6X looks like a slightly smaller version of the Huawei Mate 9. It’s\ngot a metal back, plastic top and bottom edges, a dual camera in vertical\norientation and a fingerprint sensor on the back. The front is plain and all\nglass. It’s a simple, attractive design that’s more rounded and smoother than\nits predecessor, the 5X.  \nIt’s well made, with very little flex in the body. At 8.2mm thick the 6X is\nthe same thickness as the 5X, but thinner by 1.6mm than the Moto G4 Plus. The\n6X is also shorter by 4mm than the 5X, but whether you could tell that by\nlooking at them is debatable.  \nIt weighs 162g, which is actually heavier than the 158g 5X and the 155g Moto\nG4 Plus, but the curved back and rounded edges make it feel a lot nicer in the\nhand. It feels reassuringly heavy with good balance rather than being a lump.  \nThe 5.5in 1080p LCD screen is very good for a smartphone in its segment, and\nis improved over the 5X, although it doesn’t quite match up to the likes of\nApple’s iPhone or Samsung’s AMOLED displays in its S range. It looks\nrelatively crisp, clear and colourful, with wide viewing angles. The included\nscreen protector is useful, but sort of ruins the smooth glass curve down to\nthe smartphone’s edges.  \n  \nGood battery life  \nThe Honor 6X has Huawei’s own processor, the Kirin 655, which handled games\nand apps with aplomb. The in graphically-rich Real Racing 3, for instance,\ngameplay was buttery smooth and the 6X only got slightly warm while playing.\nIt was responsive and snappy throughout normal Android operations and in no\nway felt like anything other than a premium device in operation.  \nBattery life was also very good. Using it as my primary device, even with the\nFacebook app installed, and receiving hundreds of push notifications, emails\nand messages, as well as browsing the web and using apps for around three\nhours, I would finish the day with about half the battery left. The next\nmorning it would only have dropped about 3% battery overnight and would last\nuntil evening.  \nMost users will get somewhere between 1.5 days and well over two days of use\nbetween charges, more if you leave it alone for long periods as Huawei’s app\ncontrol prolongs standby time immeasurably compared to most other Android\nMarshmallow devices.  \nIt also charges a lot faster than the 5X, which means when it does run out it\ntakes just over an hour rather than a good two to reach 100%.  \nThe 6X also has dual-Sim support, for using two numbers or plans at the same\ntime with the same phone, but the second Sim slot also doubles as a microSD\ncard slot for adding more storage, which means it’s either or but not both.  \nThe Honor 6X has a microUSB port, not the new USB-C port for charging, which\nis disappointing. It might be helpful in the short term to be able to use your\nexisting microUSB cables, but soon almost everything will use USB-C and the\nHonor 6X will be the odd one out.  \n  \nOld Emotion UI  \nIf there’s one weakness to the Honor 6X, it’s the software. It has an old\nversion of Android 6 Marshmallow, not the current Android 7 Nougat, which for\na new smartphone going on sale over four months after Nougat was released is\npretty poor.  \nAt the same time Huawei makes modifications to the basic Android experience\nwhich are a mixed bag. Some tweaks such as aggressive control of background\napplications and notifications when they’re draining your battery are good.  \nThe removal of the app drawer in favour of every app installed having to be on\nthe home screen is not. Some people like Huawei’s so-called Emotion UI - EMUI\n4.1 in this case - but many do not.  \nEMUI 5, which the Honor 6X is due to get relatively soon, is a big step up,\nbut for now it’s stuck with the same version of EMUI as the Honor 8 and Huawei\nP9.  \nFor more information on EMUI 4.1, please see the Huawei P9 review.  \n  \nDual camera  \nThe camera on the Honor 6X works well even in low light.  \nThe camera on the Honor 6X works well even in low light. Photograph: Samuel\nGibbs for the Guardian  \nThe dual camera on the back produces really quite good images, with accurate\ncolour and a solid amount of detail in all conditions short of really poor\nlight. The 12-megapixel sensor captures the images and the auxiliary\n2-megapixel sensor below it captures depth information. Using the two, with a\nspecial wide-aperture mode, you can take a variable aperture photo for various\nblurring effects, but also refocus the picture after the fact.  \nThe HDR mode is not built into the main shooting mode, and while it is easily\none of the best cameras for the price, it won’t trouble the best there is\navailable on a smartphone for sheer image quality.  \nThe 8-megapixel front-facing selfie camera is fixed focus, which eliminates\nout-of-focus shots, but also means you’re unlikely to get anything with a\npleasing out-of-focus background. Nevertheless, it captures a really good\namount of detail in photos, even in poor artificial lighting conditions, and\nhas enough beauty modes to satisfy all but the most self-obsessed.  \n  \nObservations  \nThe fingerprint scanner on the back of the Honor 6X is very good.  \nThe fingerprint sensor is very fast and very accurate  \nThe fingerprint scanner can be used to swipe through photos or pull down the\nnotification shade  \nCall quality was good, and reception and data speeds were excellent  \n  \nPros: good cameras, good screen, dual-Sim, microSD card support, good battery\nlife, great fingerprint scanner, great value  \nCons: old version of Android, EMUI not to everyone’s taste, microUSB not USB-C  \n  \nif my Review helped you in anyways Please Vote it as HELPFUL.\n\n", "🔴kindly read the full review if you are planning to buy HONOR 6X  \n●● if you want to get quick overview of the device, then read below else\nscroll down for detailed review ●●  \n👉PROS  \n፨Good display  \n፨Decent battery life  \n፨Average camera  \n👉CONS  \n፨Awful, buggy software  \n፨Boring design  \n፨Dual-camera setup is nothing more than a gimmick here  \n➽B.O.T'S OVERALL SCORE - 3/5  \n👉DETAILED SCORES  \n★Performance - 7  \n★Camera - 7  \n★Design - 6  \n★Battery Life - 7  \n★Value - 7  \n★Software - 4  \n★Calls & Sound - 6  \n★Screen Quality - 8  \n👉KEY FEATURES  \n፨Review Price: ₹ 11,999  \n፨12MP front and 2MP rear-facing cameras  \n፨Variable aperture settings  \n፨5.5-inch 1080p display  \n፨Kirin 655 CPU  \n፨32GB storage  \n፨3GB RAM  \n👉WHAT IS Honor 6X?  \n፨Honor, a spin-off from Huawei, appears to be more focused on “viral”\nmarketing aimed at its supposedly millennial audience than making decent\nphones.  \n👉DESIGN  \n፨Hold the Honor 6X at a distance and it looks like quite an expensive, if\npredictable, piece of kit.  \n፨It has that often recycled sloped “metal” back with slightly curved corners\nand a 2.5D glass display.  \n፨A circular fingerprint scanner sits below the dual-camera setup.  \n፨The metal feels almost plastic-like, with just a thin layer of metallic spray\nadded on top.  \n፨The buttons, too, are quite mushy and have already started to stick into the\nbody of the phone.  \n፨The headphone jack sits offset on the top  \n👉DISPLAY  \n፨5.5 inches in size and an LCD panel running at 1080p.  \n፨The screen ticks most of the boxes: it’s accurate at representing colours,\ngets bright enough to combat the sun,  \nColours don’t have quite the punch you’d get with an AMOLED panel(reds are a\nbit washed out & blacks lack depth – but you can toggle settings slightly to\ntry to combat this)  \n👉SOFTWARE  \n፨Completely out-of-date software  \n፨EMUI 5 completely gutted the OS and improved everything from the general\ndesign to the notifications panel.  \n፨Google integration actually worked as it should,& there was a noticeable\nperformance improvement.  \n፨It also likes to restart frequently, completely quitting out of all the apps\nand rebooting the whole phone.  \n፨There are quite a few bloatware apps and games pre-installed – but\nthankfully, each of these can be deleted.  \n👉PERFORMANCE  \n፨HiSilicon’s Kirin 655 CPU(similar to Snapdragon’s 625)  \n፨The majority of 3D games work fine, although gameplay isn’t quite as\nsmooth,and less intensive titles run perfectly.  \n፨3GB of RAM and 32GB of onboard storage.  \n፨Geekbench 4 - Honor 6X scored 3,270(while the Moto G4 picked up 3,067)  \n፨The downward-firing speakers are adequate but easy to block.  \n፨Call quality is good, but the microphones are noticeably weaker  \n👉CAMERA  \n፨Dual rear cameras(12&2MP)  \n፨aperture - from f/0.95 to f/6.5  \n፨12-megapixel main sensor takes quite good photos  \n፨Well-lit shots offer enough detail  \n፨The wide aperture effect can leave odd blurs in the wrong places  \n፨It often tries too hard to overbrighten lower-light shots  \n፨Night-time shots are blurry and very noisy  \n👉BATTERY LIFE  \n፨3,340mAh  \n፨Easily make it through the day  \n፨An hour of Netflix streaming takes up between 9-11%  \n፨An hour of Spotify eats through 5%  \n፨lack of USB Type-C  \n👉SHOULD YOU BUY HONOR 6X?  \n፨Although the “specs” appear attractive, the device doesn’t really use them in\na meaningful way. The CPU is fine, for example, but it’s bogged down by the\nold software; the dual camera isn’t strong enough to be anything more than a\ngimmick.  \n፨It does have a solid screen and hopefully a software update will come, but\nI’d still recommend the cheaper Moto G4 Plus or one of the other affordable\nphones.  \n🔴B.O.T'S VERDICT  \n፨Honor’s brand image is clearly more important than the products it creates.\nThe 6X is a fine phone that doesn’t really use what it has very well. It will\nget the job done – but nothing more.  \n🔴Guys! My only request is please don’t dislike my review. If you have any\nquestion or if you think I am wrong. Just ask me by commenting below.Please\nhit YES Button if you found my review HELPFUL.Write reviews, help others,\nhappy shopping  \nThank You for reading this review.  \n-●➽ Bhavesh B.O.T●-\n\n", "After using phone for one week..i struggled between redmi4 and honor6x ..Main\nreason to buy this CAMERA ..becoz camera and battery are the most people's\nrequirements..go for pros and cons ...  \nCONS-  \n1.Biggest problem in this honor device is..Audio output..its not only the\nvolume but also audio output itself is baaaad..i am a audiophile..i thought to\ncorrect it by equalizers but its a time waste ..so if u luv music u will get\nhurt by the honor audio output..i have used senheiser/sony/skull candy ..but\nhonors audio output beats their excellency nd give u the horrible output  \n2.next all are minor cons- some times glitches  \nhappen,hang one for 1or 2secnds when there is heavy functioning  \n3.In camera in normal mode also..the more the clarity in the middle grids..the\nmore the blurr in the corners...corners are so blurred in the images..dnt knw\nwhy ..  \n4\\. I just really dnt like the branding in front wasting so much space..  \n5.let look into some NO - NO ir (infra red )facility + in redmi devices, No\ndouble tap sensor, No fast charging its usb type B only ...dont use while\ncharging..back is metallic one so u will feel definitely heat .. after\ncharging remove the pin keep for 5-10 mints then use ..  \nNow PROS Which u will like more  \n1.BATTERY-..NEVER EXPECTED This from honor ..its a 3400 mah battery ...but it\ncan make ur whole day ..screen on time with mobile data like heavy usage -\neasily u can get 13-14 hrs a day..for rest if ur a just popup visitor u can\nlast for 1nd half day easily... specifically should mention about the power\nsaving modes  \n2 modes - power saving mode& ultra power saving mode -excellent ways for\nbattery life  \n3.RAM management- u wnt believe this ..actually i got 3 gb ram one ..in my mi\ntab when i open about 10 apps the ram will be about jst 100 mb left and phone\nwill be slow...but i was shocked with honor ...i nearly opened about 15\napps..its still gives 1.8gb freee..and when u open these apps they wont reload\nalso...this might be the main reason for such a long battery life also..i was\nso impressed  \n3.CAMERA- As u all knw it is at its best..best thing is front cam is so good\nand in artificial light alsoit gives u the best output.. but dnt expect beyond\nwith this..its a 13mp cam only it cant make miracles in CLARITY but showcases\nthe pic in beautiful way ..up on zooming its all grain u get ..but its the\nbest camera i have used around 10k range..best for photography people  \nConclusion-BADLY needed batterylife and photography..go for it  \nBut if u luv music - think twice /thrice before buying it ..\n\n", "The cameras were very bad not clear , while taking photos the images were like\nfrom an old Nokia phone's camera , they are like two 2mp cam's . Battery is\nnot good not that backup , simply wasted money . And I hated it's UI . The\nonly reason I bought this was because it was having dual back camera . Any way\nI will adjust.and i noticed that only one of two speakers are working .\nbattery is just for name no use drains like a sports car drinking up fuel.\n\n", "Note:- In this review I'm gonna discuss about honor 6X design, display,\nCamera, performance, pros and cons. Personally, I have used and reviewed many\nmidrange smartphones in amazon, So you can totally rely on my review.  \n  \n●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●  \n  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \nHonor 6X Design with Decency  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \n  \nSmooth edges and gentle curves from the rear side causing aesthetic body and\nbalance design for holding with the single hand, You can also change the\ndisplay size for more comfortable operating with single hand. The right edge\nof phone contains Volume and power buttons while on the opposite side at left\nit has a Hybrid slot for SIM and SD Card. The mono speaker grille with\nmicrophone grille and Micro USB slot at the bottom, To insert the headphone\nbud there is 3.5 mm audio jack on the top.  \n  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \nHonor 6X Display reflection  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \n  \nYou feel pleased to watch the media files in this phone as it has vivid 5.5\ninches Full HD display, configured with 2.5D Curved glass and 403ppi of\ndisplay density. This display also has quite good visibility even in direct\nsunlight with the brightness up to 450nit. There is scratch protecting glass\nbut definitely not Corning Corilla Glass for the screen.  \n  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \nHonor 6X Camera  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \n  \nCamera that Captures Depth  \nWith Tagline \"Double or Nothing\" they have installed 12+2 MP dual setup for\nrear camera, it offers Aperture range from f/0.95 to f/16 this helps in focus\nat the different level with stylish professional-grade blurred background\neffect. Two rear-firing cameras help in taking in-depth photographs. The\ndaylight and macro photography are pretty decent with the rear camera, while\nit is quite average in taking night photographs. 8 MP camera is also\nacceptable for this price group smartphone can capture good selfies in\nsufficient light.  \n  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \nHonor 6x HiSilicon CPU Performance  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \n  \nHuawei neither interested in Snapdragon nor in MediaTek so the company\nproviding their own HiSilicon Kirin 655 processor which has eight-cores where\n4-cores clocking at 2.1 GHz and 4 cores at 1.7 GHz. The performance is more\nextended by 4 GB RAM and device runs nearly with no hindrance, the good news\nis that it doesn't heats as well even in some heavy tasks. although it is not\nbest for heavy games but most of the games are running with minimum trouble.  \n  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \nHonor 6X Battery Power  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \n  \nInside the phone there is 3340 mAh high-density battery which is capable of\ndelivering 1.5 to 2 days battery usage for a typical user. In the box there is\n2A/5V charger that can charge mobile up to 50% in less than 1 hour.  \n  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \nHere are the pros and cons of Honor 6X  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \n🔰🔰🔰🔰🔰🔰🔰🔰🔰🔰🔰  \n  \n✔️✔️✔️✔️✔️✔️✔️  \nAdvantages (pros):-  \n✔️✔️✔️✔️✔️✔️✔️  \n  \n🎖️Dual camera setup for in-depth photography.  \n  \n🎖️The External SD Card is supported up to 128GB.  \n  \n🎖️FM Radio is supported.  \n  \n🎖️The glass on display is scratch resistant.  \n  \n🎖️OTG Cable is Supported to transfer the data via Pen drive.  \n  \n🎖️Built-in eye comfort mode filters to relieve screen-related visual stress.  \n  \n❌❌❌❌❌❌❌❌  \nDisadvantages (cons):-  \n❌❌❌❌❌❌❌❌  \n  \n👎No IR Blaster.  \n  \n👎Micro USB slot instead of USB Type-C.  \n  \n👎The battery is non-removable.  \n  \n👎No IEEE 802.11ac is a wireless networking standard for Wifi.  \n  \n👎Not comes up with gyroscope sensor.  \n  \n👎Hybrid SIM slot (Doesn't support 2 SIM cards along with SD Card)  \n  \n🔷🔷🔷🔷🔷  \nFinal Words:-  \n🔶🔶🔶🔶🔶  \n  \nThe Honor 5X is a great all-rounder for its expected price of under 13,000\nINR. An elegant design, admirable camera quality, reasonable battery backup,\nand vibrant display constitute its biggest strength. On the downside, this\nisn’t a phone meant for heavy graphic intensive gaming. So, if you are not\ninto high-end Andriod gaming, the Honor 6X looks like a very dependable phone\nin its class.  \n  \nThanks for Reading. I Hope this Review was Helpful.  \n  \n➽Regards,  \n➽Keerthi kanth.\n\n", "First of all I want to say that the experience of Amazon was not that great I\ngot this product after 6 long days on the great Indian sale  \nNow coming back to the smartphone, In the box you will just get the phone\nitself a charger and USB cable , so sadly no earphones you will get  \nIf I talk about the design of the Huawei honour 6x I think it is one of the\nbest looking Smartphone and also it is very lightweight  \nThe battery backup on this phone earlier I was little with worried about the\nbattery performance on this smartphone , because I moved from redmi Note 3 to\nHuawei honour 6x and in redmi Note 3 the battery backup was excellent , but I\nwas surprised to see the battery performance on this Smartphone really it last\nso long I was getting around 6 hours of screen on time with 25% of battery\nremaining isn't it great at this price.  \nNot coming back to the camera performance which is the highlighting factor of\nthis Smartphone and yes it will not disappoint you , both the camera the rear\none and the front one are very good .  \nPerformance is also very good if you do not play lot of heavy games and I am\nnot a heavy gamer and play Just some casual games  \n  \nIf you talk about the cons of the best smartphone there is not much but there\nis I think two  \n1\\. The speaker quality could have been better as well as on the headphones  \n2\\. Cannot handle Asphalt in the high graphic setting  \nI would have written third point in the cons section if the price point remain\nsame. But the price drop make a lot of different  \nThose who are worry about the call quality there should not be because the\ncall quality is excellent on this device  \n  \nSo thumbs up for huawei honor 6x..\n\n", "Friends this is worst ever phone one can buy, it has extremely poor build\nquality and the phone also gets heated up a lot.  \n  \nJust after fully charging the phone if you keep phone in the front pocket of a\nJeans it will get banded from the center. Just see pictures attached.  \n  \nOn taking a close look at pictures, you will notice that its not an accidental\nphone as you can see no other issue on Phone other than Band from the center.\nEven service station engineer said we are shocked to see this as without any\naccident how this happened.  \n  \nEven worst part is company do not take any responsibility of such handset and\ndo not give any refund nor a new handset in its lieu nor repairing the phone\nthough it's under warranty.  \n  \nI strongly advise never every buy any Huawei Products.\n\n", "Got the phone one week back. Quite fluid experience. The interface is really\nnice to look at. The gold version I got looks amazingly like a flagship.Got\ntwo massive updates just after starting up (almost 3 GB) and upgraded the\nphone to nougat 7.0. Cool. I will continue to use the phone for a few more\ndays and will update this review. I feel it's better to go for the GB ram and\n64 GB storage version as it offers the best value for money. The pros and cons\nIMHO after just 1 week of usage is as follows.  \n  \nPros :  \n  \nAmazing rear camera 10/10.  \n  \nUpdates are somewhat quick as of now.  \n  \nSound through headphones are good. Although the mentioned dts effect is only\nin supported formats which you will be lucky to find. Otherwise it's just SWS\n(Super Wide Sound) for mp3 and flac files.  \n  \nThe 4GB ram version is smooth as butter and flies through most tasks and games\nreally. Fine. I was worried about lag during gaming, but turned out this thing\ncan handle any game that I threw at it( yet).  \n  \nNo heating issues at all, but as an advice keep the battery charged between 20\n% and 80% to extend the life of the battery as this device has a non removable\nunit. Better to take care of the battery as a precaution so as not to sell a\nkidney when it run out of juice a year from now and you have to take it to a\nservice center to get it replaced.  \n  \nBattery lasts around a full day even with above average usage ( 5 to 6 hours\nto screen on time with not much gaming and using wifi instead of 4G data)  \n  \nCharging from empty to full takes around 3 hours but put the phone in airplane\nmode when it charges and it went from 30 % to 90 % in around an hour and a\nhalf.  \n  \nHas a screen protector pre applied.  \n  \nThe display is brilliant. 1080p and clearly visible even in direct sunlight of\nmy very tropical hometown. The colors look amazing.  \n  \nEven after installing 3 dozen apps and a few casual games the storage is only\n15 % full.  \n  \nCons :  \nThe front camera suffers in low light. Also there is no front facing flash and\nit uses the screen to light up your face while taking a pic in low light. That\nwas funny when I saw it for first time lol.  \n  \nNo glass protection of any kind. So drop this thing and you will most\ndefinitely shatter the glass. Kind of fragile too as jerryrigeverything's\nyoutube channel showed. If you sit on this or something it will definitely\nbreak. So better invest in a good case ( I suggest a transparent one as the\nlooks of this beauty will be wasted on a blocky armored type case.)  \n  \nAudio through speakers is very low. Quite good on watching in a quiet room but\noutside in the subway or in a loud place it's very low.  \n  \nAfter the nougat update the available free ram after clearing recent apps fell\nfrom 2.5 GB to 2 GB ( note that this is not bad at all, the less free ram the\nbetter as it means the Android OS is using it efficiently but just a heads up.\n)  \n  \nNo other major cons but I will update it as I use it over a few months and see\nwhat develops\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 February 2017", "on 19 March 2017", "on 10 February 2018", "on 15 November 2017", "on 25 October 2017", "on 16 March 2017", "on 10 November 2017", "on 18 May 2017", "on 15 June 2017", "on 29 July 2017"], "reviewer": ["ఏమి?", "Indradeep B.", "Vinay Arora", "🔴ʙʜᴀᴠᴇsʜ ʙ.ᴏ.ᴛ™👽", "MOHIT REDDY", "akhil Amazon", "Keerthi Kanth", "UTKARSH Kapoor", "Amish", "JAY KRISHNAKUMAR"]}
]