[
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Honest review of Honor 7X", "STRAIGHT FORWARD REVIEW? WHERE DID HONOR MISS TO WORK WITH THIS?...", "Loving it so far, bezelless display is usp of this smartphone.", "Looking for a phone that looks and feel great in budget", "One Star", "Buy it you will not regret it", "NETWORK PROBLEM", "Best mobile any under 20k", "Honor 6X sales were good because of the fact that it was one of ...", "Just awesome!!  until n unless u plays heavy games.."], "review": ["Display is good (5 star)  \n  \nDesign and 18:9 ratio has maintained and looks very stylish and slim (5 Star)  \n  \nKirin 659 Processor is fast as compared with Snapdragon 625 (5 star)  \n  \nLot of Bloateares (1 star)  \n  \nCamera is above average (we can notice noise). Shutter speed is super fast.\nFront camera portrait mode doesn't work as effective as claimed. Also lacks\nfront flash. If u want good selfie then consider Honor 9i (4 stars)  \n  \nBattery life, I yet to test but seems okay. No fast charging supported (4\nstars)  \n  \nAudio via speaker is loud but it's mono speaker so quality is little\ncompromised (4 stars)  \n  \nFM radio is included (5 star)  \n  \nEye comfort display mode works well (5 stars)  \n  \nEMUI is difficult to operate though company has given Ap drawer option. Lot of\nJunk apps and it's not systematic (3 stars).  \n  \nFinger-print sensor works butter smooth. It unlocks phone instantly (0.25\nseconds). (5 stars)  \n  \nBox contains normal charger and Transparent silicon case cove. No earphone &\nscratch guard provided. (4 stars).  \n  \nPricing is very competitive for 32 GB variant. For 64 GB, it's overpriced as\nyou can't pay ₹3K for just 32 GB extra storage. (4 stars).  \n  \nShould you buy this?  \nBuy only for stylish look and good processor. It's not at all camera phone.\nBuy 32 GB variant of Honor 6X. 64 GB is overpriced. Better you buy Honor 9i by\nspending 2K more for good selfie.\n\n", "\\---------------------  \nMY VERDICT  \n\\---------------------  \n● What's great in this device?  \n  \n1\\. The dual camera setup on the back can take some nice portrait shots.  \n2\\. The build is premium and the black or the blue color device looks\nstunning.  \n3\\. The full view display on the front looks beautiful.  \n4\\. Kirin 659 Processor with 4GB RAM can handle multitasking and games with\nease.  \n5\\. Camera app comes with absolutely all beast modes.  \n  \n● What's bad in this device?  \n  \n1\\. The most important thing they missed is the fast charging that was\nabsolutely a head down stuff for me, because everyone wants it badly these\nday, or the charger provided is 3A nor the phone supports fast charging.\n(STRAIGHT AWAY A STAR LESS)  \n2\\. Hybrid sim slot is there which is something we do not like because you\ncannot use 2 sim cards with a MicroSD. (THIS POINT IS FAIRLY ACCEPTABLE TO\nSOME).  \n  \nTalking about buying this phone, yes definitely you can buy this phone if you\nlike to have best the camera stuff, performance stuff, design, etc in such a\nbudget range. Only thing you need to compromise is the fast charging. Dont get\nme wrong the battery is good and lasts a day with normal usage with almost\ncompletely charged.  \n  \nHope I was helpful to you. Thankyou.\n\n", "Loving this phone so far.....  \nPROS-  \n1.The first and most amazing usp of this mobile is its looks - bezel less\ndisplay. Its big and even handy. Well finished curbed body makes it best\nlooking smartphone under 15k.  \n2.finger print sensor is very responsive. And unlocking ur apps with ur\nfingerprint is more convenient than the password.  \n3.camera of this mobile is good actually, there are better camera phones out\nthere but in this price i say you will be more then happy with its camera\nactually. But bokhey effect is not good on this set.. But in simple mode you\nactually get good photos.  \n4.Ram now days are very important on a smartphone, so honor 7x comes with 4gb\nram. In which only about 2.85 ram is available for oprating apps rest is\noccupied for OS operations and basic applications. that is good i would say.  \n5.you won't find any heating issue with honor 7x, yes you do get some heating\nwhen playing some heavy games. But with time it doesn't heat further. So good\nmarks for head management.  \n6.the grip of this mobile is good, this holds good grip and doesn't slip from\nur hands so for a big phone like this you must have a good body surface to\nhold, so full marks for the grip.  \n7\\. My this point may seems silly but i like they are providing a transparent\ngood looking cover in box. When i bought my oneplus 5, it dropped on day one\nand got a dent on the body. So it is good that you get ur protection from the\nstart. And this cover is very good looking so the slimmer body, curvey design\nand display looks unchanged after applying the cover.  \n.  \nCONS-  \n1.you get about 6 inchs of display on honor 7x, although this phone is smaller\nthan other 5.5 inches mobiles, but still big to operate by one hand. I would\nhv given better marks if this was a 5.5 inch display in much better handy\nsize.  \n2\\. It lacks some of the newer technologies like NFC which is usefull for\nmaking payments and for easy tasks, and for connectivity. But not a problem\nfor most users.  \n3\\. Honor 7x comes with a 3340 mAh of battery, which is ok kind of capacity.\nBut what makes it a bit a downside is its non-fast charging capability. If it\nhad the fast charging feature then the battery size was not a big issue, but\npersonally i am comfortable with it and has no problem when you optimise ur\nphone and not play long games. If u are buying to play lobg games then u hv to\ncharge it very soon.  \n4\\. It comes with usb 3.0 not with c type, which will be more usable port in\nfuture.  \n.  \nConclusion -  \nI am happy with this mobile. In 13k you get a good smart phone. Specially with\na amazingly rich looks.  \nWithout its bezelless display I would hv given 4 stars but for display i am\ngiving a 5 star.\n\n", "OK.. the real auhtentic rating is here guys.  \nLooking for a phone that looks and feel great in budget .. your search is over\nwith this Honor piece.  \nBeen using it now for a week and there is absolutely no lag. The multitasking\nmay sometimes looks a bit slow (just a tiny miny bit) but otherwise great\nprocesaor.  \nI played Asphalt 8 for more than three hours straight and no heating problem .  \nBattery is good and takes around 2.5 hours to reach 100 from 0 with more than\na day of back up for moderate use.  \nUI is simply WoW!!  \nHand down for the unibody build. And 2.5d curve glass, just makes the phone\nlooks more expensive than its actual price.  \nCamera is pretty good in every section and takes crisp pics in both day light\nand low light. Few sample are attached for reference.  \nThe overall build of phone makes it pretty easy to handle single handedly.  \nFinger print sensor works like a wonder and very responsive.  \nP.S. you definitely need to order a body cover & tampered glass with this\nphone.  \nNegatives - No turbo charging option & hybrid slim slot making it difficult to\neither choose two sim or one sim and a memory card.\n\n", "Product is hanging and not work properly as per honor commitment\n\n", "I have used 5S, 6S and was planning to buy 7S but changed my mind to go with\nHonor 7x when saw a sale starting in 15 mins..  \nBelieve me its a best decision.  \nIt gives you a feel of high end mobile phone of over 50k when you hold it in\nyour hand.  \nWhile using it from last 5 days.. No lagging no problem till now.  \nI am a freelancer and i use many apps like 40-50  \nAnd the battry back up its giving me is simply amazing.  \nThe screen is very large for the single hand use but when you use it.. Its\ntotally worth it..  \nSo many functions and themes i can use.. Small small features which are very\nuseful makes it a perfect phone for me..  \n  \nWas worried when ordered that it might look like a crap chinese phone which i\nwill be ashamed of while using in front of my friends.. But i show off with\nit.. Thats what the quality is.  \n  \nThanks to amazon for 1 day delivery..  \nEverything was sealed properly.  \nBut it should have some more protection from falling or mishandling.. Thats\nwhat the only complaint is.  \nPS the touch sensor on the back.. Wow.. Unlocks the phone in a blink.. And due\nto which i was able to set multiple passwords on whatsapp and other apps too\nbecause there is no hazzle in opening the apps quickly.. Just a firm touch and\nthere you go. :)\n\n", "it's better you have to buy Nokia 1100 i.e. basic phone coz if u are facing\nproblem on network then every features is useless. we are buying phone with\nfull features but the phone have network problem then its useless. i am facing\nnetwork problem in maximum call . while dialing a number from Honor 7x it's\nshowing dialling after that phone call is disconnect. the same i call from\nlandline or another mobile phone call is connected. its not a single time. i\nhave try to cross the network problem is coming only from my phone or its real\nproblem. but always found the problem is in my phone. don't buy if u r buy\nthis phone for phone calls. else u r buying for camera or speed then its ok.\n\n", "Good mobile under 20k, nice display slim peace, bought for 11700/-\n\n", "Honor 7X Review and Pros Cons:  \nHoHonor 7X is the successor to the Honor 6X which was first dual camera phone\nin mid range. Honor 6X sales were good because of the fact that it was one of\nthe first dual camera phones in this range plus the overall performance of the\ndevice was good as well. Huawei would like to replicate the success with Honor\n7X.  \n  \nHonor 7X is actually a lot like Honor 9i which was launched recently in India.\nThe internals are same with the same chipset, same RAM. The camera setup at\nthe back is same. The display is also same. Only things that have changed from\n9i to 7X is that front camera on 7X is a single 8MP sensor while it was a dual\ncamera setup on 9i and the camera placement on the back has changed. In Honor\n9i the dual camera setup is placed vertically in the middle and on Honor 7X\nthe dual camera setup is placed horizontally on the top corner of the device.\nBecause a lot of things are similar, the review is also similar. You can take\na look at Honor 9i review here.  \n  \nHonor 7X has a metal unibody design with a 2.5D glass covering the display on\nthe front which is 5.93-inch display with Full HD Plus resolution. The aspect\nratio of the display is 18:9 which we are seeing a lot in latest phones and\ntrend is expected to continue for next few years. In a couple of years, all\nphones might come with these full view 18:9 displays.  \n  \nThe hardware inside the Honor 7X is decent as well. We have a Kirin 559 SOC\nwhich is an octa-core chipset with 2 clusters of 4 A53 cores. One cluster is\npower efficient and runs at a lower frequency. The other cluster runs at\nhigher frequencies and is able to handle heavy workloads like heavy games and\napps. For storage we have 3 variants: 32GB, 64GB and 128GB. There is a hybrid\nsim slot as well which can be used to increase the storage by up to 256GB. We\ndo not like the concept of hybrid sim slot but companies are still going for.\nWe hope it changes in future.  \n  \nIn the camera department, we have a dual camera setup on the back. There is a\n16MP+2MP dual camera setup. The higher resolution sensor is a color sensor and\nlower resolution is a black and white sensor. Details from both sensors are\ncombined to improve image quality. It also helps in giving a depth/bokeh\neffect to your pictures which are also known as portrait shots. In the camera\napp, you can actually change the object that you want in focus which is quite\nuseful sometimes. The camera performance is good for a device in this range.\nThe Mi A1 back camera is slightly better than this but it does not have a\nlarge 5.9 bezel-less display. On the front, there is a single 8MP camera which\nis capable of taking some nice detailed shots in daylight. The camera\nperformance is decent. The front camera on Honor 9i is better because it has a\ndual camera setup on the front as well. So selfie lovers should go for Honor\n9i.\n\n", "Amazing mobile, I love it, for look..18:9 looks fabulous... Touch I very\nresponsive and smooth 5star, performance 5star, music system superb.... Front\ncamera is superb. Have wide angle but when it comes art rear it's not good as\n16+2MP.. ram management is excellent. Got 2.81 GB of free ram.. and about 20gb\nROM..  \nOverall amazing mobile at this price..  \nWallpapers with mobile are amazing.. attached some of them...  \n  \nGot it just at ₹11700/-😍😍\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 December 2017", "on 14 February 2018", "on 15 January 2018", "on 21 March 2018", "on 4 January 2018", "on 10 December 2017", "on 23 February 2018", "on 10 December 2017", "on 22 February 2018", "on 11 January 2018"], "reviewer": ["CA Hiten Chheda", "Ajay J", "Ravi Anand", "Nishant", "Shahezad", "Aj", "Amazon Customer", "ramesh.katragadda91", "kalra ji", "Shyam"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["I don’t know if you can get a better looking and better performing phone than Honor 7x in ...", "One Star", "MidRange Avrage SmartPhone", "HONEST REVIEW ..AWESOME PHONE", "Flagship Phone!", "Honor 7x my choice", "Honor 7x , ohh yeahhh , buy it with out any doughts :)", "Value for Money", "A nice phone in this price range should go for it", "Does what it needs to."], "review": ["I am giving this review after having used the phone for over a month.  \n  \nI don’t know if you can get a better looking and better performing phone than\nHonor 7x in this price. I'll break down the pros and cons of this phone:  \n  \n1\\. Look 9/10 Good luck getting a better looking phone under 15k.  \n  \n2\\. Camera 8/10. Not perfect but the images are so good. Even low light shots\naren't bad. The front camera is fine and primary camera is very good. If\ncamera is a high priority for you and budget is under 15k, go for this phone.  \n  \n3\\. Gaming performance 8/10. Haven't experienced any lagging despite playing\nLast Day on Earth regularly and having many other apps running at the same\ntime. Injustice Gods also worked well.  \n  \n4\\. Battery 7.5/10. Didn't expect battery to last very long when I got this as\nsome reviews said it didn't last long with gaming. It did last me longer than\nexpected. Very decent actually. And it charges quicker than other non fast\ncharging phones I have used.  \n  \nCons:  \n  \n1\\. Heating 6/10. But this is honestly expected if you play games regularly on\nyour phone. Nothing unusual and it's not like it heats up too quickly or makes\nthe phone too hot to touch. You can still continue with your phone activities\nwithout any issues. Yet it would be good if it can be reduced.  \n  \nI don't have more cons to add at this point because I am honestly very\nsatisfied with Honor 7x phone. It's a great phone for its price. If you are\nconsidering this phone, as someone who has used it for over one month, I say\ngo for it.\n\n", "Water bubbles on screen\n\n", "The Honor 7X is the newest smartphone to sport an 18:9 aspect ratio screen,\nand has been launched at a starting price of Rs. 12,999. It is the successor\nto the Honor 6X (Review) and comes shortly after the launch of the Honor 9i\n(Review),  \nOne look at the spec sheet and it is evident that Honor has loaded this phone\nup with loads of features, but is that enough to give it an edge in this\ncompetitive price segment? We'll answer that question and more in our Honor 7X\nreview.  \nWe like smartphones with big displays, and the Honor 7X ticks this box. The\nfront is dominated by a 5.93-inch screen with thin borders on the sides but\ncomparatively thicker ones at the top and bottom. Many Honor phones are\npowered by Huawei-made processors, and the 7X packs in a HiSilicon Kirin 659\nSoC, the same processor powering the Honor 9i. It is an octa-core chip with\nfour cores clocked at 2.36GHz and the other four clocked at 1.7GHz. With the\nHonor 7X, you get to choose between 32GB and 64GB of internal storage, but\nboth variants have 4GB of RAM. Both also let you expand storage up to 256GB\nusing a microSD card in the Hybrid dual-SIM slot. Like all other Honor\ndevices, the 7X runs on Huawei's custom EMUI skin, specifically EMUI 5.1 on\ntop of Android Nougat. You get the option to choose between layouts with and\nwithout an app drawer. The UI also includes theme support for a degree of\ncustomisation.  \nGood- Well built,Good screen  \nBad- Battery life could be better,Average camera performance\n\n", "awesome phone awesome camera the screen is so vivid and rich..just download\nthe 4k wallpapers and set them on ypur home screen you will absolutely love it\ncrisp sound and good UI. battery life is also good .camera is awesome but\nstruggles in low light.. portrait mode is awesome but could b better on the\nedges as when we take someone's photo the detailing on the edges of the object\nis not that great..but only sometimes....if u have good lighting u wont notice\nthat either  \nGO FOR IT ITS BETTER THEN MI A1 I HAVE BOTH PHONES and everyone is attracted\ntowards honor 7x edge to edge display is super sexy..  \nits my honest review..as i am using it for a week\n\n", "The Honor 7X mobile features a 5.93\" (15.06 cm) display with a screen\nresolution of 1080 x 2160 pixels and runs on Android v7.0 (Nougat) operating\nsystem. The device is powered by Octa core (2.36 GHz, Quad core, Cortex A53\n1.7 GHz, Quad core, Cortex A53) processor paired with 4 GB of RAM. As far as\nthe battery is concerned it has 3340 mAh. Over that, as far as the rear camera\nis concerned this mobile has a 16 MP camera CMOS image sensor supporting a\nresolution of 4616 x 3464 Pixels and the front snapper is powered by a CMOS\nimage sensor. Other sensors include Light sensor, Proximity sensor,\nAccelerometer, Compass. So, does it have a fingerprint sensor? Yes, it does.\nFor graphical performance that can make games run smoothly, this phone has got\na Mali-T830 MP2 GPU. On board storage is at 32 GB with the option to expand\nthe memory by Yes Up to 256 GB. Design is one of the most important factors\nwhen it comes to mobiles. This phone is 7.6 mm slim and weighs 165 grams.  \n  \nHuawei Honor 7X Mobile Phone  \n  \nHuawei Honor mobile phones have been a sensation in the forte of Smartphones\nin India. Huawei Honor is known to be one of the most prominent smartphone\nvendors in the world that have also specialized in a series of modish tablet\ncomputers and wearable technology. This Chinese brand has successfully\nproduced a line of phones that are no less than any international brand.  \n  \nHuawei Honor 7x has been one of the most path-breaking products of the brand.\nAs per the expert reviews, this phone is absolutely worth its price and meets\nall the needs of a tech savvy.  \n  \nWith the advent of digital marketing buying anything, varying from a needle to\nrefrigerator, has become a matter of just a few mouse clicks. And\nGadgetsnow.com assures to provide you with the best of gadgets and services.  \n  \nTake a look at the specifications of Huawei Honor 7x mobile phone:  \n  \nDisplay and Camera:  \n  \nLaunched in October 2017, Huawei Honor 7x boasts of a 5.9-inch IPS LCD panel\ncareen that has a resolution of 1920x1080 (~403 ppi pixel density).  \n  \nFor the selfie lover in you, the phone comes with primary cameras that are\ndual 12 12-megapixels with PDAF and also feature LED flash, geo-tagging, touch\nfocus, face detection, HDR, panorama and can also record full HD videos at 30\nfps. The secondary camera is of 8-megapixels with LED flash and can record\nfull HD videos at 30 fps.  \n  \nFor your utmost convenience, the phone also comes with a new Gesture Control\nfunction. This enables you to simply turn your palm to the camera to trigger a\ncountdown to click a selfie.  \n  \nRAM and Processor:  \n  \nHuawei Honor 7x phones guarantee you fast performance. This phone has 4GB RAM,\n2.36GHz Octa-core Kirin 659, and EMUI 5.1. All Huawei Honor 7x phones are\npowered by an octa-core Hisilicon Kirin 670 processor that have four cores\nclocked at 2.2Ghz and four cores clocked at 2.0GHz. As per your requirement\nyou can choose from 4GB of RAM and 64GB of internal storage respectively. The\ninternal storage can further be expanded up to 256GB via microSD card.  \n  \nThese aspects ensure you smooth working of multiple apps that are running\nsimultaneously. Smart optimization and file management features ensure no\nlagging.  \n  \nConnectivity and Other Features:  \n  \nUnbeatable battery life is one of the major highlights of this range of Huawei\nHonor phones. The battery is a 3,340mAh Li-pol unit, which is slowly becoming\na standard in most Chinese OEMs.  \n  \nAmong others, Huawei Honor 7x device is a dual SIM phone that is compatible\nwith 4G and VoLTE. Other connectivity features include, GPS, A-GPS, GLONASS,\n802.11 b/g/n, WiFi, Bluetooth and a USB Type-C port for charging and data\ntransfer.\n\n", "This review is posted after a month's use, the phone is very handy and looks\nnice  \nI'll give points about what's good and what could be better  \nGood  \n1 looks and quality  \n2 sound, calling and voice quality  \n3 user interface ( more or less a lot like  \nbasic android, with some features)  \n4 customizable  \n5 suitable for one handed use, as its  \nscreen size is just right.  \n6 Awesome 18:9 experience, most apps  \nwork full screen, some show a  \nnotification that they might be  \nproblematic in full screen mode (  \nnothing happens though).  \n  \nNow I'll state points that could be better  \n1 Battery backup could be better, it's  \ngoing to work an entire day for an heavy  \nuser, for normal users good (no fast  \ncharging)  \n2 it lacks gyroscope (which I don't need)  \n3 camera  \nThis is both good and bad thing  \nThe camera is good, ya one needs to put some work onto getting quality images\nsometimes, bokhe mode works both in front and rear,( however sometimes your\nhair might not be very clear).  \nVideo has no stabilization, and Ya for modes like night shot one needs very\nstable hands, probably a tripod, but images come out dope. A lot of pre loaded\nmodes are provided.  \n  \nSummarizing  \nIf you want a really nice looking, cool and genuine all rounder, with some\nnicks of improvements, this is for you.\n\n", "it is such a nice phone friends , some important info for up coming buyers :  \n  \nHeating issue : yes heats , but only after usage of camera image / video , (\nnote : some people may get heating issue on 1st usage itself , it continuous\nfor 2 - 3 days , later it stops , its a common issue on few mobiles.  \nimage / Video Quality : its okk , suitable for youtubers , ohh yeah in video\nwe will get pause option , in order to change the angles , rather than\ncontinue shoots , about image , wide angle images are really fits your screen\nwith clear details.  \nBuilt Quality : its superb , no more comments.  \nVoice Quality : On normal talking itself the voice is really very loud , we\nhave to decrease the volume levels , when there is any personal calls.  \nMobile Color Choice : Till now i always use black color mobiles , but this\ntime i tried with white one , OMG its really eye catching on crowd.  \nItems in the box : mobile , charger , transparent case ( very bulk ) ,\nwarranty card , sim tool.  \n  \nBTW friends i personally bought nillkin back cover case for my honer 7x , its\nreally good and best product , here the attachments , even i shooted video in\nyoutube , to watch friends you just type ( vamsi naik honor 7x ).\n\n", "DAY 4 UPDATES  \n\\---------------------  \nI have mixed feelings (still positive though) about this phone knowing fully\nwell that it's not a flagship phone and expectations should be toned down\naccordingly. Here are a few more updates  \n  \n\\- Battery life: have uploaded three more pictures that show the Screen On\nTime (it's amount of time screen was on and in use with battery starting at\n100% and discharging to almost 0%). In my case, the battery discharged to 5%\nand the SOT was 4 hr 13 mins approx. This is not bad but it's not good either\ngiven the battery capacity. This is running the screen at 50% brightness, not\nrunning power saving mode and using the phone to play a couple of heavy games,\nwatching youtube video, browsing and then some social media (all in all that's\ntypical of an average user)  \n  \n\\- Performance: This is also mixed. I played Asphault 8 for about 10 minutes.\nThe battery drained faster which is expected but the phone also became hot\n(backside upper part). Without the case, it felt hotter. The performance after\nthis was not good at all, perhaps because the processor was throttled due to\nit being hot. Without playing games, the phone performs good but after playing\na heavy game, it didn't perform well - apps took longer time to open and there\nwas stutter in scrolling too  \n  \n\\- Bluetooth: it was easy to connect to any bluetooth enabled device once the\nphone had bluetooth on so it's all good here. However the issue was trying to\nswitch on bluetooth from the pulldown menu. At least in my unit, it didn't\nwork though I tried multiple times. Maybe it's a software defect. Will keep on\ntrying.  \n  \n\\- Selfie Camera: this can be easily put in good category. The selfie camera\nto me at least pulled in better pictures than my iPhone 7 plus in day time and\nin dim light past evening. That's a major plus so happy with that.  \n  \n\\- Sound quality through headphone jack: it was good, infact very good. I\ntried the AKG earphones that came with Galaxy Note 8 and the sound quality was\nat par with Note 8. So happy with it  \n  \nI'll certainly lower the rating from 4.5 to 4 with the processor throttling\nand bluetooth switch on issue. Otherwise the experience has been good so far.  \n  \nDAY 1 UPDATES  \n\\---------------------  \nI have always had flagship phones but was looking for a backup phone and\nthought that this would be a good candidate. I received this phone today so\nposting this review based on my initial impression of it. Will keep it very\nsimple - what's in the box, what's there to like about this phone, what's not\nso good about the phone  \n  \nWHAT'S IN THE BOX  \n\\- Phone with 5.93 inch display, IPS LCD panel  \n\\- Charging brick and micro-USB cable  \n\\- A TPU transparent case  \n\\- SIM ejector tool  \nNote: like other Huawei phones, was expecting that this phone will have a pre-\ninstalled screen protector but there isn't one  \n  \nWHAT'S THERE TO LIKE ABOUT THIS PHONE  \n\\- Build Quality: it's excellent to say the least. Holding this you can't say\nthat this is a $200 phone. It has a premium solid feel with no flex. Metal on\nthe back and gorilla glass on the front  \n\\- Looks: the phone looks good with aluminium back that is blue (check out the\npictures). From the front too, it looks and feels modern and follows the\ncurrent trend of 18:9 aspect ratio.  \n\\- Fingerprint sensor: It's lightening fast and has always worked up until\nnow. So overall very good  \n\\- 3.5 mm audio jack: it's there. Putting this in the things to like section\nbecause even the most premium and expensive phones don't have this now.\nExample, iPhone, Huawei Mate 10 Pro, Google Pixel so it's really a luxury\nnow-a-days  \n\\- Software: this can be subjective for a lot of people but I do like EMUI\nsoftware. The version is 5.1 which is not the latest but still EMUI is a good\nskin because it feels like a good mix of iPhone and Android (am a fan of iOS\nand this is a good mix)  \n\\- Call Quality: It's very good. I am using T-mobile and getting a good signal\nin my area. It's comparable to my Galaxy Note 8.  \n\\- Sound quality through bottom firing speaker: Again at this price, would\ndefinitely say that that sound quality is good. There's just one bottom firing\nspeaker but its plenty loud. Not a lot of bass but enough clarity  \n  \nWHAT'S NOT SO GOOD ABOUT THIS PHONE  \n\\- Rear Camera at night: I have taken just a few shots from this camera,\nmostly night time - a few of them indoor and a few of them outdoor. In both\ncases the images are falling apart. Indoor images have a blur so unless you\nhold the phone steady, you won't get a nice shot. Outdoor it doesn't capture\nenough light and the results are grainy photos. Will try to post some samples.  \n\\- Use of micro-USB port for charging: In this day and age of USB type C, this\nphone comes with micro-USB. No way a deal breaker though. There's no fast\ncharging but again with the price, it's ok  \n  \nA few more things:  \n\\- Battery life: Though I have used this for a short period of time, the\nbattery life at least for now appears to be good. After a couple of days, it\nwould be possible to put this in the above two categories  \n\\- Performance: This phone comes with Andoid Nougat and not the latest Oreo.\nIt's a bit slower than flagship phones maybe due to the processor being mid-\nrange. I know this phone shouldn't be compared with a flagship phone.  \n\\- Rear camera in day time: yet to be tested during the day, will try to post\nsome sample pictures  \n\\- Selfie camera: yet to be tested both in day time and night time so would\nupdate in next few days  \n\\- Sound Quality through headphone jack: would be able to update in next few\ndays  \n  \nI would have rated this 4.5 given that it's not a flagship phone but that's\nnot an option. In the end rated this as 4 because it's a bit behind in terms\nof both camera and performance\n\n", "Well product is really good  \n* Great camera both back and front  \n* Battery is little bit low should be 4000 mh would be better  \n* And available space is less I get 18 GB out of 32gb  \n* Sound quality and sound range is bit low both in earphone and handset speaker  \n* Built quality and texture is rich  \n* Big screen size full 18:9  \n* Looks like iPhone 7 with finger print sensor  \n* Finger print sensor works great  \n* Smooth touch  \n* Split screen is great to see  \n  \nOver all I like this phone and recommend to buy it . You will get everything\nin this price.\n\n", "In this era of daily updates of new phones , there is literally no end to the\nwants of people.  \nBut this one does what's expected out of it, what's needed out of it.  \n  \nReview After a month's use.  \n  \nLooks:  \nBest display and the split screen function is pretty cool. Camera is out of\nthe body so a back cover is required (which is included with this phone) to\navoid scratches.  \nLooks premium on this budget.  \n  \nTouch:  \nGreat response, but I have a very rugged use so I always use tempered glass or\nany screen guard. A little rough in comparison to using without any screen\nguard, but this is a sacrifice I am willing to give.  \n  \nBattery:  \nA day with data on for whole day, some Netflix , some YouTube, games and\ncalls, roughly used 60-70% of battery, so I am pretty satisfied with it.  \n  \nCamera:  \nIf you look at the budget, it's like jack of all and king of none. It gives a\ntaste of every function that a high end phone have, but as you can guess\nquality of those functions are not that great.  \nNormal photography is decent for this phone, great actually.  \n  \nSoftware:  \nAndroid runs smoothly on this, no lags as such.  \n  \nFinal verdict: if you are looking for a high end phone with low end budget,\nthat's your deal right here.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 February 2018", "on 18 December 2017", "on 20 January 2018", "on 3 January 2018", "on 23 March 2018", "on 7 February 2018", "on 13 February 2018", "on 12 March 2018", "on 31 December 2017", "on 28 February 2018"], "reviewer": ["James Mangte", "Ashish", "Amazon Customer", "shivam", "🗣▂▃▄▅▆▇█▓▒░FeeDz░▒▓█▇▆▅▄▃▂🗣", "Anupam Das", "vamsi naik", "Evil Playa", "sachin ingle", "Mukesh"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["#Probably the best phone of 2017 in Mid range", "Like Your working And mobile phone is So good", "Great Display for this price..hope it gets Anroid O update.", "Received the phone in excellent condition. But on the 3rd day on restarting ...", "Go for it! & Get honoured", "Plz Guyz Don't Buy this Mobile. It has a ...", "Camera is better than honor 6x but something feels wrong with the ...", "Best (Budget) Phone out there.", "\"Premium Stylish Performer\"- Worth The Buy", "Please be careful"], "review": ["This phone has been made keeping customer requirements at par.  \n  \nPros:  \n-Decent Camera (both rear and front) with some handy options to use for photography enthusiasts.  \n-Battery is really very good, no Heating issues at all, lasts upto 2 days with 4g Net on, and normal usage.  \n-feels premium in hands, Earlier I had doubts I could use it single handed, but trust me it doesn't feel bulky at all, and keep your other hand in pocket as it's quite cold out there :D  \n-No lags experienced till now, but I would also iterate the fact that I don't use too many apps, in fact for Facebook also, I use Lite app which saves a lot of space and data as well.  \n  \nCons:  \nYou need to order a screen guard online or would have to wait for few days\ntill it is available in offline stores, currently I'm using V7's screen guard\nwhich does the job.  \n-Still waiting for any other issues, I hope it never happens.  \n  \nAnd at last, Thank you Amazon for on Time, service. The delivery person was\ndecent and well informed.  \n  \nRegards\n\n", "Like Your working And mobile phone is So good .thanks Pack Box And good you .\n>>> care mee and help Thanks god pule sh you. GreenMobiles thanks selling and\nAmazon.India 3.3.2018 look my Camera One Look silver Ring\n\n", "Nice phone .. delivery was on time ..  \nScreen is amazing for this price segment...  \nCamera is good for this price.  \nLota of bloatware but can be uninstalled.  \nBattery is great.. no fast charging but that is covered by great battery\nbackup for this price.  \nIf you want a 18:9 display go for this one..\n\n", "Received the phone in excellent condition. But on the 3rd day on restarting\nthe phone it's asking for security code. But it does not accept any code. I\nalso took it to the service center but they were also unable to fix the\nproblem and asked me to return it back\n\n", "I got the best smartphone.  \nHonor never failed @ camera quality.  \nFront camera supports the portrait mode. This feature you'll not get in any\nsmartphone. So thanks for that feature.  \nWe get a crystal clear FULL HD + Display. i.e. 1080x 2160 resolution with\nGorilla glass.  \nThis phone has 4 air bags as they said in the launch ceremony of honor 7x @\nlondon.  \nI don't know what they fitted inside of phone but it's a safety feature. It'll\nprotect your all the four cornors of your smartphone.  \nIf I talk about smartphone body it's very silky and beautiful. If you took\nthis smartphone believe me you'll love it.  \nIf you've not installed any other messaging apps like Hike, messenger,\nsnapchat etc except WhatsApp. You'll get a complete 2 days of battery backup.  \nSound quality is amazing. Honor gives you a original protective cover which is\nalso good. (Honor brand) (Transparent cover)  \nThis phone supports a very fast finger print scan. As they say honor 7x gets\nunlocked in 0.25 seconds & it's true.  \nProcessor: Runs like cheetah.  \nRAM: Amazingly smooth experience\n\n", "\n\n Plz Guyz Don't Buy this Mobile.It has a YouTube Problem when you played the\nvideos in 1080p 60fps the Screen Start flickering Automatically,Hanged. I\nalready open 2 Mobile Box I face the Same Problem...  \nIf you already Buy then check you are Facing the Same Problem  \n  \nComment Down Below....\n\n", "Pros:  \nNext day delivery without prime subscription.  \nGorgeous screen.  \nCamera is better than honor 6x but something feels wrong with the camera.  \nBokeh mode is good at times. Just ok  \nCons:  \nCamera in just little artificial condition feels very grainy, not good camera\nin low light.\n\n", "Edit:I Got the face unlock update yesterday and it works flawlessly, honor\ncontinues to impress with these updates every month. Hopefully oreo will\narrive in March or early April as they have promised.  \n  \nFIRST IMPRESSION: As cool as I expected it to be. The display and design were\nmy first priority and the honor 7x rocks these aspects. The full vision\ndisplay looks nice on these 2.5D curved displays. I love how the device is\ntotally lag free,not even a hint of lag it's my 3rd day using it and I think\nthe battery backup is good. I don't play games on phones so I don't know how\nsmooth the device runs while gaming. But for a normal user it's way more than\nenough. A bit of Bloatware does scar there otherwise amazing first impression\nbut it will hardly take your mind off the great things this phone offers at\nthis range. Thanks Huawei for an amazing phone and Amazon for a really good\nservice.  \n  \n1 Month later: This phone is still as amazing as it was on day 1. There was an\nupdate with the January security patch and they also enabled gyroscope sensor\nin the update. The battery still lasts 1day or slightly more on normal usage.\nThe cameras is clearly a weakness but doesn't mean you get bad photos, not at\nall. But you ocassionally get average pictures. In low light the camera\ndoesn't look good. But if you're not that into photography, like me. No other\nphone beats this in terms of looks. But come on honestly that's just the tip\nof the iceberg. Totally lag free, I haven't seen one app crashing or lagging.\nIt's a beauty and a beast in the same body.  \nCons: the stock android that a lot of people love isnt here but emui is\nbeautiful and very fast, there are Bloatware that I mentioned already but the\ncustomization on the emui is really cool. You can totally change the looks\nwithout a third party app. And the USB port is not type c. So no fast\ncharging. It takes 2 hours 10 minutes to charge from 0-100. But I don't feel\nlike there's anything to complain about considering this is the mid range\nsegment.  \n  \nI recommend this one without a doubt.\n\n", "Phone is Decent Performer and Bang for the Bucks.  \n📷Camera Quality in Day Light is Very Good but Low Light Photos are not Good (I\ndon't use mobile camera for night photography as I know all the cameras\nstruggles in low light photography) . Bokeh Effect is Nice it gives new\nmeaning to the pictures.  \n🔋Battery is also very Good , I am A Light To Moderate user.I get 1.5 to 2 days\nbackup. I have submitted Battery Uses screen-shot.  \n🎶Audio quality (In ear headphone) is average not much impressed, .  \n🔊Speaker volume is enough for a room. Call quality is also good - loud and\nclear.  \n🏁 No Lagging issue.No Hang Issue  \n💾 I get around 48 GB of storage  \n📲 UI is Very Good . You can swap photos, answer calls , see notifications\nusing finger print scanner.  \n🖥️ Display is Superb - Bright and Clear  \n\"Premium Body And Stylish Design\"  \nOver All I am a Happy Buyer And I will Definitely recommend it.  \n\"Good Luck-Happy Shopping\"\n\n", "Heats like iron box while video recording....  \nToo much to handle  \n  \nRequested for a replacement / Cash back, and the replacement accepted because\nthe machine is heating more than 46% in 5 mint.  \n  \nBut, they are purposefully delaying the delivery as we have requested for\nreplacement\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 December 2017", "on 2 February 2018", "on 9 December 2017", "on 20 December 2017", "on 6 January 2018", "on 29 December 2017", "on 26 December 2017", "on 23 December 2017", "on 1 February 2018", "on 10 December 2017"], "reviewer": ["varun kant Tripathi", "TejasParmar", "gagan", "sachin kapoor", "Dr.Samiiee", "Amazon Customer", "Shreyas", "Subham Sur", "Jitendra Goyal", "nidheesh"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["After one month use 🌹", "Nice Mobile but stylish one", "Very nice smartphone!", "A Superb Mid-range Premium-ish Phone", "Definitely better than both honor 9 lite and 9i", "Best in this price sagament.", "Awesome device at this price", "Great phone at this price. Looks amazing!!👌", "Exclusive deal", "Pro Con Honor 7x"], "review": ["Reviewing after one month use :  \nFirst thanks to honor for its awesome looks and beautiful camera. My friends\nwho are not aware about honor and only belived in samsung/moto are surprised\nafter seeing its gorgeous looks and cristal clean camera quality. Pics like\nDSLR. Very strong network magnetism. Now smoothly net surfing in regular train\njourny is not a problem. Battery stay easily for a full long day. Full charge\nin 2hours. FHD disply. And strongly built outer case. Front camera also very\nwell & takes nice pis even in very low lights. In one month no hanging or\nlagging created.  \n  \nCons: 1)- **hybrid sim slot is its main problem to me . 2)- No fast charger.\n3)- No frontal flash light. 4)- battery is ok for a moderate user but not for\na heavy gamer.  \nOverall : its true I am in love with this device. In my advice \"brother go for\nit\"\n\n", "Nice Mobile but stylish one. Faced the youtube flickering issue for a time.\nBut after a restart it is working fine. may be the next patch will fix this\nissue. Still many apps are not supporting the new 18:9 aspect ratio.  \n1.Camera performance is above average. Added few for sample.  \n2.Battery also giving good backup.  \n3.Fingerprint is the super fast.better and compared to the flagship phones.  \n4.UI also smooth and lot of bloatwares .  \n5.Highly customize able UI and lot of theme manager apps are available on\nplaystore.  \n6\\. Single bottom firing speaker is loud and crisp. Loudness is better than\nSamsung mobiles but lacks a punching feel and surround sound.  \n7 Front Camera is better and good software customization also available.  \n8.Charger is average. takes more than two hours. and never charged it fully  \n9\\. Flash LED is heating, when using more than a minute.  \n10\\. 3.5mm is good but audio quality is par. sound effects also good but\naverage.  \nOver all worth but Andoid 7.0 is the OS currently installed. Expecting oreo\nASAP.\n\n", "I have been using this smartphone from past 1 week and till now, I'm very\nhappy from the performance and overall looks of this handset. Battery life is\ngood, it can easily last whole day with atleast 30% charge remaining at the\nend of the day after moderate usage. By moderate I mean 2 hrs of youtube and\n3-4 hrs of net surfing and social networking. The very usp of this mobile is\nits great look although a bit heavier then samsung smartphones but look wise\nthis is awesome. Specs are also at par with other premium smartphones. Back\ncamera quality is very good. The only thing lacking is that the manufacturer\ndoesn't provided screen guard with this mobile. Also, this mobile lacks amoled\ndisplay, so if you are currently using amoled display mobile, you can easily\nnotice the change. Build quality is good and gives a sturdy metal look.  \nOn a scale of 1 to 10, 10 being the best, I will rate this mobile as-  \nLooks- 10  \nPerformance-9  \nBuild quality-8  \nValue for money-8  \nCamera-9  \nBattery life-6  \nSpeaker quality-6\n\n", "I am NOT an IT geek, and this is one of the best android phones I have owned\nso far.  \n  \nYes this is a mid range phone, but it has everything you could want from a\nsmart phone in 2017. I stopped buying the ultra premium/top of the line\nhandsets a few years ago as phones in this range provide the most value for\nyour money with relatively little compromises:  \n  \nBuild quality ----- Sleek metal body design ( but like most people I keep it\nin a cover)  \n  \nGreat battery life ----- This phone has a large battery ( 3340mAh ), and the\nsoftware tweaks like notifying you when a background app is consuming battery\nare very handy- I'm a light user and the battery lasts for a day and a half\nfor me, with moderate use a whole day should be fine  \n  \nGreat Screen ----- Works fine indoors and outdoors. You won't be able to tell\nthe difference from a top of the line phone like iPhone or Galaxy S Series\nphone unless you put the two phones side by side  \n  \nDecent Camera ----- with HD Video Recording. It will be unfair to compare it\nto iPhone/Galaxy S Series cameras. This In terms of the picture quality, I'd\ngive it a 6.5 to 7 out of 10- It has a flash but night/low light photos are\njust \"meh\"  \n  \nFast , Responsive CPU and more than enough RAM  \n  \nFor gaming - I've tried games like 'Bart' a full 3D game and it handled it\nfine. Although in fairness I'm not much of a gamer but this \"should\" play most\n3D games available on play store given its specs.  \n  \nAn accurate fingerprint reader ( supports registering multiple fingers to\nunlock the phone)  \n  \nGPS works great with google maps, speedometer, compass, etc  \n  \nAnd the standard smartphone features ( Bluetooth, WiFi,NFC, Google Play)  \n  \nWi-Fi Bridge feature connect up to 4 other devices and share the available Wi-\nFi among your friends.  \n  \nOne-key Split Screen function offers an even faster multi-management\nexperience.  \n  \nAnd this phone is by a TRUSTED brand - Huawei built Nexus with Google and that\nwas extremely important for me because I definitely don't want to be putting\nmy banking apps on some unknown Chinese brand phone where who knows what is\nbeing logged. All my banking apps work without complaining.  \n  \nAll in all, this is a great phone for the price.\n\n", "I got an OTA update a day after the delivery. After the update, YouTube issue\nwas rectified and the phone got gyroscope sensor.  \nDefinitely better than both honor 9 lite and 9i.  \n  \nFirstly, 7x has Gorilla glass protection which both 9 lite and 9i do not have.\nPS: Gorilla glass provides better protection for the screen againt accidental\ndrops.  \n  \nVS 9 lite: Better rear cam (The white balance of 9 lite's captures is very bad\nand lacks details). 7x has got Larger screen, Better memory management, and\nSlightly better battery backup. Moreover, 9 lite's glass back is fragile. A\nsingle drop can shatter the back glass. Only advantages of 9 lite is its front\ncam and android version. PS: 7x's front cam is also decent enough and will get\nOreo update very soon.  \n  \nVS 9i: I don't think 9i got gyroscope in the latest udpate like 7x. All\nfeatures are same compared to 7x except for front cam and portrait mode of\nrear cam. 9i's photos (both rear and front) are slightly over saturated which\nsome like and some don't. It's upto you. The side bezels of 9i is slightly\nsmaller than 7x's. Not noticible easily though. If you are willing to spend\n2000 more just for better front cam, you can go for 9i.\n\n", "Really very good smart phone in this price sagament. 4 Gb ram is enough for\nhandle multiple tasks. Gaming is good. Asphalt 8 can run smoothly on medium\nsetting. Camera ia really very good. Rear camera does the blur effect very\ngood. And front camera is mind blowing. But they both are struggling at low\nlight. but the rear flash does the job. Now talk about about display that is\nthe main attraction of the phone. 18:9 ratio with brazzleless display is so\ncolour crunchy that gives much better enjoy while watching movies and gaming.\nOver all in this price sagament can't want more. Its the best in this price\nsagament.  \n  \nDisplay 10/10  \nRam 9/10  \nStorage 8/10  \nGaming 8/10  \nRear camera 9/10  \nFront camera 9/10  \nFinger print 10/10 too fast  \nOver all I will give 9/10 to this phone.  \nSome pictures are added for camera quality. enjoy. 😊😊\n\n", "Value for Money....new GENERATION Phone (FULL VIEW)......Before buying this\ndevice gone through all the reviews, of course every device has +/- feed back.  \nAwesome device at this price. Nice performance through out and no lags seen\nyet with full gaming usage and you tube videos.  \nNote: This is a Budget phone, should not compare with higher end phones. This\nis my first budget phone, earlier I have used higher end phones of Nokia,\nSansung, HTC-cost 25K-35K. The reason for giving this statement is after using\nsuch a type of phones still this HONOR 7X not at all disppointed me.  \nReviwe:  \nPerformance- Superb (I did not understand while closing opened apps its shows\nxxxMB cleared to 2.5 GB instead of 4GB )  \nBattery: Good (In 24 hr Usage with 100% power: 3 hrs You tube, Tracking in\ngoogle map and OLA app for 30 min, reading paper, incoming /out going calls)  \nRear Camera: Very nice at this budget in Day time and in low light also doing\ngood at this budget  \nFront Camera: Average ( Needs to improve)  \nLooks: Woow....Full screen view and design  \nSpeakers: Normal speakers (Mono tone not Dolby). One of the drawback in the\nHandset. Music lovers don't like this  \n  \nGot it @11,800/-....Its worth at this price. Thanks AMAZON for prompt response\nagainst my queries and mails. Keep it up.  \n  \nEnjoy guys with new GENERATION Phone\n\n", "Best looking phone upto 20,000 price. I don't play heavy graphics games but in\naverage quality games like shadow fighter 2, it doesn't show any lags and\nheating up. It hasn't heated up yet, remains cool and calm whatever task you\ngive it. Camera is not the best in the class but is above par in its budget.\nCaptures great shots in good light, in low light captures fine shot, but it's\na low budget phone that is cool. Camera is far far better than xiaomi phones.\nUser interface is very fast and responsive.  \nFinal words, if you want a phone with gorgeous looks, fast processor, fresh\nand responsive ui than this one is for you. But if camera is your biggest\nconcern than have a look at the moto g5s plus.  \nBut don't buy junk oppo and vivo, then you are spending 1.5 times phone's\nactual value, don't waste your hard earned money, rather donate that extra\nmoney.\n\n", "Pros  \nGreat display  \nGood Battery Life  \nCamera clicks good images in well lit conditions  \nCons  \nGraphically heavy games stutter on the device  \nUnderwhelming audio quality  \nCompetitors have better camera\n\n", "Nice product. But at Night frint & rear Camera is poor & bettary is poor...  \n  \nReceived Honor 7X Black on 08-DEC-2017. The box had a transparent cover which\nfits very well and is ok very good quality which was great as till now no\naccessories are available for this product in market. Now for product review.  \nPros:  \n1\\. The screen is its greatest advantage. Good display although it is 5.9''\nstill it is slim and slender and can be operated by single hand as it is not\nat all bulky. Compared with Xiaomi Mi A1, this phone's display is simply way\nbetter and bigger due to FHD+ 18:9 display.  \n2\\. Battery life is descent enough and easily last more than a day with normal\nusage and watching few clips with medium brightness and 4G Wifi on through the\nday.  \n3\\. Camera is good when compare to Xiaomi Mi A1.  \n4\\. Sound from in-build speaker when compared with Xiaomi Mi A1 is definitely\nnot on par. Xiaomi Mi A1 sounds way better.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 February 2018", "on 30 December 2017", "on 15 December 2017", "on 14 December 2017", "on 26 January 2018", "on 1 March 2018", "on 20 December 2017", "on 25 January 2018", "on 7 January 2018", "on 9 December 2017"], "reviewer": ["Amazon Customer", "Mani Bharathi", "Akum Paul", "SwordFish", "Santhosh Kumar", "Pritam Majumder", "B Chowdary", "JB", "sameer singh", "jay shinde"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Very good smartphone.", "Worst camera", "Connectivity issue", "Review after using for 5 days", "Three Stars", "Five Stars", "Mi A1 has better camera and software support on the other hand", "Honor 7x far better than mi a1 specially camera", "HONOR 7X one Week Oveservation...", "Go For buy this product.............."], "review": ["The Honor 7X not only looks and feels premium but is also built reasonably\nwell  \nThe 5.9-inch FullHD+ display is unmistakably the star of the show on the Honor\n7X - it is bright, vivid and punchy and has good viewing angles  \n7X handles casual games reasonably well, heavy titles like Asphalt 8 witness\nquite a few frame drops.To be fair, the Honor 7X handles day to day use like\ncasual web browsing, social media use and taking the occasional picture quite\nwell. It is only when you push the phone a little that certain slowdowns come\nto the fore. EMUI does have its advantages - certain features like the ability\nto use the fingerprint sensor to slide down the notification tray and the\nability to run multiple iterations of the same app are genuinely useful  \nImpressive battery life Honor 7X can easily last more than a day on a single\ncharge. Intensive use will necessitate a charge by the end of the day.There\nare various power saving features on offer in EMUI 5.1 such as a mode which\nlowers the screen resolution as required in order to save battery life.  \nDual Back (16MP+2MP secondary - the sole job of which is to capture depth\ndata)Camera images taken outdoors and in well light conditions are  \nV.good with good detail and sharpness, quality suffers in low light, autofocus\nis fast, fully featured Pro mode, with the ISO, exposure, shutter speed and so\non, Bokeh shots look decent and are better than those produced by some\ncompetitors. 8MP front camera produces images with adequate detail and is\ngood, biggest issue with the front camera is the bokeh mode, bokeh shots are\nproduced via software algorithms.  \nMy verdict:It has a sleek and classy bezel-less design, solid build quality, a\npunchy and vibrant display and fairly good battery life must buy at this price\npoint i.e 12999/- If you can live with bezels and dont want sleek and classy\ndesign and can spend more money than you can go with Xiaomi Mi A1 and Moto G5S\nPlus\n\n", "Worst camera ever seen..front camera OK...  \nStylish look..Rear camera is just worst..many bugs in image processing..no\nsharp edges...gets blend near edges..\n\n", "I bought this mobile 1 week before bt till now it does not connect to 4G\nconnect oly 3G\n\n", "Honest review after using for 5 days  \n  \nFirst of all excellent delivery of amazon!!! Got delivered in 27 hours without\npaying a single penny for delivery.  \n  \nComing to the phone  \n  \nU will fell in love with the display oh man I have seen phones like one plus\n3t,iPhone 6 believe me this display is comparable to flagship grade, colour\nreproduction is another level  \n  \ncoming to day to day operation it handles task like a charm, I am not a heavy\ngammer not a single lag for a sec.  \n  \nBattery the most important!!, oh my goodness if you kept it on standby it will\nloose 0% in overnight, also u will get a full day usage on a single charge,\nalso there are many inbuilt battery saver mode but never used them.  \n  \nCamera in just one word super, I was not a selfie lover but after using these\nphone have to say it's not only click great photos in outdoor conditions but\nalso indoors, also there are many inbuilt camera functions like wide aperture,\nslow motion, portrait, doc scanner etc.  \n  \nBefore switching to this device I was a stock Android fan but believe me the\nway Huawei optimized this emui I feel its better than stock Android also many\ntweaks are there in settings.  \n  \nYesterday got an update which updated the security patch level to 1st Jan also\nenabled gyroscope sensor also enhanced the portrait experience . If honor\ngives regular updates like these I don't think there would be any reason to go\nfor devices like mi a1.  \n  \nCons  \n  \nI don't see that much cons in my daily usage, only thing I miss infrared\nblaster and lack of NFC.  \n  \nFirst charging is not a matter as almost in 2 hours this phone can give enough\njuice to run a full day.  \n  \nGo for it you will never regret your decision,  \nBefore buying this phone heard about screen flickering issue all things are\nrumours!!\n\n", "Mobile look cameras & display was excellent. But worest processor. Lagging.\nbad ram optimisation. Hanging\n\n", "Amazing product with good and advance features..\n\n", "Hello friends, today I will compare Mi A1 and Honor 7X. Do read my review.  \n  \n•• = Display = ••  \n  \nThe Honor 7X sports a 5.93\" 18:9 LCD display with a  \nresolution of 1080×2160 while the Mi A1 has a 5. 5\"  \n16:9 LCD display with a resolution of 1080×1920.  \n  \n•• = Camera = ••  \n  \nBoth the Honor 7X and the Mi A1 sport dual cameras  \neach-while the Honor 7X makes use of one 16  \nMegapixel camera and a 2 Megapixel depth sensor,  \nthe Mi A1 has two 12 Megapixel cameras-One with a  \nwide angle lens, and another with a telephoto lens.  \n  \n•• = Performance = ••  \n  \nThe Honor 7X is powered by the Kirin 659 Soc while the Mi A1 sports the ever\npopular Snapdragon 625 chip.  \nThe battery capacity of the Honor 7X stands at 3340 mAh, while that on the Mi\nA1 is rated at 3080 mAh.  \n  \n•• = Software = ••  \n  \nThe Mi A1 runs on Stock Android 7 Nougat, while  \nthe Honor 7X runs on EMUI 5. 1 based on Android 7 Nougat-a heavy skin with a\nLot of features.  \n  \n•• = Conclusion = ••  \n  \nIn my honest opinion, Mi A1 has better camera and software support on the\nother hand. Honor 7X has a great display and feature-rich software. The camera\non Honor 7X is good if you use manual mode else in auto mode Mi A1 is better.\n\n", "Honor 7x far better than mi a1\n\n", "I have used almost 1 week...Honor 7x..  \nHere are my observations..  \n1\\. Phone design is very premium trust me, it is great and you will feel you\nare holding high end phone.  \n2\\. Display is V. Good, color reproduction is also good, it gives natural\ncolor and repair when needed.  \n3\\. Screen to body ration 18:9 is v. good just like galaxy S8.  \n4\\. Processor Speed is good in this segment, do not compare with one plus 5.  \n5\\. Gpu handle games very effectively.  \n6\\. RAM management is improved in this device as compare to honor 6x and 5x.  \n7\\. Front Camera- This one is surprisingly working Awsome better than Mi A1\nbelive me, you will be amazed.  \n8\\. Rear Camera- 16+2 MP Not very Awsome but does decent work when you use\nPortrait mode, wide angle and normal. It does give depth effect in pictures.  \n9- Battery works almost 1 and half day which is good because of new processor\nkirin 659 and EMUI 5.1  \nCharging takes time but if you don't have electricity issue near then who\ncares..  \nOverall my rating would be 8.5/10 it is a good deal to Buy instead of Mi A1\n(becoz of selfie camera)\n\n", "pors;  \nExcellent Display and looks very awesome in hand.  \nAmazing performance with No hanging No Heating,  \nBattery is average but not a very bad.  \nSound is awesome in headphone and also loudspeaker.  \nPhone weight is good, It is very light.  \nFingerprint Sensor is very fast. you can slid notification bar and photos\nslide from fingerprint sensor.  \nRear camera Dual is awesome,color is sharp and feel like DSLR  \n  \nCons:  \nfront camera is Good in daylight But there is a lot of struggle in low light.\nI was using Vivo Y66. this camera is awesome in lowlight and daylight. For\ncamera I can say that Vivo Y66 better than Honor 7x. You Can not use clean\nvideo call in night or Lowlight from 7x. But If You are ignoring this Cons\nthen It is too good phone.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 January 2018", "on 22 December 2017", "on 29 December 2017", "on 14 January 2018", "on 15 December 2017", "on 12 January 2018", "on 16 December 2017", "on 4 January 2018", "on 16 December 2017", "on 10 January 2018"], "reviewer": ["V. Rathore", "naveen", "Vidya Prabu", "risov chakrabortty", "Shanmukha", "Abhay Rawat", "Kavya from IIT", "Amazon Customer", "Manish Dubey", "Piyush D."]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best phone for photography!!📸", "Bokeh effect", "Not beast but yes definitely the best in CLASS", "My Rating is 4(All are good bit sad in battery capacity)", ".", "\"Budget Flagship Killer !!\"", "Best smartphone within 17k price range, it kills all the competition", "Honor 7X Retail Unit Unboxing and Review video", "Value for money", "#honor 7x#flagship killer"], "review": ["Everything is perfect!! I receive my product on 26 December thanks to amazon\nfor fast delivery, Honor 7x is the best phone in 13k and 16k price ranges,Best\npart of honor 7x is The dual camera gives you a professional feels when you\ncapture a photo,there is only one breakdown this you can't unable to make a\ndirect video call in dialer but Honor 7x is perfect for photography,Watching\nfullhd Video's on Fullview display..Simply you go for it ...\n\n", "Trying to exemplify MY experience on this product.  \nI have received this phone on the 18 of December since then I have been using\nit extensively I had an one plus one before using this mobile as of which I\nwas hesitating to buy THIS phone but to my experience I am satisfied after\nbuying this phone I did a lot of research via YouTube wether to buy this\nproduct or not it was a 50/50 and I took a shot and bought IT.  \nFor first few days I was really not happy with ITS performance in all levels.\nslowly when I got adopted to the user interface of the module I started liking\nit.  \nFor those who have already used Honor you can buy without any thought.  \nIf you are new to this interface you should try out as it gives a new look and\nlittle better advancement in operating system terms.  \nLook and feel of the mobile is average the processor is not upto the mark (no\ncomplains) as I was addicted to faster processor apart from that it is\nnegligible for day to day use and if you have a knowledge on how it is\ndifferent from snapdragon processes only then you can figure out.  \nThe screen ratio which is 18:9 is absolutely fantastic.  \nThe camera is better than few duel camera phones.  \nOS is very light and good  \nFull metal body, comes with a cover which is good.  \nDo not compare this phone with other phones as the price range of other phones\nare different.  \nThe only thing which is not good is that this phone IS MADE IN CHINA.\n\n", "Hi all,  \n  \nIf your moderate user and someone who is looking good phone within price range\nof 15-16k. Take my word blindly go with this one, u will not gonna regret at\nany point.  \n  \nI am using 7x from more than last 10 days found only surprisingly good abt\nthis phone.  \n  \nThey already their best to make this much big display handy.  \n  \nCamera of front n rear is all good u can check camera comparison made by geeky\nranjit on you well not phone reviewer.  \n  \nBattery and phone task performance in thid price range is more than u can get\nin other.  \n  \nUI is also good and smooth... I was worried for this also i was stock android\nuser before to this.. Moto G3  \n  \nLooks and design of the phone is something that will make u happy when other\npeople notice ur phone even if u don't tell them abt it.  \n  \nOk being honest the 2 things might have been good to this phone beast rather\nthan best.  \n  \n1)Audio output via headphone jack is not simply that great - headphones is not\nthat good  \n2) Alots if Pre installed apps and games  \n  \nThanks,  \nSurya saravagi\n\n", "Having no issue's till there..  \n  \n__Positive vibes___  \n*Camara both front and back giving good results  \n*Ram management also good  \n*Gaming  \n*Display Quality is ozm..  \n*Viewing angels is fine,in sunlight also  \n*Slim design gives a standard look  \n__Neg__  \n*Battery is not much best like redme note4,its avareg only, gives 6 hours fully screen on life,  \n*Screen curves-its hard to find a screen guard\n\n", "Hello friends, today I will compare Mi A1 and Honor 7X. Do read my review.  \n  \n•• = Display = ••  \n  \nThe Honor 7X sports a 5.93\" 18:9 LCD display with a  \nresolution of 1080×2160 while the Mi A1 has a 5. 5\"  \n16:9 LCD display with a resolution of 1080×1920.  \n  \n•• = Camera = ••  \n  \nBoth the Honor 7X and the Mi A1 sport dual cameras  \neach-while the Honor 7X makes use of one 16  \nMegapixel camera and a 2 Megapixel depth sensor,  \nthe Mi A1 has two 12 Megapixel cameras-One with a  \nwide angle lens, and another with a telephoto lens.  \n  \n•• = Performance = ••  \n  \nThe Honor 7X is powered by the Kirin 659 Soc while the Mi A1 sports the ever\npopular Snapdragon 625 chip.  \nThe battery capacity of the Honor 7X stands at 3340 mAh, while that on the Mi\nA1 is rated at 3080 mAh.  \n  \n•• = Software = ••  \n  \nThe Mi A1 runs on Stock Android 7 Nougat, while  \nthe Honor 7X runs on EMUI 5. 1 based on Android 7 Nougat-a heavy skin with a\nLot of features.  \n  \n•• = Conclusion = ••  \n  \nIn my honest opinion, Mi A1 has better camera and software support on the\nother hand. Honor 7X has a great display and feature-rich software. The camera\non Honor 7X is good if you use manual mode else in auto mode Mi A1 is better.\n\n", "Hey guys !!.This is Vishaal.I have been using this phone has my daily driver\nfor last 2 days.I would love to thank Amazon for One day delivery.  \nOkay for easy understanding let me divide this review into pros and cons.  \n  \nNote:This is an intial review and i will update this after few days for my\ncomplete review  \n  \nPros:  \n1.Full HD Display looks stunning .One of the best available display at this\nprice tag.  \n2.5.93 inch display with 18:9 aspect ratio is sufficient enough to blow your\nmind while watching movies and playing games.  \n3.Build quality looks great and stunning. Hats off to honor for choosing metal\nover plastic body  \n4.Dual rear facing cameras for Bokeh effect works perfectly fine  \n5.Phone handles multi tasking with eaze with its kirin 659 processor.  \n6.Once again hats off to honor for not skipping on sensors .  \n7\\. 3340mah Battey doesn't dsappoint you.It can easily last for an day with\nnormal usage.  \n8.Presence of headphone jack in 2017.(thumbs up for that ).  \n9.Presence of MicroSd Slot (Its worth mentioning.Spending extra 3k for 32gb\nnot a great choice).  \n10.Thanks to honor for providing free transparent silicon cover with\npackaging(though not of great quality anyway it is so kind of you )  \n  \nCons:  \n1.Speaker is not too loud and even sometimes sounds bit low.  \n2.Its December 2017,But still honor decided to go for Micro USB port thats\nreally disappointing.  \n3.Auto brightness sensor doesn't perform upto its limit.Display is almost\ninvisible under sunlight.  \n4.This phone takes too long to charge.Even with the specified 5V 2A charger.  \n5.Under low light both the camera doesnt perform upto our expectation.  \n6.Phone heats up a bit while charging(Anyway considering its metal built this\ncan be ignored).  \n7.Memory management is poor with EMUI 5.1.Out of 4gb of ram you can expect\naround 2.15gb of usable ram.  \n8.Offcourse you can expect lots of bloatwares with this device(Anyway most of\nthem can be uninstalled)  \n8.Front facing camera is not good for selfies.(Becomes almost dark even under\nhomelighting).  \n9.Though phone as 18:9 Aspect ratio .Their are not many contents available on\ninternet which supports this aspect ratio(Especially i hate those black bars\non sides while watching most of the youtube videos.)  \n  \nVerdict:  \nThis is one of the best choice for people who loves using full hd\ndisplay.,loves watching movies and playing mid level games etc.But,if you are\npersonal who loves photography(professional) and playing high end games sorry\nthen this one is not for you\n\n", "Undoubtedly, honor brand is known for  \n\\- Thin metal body, slim yet solid.  \n\\- Customized U.I. which provides great ease to use, completely user friendly.  \n\\- Last but not the least, every new device brings the best camera for the\nprice range.  \n  \nHave used the device for quite a while, here are my reviews:  \n  \nPROs:  \n\\- Metal body shroud along with slim dimensions, gives an absolute premium\nfeel on holding it.  \n\\- Blue color variant is the best colorin the market, design of the device\nalong with this color gives a great premium feel which is completely unique,\ncan be compared with iPhone here.  \n\\- As always a customized U.I. makes things easy and fluid to navigate and do\nthe tasks on it.  \n\\- Combination of Kirin processor and 4gb ram only asks the user to challenge\nit with more tasks, yet still never it lags. Gaming and multitasking is\nsmooth.  \n  \nAlso you get 4-5 games in the device with the trial version.  \n  \n\\- You get a CASE COVER out of the box for free, yes you have read it right,\nit provides a case cover which is completely transparent and decent enough to\nprotect the device.  \n  \n\\- Bigger display just indulges you into it with 18:9 ration and bezel-less\ndisplay is a great experience.  \n  \n\\- Honor devices are icons for smartphone photography, yet again it proves the\nsame here, with an updated feature for moving objects and improved camera, it\nbeats its predecessor.  \n  \nAll in all a great smartphone with the best camera within the range and a\nunique premium feel not to miss at all.  \n  \nCONs:  \n\\- Being an updated model to honor 6x, its camera gets 16+2MP from 12+2MP,\nincrease in size and 18:9 view, no other changes to it.  \n\\- Having released Honor 9i previously, one could only enter a dilemma, which\none to go for, also 7x and 9i are almost same, except for 7x with only a\nsingle lens on the front instead of a dual, but increase in size. If you are\nselfie addict, plz go for 9i and not 7x, bcoz 9i comes with dual selfie camers\nbut 7x does not.  \n\\- Price for 64gb variant is comparatively too high, compared to 32gb one\nwhich costs 3k less, difference of 3k for 32gb is too much...  \n  \nLet me know if the review was helpful..\n\n", "\n\n Honor 7X is the latest entrant in dual camera phones and it has come with a\nbang. 18:9 ratio full screen Full HD+ display makes it stand apart in the\ncompetition. The dual rear camera is the best in class as per the price\nsegment. The Kirin 659 CPU is pretty fast and has no lag whatsoever. 4 GB RAM\nalso keeps things running smooth. Exceptional feautures like support for\nfinegerprint gestures and native screen recording is welcome. Battery life is\ndecent for a day with moderate use. Front 8MP camera also supports bokeh and\nbeauty mode. SAR value is 1.23. Screen size is 5.93 inch. Value for money at\n₹12999 or the 4GB/32GB model. It comes in 3 colours - blue, black and gold.\nThis is a must buy if you are in the market for a new dual camera budget\nsmartphone.\n\n", "Awesome phone with number of features really if u r interested in buying Mid\nRange phone with Gud features then I recommend u this phone it has Gud camera\nQuality , USB charging cable, No earphones,Finger print is very fast If u want\nphone with fast Fingerprint Sensor then it for u\n\n", "Honor is back here at the end of 2017 with another budget phone that, for all\nintents and purposes, is a better bang for your buck.The specs have seen a\nheavy boost, and the biggest change is the addition of Huawei's FullView\ndisplay. A budget phone with an 18:9 screen, this is the tribute to honor.  \nThe 7X outright bests its predecessor and goes right up against the Moto G5S\nPlus, all while sitting at an extremely attractive Rs 12999 asking price. It\ncomes with a nicer display than its competitors and a design that keeps in\nstep with 2017's trends.  \n  \nPros:-  \nHuawei is pushing the boundaries here. Rs 12999 is extremely aggressive price\nwith phones, especially for what you get with the 7X.  \nBattery life  \nThough it's 3340 mah but trust me guys it lasts 1 day easily.  \nFingerprint sensor  \nSuper fast, very accurate, and on the back where it belongs the perfect\nposition.  \n  \nCons:- No Cons in my case & also it seems like no cons in other users case.  \n  \nThe last & final word honor 7x is legend make honor no.1 brand in India & in\nthe world as well.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 December 2017", "on 10 January 2018", "on 25 December 2017", "on 2 January 2018", "on 16 December 2017", "on 10 December 2017", "on 26 December 2017", "on 11 December 2017", "on 29 December 2017", "on 13 December 2017"], "reviewer": ["Chocolaty_Armaan", "RAMBO", "Surya S", "Amazon Customer", "Kavya from IIT", "Vishaal S", "Amazon Customer", "Navneet Kaur", "Sirjanpreet Singh", "Iquyan Sabigh"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["🔴#1 HONEST(Unbiased) REVIEW of Honor 7X  [Full Review]", "Honor 7x review - is it worth buying?", "Worst phone", "🏆A TRUE BUDGET BEAST🏆🏅Narrow Bezels🏅Kirin 659 Processor with 4GB RAM🏅 Premium Design🏅Full View Display🏅", "MAXIMISED My View... now it's your turn.", "Nice", "Brand, Phone and Screen Issue", "Totally waste of money amazon india tactfully looted me.", "Change of experience after update... :)", "All Queries Answered."], "review": ["🔴Kindly read the full Review if you are planning to buy Honor 7X  \n●● If you want to get quick overview of the device, then read below else\nscroll down for Detailed Review ●●  \n👉PROS  \n፨Extra-wide 18:9 display  \n፨Minimal bezels  \n፨Solid performance  \n፨Headphone jack  \n፨Very low price  \n👉CONS  \n፨No Android 8.0 at launch  \n፨Outdated UI  \n፨MicroUSB port  \n፨No NFC or water resistance  \n፨Subpar battery life  \n  \n🔴B.O.T'S OVERALL SCORE - 8/10  \n●Performance 9  \n●Camera 8  \n●Design 10  \n●Battery Life 7  \n●Value 9  \n●Software 8  \n●Calls & Sound 8  \n●Screen Quality 9  \n  \n👉KEY FEATURES  \n፨Price - ₹12,999.00  \n፨Bezel simply melts away  \n፨A 5.93-inch FHD+ Full View display  \n፨Headphone Jack!!  \n፨Powered by a Kirin 659 SoC and has 4GB of RAM  \n፨A 3340mAh battery but it won't always last a full day  \n  \n👉QUICK TAKE  \n፨Get this phone if you're on a budget. While the Honor 7X doesn't offer the\ngreatest battery or cameras among budget smartphones, its 18:9 display, all-\nmetal design and solid performance make it an excellent alternative to the\nMoto G5 Plus, and it sells for ₹2000 less.  \n●●FULL DETAILED REVIEW●●  \n👉DESIGN  \n፨Stealthy matte aluminum body  \n፨Curved edges and sloping 2.5D glass  \n፨Premium-feeling for the price  \n፨Very easy to hold and use in one hand  \n  \n👉SCREEN  \n፨5.9-inch, 2160 x 1080, LCD screen  \n፨18:9 Aspect ratio  \n፨Solid contrast and good visibility from multiple angles  \n  \n👉CAMERA  \n፨Dual-camera setup here consists of a 16-megapixel main sensor with an f/2.2\nlens, and a secondary 2-megapixel sensor.  \n፨The extra sensor is simply there for gathering data for the wide-aperture\nmode.  \n፨Front 8-MP camera, featuring gesture control so you can trigger the shutter\nsimply by turning your hand  \n፨Pictures in good light are fine, but things feel very artificial at night.  \n፨Honor's Portrait Mode appears to be tied to basic object recognition  \n፨7X features a more aggressive depth-of-field effect that blends the\nbackground evenly  \n  \n👉BATTERY LIFE  \n፨9 hours and 21 minutes (which consists of endlessly streaming webpages)  \n፨There’s a 3340mAh battery that keep the Honor 7X running all day  \n፨Lack of fast-charging is a sore point.  \n፨31 percent in 30 minutes connected to the packaged adapter.  \n፨7X is still using Micro USB  \n፨No NFC on this phone, so no chance of using it for mobile payments.  \n  \n👉PERFORMNCE  \n፨Kirin 659 CPU  \n፨4GB of RAM  \n፨64GB of internal storage.  \n፨Honor 7X is tuned for efficiency rather than all-out power  \n፨I’ve only been using the phone a few days, but it feels fast.  \n፨You’re not going to mistake this for a flagship experience, but it’s\nperfectly adequate  \n  \n🔴B.O.T'S VERDICT  \n፨No ₹12,999 smartphone is perfect, but the Honor 7X is a jack of all trades\nnot a perfectionist.  \n፨Get this phone if you're on a budget. While the Honor 7X doesn't offer the\ngreatest battery or cameras among budget smartphones, its 18:9 display, all-\nmetal design and solid performance make it an excellent alternative to the\nMoto G5 Plus, and it sells for ₹2000 less.  \n፨The Honor 7x is one of the best big screen smartphones in the segment. It\nimpresses most with its premium looks, ergonomic design, dual camera, stutter-\nfree performance. But you cannot ignore the Mi Max 2 with its 6.4-inch screen\nand 5,300mAh battery is a better bet. However, it is bigger in size and can be\na bit unmanageable with one hand  \n🔴Thanks for reading Guys!. If you have any question or if you think I am\nwrong. Just ask me by commenting below.Write reviews, help others, happy\nshopping  \nThank You for reading this review.  \n-●➽ Bhavesh B.O.T●-\n\n", "Writing this review after using Honor 7x for ~ 1 week. Below, I have captured\nsome basic observations about Honor 7x (+ positive, - negative, ~general)\nbased on my usage experience:  \n\\+ performance is excellent, didn't noticed any lags so far while using\nregular apps (news, trading apps, surfing, and basic games). It has octa-core\nHiSilicon Kirin 659 processor (4 x 2.36GHz Cortex-A53 cores + 4 x 1.7GHz\nCortex-A53 cores) + 4 GB RAM which makes it fly!  \n\\+ display is crisp and clear, color looks good. The 5.93 inch screen with a\nresolution of 1080x2160 pixels is excellent. It sports the new 18:9 aspect\nratio which is super cool!  \n\\+ touch is smooth, performance and multitasking is impressive.  \n\\+ looks are premium and build quality is excellent, it is sleek, light weight\nand good to hold.  \n\\+ camera is just above average. It has a 16MP + 2MP dual back camera and 8MP\nfront facing camera (no front flash, so average selfies), though you it has\nthe blur functionality. I have posted a large number of photos with default\ncamera settings. You can judge yourself how they are.  \n\\+ call quality is good, and the signal reception is decent.  \n\\+ a back cover is provided, which is good. It will provide you sufficient\nsupport till a decent cover is available in retail.  \n\\+ fingerprint scanner is quick, responsive and precise, and the placement is\nsuperb.  \n\\+ wi-fi and blue-tooth connectivity are at par.  \n\\+ no heating issues noticed while charging or regular usage, with extended\nusage you can slightly feel the bare back gets little warm, but can't feel\nanything with the cover on.  \n\\+ this 32 GB variant has a usable free space of ~ 20 GB.  \n\\- on the flip side, only single speaker and it sounds very average.  \n\\- the charging time is relatively slower.  \n\\- the OS, that is android v7.0 Nougat with EMUI 5.1 skin looks outdated\ncompared against others.  \n\\- no earphones provided! Nobody uses the out-of-the-box earphones, still it\nis expected to be provided in the package.  \n\\- no native video calling option available in the device which can leverage\nVoLTE. Though third party apps can be used for making video calls over\ninternet.  \n~ after initial boot, got a patch update of size 448 MB, which I believe are\nstability bug fixes.  \n~ I haven't faced the screen flicker issue yet while playing YouTube, but as\nmany are complaining about it, this definitely must be there and should be\naddressed. One thing I can tell, it must be a software issue which can be\nfixed with a patch release, so nothing to worry much hopefully.  \n  \nIMHO, considering things holistically, H7X is not far behind than its\ncompetitions. With its cool aspect ratio, sturdy build, and most importantly\nthe price of H7X 32GB variant perfectly fits for those who are on tight budget\nor want it as a secondary phone. Overall, a worthy buy, value for money phone\n- one of the better options in under 15K segment. Go for it without second\nthought keeping in mind the limitations highlighted above, definitely an\nexcellent product in its segment.  \n  \nPictures are posted for reference, I hope this helps.\n\n", "\n\n Hello my phone is just 3 days old I am Watching youtube since 1 hour my honor\n7x phone display starts flicking.iam are unable to do anything simply you have\nto restart your phone.so don't buy this phone,I have posted a video below you\ncan see it ,I am facing this issue for third time in three days\n\n", "Note:- Always read reviews before buying anything online. I have listed major\nPros and Cons of Honor 7X in this review. Though it is not going to be a\ncomplete review , my list will certainly help you take a decision , because it\ncovers all the important aspects of the Honor 7X smartphone. Personally , i\nhave used and reviewed many midrange smartphones in amazon , So you can\ntotally rely on my review. I hope my review will be helpful.  \n  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \n  \n📦📦📦📦📦📦📦📦📦📦  \nLet's start with box contents  \n📦📦📦📦📦📦📦📦📦📦  \n  \n➽Honor 7X.  \n  \n➽Documentation.  \n  \n➽Sim ejector tool.  \n  \n➽Wall charger.  \n  \n➽Micro USB cable.  \n  \n⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿  \nHuawei Honor 7X Key Specifications  \n⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿  \n  \n➡️5.9-inch Full HD+ 2.5D Curved Glass Display.  \n  \n➡️HiSilicon Kirin 659 Octa-Core Processor.  \n  \n➡️4GB RAM, 32GB/64GB/128GB Storage Variants  \n  \n➡️Android 7.1.1 (Nougat) operating system.  \n  \n➡️16MP + 2MP Dual Rear Cameras.  \n  \n➡️8MP Front Facing Selfie Camera.  \n  \n➡️Fingerprint Scanner  \nMicro USB Port / 3.5mm Headphone Jack.  \n  \n➡️3340 mAh Non-Removable Battery.  \n  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \nBelow are the Pros and Cons of honor 7x  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \n  \n✅✔️✔️✔️✔️✔️✔️✔️✅  \nPros/Likable/Advantages  \n✅✔️✔️✔️✔️✔️✔️✔️✅  \n  \n🎖️Narrow Bezels.  \n  \n🎖️Metallic Body and Premium Design.  \n  \n🎖️18:9 Ratio Screen / 5.9” FHD+ IPS LCD Display with Corning Gorilla Glass.  \n  \n🎖️The dual camera setup (16MP + 2MP) on the back can take some nice portrait\nshots.  \n  \n🎖️The build is premium and the blue color device looks stunning.  \n  \n🎖️On Front, 2.5D glass is present which gives good grip and look to the\nsmartphone.  \n  \n🎖️The full view display on the front looks beautiful.  \n  \n🎖️Honor 7x gives battery back up to 1 days with the normal usage.  \n  \n🎖️HiSilicon Kirin 659 Processor with 4GB RAM can handle multitasking and games\nwith ease.  \n  \n🎖️The fingerprint sensor is present on the back of the smartphone and it is\neasy to reach. It was quick and accurate.  \n  \n🎖️Features like WiFi bridge, Split screen and ultra power saving mode is\nuseful in day to day life.  \n  \n✖️❌❌❌❌❌❌❌❌❌✖️  \nCons/Unlikable/Disadvantages  \n✖️❌❌❌❌❌❌❌❌❌✖️  \n  \n👎The phones lag while playing heavy games so if you wish to play heavy games\nthen set the resolution to low or mid. Also Battery drains at very fast phase\nwhile playing heaving games.  \n  \n👎Hybrid sim slot is there which is something we do not like because you cannot\nuse 2 sim cards with a MicroSD.  \n  \n👎Slightly Bigger for Single Hand Usage.  \n  \n👎This phone only supports single band WiFi that is 2.4 GHz and not to 5 GHz.  \n  \n👎4K Video Recording Not Supported.  \n  \n🔷🔷🔷🔷🔷  \nFinal words :-  \n🔶🔶🔶🔶🔶  \n  \nHonor 7X is classic and splendid phone in its price category. Isn’t? The glass\nbody and its superb display will mesmerise you if you are looking for an\naffordable phone. It is a phone for a person who loves entertainment and does\nmid usage instead of heavy tasking. Also, when it comes to camera and heavy\nperformance, Honor 7x perform decently.  \n  \nYou can go for it , if your budget is under 16k. You will not regret buying\nit.  \n  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \n  \nIf you have any Doubt regarding this Review or this Product, then Feel Free to\nContact me or Comment Below. Thank You for Reading this Review. I Hope this\nReview was Helpful.  \n  \n➽Regards,  \n➽Keerthi Kanth.\n\n", "Received my mobile on 11.12.17  \nGot 64gb variant at Rs14600 (used card at the time of delivery)  \nI ordered blue colour(but please don't buy blue colour...it will loose its\nuniqueness).Its an head turner device...amazing...wonderful.It looks so\npremium in hand with super build quality at this price.  \n  \n1\\. 18:9 FullView: Very beautiful display with high resolution. As being a\narchitecture student it is very good for me to have such a big screen. Again\nthe placement of headset,front camera and proximity sensor is very good. Touch\nis so nice that it feels like there is no screen between the content and\nfingers  \nDisplay 10/10  \n2\\. Speakers: As I have upgraded from Oneplus One to Honor 7x I feel that\nspeaker quality is not that good but at this price point it is negligible.  \nSpeakers: 8/10  \n3\\. Rear camera: Front camera is really best in comparison with the mobiles\nunder 20k. Bokeh effect would have been better  \nRear camera: 9/10  \n4\\. Front Camera: It is good but not the best. Front camera in this price\nrange is best in Oppo F5 (obviously it's selfie expert)  \nFront camera:7/10  \n5\\. Battery: Battery backup is really very good...after all its Huawei...best\nknown for its battery. Battery easily lasts for a day with\nvideos,surfing,chatting and calls  \nBattery:10/10  \n6\\. Battery charging time: Only this is Con of this mobile. It takes around\n3hr to charge. But once it gets charged...no worries  \nBattery charging time: 2/10  \n7.Performance: Performance is really good. It doesn't lags between switching\napps. Haven't tried heavy games but they might work properly.  \nPerformance:9/10  \nFingerprint sensor: It is just very accurate. Doesn't miss even a single time.\nVery fast.  \nFingerprint sensor:10/10  \n  \nSome cool features:  \n1) Screen in screen: This feature allows us to watch video in other screen\nthat is while using other apps  \n2) Split screen: Though it is a feature of Android Noughat...it is plus point\nin this device because of its FullView display  \n3) Fingerprint sensor: It can be used to pull down navigation bar, browse\nphotos, receive calls, stop alarm and take photos.  \n4) Ultra battery mode: One of the awesome feature. Just start this mode when\nmobile is not in use. It will drastically increase the battery life.  \n5)Scroll Screenshot: One of the cool feature. Reduces task of taking repeated\nscreenshots  \n6) Screen Video: Good to see this. Other Android devices need to be rooted for\nthis but it is inbuilt here.  \n7) EMUI: Very good. Interesting and easy to use.  \n8)Themes: Lots of themes available in the store.  \n  \nAnd also there is a silicon cover inside the box  \nThat's all.  \nThe smartphone is really very good. Just go for it.\n\n", "\n\n Overall mobile is good but i have a problem with YouTube\n\n", "What I observed about us Indians that we only believe what we heard most of\nthe time. Likewise, how we Indians were reluctant on buying Mi phones and\nOneplus when it was launched people used to laugh at me when I bought phones\nfrom that companies.  \nNow people are doing the same when I bought my first honor device past week.  \nAbout Huawei company  \n1\\. It spent a whopping $11.7 Billion on R&D in 2016 alone.  \n2\\. It was one of the first company to pioneer dual camera technology (of\ncourse after HTC and LG) but at least before So-called Apple.  \n3\\. It is the first company to launch AI enabled processor.  \n4\\. It became the biggest telecom equipment manufacturer on the planet.  \n  \nI think that speaks a lot about the company now coming to the phone itself.  \n  \n1\\. The screen on this phone is the charm, believe me, it's an IPS display not\nOLED or AMOLED but colour saturation and sharpness are good enough or better\nthan most of its competition.  \n2\\. The phone handles day to day task pretty well and I don't see any lags\nwhatsoever.  \n3\\. UI is a bit dated but smooth and working as expected, as I am the fan of\nstock android tough.  \n4\\. No heating issue at all.  \n5\\. The camera is pretty decent in this price range and comes with loads of\nfeatures. and believe me this phone is insanely a looker.  \n  \nComing to the screen flickering issue and Company is acknowledging the issue\nand working on fixing it and on Andriod Oreo update. I will post the mail\nscreenshot. It's overall 4.5 ⭐ from my side.\n\n", "\n\n After i received the product from day one onwards i am facing serious display\nflickering issues mainly while watching YouTube and then it restarts and hangs\nfrequently. Also this product is having serious battery draining issues. I\nwould recommend don't purchase this product also please don't trust the\ncustomer care executive they are just trying to fool us. They won't solve the\nproblem rather they will make illogical excuses.\n\n", "Changed my review after update. Guys, trust me, this is one of best mobile\ntill now under 16k. Most liked after update.  \nNice display amd camera is upto the mark. No issues with youtube or volte.\nPlaying games online and battery backup is improved.  \nSound is far much batter now. I was about to sell this mobile but now i wont.\nI got everything i needed. Its an awesome experience.  \nHope you guys have enjoyed this beast too.\n\n", "Disclaimer-Be patient as this is a long,detailed,precise and honest review.  \n  \nI would first tell you one very important thing and that is the 'EMUI' thing\nin this phone. This has EMUI5.1 on top of the Android 7 and so those of you\ndrooling over stock Android stuff, EMUI is far better cauz it is way too fluid\nand gives you very much versatility.And if you think stock Android is faster,\nthen you wouldn't even feel a difference in the performance and you can even\ncheck that out using Benchmark scores and also some YouTube comparison videos.  \nAnd regarding the bloatware, it all is uninstallable as I myself have done\nthat and removed all the pre-installed apps except CHROME and a few other\nimportant apps.  \n  \nI am definitely loving this phone and gave it a five star as it was no tough\ndecision for me given the following points:-  \n  \n1) The processor,a Snapdragon equivalent of RedMI A1, is really damn fast as I\nran Asphalt8 and Modern Combat 5 at the same time and did not find any lag ,\nso it is pretty much craved for from a gamer's perspective.  \n2) The design of this phone, I'd say awesome cauz those curves got me drooling\nover it and that edge-to-edge display looked really very great.I never missed\nout on a chance to show it off in front of my friends.  \n3)RAM is 4gb which is pretty good and u will get blistering fast performance  \n4)EMUI 5.1 is way better than stock android and that you would get a lot many\nupdates from Honor thus keeping your phone up to date  \n5)Though battery is not very great but for carrying out moderate tasks, you\nwill easily get 12-5 hrs. For gaming intensive routine, a 6hr life is there\nwhich is not really bad but not really good either.  \n6) MISCELLANEOUS -Fingerprint sensor is lightning fast and the front camera\nhas some kind of flash (found that while clicking a selfie in the dark) thing\nfor low-light.  \n  \nNOW comes the Camera.  \nThe dual camera setup is really great.Many reviews pointed out that the camera\nperformance in low light conditions is very bad. Well I used it in low-light\nand I found it very good. Why?? Cauz I know how to use PRO PHOTO mode. Dude\nthis phone has got really good pro photo and a PRO VIDEO mode too. I have\nuploaded only low-light pics but you can see that they're good.  \n  \nYou can post your queries in the comment section.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 December 2017", "on 28 January 2018", "on 26 December 2017", "on 26 January 2018", "on 13 December 2017", "on 23 December 2017", "on 6 January 2018", "on 27 December 2017", "on 29 December 2017", "on 2 January 2018"], "reviewer": ["🔴ʙʜᴀᴠᴇsʜ ʙ.ᴏ.ᴛ™👽", "alter-ego", "Pranay", "Keerthi Kanth", "Amazon Customer", "Amazon Customer", "Jabir Ansari", "supratim choudhury", "MUZIK D", "Shubh"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Unfair with Buyers", "15K very good mobile", "A very true review after using it for a week", "Camera doesn't take great snaps.", "Genuine Review after one week", "Doesn't let you down...", "Everything is nice in phone", "Disappointed and returning.", "Mind blowing phone you can buy it simply and blindly", "Detailed review!"], "review": [" I did not got A headset which makes me dissapointed for buying a brand new\nmobile of huwai , i m spending ₹12999/- for a new mobile and i didnot gets a\nheadset with it then wat is use of new mobile ?  \nI expected for a fast charging mobile but it is same slow charging one again a\ndissapointment.  \nVery unfair i am going to return back this mobile .  \n  \nTo the buyers if you don't care for headset i must say you this is the best\nmobile any one should have , and the camera lover must must be having this\ngreat budgeted smartphone mobile in today's world .\n\n", "I am happy with the performance, display, touch screen, design, dual camera &\nbattery good and camera at night is average, other than that everything is\nfine.\n\n", "Bought the phone 3 days ago and wanted to share the review with you guys. I'll\nbe giving you very genuine and correct review  \nStarting with its pros:  \n1)Build quality is too good feels right in your hand and I would prefer blue\ncolour  \n2)fingerprint sensor is insanely fast  \n3)very good front and back camera with decent portrait shots when it comes to\nportrait shots at the back camera mi a1 does a really good job in comparison  \n4)DISPLAY, actually this should be first point though it's an IPS LCD screen\ndue to its pixel density it's too close to AMOLED display  \n5)kirin 659 processor and memory management is good with 4GB ram  \nComing to its cons:  \n1)those who are expecting this to have a good battery sorry guys. Though it\nhas 3340 mah battery due to its display quality it drains quickly it can last\nfor a day long with calls, WiFi, data and GPS on, and if you are playing games\nor watching video it lasts nearly 4 to 5 hours with full brightness  \n2)back camera portrait shots.  \n3)GPU is Mali T830 which is OK not for true gamers  \nAnd that's all guys and my final conclusion is go for it this is best phone\nyou can get it in this price range  \nHope you find this review helpful\n\n", "I own honor 6x and now 7x I don't see anything special in 7x xcept screen\nsize.. Camera doesn't take great snaps.. I think 6x camera takes better\nsnaps... Battery also isn't great...\n\n", "Performance-:  \n✓ It's really awesome Performance with 4GB RAM.  \n✓For gaming also it's fantastic Mobile like COC,8Ball Pool etc.  \n✓Using from one week there is no Hanging and bugs I noticed.  \n  \nBattery-;  \n✓I mostly like this battery performance compare to my another mobile OnePlus5T\nHonor 7X is better in battery performance.  \n✓ It's take some more time to charge but ok.  \n✓I expected they give type-c charger ok no problem.  \n  \nCAMERA-;  \n✓Come to camera performance it's really good to compare with any other\nmobile's in 13k.  \n✓The Blur is sometimes not taken the position but no problem it's good.  \n✓The Double camera is good.  \n  \nNetwork-;  \n  \n✓I'm using Jio Network it's working very cool.  \n✓The WiFi connection is very faster very quickly connects.  \n  \nFinally the Phone is awesome Compare to my OnePlus5T I choose Honor 7X.  \n  \nThank you Huawei Technologies..\n\n", "Phone's great. I mean 18:9 display, dual camera, 3300 battery, built quality\nfeels premium and so lightweight, I was amused how fingerprint sensor was so\nfast. I think it's worth the money.  \nAlso beats all the competitors by far away. Beats mi a1, g5s plus, Redmi note\n4. I also think I will be a tough for Redmi 5 plus to compete against this\nbeast.  \nPros:-  \n18:9 full FHD+ display  \nPremium Build quality(slim and light weight)  \nWiFi bridge(I think it's useful because earlier I had to use Bluetooth\ntethering)  \nCamera quality(well, honor always beats in that)  \nWeight(16th)  \nBattery life(around of 1.5 day)  \nProcessor(has antutu score nearly same as of mi a1, g5s plus with sd625)  \n0.25 fingerprint unlock  \nSound quality was far better than expected  \nCons:-  \nIR would be good but can't expect all..  \nMicro USB, I mean type cwould have been nice  \nNo fast charging, duh  \nFlashlight's little too dim  \nGaming performance was average(not for gamers)  \nStill testing will let you know guys....\n\n", "Everything is nice in phone, but there is line in the selfie.......please tell\nus there any setting problem or anyone face the same issue...\n\n", "\n\n The mobile started flickering after 1 day. Not something I expected.  \nI really had huge expectations especially after the on-paper specs.  \nAttaching the video for reference for other buyers.\n\n", "This phone is very good and it's very perfect bill quality in the first ship\nphone looking and it is very lightweight the speaker is loud and clear and\nit's runs with Android nougat 7.1 and emui 5.1 finally I want to talk about\nthe camera back camera is simply superb Santhi is average performance and the\nsecondary camera 2 megapixel is good for portrait shots and it is simply mind\nblowing phone you can use it and in the box Honor providing the tpu case and\nit comes with normal adaptor and it is very lightweight to carry easier to\nanywhere the display is the highest and biggest benefit to the phone this is\nmy small review about the phone but if you buy it you can absorb more on it\nlet's look at about my pictures thank you guys.....\n\n", "Huawei Honor 7X smartphone was launched in October 2017. The phone comes with\na 5.93-inch touchscreen display with a resolution of 1080 pixels by 2160\npixels.  \n\\-------------------------------------------------  \nInitial impressions:  \n  \nThe trend for 2017 in smartphones has to be bezel-less phones. Bigwigs like\nApple and Samsung have made their presence felt and brands like OnePlus,\nXiaomi and Honor aren't holding it back either. Bezel-less is the buzzword and\nthe challenge now is to make it available at an affordable price. Honor with\nits 7X smartphone.  \n\\-------------------------------------------------  \nWhats in the box:  \n1x handset.  \n1x manual  \n1x charger  \n1x Phone  \n\\-------------------------------------------------  \nPros  \n\\- Front glass, aluminum body.  \n\\- 1080 x 2160 pixels, 18:9 ratio (~407 ppi density).  \n\\- Hi-Silicon Kirin 659.  \n\\- Android 7.0 (Nougat).  \n\\- Dual: 16 MP (1/2.9\", 1.25 µm) + 2 MP, phase detection auto-focus, LED\nflash.  \n  \n\\-------------------------------------------------  \nCons  \n\\- Delivery.  \n\\-------------------------------------------------  \nVerdict  \n  \nThe Honor 7X features an 18:9 ratio full HD (2160x1080) display and looks\nimpressive. Following in the footsteps of the Honor 8 Pro Xiaomi The power\nbutton and the volume button are both located on the right side while the SIM\ncard slot is on the left.  \n\\-------------------------------------------------  \n  \nDelivery time: Mumbai-Next day delivery  \nPrime: Yes  \nReturn Policy: Yes (Only defective)  \nFulfillment: Amazon FBA  \n  \n\\-------------------------------------------------  \nI hope my review was helpful!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 December 2017", "on 6 January 2018", "on 28 December 2017", "on 10 December 2017", "on 12 February 2018", "on 16 December 2017", "on 31 December 2017", "on 25 December 2017", "on 11 February 2018", "on 10 December 2017"], "reviewer": ["Vijay ojha", "Amazon Customer", "Amazon Customer", "Baiju", "Surya Chowdary", "Amazon Customer", "Anil Mehta", "Imran", "sampath", "Techking"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best in class,value for money", "Why buy it?", "Awesome phone", "Height of awesomeness", "No phone on the market can beat this phone in this price range.", "Beautiful full HD display", "honor 7x first hand review", "Honor 7X impresses with its great display and generous battery", "Bad Performance Quality low", "Break the Limits, Max your world"], "review": ["❣️ Honor 7X Review ❣️  \n➖➖➖➖➖➖➖➖  \n▶️IN THE BOX➡️Phone,Charger,Usb cable,Sim ejecter pin,a case cover, user\nmanual  \n✴️Display🔸What A display.. Its 5.93 Inch 18:9 full screen display,small\nbazel,2160×1080 Resolution,colour is awesone,, display see in sunlight full Hd\ndisplay 2.5D glass helps the phone beauty  \n✔️((GREAT LOOK, FEEL PREMIUM, EASY TO HOLD,FULL METAL BODY))  \n✴️Sim & Memory 🔸32 GB rom(19 GB usable) *Hybrid Dual Sim. One sim/One microSD\ncardand Dual sim(No extra SD card slot)  \n✴️CPU & GPU & ANDROIED & CUSTOM UI🔸HiSilicon kirin 659 is fast processor.\nMali-T830 MP2 Gpu helps the game., android 7.0 out of the Box, Emotion Emui\n5.1,  \n✔️((SMOOTH TOUCH, NO HEATING ISSU, PERFORMANCE IS BETTER THAN SD625, BUT IN\nHIGH GAMING ITS SOME LAG,BUT NO PROBLEM IN MULTITASKING, YOU CAN USE IT LONG\nDAY ROUGH USE))  \n✴️CAMERA 🔸, Its nice camera, not best in this price range, Daylight\nphotography is awesome, High resolution pictures, But selfie camera is best in\nthis price range.but portrait mode is not Good bcz its software basic  \n*Video recording 1080P but* no 4k recording option available*Low light photography is not Good(<MI A1)  \n✔️((Special Camera Features)) ➡️((Pro photo, pro video, HDR, night shot,\nPanorama, Light painting, Time lapse, slow motion, Filter, effects, Watermark,\nAudio note, Good Food, Document Scan))  \n✴️SENSORS 🔸Fingerprint, accelerometer, Proximity, compass, Notification lights\nindicator  \n✔️((0.25S UNLOCK, FINGERPRINT IS SOO SENSITIVE,😕NO GYROSCOPE SENSOR FOR 360\nVIDEO AND VR  \n✴️SOUND 🔸 DTS Studio sound,no much sound, sound is slightly low,*active noise\ncancellation with dedicated mic,  \n✴️BATTERY & CONNECTIVITY 🔸 3340 mah battery,,one day battery life,in heavy use\nhalf day and 4.30 screen on time,Batter is not Bad, No fast charging,, its\ntake to 2.30-2.45 full charge 1-100%,, 4G VOLTE,DIRECT VOICE CALL BY JIO,,\nCALL CLEARITY IS AWESOME,,  \n⚫SOME EXTRA FEATURES ➡️▪️WIFI BRIDGE,, ▪️APP DRAWER,, ▪️NAVIGATION KEY\nCHANGE,, ▪️APP LOCK,,▪️ DUAL APP,, ▪️SWIPE FINGERPRINT AND SEE STATUS BAR,,\n▪️MINI SCREEN,, ▪️SPILIT SCREEN,, ▪️MOTION CONTROL,, ▪️FLOATING DOCK,,▪️ VOICE\nCONTROL FOR CALLING,,▪️ ▪️WALLPAPER CRASUAL,, ▪️SMART HEADSET CONTROL,,\n▪️MIRROR SHARE DOUBLE TAP SCREEN ON OR OFF,, ▪️SIMPLE MODE,, ▪️EYE COMFORT,,\n▪️VIRUS SCANNER,, ▪️HUAWEI SOUND EFFECTS,,▪️ SCREEN RECORDING,, ▪️HUAWEI\nDHARE,,▪️ REPLY IN NOTIFICATION 🔔  \n((ALL ARE AVAILABLE IN EMUI 5.1))  \n🔄HONOR 7X AWESOME IN THIS PRICE RANGE,, VALUE FOR MONEY,, MODERN DESIGN,, BIG\nDISPLAY,, GOOD CAMERA,, GOOD BRAND VALUE 🔄  \n☸️THERE IS NO 💯 % PERFECT PHONE IN THE WORLD IN ANY PRICE RANGE☸️  \n⏺️⏺️⏺️CONS ⏺️⏺️⏺️  \n⬅️NO FAST CHARGING😕  \n➡️NO GYROSCOPE 😕  \n➡️NO NFC😕  \n➡️NO GLASS PROTECTION 😕  \n➡️NO UCB C TYPE 😕  \n➡️BATTERY IS NOT BEST😕  \n➡️PORTRAIT MODE IS NOT BEST😕  \n➡️No OREO IN OUT OF THE BOX  \n🔯((OTHER PHONE UNDER 15K-U MUST TRY MI A1))🔯  \n❤️ ❤️ DELIVER IS AWESOME. 2 DAYS DELIVERY 🚚 THANKS TO AMAZON AND SELLER ALSO,,\nPACKAGING ALSO 👋\n\n", "Why buy this?Why it is better than competition?  \nRead this review to find out.  \nPros  \n# 18:9 aspect ratio a new thing its a 6inch phone in 5.5inch body. Front look\ngorgeous.  \n# fast processor capable of heavy multitasking (best ram management) and\ngamming is great you will only notice laggyness while playing asphalt 8 at\nhigh graphic settings but laggyness goes away at medium graphics.I have tested\nit with dead trigger 2, unkilled 2, mordern combat verses,NFS no limits,\nsubway surfer, breakneck, injustice 2 played all games without any issues.  \n# feture rich ui. Its easy to operate and fun to use offer useful features\nlike dual apps,one hand mode, fingerprint gestures,split screen, bundle\nnotification, quick reply etc  \n#late to mention but camera is great 16+2mp bokeh effect is cool captures good\nimages and front camera is also good.  \n# great battery life its a 3340mah battery  \n# 4gb ram standard  \n# fingerprint sensor faster than moto and mi  \n# gorilla glass is present but not mentioned and a nano water-proff coating is\nalso present  \n# Android Oreo update in January  \nCons  \n\\- no fast charging (takes 2hrs)  \n\\- speaker volume is decent but not that loud  \n\\- 64gb variant is overpriced  \n\\- single color notification LED is not that bright compare to multiple\ncolor(5 colors) LED in mi note 4  \n\\- Type C port is missing  \n\\- rear bokeh effect can be better with software update  \nCompetors:: moto g5s plus (16k) and mi A1(14k)  \nCamera  \nG5s plus==7X> A1(grt rear cam but front camera is not that great)(7x offer\nmore mods if you love to play with camera)  \nBattery  \n7X with slightly better battery (you might not even notice) its okay to call\nit a tie.( Both g5s plus and A1 has 3000mah battery but 7x has bigger screen\nsize)  \nScreen quality  \n7X(rokz)>A1>g5s (both have good display but 7x has slightly better screen\nquality)  \nDesign  \nBoth A1 and g5s looks dated in front of 7x due to its full view display. but\nat rear A1 and 7x have same design (a lots of phpne has this design) g5s plus\ndesign is unique.  \nProcessor  \nSd625 is slightly better than kirin 659.  \nColour  \nG5s plus have two colors grey and gold (very common and old)  \nMi A1 have black and gold and rose gold and red version is coming too(both\nfoundis only find iPhone)  \nHonor 7x have gold, black and blue ( this dark blue colour is different than\nwhat other OME offers)  \nSoftware  \nG5s plus and A1 both run stock Android while 7X rums emui all devices will get\noreo(but A1 will get Android P and offers monthly security updates)*since 6x\nis recieving oreo 7x will also get Android P for sure.  \n##conclusion##  \nIts upto you which device you like according to you  \nMi A1 perfect all rounder  \nG5s plus better front cam than A1  \n7x new trendy phone a great camera at budget  \n## all phones have grt cam, screen, design, bit i choose 7x due to its screen\nratio but true competors of 7x are upcoming mi note 5 and moto g6 plus.(in\nwhich g6 plus will be expensive and note 5 cannot offer this grt camera)\n\n", "The good:  \n* Awesome display! 5.93” with 1080 x 2160 px.  \n* 4GB RAM at this price! With moderate usage, 1.7GB RAM is free (average).  \n* Good processor - HiSilicon Kirin 659 Octa-core. I haven’t noticed any lag till now.  \n* Good camera (for this price). There are various “pro” modes which let you tinker with settings as in a DSLR. The front camera is quite good.  \n* Good battery - 3340 mAh (non-removable). Easily lasts more than a day for me with moderate use.  \n* Price <13k !!  \n* Free transparent case (might be a limited-time offer). While the case is good at protecting the camera & back of the phone, it doesn’t look like it will protect the screen in case of a face-down drop. This is because there is very little protrusion of the case in the front of the device.  \n  \nThe bad:  \n* No fast-charging  \n* Uses Micro-USB instead of USB-C  \n* Running Android 7.0 Nougat as of now. Oreo update is in the works apparently.  \n* No headphones included in the box  \n  \nI received an update mid-Jan which brought VoLTE settings on the phone (till\nthen, I couldn’t find anything for VoLTE in settings). However, I’m not sure\nif it is enabled since there is no indication on the status bar which says so.\nHowever, the android version still remains 7.0 (Nougat) even though Android\nsecurity patches are updated to 1-Jan-2018.  \n  \nThe highlight of the phone is of course the display. Very few phones have an\n18:9 ‘FullView’ display at this price range at the moment (as of Jan 2018).\nFor ex, LG Q6 also has a similar screen, but lacks fingerprint sensor.  \nHonor 7x’s display looks gorgeous while in action. Also, the Blue colour\nvariant of the phone sets it apart in a market flooded with Black & Gold\ncolour options. The fingerprint sensor is quite fast in unlocking the phone.  \n  \nI bought the 32GB variant. The firmware occupies 9.6GB space. You can add upto\n256GB external memory using SIM-2 slot.  \nThe invoice which I downloaded from Amazon doesn’t have the IMEI or Serial\nnumber of the phone. However, the packaging slip had it. I’m not sure if this\nwould be a problem, but I’m checking with GreenMobiles if they can issue me a\ninvoice with IMEI number.  \n  \nOverall, I’m delighted with the phone. Till more phones with FullView displays\nhit the market at this price-point, this phone will retain an advantage over\ncompetition.\n\n", "My personal opinion after using this phone for 5 days..  \n  \n1\\. CAMERA  \nBack camera hardware is very good, struggles a bit in the low light but can be\ncompared to some of the mid rangers of Samsung and LG phones. Very satisfied\nwith normal mode on daylight shots but colour reproduction is little\ninaccurate. Looks over exposed. Bokeh effect and wide aperture mode is totally\nuseless and needs serious software improvement. (3.9/5)  \n  \nFront camera is again very good in normal lighting conditions only problem is\nover exposure. If you use in day lighting condition it looks more brighter but\nmore(more than it should be) darker in low light. Bokeh effect and portrait\nmode are very inaccurate. Bokeh effect cannot properly separate the edges of\nface and body from the background. Also while video calling in low light looks\ndarker than it should be. Again it needs serious attention to the camera\nsoftware.. (3.8/5)  \n  \n2\\. LOOK AND FEEL  \nFeels really premium on hand. Well built, perfect size, blue colour looks\nunique. Only thing I don't like in a smartphone is both volume and power\nbutton on the right side but the good thing for me in this phone is volume\nbuttons are on the upper side which doesn't mess up with my fingers. (5/5)  \n  \n3\\. DISPLAY  \nDisplays is outstanding Crystal clear and butter smooth should have been\nlittle brighter to view under the sun (4.9/5) otherwise there is no better\ndisplay in terms of quality for the price.  \n  \n4\\. UI AND PERFORMANCE  \nUI is very simple and easy. Lots of customization. Absolutely lag free (with\nsuch an amazing display as if I am touching the objects with my fingers)\nperformance. (5/5)  \n  \n5\\. NETWORK AND CALL  \nNetwork connectivity and call quality is really really superb. Found even\nlittle better than other devices like those of Samsung and LG but way way\nbetter than Xiaomi, Coolpad and Honor 6x (5/5)  \n  \n6\\. WiFi and GPS  \nWiFi coverage is really good also comes with WiFi bride is really handy. GPS\nis quick and accurate even inside the room. (4.9/5)  \n  \n6\\. Fingerprint sensors is very responsive and 100% accurate. (5/5)  \n  \n7\\. BATTERY  \nBattery is okay. Easily lasts a day with moderate use(Calling, WhatsApp,\nInternet surfing) (4.7/5)  \n  \n8\\. HEATING  \nThere is NO heating issues at all (at least in the winter season where the\natmospheric temperature is on the lower side). But it gets warm when we use\ncamera continuously for 5-10 minutes(which occurs in all smartphones\nliterally). (4.9/5)  \n  \n9\\. STORAGE AND MEMORY  \nStorage is a concern for this phone being a hybrid type memory card slot. The\nsituation becomes even worse when the system occupies 9 GB of space out of 32\nGB. There is only 19 GB (Normally 2 - 4 GB less than others) is available for\nthe user. But I don't strore lots of music or videos so its fine for me.\nTalking about 4 GB ram, I always get 2.1 to 2.4 GB of free memory despite I\nhave installed 20 heavy apps. (4.7/5)  \n  \n10\\. BLOATWARE  \nYes, bloatwares are there but the good news is that they can be removed from\nthe phone.  \n  \nI haven't tested the gaming performance yet.  \n  \nOverall I am really satisfied with the device for the price paid and knowing\nits pros and cons and being an occasional camera user for photography. Its a\ngood VFM smartphone.  \n  \nIf the seller is reading my review, please fix the camera software and\nperformance to make it a really champion smartphone.\n\n", "Description :- I'll start up with the major con of this phone that is UI, well\nit turns out to be a major pro of this phone.  \nYes EMUI experience is a flawless experience it is very snappy and cool.  \n  \nIn my opinion it provides more options than that in stock android.  \n  \nNow lets come up to the screen - well that is the highlight of the phone and\nit couldn't get any better. In my opnion it also beats the 30k price range\nphone on the market.  \n  \nPREMIUM look and feel - when you hold the phone it feels really premium and\nthe screen adds upto that premium feel of the phone.  \n  \nCAMERA - I would not say the best but it is good or average.  \nWide aperture and portrait mode are sometimes gimmicky.  \n  \nFEATURES :- the phones with stock android on the market in this price range do\nnot give us the various options to turn on same very important features\nneeded.  \n  \nDISPLAY - Couldn't get any better and the rounded edges looks just futuristic.\nThe screen very precisely blends with the body which gives an amazing grip to\nthe device.  \n  \nBATTERY - Many reviews i read  inficated that battery backup is not good at\nall. But when i started using this device I didn't feel like battery was\ndraining very fast it gives a decent battery performance. But i would say that\ndue to type - b charging port it takes a little long time to be charged. They\nshould have used type - c port.  \n  \nConclusion :- if you want a premium feeling phone with a great display and a\nawesome UI in the budget of 13k-16k then don't think and just go for honor 7X.\n\n", "Posting this honest review after two weeks of usage:  \n  \nBattery: 8/10: Lasts a day for moderate users.  \n  \nDisplay:10/10: Beautiful full HD display. Watching videos is a treat.  \n  \nSound:8/10: Good output which is sufficient, however not loud enough for some\nusers.  \n  \nBuild Quality:9/10: Looks aesthetically beautiful and build is tough. However,\nback screen is prone to damage, hence, also apply back cover.  \n  \nUI:9/10: Wonderful blend of EUI and Nougat. Flawless performance.  \n  \nBack Camera:9/10: Near perfect bokeh with huge variety of features. Amazing\ncamera app. Video quality also great.  \n  \nFront Camera:8/10: Good for selfies. Above average portrait mode.  \n  \nCharging speed:8/10: Charges from 0 to 100 in about 140 minutes.  \n  \nSpecial features:9/10: Many unique and cool things can be done. Amazing\npersonalisation options available.  \n  \nValue for money:10/10: No phone is better than 7x in ₹13000.  \n  \nVerdict:9/10: Amazing phone with many features. Minor flaws are present, but\nwhich won't cause any big problems.  \n  \nPlease upvote if you find it helpful!\n\n", "Ordered honor 7x(32 GB- gold) and received on time.  \nusing this mobile for last 2 days.  \n  \npros:  \n=======  \n1\\. premium look  \n2\\. honor photo editing options (pro mode options etc)  \n3\\. front and back camera portrait mode  \n4\\. battery last for whole day with gaming,4g,wifi,location on  \n5\\. EMUI 5.0. I used stock android before. but EMUI5.0 is really good.  \n6\\. Fastest finger print scanner. Just 0.25 sec. faster than any other mobile\nin this proce range.  \n7\\. No network issue.Signal strength is very stable.  \n8\\. Wifi bridge  \n9\\. Eye comfort mode with schedule option :).  \n10\\. swiftkey keyboard.  \n11.Free Back Cover Case on the box :)  \n  \nstorage :19GB free out of 32 GB.  \nRam: 2.75 GB free out of 4 GB(with my personal apps)  \n  \nCons:  \n======  \n1.no fast charging( takes more than 2.35 hrs for 100% charge)  \n2.no USB C-type  \n3\\. no 802.11ac support.  \n  \nthese points are not really cons .but if these option also given with this\nprice, it will be even better.\n\n", "It has everything you want in a 2018 handset - 18:9 Full HD screen, a sleek,\nall-metal design, skinny bezels, and a dual camera. The only thing it's\nmissing? A USB-C port.  \n  \n• Dimensions: 156.5 x 75.3 x 7.6 mm  \nThe Honor 7X comes in blue and black. Displays with a tall 18:9 ratio may be\ncommon among premium phones, but it's rare to see one in a mid-range handset,  \n  \n• Display: 5.93-inch, 18:9 Full HD 1080x2160 LCD  \nThe screen is bright and crisp, and feels as immersive as the Infinity Display\non the Galaxy S8.  \n  \n• Processor: Kirin 659  \nThat means you get smooth scrolling, snappy animations, and apps that launch\nand switch quickly.  \n  \n• Camera: Dual 16MP, f/2.2 + 2MP  \nThe 7X has a dual pairing a 16MP main with a 2MP secondary one. For the most\npart the 7X performs as you'd expect for a budget phone: good enough, but not\ngreat.  \n  \n• Battery: 3,340mAh  \nThe company promises the phone can deliver a little less than a day and a half\nof life on a full charge. I found that to be somewhat true during my time with\nthe phone with average usage.  \n  \n• RAM/ROM: 3GB or 4GB/ 64GB  \nThere are two options available 4GB of RAM and 64GB of storage and 4GB of RAM\nand 32GB of storage. It's good to see they made the numbers work with skimping\non space.  \n  \nIn my personal opinion if Honor wanted to compete with Moto they should have\nadded sim+sim+SD card option. Otherwise don't think of it as a budget phone.\nThink of it as a really good phone that's really, really cheap.  \n  \nThanks  \nAnurag\n\n", "Got my Phone today but poor performance display flickering not working\n\n", "First of all 5 star to Amazon delivery. Before the expected date...  \nNow about phone HONOR never lets you down. HONOR 7X under this price range is\na competition killer as people and experts are saying.  \nYou will get a phone, charger, back cover, warrenty card, manual, sim tray\nopener pin in the box.  \nLets talk about phone and its pros and cons.  \nPros:  \n1\\. Backup from old phone with the help of application at a time of starting a\nphone for the first time makes way easy for switching to new phone  \n2\\. Fingerprint sensor - very quick  \n3\\. Camera is also good especially front camera with those filters and works\nunder low light also well  \n4\\. Pin the app function for privacy purpose  \n5\\. Some people and reviews are saying that speaker volume is low but its not\ntrue, volume is actually pretty good and adequate not too lould but yes it\ndoesn't have dolby sound system  \n6\\. Picture clearity is wonderful  \n7\\. Phone design gives you feel of premium segment  \n8\\. EMUI system gives you few themes to enhance the look of the phone  \n9\\. Battery back up is good, last upto one and half day with one full charge\nwith normal daily use  \n10\\. Sound effects with headphones and earphones are awesomely wonderful, a\nclarity to the sound  \n  \nCons:  \n1\\. Charge time, it almost take 2 and half hour  \n2\\. Camera Portrait mode is not of that standard as competitors are providing  \n3\\. Almost 12.50 GB consumed bye firmware software in 64GB phone  \n  \nSo overal the phone is good and value for money. You can ignore cons against\nits pros because every phone does not cover all the good things. But this\nphone is truely amazing and like I said in begining HONOR never lets you down,\nthis phone will also never let you down. HONOR for the Brave.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 December 2017", "on 17 December 2017", "on 16 January 2018", "on 18 December 2017", "on 11 March 2018", "on 25 December 2017", "on 12 December 2017", "on 11 March 2018", "on 13 December 2017", "on 18 December 2017"], "reviewer": ["Prasanta Giri", "Amazon Customer", "SK", "Sushant", "Amazon Customer", "Amazon Customer", "hello world", "Anurag", "Bittoo", "Jenish"]},
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["First day with HONOR 7X", "Honor 7X review with camera samples with real world usage.", "MOST HELPFUL REVIEW", "100% genuine Review after one week use.", "Superb..!! Excellent..!! loving it..!! Honor 7X", "Missing X effect. In camera Honor 6X is much better", "Best buy at this price range", "Amazing camera phone with power packed performance", "Worth The Price! Great Build Quality and Smooth UI Experience for this price!", "Honor 7X Full Honest Review!🎀❤"], "review": ["Ordered Blue Variant with 4 GB RAM, 32 GB Storage. Delivered by Blue Dart in 2\ndays in good Packaging. Received Yesterday.  \nIn the box: Phone, Quick User Guide, Charger with USB Cable, Transparent\nRubber Back Cover.  \n  \nAbout Phone:  \nIt came with firmware dated October 2017. I just connected to JIO hotspot and\nupdated it to Jan 2018 firmware package.  \nGyroscope is working fine after updates. Wifi worked without any issue.  \nNo issue with Battery as it was draining slowly. Lot of options for\ncustomization.  \nI downloaded my apps from play store over HOTSPOT and it was running very\nfast.  \nCamera performance is satisfactory and there are tons of options for\nPhotography.  \nFHD+ Display with 18:9 ratio is really awesome. Mobile internet also works\nfast without problem.  \nInitially play store was getting closed automatically but later I updated all\nthe Google apps from play store my apps (In this menu, it was not closing\nauto). Then Play store was working fine. All the downloaded softwares are\nworking fine.  \nToday I charged it for 40 minutes and it charged from 10 % to 44 % in that\nperiod.  \nAfter few seconds, display was black for 10 minutes. I tried everything but\nfailed. Mobile was on cuz I called on the number and it was ringing but\ndisplay was black. After lot of efforts to unlock, display came back with\nflickering RGB lines on Display.  \nIt worked for 10 minutes and then again I faced the same Issue. Then I tried\nthe solution that is suggested by HONOR staff.  \n1\\. Power off the phone 2. Press Volume UP button and then press Power button\nto start the phone. 3 It goes in to recovery. Wipe the CACHE PARTITION. 4.\nRestart the phone.  \nAnd now its 3 hours and its working fine without any issue. I checked all the\nfunctionality and clicked some photos, shown my phone to my office friends.\nIts working fine at least for now. Let see how it goes. I will update my\nreview later.  \n  \nUpdates: Still there is issue. Mobile is on but display is going black and\nstucks. This time I did both WIPE DATA & WIPE CACHE.  \nI will observe today and I will update if issue persists.  \n  \nFinal Words: Its good and capable phone with Best in class Display and\nfunctionality. It seems like issues are actually because of software.  \nI am not returning this phone anyway. Huawei has already sold 40 million of\nHONOR 7X devices and I hope they will support strongly for this phone.  \nThey have promised, EMUI 8.0 OREO updates in the March 2018.  \n  \nIf any question you can ask by replying to this post.\n\n", "First of oll  \n1)Packaging-worst i have ever seen  \n2)Buit and design-Go for it if have not used any smartphone with 18:9\ndisplay.I must say i looks amazing when you first hold your phone.although it\nhas 5.99 inch display it does not feel bulky. All metal build makes it much\nreliable. Better than Mi A1 or even moto g5s plus.  \n3)display-18:9 looks awesome.media consumption or even social media\nconsumption is amazing in such a tall display.  \nViewing angles was good in indoors and outdoors no complaints.toch is not\nresponsive as another phone i have used this must be because of tall display\nwhen you scroll down it scroll little bit slow as compared to any 16:9\ndisplay.  \n4)sensors-all sensors is present except gyroscope and IR blaster.If you want\nVR staffs then definitely this is not the ideal phone for you go with MI\nA1.Auto brightness sensors works very well.  \n5) speakers-It has just a single bottom firing speaker.It is now much louder\nas compared to MI A1 but it is similar to all other phones in this price\nrange.  \n3.5 mm jack- audio via 3.5 mm jack is very good no problem but MI A1 has a\ndedicated DAC which makes it a clear winner.  \n6) wireless connectivity-it only supports single wifi 2.5 Ghz band.  \nJio VOLTE works well.  \n7)sim slots-it will take two nano sims or a nano+sd card but 1st sim will hold\n4G and 2nd sim will be 2G only.  \n8)call clarity is great both with ear piece and speakers.  \n9) software-It runs on Android Nougat 7.0 with Custom skin Emui 5.1 but\ncompany has promised for Android Oreo in the first quarter of 2018.  \nIt comes preloaded with lot of bloatwares wich can be uninstallable.  \n10)Storage-go with 32 gb varient but keep in mind it provides on 19 gb of\nusable memory you definitely need a sd card.  \n11) battery-it amazing hwawei kirin 659 soc has been calibrated very\nwell.Snapdragon 625 vs kirin 659.14nm vs 16 nm.definitely kirin 659 takes the\nlead here in terms of speed as well as battery optimization.  \nIt takes 2 hrs10 mins to charge from 30-100 percent but when i have charged it\n100 percent in night and i saw on morning it was 100 percent.stand by time is\nawesome.  \n12)RAM-ram management has done very well i never kill any app from the\nbackground it manages very well.  \n13) performance-It clearly beats MI A1 in speed tests and and it is much\nsnapier than snapdragon 625 soc.  \n14)Gaming-good but sometimes it lags with high grafics settings in asphalt.No\nheating issues  \n15)CAMERA- front-8mp with beautification mode,potrait mode and much more i\nmust say if you are looking for a selfie camera then go fo it  \nCan't be compared to MI A1 it is much better than MI A1. I will provide you\nsome shots of front facing camera.  \nRear camera-16+2 mp.much better than MI A1 portrait shots is better on MI A1.\nSometimes portrait shots is like hit or miss on 7X.  \nIt has wide range shots also and moving pictures shots along with lots of\nprofessional mode options.I will provide you some shots.  \n16) videos -front camera you can shoot only 720p videos not 1080 or 4K but\nlooks very nice and surprisingly it is better than Mi A1 front camera even\nwith 1080p fottage.No video stabilization.  \nRear-1080p recording and it is similar to MI A1  \nBut not 4K.focassing it best on 7X.  \nThese are shots taken in portrait,bookeh and wide angle you decide what is\nbest for you.\n\n", "Verdict  \nFor Rs 13,000 device, the Honor 7X isn’t the best.  \nIt has a great display and good battery life and the overall performance is\naverage at best.  \nIt loses out to the Mi A1 as far as the camera is concerned and graphically\nheavy games like Asphalt 8 stutter on the device.  \nYou can consider it if you aren’t a heavy smartphone user and like reading\ncontent or watching movies on the go, as the display on the smartphone is\nindeed good.  \nBut if the camera is something you are finicky about and aren't a fan of\nskinned OSes,  \nthen you may want to consider your options.  \n  \nPROS  \nGreat display.  \nGood Battery Life.  \nCamera clicks good images in well lit conditions.  \n  \nCONS  \nGraphically heavy games stutter on the device.  \nUnderwhelming audio quality.  \nCompetitors have better cameras.  \n  \nHuawei Honor 7X: Detailed Review  \n  \nHonor has launched an interesting portfolio of smartphones here in 2017,\nincluding the Honor 8 Pro, Honor 9i and the Honor 6X to name some. Today we\nhave the successor to the Honor 6X, predictably called the Honor 7X.  \nThis means that it will compete with the likes of the Moto G5 Plus, Lenovo K8\nPlus, Redmi Note 4, and the current heavyweight champion of the sub 15k\ncategory, the Xiaomi Mi A1.  \nDoes it have what it takes to become the king of the hill?  \n  \nSpecifications at a glance:  \n  \nThickness: 7.6mm  \nWeight: 165 grams  \nCPU: Kirin 659 Octa-Core CPU  \nOS & UI: Android 7.1 with EMUI 5.1  \nDisplay: 5.93-inch 18:9 display  \nDisplay resolution: 2160x1080p  \nRear Camera: 16MP+2MP  \nFront camera: 8MP  \nRAM: 4GB  \nBuilt-in storage: 64GB.  \nBattery: 3340mAh  \n  \nBuild and Design  \n  \nSpeaking of the build, the Honor 7X is as premium as the Mi A1 and that isn't\na bad thing.  \nThe smartphone has a metal build with curved edges.  \nIt is ever so slightly taller than the Mi A1 and thanks to the 18:9 form\nfactor, it has thin bezels on the sides.  \nThe top and bottom bezels are quite thick and the phone has an attractive\ndesign.  \nThese bezels are thin enough that they add to the aesthetics of the smartphone\nand yet thick enough so that your palm doesn’t accidentally touch the screen\nif you are trying to reach one of the top corners during single-handed use.  \nThe top and bottom bezels are thick enough to comfortably hold the phone in\nlandscape mode for watching movies and playing games.  \nAt the back, you have the fingerprint sensor conveniently located. You also\nhave the dual-camera setup which is protruding. I wish the dual camera setup\nwas as seamless as it was on the Honor 8 Pro.  \nThe right side of the smartphone has the power button and the volume rocker. T  \nhe buttons are clicky and feel good. At the bottom, we have the micro-USB port\nfor charging, which is a bummer in a USB-C dominated market.  \nYou also have the headphone jack and the speaker grill on either side of the\nUSB port.  \nSpeaking of the design, the smartphone has the standard candy bar 18:9 design\nwe’d expect in this price and the curved edges make it comfortable to hold\nwith one hand.  \nAlthough reaching all corners of the phone isn’t easy with single-handed use,\nit is fairly ergonomic.  \nOverall, the build and design of the Honor 7X is good.  \nThe 18:9 display is a good addition when compared to other phones in the same\nprice range.  \n  \nDisplay and Sound  \nAs we’ve mentioned above, the smartphone has an 18:9 display for watching\ncontent.  \nWe faced no issue with the display on every day use. Apps that haven’t been\noptimized for the new aspect ratio show a black bar at the bottom with the\noption to stretch it to full screen.  \nThere are however some apps and games, like Asphalt 8, that run in full screen\nand take advantage of the new display.  \nThere are some 18:9 specific videos on YouTube as well and if you are watching\nthe new Avengers: Infinity War trailer on the device, you can simply pinch to\nfit and enjoy the trailer in full screen.  \nOther apps like WhatsApp, Facebook, Gmail, Chrome, etc. work well on the new\naspect ratio. No complaints here.  \nIf there is a complaint it’s with the audio quality from the speaker.  \nWatching YouTube content including movie trailers, cinematic video game\ntrailers, talk shows, Ted Talks, etc. is very underwhelming.  \nThe background score of the movie trailer and the vocals seem muddled. The\nsame can be said for music videos.  \nWhen playing games like Asphalt 8, the audio from the speaker is underwhelming\ntoo and sounds muddled.  \nWhen taking calls on the speakerphone, the voice is clear but the maximum\nvolume is lower than what I’d expect from a smartphone.  \nComing back to the display, it has a maximum luminance of 417 lux. It isn’t\nthe brightest display out there and sunlight visibility does suffer, but if\nyou are going to read web pages or Kindle books, you should be fine with auto\nbrightness. You may want to bump up the brightness manually while watching\nmovies though.  \nFor those of you finicky about the colour temperature of the device, you can\nmanually change it between default, warm and cold. You also have the ability\nto manually adjust it to your preference. There's even an eye comfort mode\nthat essentially filters out blue light.  \nOverall, the display is very good and supports a pretty wide colour gamut. You\nwill enjoy watching movies on it, but audio is an issue.  \n  \nUI  \nThe Honor 7X has the company’s own EMUI overlaying Android Nougat. The UI has\nsome interesting features. If you like, you can have an iOS-like layout where\nall the apps are present on the home screen. Or if you are one that prefers an\napp drawer, then that option is there too. The phone comes with a bunch of\npreloaded apps and games. There is one pre-loaded app I found quite\ninteresting. In the tools folder, there is a Mirror app. It essentially uses\nthe front-facing camera of the smartphone and you can zoom in as well if you\nwant. It has a bunch of mirror frames to choose from and in case you want to\ncheck out your hair before that big date, I suggest you give this app a shot\ninstead of opening the front-facing camera.  \n  \nThere is another interesting feature on the phone called WiFi bridge. Through\nthis, the current WiFI network can be shared with other devices. This is very\nuseful in a scenario where you have access to WiFi on only one device, but\nneed the access for other devices too. Do remember, this feature on the Honor\n7X is a battery guzzler.  \n  \nOverall, the UI is fairly fluid and if you have used an Honor phone in the\npast, you will feel right at home. There are times when the UI stuttered\nduring heavy multitasking and a few times when Facebook didn’t respond, but\napart from that, the average user shouldn’t face any issues.  \n  \nPerformance  \n  \nLet’s talk about the call performance. The audio is crisp and clear at both\nends. The earpiece is loud and there is audio leaking when it is at full\nvolume. So, if you are in a car and the earpiece is at full volume, the person\nsitting next to you can easily eavesdrop on the conversation. At about 60%\nvolume, the earpiece works perfectly well. There are also some places in my\nhouse where the network is an issue but the Honor 7X managed to grab better\ncellular reception than other phones in this case.  \n  \nRunning everyday apps like Facebook, Whatsapp, YouTube, Netflix, and more is a\nbreeze. The smartphone multitasks well and stutters only when you run heavy\napps and games back to back.  \n  \nThe biggest downside to the performance of the smartphone was gaming. Casual\ngames like Farm Hero Saga ran well but graphically heavy games like Asphalt 8\nshowed patchy framerates. When there are a bunch of cars on screen, the\nframerate really drops. If you are one that wants to play graphically heavy\ngames on the device, you may want to look at other options.  \n  \nWhen it comes to benchmarks, the performance is at par with the Honor 9i and\nthis isn’t surprising since both phones are powered by the same SoC. Here is a\nlook at the benchmark scores of the Honor 7X against some competing devices.  \n  \nOverall, the performance of the device is not groundbreaking, but it has just\nenough to keep the average user happy. There aren’t any troubling heating\nissues with the smartphone either.  \n  \nCamera  \n  \nMoving to the camera, the Honor 7X has a dual camera setup with one 16MP\ncamera and another 2MP camera. Photos clicked in well-lit situations have\ncolours that are true to the source. However, for a phone priced around 15k,\nthere are smartphones with better cameras. Low light photos also present the\nproblem of noise especially when the light is really low. Since the smartphone\nhas a dual camera setup, you’d expect it to click good bokeh photos. However,\nthat isn’t the case. The bokeh photos are average at best and the camera on\nthe Honor 7X isn’t as groundbreaking as they were on the Honor 6X, with\nrespect to their respective competitors. If a camera is of utmost importance\nto you, you are better off considering the Mi A1.  \n  \nBelow are some of the camera samples,Don't Forget to Check it out  \n  \nBattery life  \n  \nUsing the phone for about a week, the smartphone can last you a little more\nthan a 9 to 5 day with above average use. With brightness on auto, and 100%\nbattery at 10am the phone was at about 20% battery when I got home at 8PM,\nwhich is good considering usage. We made many calls and sent many texts during\nthe day, clicked some images, watched YouTube videos, Facebooking and some\nlight gaming. The smartphone lasted for about eight and a half hours on the PC\nMark Battery Test, which isn’t the best in this category but it isn’t bad\neither.  \n  \nHow it compares  \n  \nWhen you consider a 15K smartphone, you will look at devices like the Moto G5\nPlus and the Mi A1 to name a few. The Honor 7x has a better display than the\nMi A1, which means that you can enjoy movies on it a lot more. The 18:9\ndisplay also helps in this regard. However, the output from the speaker of the\nMi A1 is far superior. When it comes to everyday performance, the phone is\nsnappy and can give the Mi A1 a run for its money. Gaming performance on the\nHonor 7X could have been better.  \n  \nBottom Line  \n  \nFor Rs 15,000 device, the Honor 7X isn’t the best option out there.  \nIt has a great display and good battery life and the overall performance is\naverage at best.  \nIt loses out to the Mi A1 as far as the camera is concerned and graphically\nheavy games like Asphalt 8 stutter on the device.  \nYou can consider it if you aren’t a heavy smartphone user and like reading\ncontent or watching movies on the go, as the display on the smartphone is\nindeed good.  \nBut if the camera is something you are finicky about and aren't a fan of\nskinned OSes, then you may want to consider your options.  \n  \nif my Review helped you in anyways Please Vote it as HELPFUL.\n\n", "\n\n 1) product design is simply awesome.it's much beautiful than it seen in\nimages, i suggest go for blue colour.  \n2) Display quality is better than any 16:9 displays phones as 18:9 display has\nfull hd plus display.  \nOnce you start using it when you looked to 16:9 displays of any phone of any\nprice range upto 20 to 25k phones, you will definitely not going to like the\ndisplay of such type of phones.  \n3) it is truly a bezzel less phone as seen in images.  \n4) Camera is better than 6x as you click images and zoom it honor 6x show some\npolished on faces that doesn't happen with 7x. Thanks for it.  \nThere is no use of camera of 2MP as it's bokeh effect software is not good.\nFront camera is better than Mi A1 i think.  \n5) battery life is good .  \n6) one thing that disappoint me about this phone.  \nThe day i purchased, i start watching video on YouTube but when i m sliding\nthe video from the buttom sometimes it will get hanged. You checked that\nhanging problem in video that i m attaching with this feedback.  \nI m suggesting don't go for 16:9 display, 18:9 display has better display\nquality.Go for it or LG q6.\n\n", "Hope you are reading this after knowing the specifications...!!  \ni've purchased 4GB+32GB BLUE colour variant for INR12,999.00. Delivery and\npackaging was really bad from amazon this time. no bubble wrap. just box\npackage. though amazon delivered on time. i expected the mobile, a day\nbefore,since the vendor address is just 5km from my place. so one star less.  \nInside box:  \nPHONE, User manual and warranty  \nCHARGER, CHARGING CABLE  \nSILICON CASE(transparent).  \nAbout phone.  \n1.18:9, 5.93\" FHD+, 2.5D corning gorilla glass display is really superb, Clear\nand vibrant. viewing angles and brightness is also great.  \n2.slim, round edge, uni-metal body design and normal weight. Feels premium in\nhand.  \n3\\. placement of notification LED and Proximity sensor cannot be seen easily.  \n4\\. Volume & power on buttons are made of metal & of same colour. very\nresponsive.  \n5\\. I love EMUI of honor though it is heavy. so EMUI 5.1 is superb  \n6\\. fingerprint reader is ultra fast and accurate.  \n7\\. Kirin 659 is really superb processor, no lags etc.  \n8\\. used for playing games and video recording and photo capturing around 2\nhrs. no heating issues.  \n9\\. battery back up needs to be tested. but till now no issues with it. hope\nwill be getting 1 day for above average usage.  \nCamera:  \n1.16MP+2MP rear is really great combination. captures really excellent photos.  \n2.Shutter speed and processing of image speed is excellent. infact its\nexcellent.  \n3\\. bokeh and portrait mode are given differently. so you can make different\ncombinations.  \n4\\. Portrait and bokeh mode are limited to 8MP and you cannot change settings.  \n5.video capture is limited to 1080P and not 4K.  \n6\\. slowmotion is limited to VGA. which is pathetic.  \n7.Sharpness of images, depth, detail capturing is excellent as per the price\nis concerned.  \n8.Colour reproduction is more towards warmer side and tends to saturate.  \nSelfies are good. i've used honor 6x before. no changes in selfies, just same\nas honor 6x ,except portrait effect as extra.  \nPortrait effect is not great on front camera.its just ok ok.  \nPerformance:  \n1\\. kirin 659 is really powerful processor,  \n2.2.6GB RAM free for usage out of 3.64GB  \n3\\. 20 GB free out of 32GB. this is very bad.  \nSignal and call quality:  \nSignal reception is superb no issues with it.  \ncall quality is also great. Loudspeaker is also good for calls.  \nboth sim slot supports 4G. But only one can be used as 4G at a time. supports\njio Volte  \nSAR is 1.23W/KG which is quiet more.  \nDisplay colours are not natural it is more darker than natural colour. Apart\nfrom this display is awesome.  \nIts slippery, doest have good grip,surely cannot be used in single hand.  \nis this update for honor 6x?  \nif you are using honor 6x, and looking for camera and normal day today usage.\nthink its not the update.  \nLIKE MY comment if it was useful.  \ncheck my first impressions and unboxing video on youtube.\n\n", "Honor 7x was delivered to me next day after booking. When i first opened the\nbox i just fall in love with the display. 18:9 screen is just awesome with\nawesome colour reproduction with bit saturated colours. Handset is\nslim.Battery back up is good, give one day back up with mix usage and charges\nfrom 8% to 100% in 2 hours. Coming to camera, its just average. Camera take\ntime to focus. Day light shots are good. No image stabilization. If you try to\ntake pic of moving object you will get blur image(in this case Mi A1 is really\ngood). Low light photography is poor.Camera sometimes doesnt focus on object\nin low light.Bokeh effect is much better on Mi A1, in Honor 7x in bokeh images\ntheir is no sharpness on edges. Sound is loud and clear. Sound output is\npretty good using headphones. If you are entertainment freak and use camera\nrarely than go for Honor 7x you will love it and if you want an all rounder\nand use your smartphone for taking pics than go for Mi A1. M using both\nhandsets.\n\n", "Great mobile at this price range.Display is crisp and punchy,Processor and ram\nmakes the phone run smoothly without any hang ups.Battery life is good had\nbrowsed internet played games music and it lasted 7 to 8 hours easily can last\na day plus if used mediocrely.At this price range it averages above other\nmobiles in all fields.The looks are premium and match high end mobiles under\n30k.The sleekness is good (7.6mm) and can fit in the pockets.The bloatware\ninstalled by huawei in mobile can be uninstalled easily giving you more memory\nspace.Out of 32Gb memory 19.5Gb is usable.Dual rear Camera is good in outdoor\nlights and moderate in dim light. selfies are above moderate you need a steady\nhand while clicking pics you can tweak the camera settings according to your\nsituations resulting in good results.phone volume is good and rings can be\nheard in noisy places.Having hybrid 2nd slim slot you can either use sim card\nor memory card in slim slot 2.  \noverall score out of 5  \nDisplay 4.5/5  \nBattery 4.2/5  \nLooks 4.2/5  \nProcessor 4.7/5  \nCamera 4/5  \nCost 5/5  \nAudio 4.2/5  \nInternet connectivity 5/5  \nCons  \nNo fast charging.  \nNo NFC  \nHybrid 2nd slim slot.  \nOver all a very good and best mobile to buy in this price segement.  \nGO FOR IT.\n\n", "Hello there, I am not going to tell about the specifications, which is already\nshared by many. Till now everyone knows that, in this price range of 13000 to\n16000 non other phone can beat this. I want to clear the doubts of people, who\ndon't know about the Honor brand of Huawei. Huawei is the #3 company after\nSamsung and Apple in current world rankings of Mobile market. Like Apple,\nHuawei also using their own processor and user interface for mobile devices.\nCamera is far better than Mi A1 and any other device of Oppo or Vivo. Even the\n8MP front camera is better that Oneplus 20MP. Kindly check out the images I\nshared.\n\n", "* This review is after 10 days of regular usage from the date of delivery.  \n* Packaging : Nice and strong - Not too big, nor too small. Great job there, Amazon!  \n* Delivery : One Day Delivery (Without Prime) - Prompt Delivery, Delivery Associate was courteous enough and well behaved. Awesome as always, Amazon!  \n* Inside the Box : Charger (5V,2A) + Micro USB Cable + Phone + Sim Ejector Pin + Soft TPU Transparent Case + Warranty Cards and Quick Start Guide  \n* Camera : 8/10  \n* Build Quality : 9.5/10  \n* Battery (For Regular Usage) : 9/10  \n* UI Experience : 8/10  \n* Call Clarity : 9/10  \n* No lag whatsoever in the past 10 days.  \n* Gives a solid and sturdy feel.  \n* 5.9 inch LTPS IPS LCD display - 2160 x 1080 px - 18:9 aspect ratio. Option for full screen mode on third party applications.  \n* 4GB of RAM – 64 GB variant – Phone color: Black.  \n* Rear Camera: Dual camera setup – One with 16MP senor while the other one is a 2MP depth sensor. Has PDAF and records 1080P videos at 30fps. Single LED flash.  \n* Front Camera: 8MP camera which also records 1080P videos.  \n* Battery: 3340mAh – For low and medium users, the phone will last for a full working day.  \n* SIM – Hybrid SIM Slot – Both SIMs support 4G VOLTE. No cellular signal discrepancies whatsover.\n\n", "Must Read This Review Before Spending Hard Earned ₹15K🎀❤🙏  \n  \n\\----------------------------------  \nDesign and display🎀  \n\\----------------------------------  \n  \nAluminum unibody finish feels premium  \n5.93-inch Full HD+, 18:9 aspect ratio display  \n  \nHonor 7X is uses a single block of metal that looks and feels very premium for\na Rs.12,999 phone. Even though the rear of the phone has a flat profile, which\ncompliments its 7.6mm thickness, it doesn't exactly sit in the hand\ncomfortably as a slightly curved back would have. That being said, the\nsmartphone does look attractive with its aluminum chassis which might not be\nas pleasant as the glass back on other flagship smartphones, say the Honor 9,\nbut does just fine in this price bracket.  \n  \nThe fingerprint sensor is located on the rear of the handset, and we found it\neasy to reach when holding the phone. The fingerprint sensor is quick to\nidentify the touch input and unlocks in a jiffy.  \n  \nThe bottom edge houses a 3.5mm headphone jack along with a micro USB port\nbeside the speaker grill. The left side of the smartphone has the hybrid dual\nSIM card slot which can either be used for two SIM cards or one SIM card and a\nmicroSD card.  \n  \nAt 165 gms and measuring 156.5 x 75.3 x 7.6 mm, the Honor 7X does feel like\nmore than just value for money.  \n  \nWe have to commend Huawei and Honor for the 5.93-inch display that they have\nmanaged to cram into a body that would traditionally accommodate a 5.5-inch\nscreen.  \n  \nThe FullHD+ (2160x1080 pixels) display as such provides a great experience\noverall and we found it to be bold and vibrant. Now, the 18:9 aspect ratio\nwith a pixel density that equals to 407ppi, the screen isn’t anything like on\na flagship smartphone, but at this price, it is more than what anyone could\nask for.  \n  \nApps on the smartphone will run at 16:9 aspect ratio by default and users will\nget a pop-up of running a particular app in full screen 18:9 aspect ratio. To\navoid that, there is an option in Display settings through which a user can\nenable the fullscreen mode on different apps.  \n  \nThe Honor 7X also comes with an Eye Comfort mode in Display settings to filter\nout excessive blue light along with options to modify the colour temperature\nand brightness.  \n  \n\\------------------------------------  \nBattery and Display🎀  \n\\------------------------------------  \n  \nThe Honor 7X comes with a 3,340mAh battery that the company claims will last\nmore than a day. It also has an Ultra Power Saving Mode that will give that\nlast minute juice to the smartphone if any need arises.  \n  \nBattery life is something that has come a long way this past year with major\nimprovements. It is also one of the first things a user looks at while\npurchasing the smartphone.  \n  \nOn the Honor 7X, you’ll be glad to know that it stays true to its claim in\nterms of performance. It’s not game-changing, but considering the phone is\npowered by a 3,340mAh battery and powers an 18:9 aspect ratio display on the\nfront, it is more than sufficient for daily use.  \n  \nOccasional boost during the night or midway in the day can also help the phone\nlast longer than a day if you are a power user.  \n  \nWe also missed the fast charging which has become a common feature with\nsmartphones today. Sadly, Honor 7X doesn’t support fast-charging capabilities\nso the phone won’t get charged up quickly. It’s a bit of a disappointment\nconsidering a lot of other mid-range phones now charge much faster than the\nHonor 7X.  \n  \nWe put the 7X through our standard battery test, which involves playing a Full\nHD video for 90 minutes from a full charge, at full brightness and with\naccounts syncing over Wi-Fi, and the phone had 78% battery left at the end of\nthe test.  \n  \nDual camera setup: 16MP + 2MP  \nGood performance in well-lit conditions  \nHonor 7X features a dual-camera setup on the back. It has a 16-megapixel\nprimary camera and a 2-megapixel depth-sensing camera on the back.  \n  \nComing to the performance of the rear camera, the Honor 7X delivers fairly\ngood images in optimal lighting conditions. The camera is snappy most of the\ntimes in focusing and capturing pictures at a blazing fast speed. The pictures\nclicked in good lighting environment came out to be punchy and detailed.  \n  \nThe 2-megapixel lens on board the Honor 7X works in the Portrait mode to\nachieve bokeh-like images. It essentially identifies the edges of the subject\nin focus and blurs out everything else.  \n  \nWe found that the 7X struggled to identify the edges of our subject resulting\nin an uneven blur around our subject. That also has a lot to do with the kind\nof light the subject is in. The camera also focuses slowly when it switches to\nthe portrait mode.  \n  \nIn low light, the Honor 7X cannot be trusted to capture a good image. Poor\nlighting is a real problem for the camera, and you can tell it’s not as\npowerful as the ones on higher-end Honor handsets or flagship phones.  \n  \nThat said it does manage to keep pace with competitors such as the Nokia 6 and\nthe Moto G5S Plus, which are around the same price point.  \n  \nThe front camera is an 8MP shooter that also boasts a Portrait mode feature,\nwhich we found worked, but not as well as on the rear camera. The selfie\nshooter will take decent snaps for social media and the like, but it’s nothing\nout of the ordinary.  \n  \nThere's a dual-camera setup on the rear of the Honor 7X, with a 16MP sensor\ndoing most of the heavy lifting and then a 2MP sensor to the side of it, which\nis dedicated to depth-sensing.  \n  \nWe've had a limited time with the camera so far, but taking the odd picture\nquickly has worked fast and given good results, though not anything mind-\nblowing just yet.  \n  \nWe'll be sure to play around with the improved wide aperture mode and further\ndepth sensing features for our full review, plus there's the Portrait mode\nthat we can't fully judge just yet.  \n  \nThere's also an 8MP front camera for your selfies. This comes with a few modes\nfor you to play around with and there's a depth of field feature here too. In\nour time with the phone, the front-facing camera captured some really good\nselfies in ambient lighting conditions  \n  \n\\--------------------------------------------  \nAndroid,Software,Perfomance and More...🎀  \n\\--------------------------------------------  \n  \nThe Honor 7X runs on Android 7.0 Nougat under the company’s custom EMUI\n(Emotion UI) 5.1. Currently, there’s no information available if the\nsmartphone will get an upgrade to Android 8.0 Oreo, which is a big deal for a\nphone that's launched almost 6 months after the Oreo release.  \n  \nSome of the latest features in Android such as multi-window support and the\nability to directly reply to texts and emails within the notification bar are\nalready present in this build of the EMUI 5.1, which are very beneficial in a\ngeneral use case.  \n  \nAfter going through the setup, users will be greeted by the homescreen which\nhouses all the apps in the phone. Now, I am not a great fan of this kind of\nhomescreen setup and thankfully, there is an option to enable the app drawer\nwhich opens up to a single page of apps users can scroll through.  \n  \nPre-loaded apps such as Emergency will allow users to set up call and SMS\nalerts. Huawei Health will monitor all kinds of dynamic activities such as\nwalking running, speed and other data that will be helpful for people looking\nto keep a track of their fitness. HiCare is another app that comes default\nwith the Honor 7X and is essentially a support system that lets a user\ninteract directly with the support in case of issues with the phone. Users can\nalso register their phone for warranty and early beta updates.  \n  \nHonor also provides a Phone Manager app with its smartphones that performs\ncleanup of cache, monitors mobile data, allows user to block phone numbers,\nscans for viruses, allows modification of permissions among other things.  \n  \nIn our usage of the Honor 7X, the EMUI 5.1 works pretty well. It was fluid and\ndidn’t lag during our use. Interaction with the 7X went as smoothly as you'd\nexpect from a good mid-range smartphone these days.  \n  \nThe big 18:9 aspect ratio display on the Honor 7X makes it an apt smartphone\nto consume media on. Be it movies, videos or songs, the visual experience on\nthe 7X is amazing, to say the least.  \n  \nConsidering its price, the screen renders some really vivid and crisp pictures\nwhich makes this a great phone to watch videos on. There is infact a video\nplayer on the 7X which can play all kinds of videos on the phone.  \n  \nOn the other hand, the speaker on the smartphone isn’t something that we\nlooked forward to. The audio output is average and one can use it\noccasionally. An issue which we faced a lot many times was the speaker being\ncovered with our hand when watching a video.  \n  \nOf course, with the retention of 3.5mm jack, one can always plug in a\nheadphone or earphone and can even go a step ahead and pair the phone with a\nBluetooth headset.  \n  \nIn our usage during gaming on the Honor 7X, we didn’t face any problem.\nAlthough once we started playing high-end games which demand solid graphic\nprowess, the phone did stutter and struggled to render graphics.  \n  \nThat said, you’ll be able to play a lot of popular, fewer graphics-intensive\ngames on the Honor 7X without experiencing any problems.  \n  \nKirin 659 processor performs well throughout a day  \n4GB RAM and 32GB/64GB internal storage  \n  \nThe Honor 7X is powered by the company’s own HiSilicon Kirin 659 octa-core\nchipset, paired with 4GB of RAM which takes most of the load easily but we\nfound it was able to cope with everything we wanted to do on a daily basis.  \n  \nOn Geekbench 4, the Honor 7X scored 3579 which is an improvement on the score\nof 3,105 that the Honor 6X achieved.  \n  \nWhile the smartphone performs well normal usage, aggressive users may observe\nslow loading time while opening, closing or switching apps.  \n  \nUsers can also choose between 32GB and 64GB onboard storage wherein 12.5GB is\ntaken up by the OS. Other than that, Honor 7X comes with a number of\npreinstalled apps that we think most users wouldn't need. Games like Asphalt\nNitro, Bubble Bash 3, Danger Dash, Modern Combat 4 Zero Hour and Spider-Man:\nUltimate Power all come as a demo on the Honor 7X with an option to purchase\nthe game. Apart from gaming enthusiasts, these apps are worthless for the\nnormal user. Other website shortcuts like the Hi Honor, Honor and Honor\nCommunity are also present disguised as apps. UC Browser and UC News also come\npreinstalled on the 7X. Thankfully though, all of these apps can be\nuninstalled but it spoils the first impression of the phone.  \n  \nOverall, the performance of the Honor 7X didn’t let us down in any way and was\nable to churn most of the things we threw at it. It manages to keep a balance\nbetween performance and efficiency which is what we liked about it.  \n  \n\\-----------------  \nVERDICT🎀  \n\\------------------  \n  \nIn a price segment dominated by the likes of Xiaomi Redmi Note 5/pro, Mi A1\nand Moto G5, the Honor 7X stands firmly with its large display packed inside a\nslim metal build. Still, if you want the best camera then Mi A1 is still ahead\nin the race, and similarly, Redmi Note 5 pro is a better option if you need a\nbig battery with solid mid-range hardware and a better camera.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 January 2018", "on 4 January 2018", "on 12 February 2018", "on 15 December 2017", "on 10 December 2017", "on 11 December 2017", "on 11 December 2017", "on 28 December 2017", "on 5 March 2018", "on 24 February 2018"], "reviewer": ["Eklavya19", "Kunalsingh156@amazon", "Vinay Arora", "Ritesh Yadav", "ravindra", "Amit Sharma", "Brando", "Ashish Kumar", "Avik Pandit", "Rashmita Dutta🎀❤"]}
]