[
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Go for it with out thinking :-)", "Charging slot issues with product received", "Awesome phone But amazon should improve their packing", "Heats Up.", "Awesome... very Nice", "I think my iPhone which I bought from you is ...", "Very nice.. Satisfied with the product", "Three Stars", "Product was delivered with misplaced front camera, unresponsive touch ...", "... thanks to seller Rocket Kommerce LLP for such a great deal! & amazon for perfect timely delivery"], "review": ["This is my first iPhone and I found the right one on right platform like\nAmazon,Thanks to Amazon for one-day delivery. Mobile is awesome ,everything\nlooks good so far.\n\n", "Product looks good, but am facing problems in connecting to charger.after\ninserting and removing 4 times only it’s detecting It. Mostly problem with pin\nslot it acting same with other chargers as well.i got 1A charger so it is\ntaking time for full charge\n\n", "Awesome phone  \nBut amazon should improve their packing quality\n\n", "Phone worked good for few months after which it started to heat up randomly. I\nhave yet to take it to service center as we dont have one in our city. Except\nfor heating issue, it wotks fine.\n\n", "As i am first time user of iphone. I have order iphone first time through\nonline amazon and i have got very genuine and nice phone. Its all good phone\nis new headphone is good and everything is nice... i would like to say thanks\nto amazon.. its really trust worthy\n\n", "I think my iPhone which I bought from you is a defected piece. The battery\ngoes from 100-0 in just 4 to 5 hours. I'm so fed up of it.\n\n", "Very nice. . Satisfied with the product. Phone runs very smooth .. Iphone is\namazing :-)\n\n", "Hangs more often\n\n", "Product was delivered with misplaced front camera, unresponsive touch screen.\nAfter submitting to service centre they confirmed that the product had\nmanufacturing defects. I suspect that the used phone was delivered. I need a\nreplacement\n\n", "First of all thanks to seller Rocket Kommerce LLP  \nfor such a great deal ! & amazon for perfect timely delivery!  \nabout iphone 6 everything is good !👍🏻\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 August 2017", "on 15 October 2017", "on 23 August 2017", "on 13 March 2018", "on 16 August 2017", "on 26 December 2017", "on 16 August 2017", "on 3 August 2017", "on 9 November 2017", "on 10 October 2017"], "reviewer": ["Amazon Customer", "nari84", "Amazon Customer", "wakeupproject03", "Sushant.Dubey", "sujil", "Amazon Customer", "Amazon Customer", "isha naik", "jayesh Vitthal Katke"]},
{"rating": ["1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Screen clicks at the bottom corner.", "Not that great", "All Good", "Original unused product", "Using it, gets slightly hot at times (just as ...", "One Star", "Bill received is unreadable", "Worst experience", "Awesome phone", "Damage product & Very bad service"], "review": ["Received a defective phone (screen clicks at the bottom corner).Requested for\na replacement and received the replacement very quickly but the new phone also\nhas the same problem but very slightly.Seems like the seller is dispatching\nall the refurbished phones in the name of sale.  \nNote: The same thing happened with one of my colleagues also.  \nSo please be aware and check thoroughly once you receive the delivery.\n\n", "No issue with the quality from Amazon.  \n  \nThis phone is known for not getting hang but even having not much apps\ninstalled or open the phone was hanging from the beginning and now the new iOS\n11 is a failurer most of the iPhone users are facing several issues specially\nthose having iphone6...the call drops suddenly[not network issue at all],\nBluetooth and Wi-Fi turns on anytime, sometimes hang and the new control\ncentre looks very bad\n\n", "Due to Amazon Deal, I got Iphone 6 into my hand whether before it was dream to\nme.  \nThanks Amazon\n\n", "Original unused product, I have checked in apple website for the date of\npurchase and I found it is very new.\n\n", "Using it, gets slightly hot at times (just as I read on other comments) but\nthats a normal problem with phones these days, nothing abnormal, I wouldn't\nleave too many apps on. Functioning and as a new piece should be, thanks.\n\n", "I has scratches. And charging wire was damaged\n\n", "I have received mobile today . The bill is not visible at all. I want a fresh\nbill. Kindly arrange to send a bill copy which is readable\n\n", "I want to replace this phone because it is having heating issue, it gets heat\non call everyone. There is blurring while capturing the pic. Volume is also\nnot clear while playing music. So I want to replace it or please refund my\nmoney\n\n", "Amazon has cheated royally I got used product bought it September 22 2017 but\nwhen I checked warranty it’s activated from July didn’t expected this from\namazon\n\n", "I purchase I phone 6 32GB silent button not working & Amazon service is very\nbad my last purchasing product from this side\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 October 2017", "on 2 November 2017", "on 22 September 2017", "on 21 November 2017", "on 21 November 2017", "on 12 July 2017", "on 14 August 2017", "on 20 August 2017", "on 6 December 2017", "on 17 August 2017"], "reviewer": ["avinash", "Siddharth", "Gagan Sharma", "SONU JOHNSON", "Abhinav Singh Bisht", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Shashi Kumar K", "sanjay dhanjal"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["One Star", "... for Last 10 days and found the product very good, Especially battery life is great as per iPhone ...", "Awaysome Smartphone!", "in just 20990/- iPhone 6 32gb", "Very nice packing and timely delivered", "network issue.", "Best packing and The good delivery, Excellent delivery from E-mobiles", "Never Expected!!!", "The packing was horrible. Very bad experience with Amazon", "seems like battery issue"], "review": ["PRODUCT IS DELIVERED DEFECTIVE JUST IN 2MONTHS STOPPED WORKING PHONE IS\nHEATING\n\n", "Using this phone for Last 10 days and found the product very good, Especially\nbattery life is great as per iPhone performance. RAM has given only 1GB but it\nis sufficient, the camera is also good and overall Performance is good. I was\nconfused before buying iPhone 6 in 2018 but now I am Satisfied and happy with\nthe phone.\n\n", "Iphone does not require any feedback. Its always on the top.  \nReceived the phone in excellent packing with gr8 discount!!  \nManufacture in September 2017!\n\n", "Nice smartphone in just 20990/- unbelievable price, thanks to Amazon and great\nIndian sale also, i want to take chance with iPhone before this i m using\nandroid, now i got in price...\n\n", "I bought 2 phones, one for self and one for my wife. Phone is very nice and\nfits very well in the pocket, nice camera and does not hang. Very nice packing\nand timely delivered. Bought in Aug'17 during Independence day sale. Thanks\nAmazon.\n\n", "iphone 6 is over all good but i m facing a countinues network issue...having a\nconnectivty problem I done with reset n all setting Then too i m countiously\nfacing a problem.\n\n", "First of all its best in class  \nRest its iphone don't need a review  \nAny way go for it\n\n", "The iPhone 6 which I ordered worked well for 20 days and after that it used to\npower off on it's own many times a day. Got the phone replaced with a new one\nfrom my nearest Apple Inc. service centre. Amazon did not play any role in\nreplacement.\n\n", "Product is ok but not up to the mark. The touch id is not working properly n\nalso the screen is little bit loos. The packing was horrible. Very bad\nexperience with Amazon.\n\n", "This phone has so many problems after usING for 6 months.  \nJust watch a video for 5 min..phone becums so hot, seems like battery issue.  \nWhen I receive any call I am not able hear anything.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 September 2017", "on 27 February 2018", "on 26 September 2017", "on 7 November 2017", "on 8 January 2018", "on 18 August 2017", "on 28 September 2017", "on 15 August 2017", "on 20 August 2017", "on 12 June 2017"], "reviewer": ["ASHOK KUMAR AGRAWAL", "C L Chandrakar", "Jigar", "krunal modi", "R P.", "Amazon customer", "Prem kxj", "Pratik Deb", "Amazon Customer", "Denzil Felix"]},
{"rating": ["3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["the battery is not good. need to be charged 2 times in a ...", "Excellent Product", "Five Stars", "Defect Peace", "Very good delivery and always a great phone", "Good experience so far😊", "Worst Experience just in 1 Month of Purchase.", "Frankly Speaking the Packing was not Good Enough. Phone is getting hot while talking or ...", "Too much heating, keeps hanging", "Good phone for a very good price"], "review": ["the battery is not good. need to be charged 2 times in a day even not using\nwifi or mobile data all the time.\n\n", "I have been using this phone for the past 2 months and it has been great. We\nstill have to work on camera settings, but otherwise a great buy. Good battery\nbackup.\n\n", "It was good decision not to buy this now it’s price dropped by 8k\n\n", "I got this phn on 27th august....after 10 dys of purchase...frequently the\nphone used to stuck....and den frequent switch off and now my phone is\ncompletely switched off and am not able to switch it on.  \n  \nI got this phone for 21,999...this doesnt mean that amazon can provide a\ndefect peace....Am not at all happy with Amazon did....\n\n", "Got for 18000 thanks for sale amazon .\n\n", "Although its not been a month since i bought iphone 6, but i am satisfied with\nthe product. I got a good deal and bought it for 21000₹ with 1500 cashback.\nThe only issue is that the cashback is not yet credited ☹️\n\n", "Worst Experience So far. My First i-phone and loss touch screen without any\ndamage. Wanted to return this. Can't expect this from worlds leading mobile\nCompany. Don't know how is it possible. Very much Disappointed. Quality\nchecking is worst than china companies.  \n  \nNow have to waste my time with Service center and calls.\n\n", "Frankly Speaking the Packing was not Good Enough. Phone is getting hot while\ntalking or watching videos. Facing problem with the screen and home button.\nAmazon is not taking any interest to solve the issues.\n\n", "Too much heating, keeps hanging and this performance not expected from iPhone\n\n", "Good phone for a very good price.. Camera is a bit lacking on low light.. but\nthis phone is much better than those Chinese spin offs!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 September 2017", "on 7 August 2017", "on 2 October 2017", "on 29 October 2017", "on 16 January 2018", "on 7 October 2017", "on 29 September 2017", "on 28 October 2017", "on 8 March 2018", "on 4 November 2017"], "reviewer": ["Gaurav Srivastava", "Rekha Rajagopal", "ravi yadav", "Archana", "Pradeep", "Priyanka", "Amazon Customer", "Amazon Customer", "Antoine Raj", "Rahul Rungta"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Ofcourse you buy it- if you are interested and well funded. its apple and worth to buy.", "Bad packaging but good product", "... a Repaired item not a new item so I recommended to all customer don't purchage any item by azamazone", "Happy as it’s in my budget", "Damage", "... i purchased first time with Amazon and it was bad experience.", "Mobile is good. Initially some issues were there", "Four Stars", "Bad battery in a new iPhone 6.", "Hi i bought this product a month back but i ..."], "review": ["Nicely packed, and well dilivred.  \n  \nProduct is just as its brand name. No more lines needed to discribe when it\ncomes to brand like this.\n\n", "Awesome phone I just love it but the packaging is not strong .\n\n", "Its a Repaired item not a new item so I recommended to all customer don't\npurchage any item by azamazone.  \nAzamazone soled old item.\n\n", "Phone is okay when you can’t spend money on iPhone X but I hope Apple does not\nslow my phone down once I update it\n\n", "Head phone port is not working. I have to return it\n\n", "i purchased this phone starting 1 week it was working properly  \nafter that it was started heating and battery drain problem  \ni purchased first time with Amazon and it was bad experience.  \neven the charger is also getting heat\n\n", "Mobile is good. Initially some issues were there. Ringtone changed suddenly\nlike a bad microphone sound. I switched it off & henceforth it is ok till\ndate.  \n  \nOverall experience Good. Thumbs up to Apple and Amazon for quick & smooth\ndelivery😊\n\n", "It's good\n\n", "While i purchased a new phone, it’s battery is getting drained very quickly.\nNot sure if it’s a new piece. We have another iphone6 which is over 2 years\nold and it’s battery lasts longer than this new phone. I’m feeling cheated.!!!\n\n", "Hi i bought this product a month back but i am getting problem in touch\nsurface it is not working well i go and touch aome app it will open some other\napp , sonething weird happeing . Is it possible to replace the product or let\nme know what j can do\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 February 2018", "on 14 November 2017", "on 14 October 2017", "on 5 January 2018", "on 28 July 2017", "on 15 January 2018", "on 25 September 2017", "on 1 October 2017", "on 13 January 2018", "on 4 November 2017"], "reviewer": ["Ghanshyam", "Kittu", "satish", "kanika singh", "POORNIMA", "Suhab", "Amazon Customer", "Amazon Customer", "Amazon Customer", "gaurav"]},
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["iPhone 6(32GB), during normal operation, it's heating up ...", "Very much Smart..", "The call quality is excellent. I was a MI customer (Redmi 1S", "My wife of 50 years, who has recently developed ...", "Excellent as usual", "Awesome Product.... Loooooooooooooooooooooved it... !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Flagship of 2014 is still a flagship", "Please don't buy iPhone from amazon. Buy iPhone from ...", "Amazon is best but battery back up not upto that mark.", "Defective handset"], "review": ["iPhone 6(32GB) , during normal operation, it's heating up. Battery performance\nwith 50% brightness is also not as per expectation. Overall not meeting the\nApple expectation. While comparing with Mi phone with apple, Apple is heating\nup immediately, I don't know may be it is unique case.\n\n", "Very much Smart.... touch is superb, very handy, light in weight, no struck /\nslow problem...  \n  \nMay be slightly uneasy initially for the users who are using android earlier.\n\n", "It has been 2 weeks now. The call quality is excellent. I was a MI customer\n(Redmi 1S, Note 4) for many years. I used to face call drops always, low\nsignal issue. Once I started using Iphone 6, I could see the difference. The\nconditions are same before and now.\n\n", "My wife of 50 years, who has recently developed interest for mobile phones, is\nectasic to receive this. ! appreciate your promptness.\n\n", "Excellent as usual . . . Apple phones don't really require reviews with its\nhigh brand value . . . they cost high but give you features to match. It\nreally is a trade off.\n\n", "Got it within 2 days (I'm not a Prime member.. but i got it within 2 days)...  \nThank you so much Amazon for this express delivery of iPhone 6...  \nExcellent Product...  \n* No Complaints.. everything works fine...  \n* I got this of a price 20,999  \n* Excellent package...  \n* 100% satisfied..\n\n", "Awesome product .  \nBlazing fast even after 10.3.3 updation .  \nExcellent quality in both hardware and software.  \nCamera is pretty good for a 3 year old device and couldn't make up with 2017\nflagship phones.  \nMore over it's gonna have software up date till ios 12 is damm sure.\n\n", "Please don't buy iPhone from amazon. Buy iPhone from showroom or Flipkart. I\ngot a defective product and it was not replaced. There was problem with audio\n,speaker and picture quality. I was trying for return or replacement. As per\nAmazon's policy iPhone could not be returned in case when defect encountered.\n\n", "This is my first iphone and I m very excited to buy this product. The only\nthing that makes me disappointed that battery back up. It drains very quick. I\ncharge it many times a day. Full charged last for 4 hurs of app usage only. I\nm not sure if I should show it to Apple Service Center.\n\n", "Headphones jack is not working in brand new hand set what a piece of crape you\nguys sell me and I'm not in India for upcoming weeks so i can't exchange\neither its such a irresponsible job you guys done .\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 September 2017", "on 30 August 2017", "on 19 August 2017", "on 20 July 2017", "on 14 December 2017", "on 25 September 2017", "on 23 August 2017", "on 29 September 2017", "on 13 October 2017", "on 2 September 2017"], "reviewer": ["Dharmendra Patel", "Amazon Customer", "Amazon Customer", "Ajoy Bhattacharjya", "Amazon Customer", "Akhil Gopi", "jose john", "archana", "Arbind C.", "divesh goel"]},
{"rating": ["2.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Battery Issues remain even in new devices. Slow processor. Avoid till it resolves. Don’t get carried away with low prices", "This phone is refurbished", "within 7 days of buying the phone, I faced ...", "thnks & regards Austin HAPPY NEW YEAR", "Loose screen from day it arrived - continues to work though", "Excellent piece of phone", "Go for it", "I choose this IPhone because the less problems and good life, I got Phone on last week but ...", "I purchased this mobile 14 days ago. But I ...", "One Star"], "review": ["Apple killed 7 years of loyalty with their worst ever battery issue, device\nheating and slow performance. This issue is common in almost alll Apple phones\nexcept iPhone X. Time to say good bye to Apple phones. Samsung, MI doing a\nmuch better job in far economical prices.\n\n", "This mobile phone is refurbish volume & silent vibration button is loose. Not\nsatisfied\n\n", "within 7 days of buying the phone, I faced network problem in the device.\nNetwork bar was showing searching. I had to give the device to service center\nbut its 12 days I didn't get back my device\n\n", "The phone received, malfunctions often just as a customer review check the\nproduct before delivery.  \n  \nthnks & regards  \nAustin  \n  \nHAPPY NEW YEAR\n\n", "I love the iphone. I dropped my original phone way too many times and ordered\nthis one. While the phone works as well as expected, the phone has loose\nscreen from the day it arrived. I have also noticed that it heats up quite\noften.\n\n", "Excellent piece of phone, latest December 2017 import. Could set up from\nI-Cloud within 30 minutes. That's Apple technology at its best.\n\n", "Deliveed on Time. Its been three months now. Working nicely. No lag. Good\nprice for 32 GB variant. Only problem is battery is dropping little fatser\nthan before after upgrading to ios 11.1...will have to wait till next upgrade  \nOverall great service and product.\n\n", "I choose this IPhone because the less problems and good life , I got Phone on\nlast week but am facing issue with less volume on calls. Its very low am not\nable to listen too .. Worst Experience .\n\n", "I purchased this mobile 14 days ago. But I don't know why am I getting heat\nwhile charging and while using mobile. I need to get immediate response from\nthe seller. I am going to return the product now\n\n", "Not functioning properly\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 January 2018", "on 24 September 2017", "on 18 September 2017", "on 1 January 2018", "on 9 October 2017", "on 15 January 2018", "on 14 November 2017", "on 23 August 2017", "on 24 August 2017", "on 19 September 2017"], "reviewer": ["Rakesh", "gaurav", "Amazon Customer", "austin", "Abhijit Kolhatkar", "Hemant Joshi", "Abhijit Kadam", "Venugopal", "balu", "pruddvii"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["The best product! Initially I was surprisingly saw the offer ...", "Good not great in 2017", "Two Stars", "Good mobile at this price", "... and in 2 months it started to hang totally like display goes black and it does not respone on ...", "Value of money in 20k", "Hangs a lot, so many problems", "worst phone ever got hanged from the day i receive", "Just Okay", "Very bad"], "review": ["The best product! Initially I was surprisingly saw the offer and thought it\nmight be inferiors product they might hv sale because of prices,but Amazon\ncompletely change my thoughts.  \nAwesome product 5+stars for product/Amazon offers.\n\n", "Buying a product that has been released in 2014 in 2017 doesn't make much\nsense... At this price point you can go for many feature rich Android phones\nand if screen size isn't an issue, then iPhone 5SE is a wise choice as it has\nmany features of 6s. BUT if you are looking for the prestigious apple\nbranding, screen size, the reliability of ios, updates for at least another\n2-3 years at a pocket friendly price.. then 6 is a wise choice... (Strongly\nrecommended to go for 32GB or 64GB variant)\n\n", "Bought it just less than a month, but Siri now not working, ppl avoid buying\nonline\n\n", "New Mobile.  \nBest price.  \nHappy with the product.  \nThe mobile works very well. Looks cool.  \nORIGINAL PRODUCT.\n\n", "I had buy this phone and in 2 months it started to hang totally like display\ngoes black and it does not respone on any key than after 2-3 hours it start\nand many times it hangs and I have to restart it again n again.\n\n", "PROS-  \n1- BUILD QUALITY 8/10  \n2- DISPLAY 7/10  \n3- BATTERY 8/10  \n4- CAMERA 8/10  \n5- SOUND 9/10  \n6- NETWORK 9/10  \n7- CALL QUALITY 9/10  \n8- CHARGING 8/10  \n9- STORAGE 6/10  \n10- FIGER PRINT SENSOR 7/10\n\n", "There are so many problems with this phone. It hangs a lot and apps keep\ncrashing. This is new phone and it keeps freezing. Today the screen was stuck\nat one point for more than one hour and I could not do anything. Really\npathetic product from Apple\n\n", "worst phone ever got hanged from the day i receive. no action is also taken by\namazon they are denying to replace the product .\n\n", "I am using this product since 4 days and the issue which is encountered is\nonly the call volume very low. I have to concentrate on my ears to hear what\nthe other person is saying. Otherwise, the product is good so far. I think\nI'll have to contact the seller for rectification. Nice phone. Just don't know\nwhether it's worth the money as it varies from person to person\n\n", "I have some issues with iPhone it’s hanging and I have found hearing issues\nand after fully charged its only working for 6 hours. After 6hours 3% or 5%\nwill be there pls don’t buy this phone in Amazon buy in to avoid such problems\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 September 2017", "on 5 October 2017", "on 20 August 2017", "on 10 March 2018", "on 1 December 2017", "on 14 October 2017", "on 15 August 2017", "on 5 October 2017", "on 17 August 2017", "on 9 October 2017"], "reviewer": ["Sunny", "Jeevan L.", "Kiransajjan", "Yuva kiran", "mahendra kumar bagariya", "Himesh", "Saurabh", "Amit", "Vignesh", "Rana"]},
{"rating": ["2.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["SAD EXPERIENCE. REMEMBER IT IS ONLY 28 GB AND NOT 32GB", "Worked good only for a week", "I like the product however after using for a few days ...", "Five Stars", "iPhone 6 ( A decent phone )", "Iphone at its best", "Looks like a refurbished product as I found lot of other ...", "Highly Satisfied.", "Worth of Money", "I am very happy with the phone"], "review": ["I bought iPhone 6 in the sale this month. From delivery to the product, using\nit has been a sad state of affairs.  \nTo start with the capacity is only 28GB and not 32GB out of which more than\n6GB are used because of built in apps. So effectively you get 22GB and not 32\nGB.  \nThe phone quality is also not what I expected being an iPhone user  \nThe touch sometimes stops working and there is a problem with the signal as\nwell which is perfect in my iPhone 5.  \nTried to initiate return but it didn’t accept.  \nI hope amazon can look into it.\n\n", "Bought it in Amazon sale, got a defective product. Worked good only for a\nweek, started giving trouble in the second week only.  \nIt takes more than 1 min to connect to any number, such a slow crap device.  \nAmazon service not happy - they say return window got closed on 10th day of\npurchase. Now i've to run behind apple service centres...\n\n", "I like the product however after using for a few days I noticed that the\nbattery drains out rapidly, I found it little strange as I have been using the\nit's predecessor for quite a long time and initially it's battery life was\ngood and later it's gone worse after a usage of about 2 years However I just\nbought an iPhone 6 and I am really disappointed with the battery life.\n\n", "Awesome product.. working awesome..got product yesterday...it's absolutely\noriginal product and covers 1year full warranty. Thankyou amzone 😊\n\n", "I got the apple iPhone 6 for my dad. He has been using this phone for a few\nmonths now and he absolutely loved the experience with it. iOS has always been\na great operating system and iPhone 6 is no slouch.\n\n", "Good phone. bought it in amazon festival sale 3 days back. delivery is prompt.\nmanufactured in September 2017. low price of 20999+ cashback.  \n  \nso far phone is good without any issues.\n\n", "Looks like a refurbished product as I found lot of other numbers already in\nthe phone , I hope this isn’t repeated then I would not choose to buy and\nencourage others to do the same! Thanks\n\n", "Everything is perfect. Never expected this product to be that much good .\nActually , it breaks all my stereotypes regarding online product shopping via\nonline payment. Only thing lags is , my earphones might be not good but it\nsupposed to be product fault nothing to relate with online buying and\nshipment. Go for online shopping freely. Kudos.\n\n", "I am using since 1 Week, Its working Great and there no issue with the mobile\neverything is fine . Love the camera Quality & yeah IOS 11.0.2 Working smooth\non this better than any android mobile. I am Andriod user from long time. But\ni am loving IOS more.  \nCharging took around 1H30M something. Normal Use more than 1 day , Heavy use\nyou need to charge 2 times a day. I Bought it for 21k.\n\n", "Well what to mention about iphone 6. It is original product, delivered a bit\nlate but in perfectly boxed condition. I am very happy with the phone.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 October 2017", "on 5 October 2017", "on 17 October 2017", "on 25 September 2017", "on 4 March 2018", "on 26 September 2017", "on 17 November 2017", "on 17 September 2017", "on 11 October 2017", "on 6 September 2017"], "reviewer": ["Anupreet", "chakravarthy", "Prateek Prabhakar", "Tarkesh chawla", "Vishwanath Menon", "Rizwan", "Raj kumar", "Vishal Sachdeva", "Swatantra Dwivedi", "Aditya Kumar Rahangdale"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["iPhone has started to hang", "Four Stars", "Defective piece", "Good product", "Delivered on time. No hassle in setting up except ...", "Many Issues", "Got used phone instead of new", "Not a value for money", "Excellent as described!!!", "Defective product received"], "review": ["hi,  \n  \nits hardly been a month that I purchased this phone and it has started to\nhang. i have been an amazon customer for long and this has never happened\nbefore.  \n  \nkindly look into the matter at the earliest on urgent basis.\n\n", "Awesome experience with the phone so far and fast delivery from Amazon. Thank\nyou !\n\n", "Defective piece. Video recording does not have voice. Incoming call voice is\nnot audiable. Tried returning it but Amazon does not allow to return it.\n\n", "Very good product delivered within 3 days looks awesome will continue the\nreview after 1 month owner ship.\n\n", "Delivered on time. No hassle in setting up except that Wi-Fi gets disconnected\nfrequently. The apple service Centre said nothing wrong with the phone but the\nsecurity setting on the router is to be changed. Still living with this issue.\n\n", "Not sure whats wrong with this product. Many defects including not getting\nsignal proper, Charger stopped working after 7 months as soon as warranty was\nexpired. Does not not look like Apple original\n\n", "After opening the mobile could see that it's already used for 10hours\n\n", "Phone started heating up in a weeks time, network reception is an issue, gives\nheadache in less then 5mins talk time and battery life is way too less then\nSamsung or may be any other mobile. This is my first experience with iPhone\nand I thing owning Samsung is a better decision then this. Not a good\nexperience.\n\n", "Excellent as described! Thanks to seller Darshina Electronics and Amazon.in\nfor priority serviced. What to say, it's a apple. Just go and experience and\nhave fun.\n\n", "Third class service  \nIphone is defected and they r not returning it saying go to service centre\nwhich is not in my city don't purchase\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 February 2018", "on 12 October 2017", "on 3 October 2017", "on 14 August 2017", "on 16 September 2017", "on 8 March 2018", "on 13 September 2017", "on 11 February 2018", "on 16 August 2017", "on 4 October 2017"], "reviewer": ["Amazon Customer", "Happy Customer", "sunil", "Prady", "K S PRASAD KAMATH", "Amazon Customer", "Amazon Customer", "Abhishek Tiwari", "Jawahar", "ishneet Singh Khalsa"]}
]