[
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Awesome", "I am very much disappointed with the set I received", "Totally disgusting.. The pH became dead after one day ...", "Five Stars", "Five Stars", "Good", "I would also like to mention that I bought this with two-day delivery ...", "Outstanding phn.", "Five Stars", "Poor : Charger failed within 20 days"], "review": ["No words to say. ...Awesome model at lowest price of @18500 ..\n\n", "Hi All, I am very much disappointed with the set I received, I purchased it in\nlast week of september 2017, and since this first week of December 2017 its\ngetting so much pain, I dont know I have not downloaded much of apps, not even\n1 mp3 or vedio songs, then too its getting freez while using simply, I am also\nunable to pick up the call at one go, and once I press power button, then call\ngets disconnected.  \nplease AMAZON, if you can do something with my handset. As this is ust 2\nmonths and I am not supposed to get soo many issues.\n\n", "Totally disgusting.. The pH became dead after one day and amazon refused to\nchange the product as their policy with apple has changed which they did not\nmention in their website... Don't buy any apple products from amazon as they\nare not authorised to sell apple products. Apple representative told me.\n\n", "Awesome\n\n", "Perfect phone✌🏻\n\n", "It is simply awesome. I found a small defect with product. It was making \"Tik\nTik\"sound while pressing at right top and bottom corners. When i checked about\nsame with service centre. Service centre guy said sound comes with all 32GB\niPhone6 models, That could be a fitting issue.\n\n", "Reliable & Dependable seller. The phone was factory sealed and had everything\nfresh & new. It was all sealed as per Apple's guidelines and did not feel as\nif it was tampered with or re-sealed by someone, thus giving me the assurance\nthat the phone was new.  \nPhone works perfectly. No issues with it. I was hesitant to order a phone off\nof Amazon but in this case, it was worth it.  \n  \nI would also like to mention that I bought this with two-day delivery and the\ndelivery guy received the order for delivery at 6:30 PM. He still delivered\nthe phone to me despite a couple of follow up calls by me on the very same day\nat night. His level of commitment has to be admired.\n\n", "Superb mobile, mind blowing touch and camera.\n\n", "\n\n Outstanding\n\n", "I bought this product Mar 9th 2017, within 20 days my charger is not\nworking... And also I am getting weird sound from my iPhone while charging.  \nHow can I replace the charger in Bangalore?  \nPlease anybody give suggestions....\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 October 2017", "on 26 December 2017", "on 24 March 2017", "on 7 October 2017", "on 9 August 2017", "on 14 March 2017", "on 4 September 2017", "on 15 August 2017", "on 11 November 2017", "on 31 March 2017"], "reviewer": ["Kiran Kumar N", "Amazon Customer", "Amazon Customer", "Baljinder Singh", "Amazon Customer", "Thiyagu Loganathan", "Avi", "Kamal", "Biswarup das", "Jerald Regis"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Good mobile", "Worst product from amazone", "Worthless Phone Iphone 6", "32 GB version is slower than the 16 GB version", "Awesome design 10/10 superb hardware10/10 superb software", "Must buy if you want to use an apple device", "COMPLAINT", "Internet signal problem ( when phone is one 7 or ...", "I loved the product", "We are not happy this product and Change cable is not Original(i have ..."], "review": ["I've been using this phone for almost 3 weeks now, here are my observations:  \n  \nBefore getting this phone I used Samsung S5 with Andriod 7.0, I wanted to get\na new device and was looking for some nice phones that's when I came across\nthis phone and bought it.  \n  \nPhone looks awesome, I was worried about the bend gate thing but phone feels\nsolid in the hand, its too smooth, so if you are a clumsy guy/girl like me\njust get a case, I got Spigen case from amazon for 999, its premium and its\nrubbery so your phone wont slip from your hand.  \n  \nI've never used Apple so this is my first time experience with IOS and I'm\nimpressed, I've used Windows and Andriod and BB10 OS, this is my second best\nexperience, 1st is BB10  \n  \nCamera quality is good but I wouldn't say it's equal to today's flagships but\nit surely is better compared to most of the phones out there. Front camera is\nAmazing considering its only 1.2MP, it takes amazing pictures.  \n  \nBattery back up is good, I was skeptical about this as most of them complained\nbut it's going very good as of now.  \n  \nPhone is quick, no lags, no hick ups, so this proves the argument that specs\ndoesn't matter.  \n  \nCall volume and clarity is good, you can hear the other persons voice clearly\nand loudly and I got the same compliment from the other end, speaker volume is\nvery good, loud and clear.  \n  \nOverall, I'm satisfied with the product it sure is priced higher comparing the\nspecs of other phones but I would say the experience is worth it and specs\ndoesn't define the phones performance.\n\n", "Worst product, and seems cheep and copied.. some time i cant even recive calls\nand use mobile cos it just hang, i have to wait till its battery goes off, to\nuse this mobile, other wise i cant make call, cant use any app its just\nstuck..\n\n", "Most worthless ph i have ever isued in my life. Battery quality is so so so\npoor, heating problem is also there further charging will take so much of\ntime. And main problem is that Amazon is not taking any resposibility for\nthat. I'm too much upset for that, i think the problem has occurred due to the\nuppur verson has already launched by Apple comp and they should stop selling\nIphone 6 on immediate basis and request to Amazon not to sale those ph which\nhad already two upper verson has release by the comp and give value their\ncustomers who are purchased product with their very hardearn money. So I would\nrequest all the buyer's or any person who interest to take this ph pls not to\nbuy this or those which has already upper version has released.\n\n", "Well, this might sound a bit weird, but the 32 GB version is noticeably slower\nthan the 16 GB version ! I had been using the 16 GB version of iPhone 6 since\na year and the less capacity of 16 GB made my phone memory full most of the\ntime. Thats when apple released the 32 GB version for around 28k and I was\nattracted to that. I gave off my 16 GB iPhone to my mother and I started using\nthe 32 GB one. Its been around 7 months of using the new 32 GB iphone, but one\nthing i found out was my old 16 GB version is much faster that than 32 GB\nversion ! The difference is easily noticeable when I use my new 32 GB and my\nold 16 GB phone back to back. The 16 GB one opens the apps very fast and is\nvery quick to respond. But my new 32 GB phone has a lag when opening apps and\nswitching apps. I thought this was an issue with my specific phone. Last month\nmy wife also bought a 32 GB gold iphone 6 and it also is slower. I think apple\nhas made some compromises in the hardware to bring the cost down in the new 32\nGB versions. Im disappointed with this.\n\n", "First of all I have to say thankyou Amazon India.  \nAwesome design 10/10  \nsuperb hardware10/10  \nsuperb software,no lagging10/10  \ncamera quality is so good even in low light 9/10  \nBattery is ok for day to day use.9/10  \nEarphone quality is 10/10  \nSpeker is loud10/10  \nno fast charging but not to worry  \nIts really fast 9/10  \nNo sim issues for Jio  \nTrust me Go for it.\n\n", "If you like android then go for one plus 3 I hated android so went with this\nand never ever in my life I am going for android again APPLE is the best and\nawesome performance and some unusual things ie it has the best vibrator\nmotor,external speaker,internal speaker and feels pretty awesome in the hand\nthe only negative is the battery but if you just turn down the brightness and\nyou can easily last a full day . And although it has no fast charger mine\nactually charged from zero to 100 in one and half hours some sample photos are\nattached\n\n", "The product I have received from you has got a complaint . The screen is not\nfixed properly . So I need a refund.\n\n", "Internet signal problem  \n( when phone is one 7 or 10 hours after that  \nAutomatic internet is off but Internet data is on  \nWhen I restart the phone then problem is solved)  \nHi team if possible please help here  \nOtherwise I going on social site\n\n", "I love the product. Initially I was apprehensive regarding its authenticity\nbut I checked on Apple Website and its 100% genuine product. Bought this phone\nfor my official purpose and very much happy with the performance.\n\n", "We are not happy this product and Change cable is not Original(i have visited\nApple Service center for replace they to told this cable is not original)\nwhich is also not worked for week and also i am share the Cable photo for ref.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 April 2017", "on 15 November 2017", "on 23 June 2017", "on 20 November 2017", "on 5 September 2017", "on 6 April 2017", "on 13 February 2018", "on 28 October 2017", "on 14 March 2017", "on 11 November 2017"], "reviewer": ["Suresh", "Rathore", "Amazon Customer", "anand", "Iqbal Afzal", "Vijayan", "9446362793", "virendra prajapati", "Manish Pratap Singh Chandel", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Amazon never failed to impress me!!", "Replacement of earphones", "Good experience", "... afford an iphone but writing this review just to waste readers time", "I'm an amateur photographer and was looking for a phone with a great camera within 25k budget", "iPhone with Half Screen !!", "\" TIK TIK SOUND\" BECOMING A COMMON ISSUE... I'M HAVING IT AND SO DO MANY OTHERS....OPTED FOR REPLACEMENT", "Five Stars", "Five Stars", "worst seller and worst amazon"], "review": ["Awesome product!!I bought more than 30 products from Amazon and I never had a\nsingle issue.Iphone 6 is just lit.Very slim and light weight.\n\n", "The earphones are not working..i need its replacement\n\n", "Received today  \nAmazon Packaging good  \nProduct packaging good  \nImport date July 2017  \niOS 9 (update to 11.0)  \nModem firmware 6.17.0 ( don’t know it is not 8.x.x\n\n", "I cant afford an iphone but writing this review just to waste readers time.\nHaha\n\n", "I bought this only for the camera. I'm an amateur photographer and was looking\nfor a phone with a great camera within 25k budget. This fit very perfectly.\nThe biggest disadvantage, in my opinion, is not having complete control of how\nto backup the photos. iCloud is not in the same league as Google Photos. Even\noffline, all photos get saved to one giant iPhoto Library and I'm still\nfiguring out a good backup strategy to backup individual photos as JPEGs.\n\n", "Some times iPhone shows half screen. I don't know is that the quality of an\napple product or is it because of the delear who are supplying a sub standard\nproduct ..\n\n", "I'm awaiting a replacement cuz \" I AM ALSO HAVING THE CLICKY THING OVER THE\nTOP RIGHT CORNER OF THE PHONE AND I CALLED APPLE SERVICE CENTRE AND THEY TOLD\nITS CUZ OF IMPROPER FIT AND FINISH OF THE SCREEN \" I believe amazon will send\nme a good piece as replacement.  \nThe clicky effects become more when the phone gets warm.. like in charging or\nwhile using 4g data or gaming.....  \n* for ref. I got the item on 14th and I'm writing this 2 days after a close watch.  \nOtherthan this Tik Tik issue.... the phone is good.  \nI dont want u to hold back in buying this item....its a good package for the\nprice.  \nBut pls keep this issue in mind  \nHappy shopping !!!!!\n\n", "awesome camera u can ho for it blindly,,,,,😘😘\n\n", "It is a great phone. Very user friendly.\n\n", "I received the cell on time, however , it didn't work even for a day. Could\nuse it only for 5-7hrs and then it got locked even I was entering the right\npassword which I had written as well.  \nAmazingly, the same password was working for 5-7 hrs however after that it got\nmy phone locked and it didn't recognize my finger shot as well.had to stay\nwithout phone 8 days then I got the phone back today, however, when i was\ngiven the phone for checking then you know what happened? touch was worst than\nany of the smart phones in the market. i would say local phones would have a\nbetter touch.  \nI had ordered this phone to gift my sister on her birthday. what an awful\nexperience it was for me and embarrassing as well.  \ni also had to give my sister then 20000 Rs cash.  \nThe worst thing happened to me in all these years.  \nWorst seller and worst amazon.  \nNeed compensation as now am without phone for past 8 days and would have to be\nlike this for next two weeks as deepawali is coming and centres would be\nclosed.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 October 2017", "on 19 December 2017", "on 23 September 2017", "on 9 August 2017", "on 22 September 2017", "on 26 August 2017", "on 15 March 2017", "on 4 December 2017", "on 3 December 2017", "on 5 October 2017"], "reviewer": ["Raju", "Bhatt zubair", "Vidyut", "Amazon Customer", "Prabhu Ravichandran", "Amazon Customer", "vishnu.c.r", "Amazon Customer", "Amazon Customer", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Perfect phone", "Iphone 6 damage", "A Must Buy If you are an Apple user ! [ Detailed Review ]", "Today I ordered my product but when I open the ...", "Phone hanged on language select option", "20% cashback", "Very bad product", "Duplicate I phone 6 pasted on the name of shopping festival", "Iphone 6 review", "Excellent product and excellent delivery speed.."], "review": ["Before buying the phone kindly check the specifications here:  \n  \nNETWORK  \nTechnology  \nGSM / CDMA / HSPA / EVDO / LTE  \n2G bands GSM 850 / 900 / 1800 / 1900 - A1549 (GSM), A1549 (CDMA), A1586  \nCDMA 800 / 1700 / 1900 / 2100 - A1549 (CDMA), A1586  \n3G bands HSDPA 850 / 900 / 1700 / 1900 / 2100 - A1549 (GSM), A1549 (CDMA),\nA1586  \nCDMA2000 1xEV-DO - A1549 (CDMA), A1586  \nTD-SCDMA - A1586  \n4G bands LTE band 1(2100), 2(1900), 3(1800), 4(1700/2100), 5(850), 7(2600),\n8(900), 13(700), 17(700), 18(800), 19(800), 20(800), 25(1900), 26(850),\n28(700), 29(700) - A1549 GSM, A1549 CDMA  \nLTE band 1(2100), 2(1900), 3(1800), 4(1700/2100), 5(850), 7(2600), 8(900),\n13(700), 17(700), 18(800), 19(800), 20(800), 25(1900), 26(850), 28(700),\n29(700), 38(2600), 39(1900), 40(2300), 41(2500) - A1586  \nSpeed HSPA 42.2/5.76 Mbps, LTE-A Cat4 150/50 Mbps, EV-DO Rev.A 3.1 Mbps  \nGPRS Yes  \nEDGE Yes  \nLAUNCH  \nAnnounced 2014, September  \nStatus Available. Released 2014, September  \nBODY  \nDimensions 138.1 x 67 x 6.9 mm (5.44 x 2.64 x 0.27 in)  \nWeight 129 g (4.55 oz)  \nSIM Nano-SIM  \n\\- Apple Pay (Visa, MasterCard, AMEX certified)  \nDISPLAY  \nType LED-backlit IPS LCD, capacitive touchscreen, 16M colors  \nSize 4.7 inches (~65.8% screen-to-body ratio)  \nResolution 750 x 1334 pixels (~326 ppi pixel density)  \nMultitouch Yes  \nProtection Ion-strengthened glass, oleophobic coating  \n\\- Display Zoom  \nPLATFORM  \nOS iOS 8, upgradable to iOS 10.3.3  \nChipset Apple A8  \nCPU Dual-core 1.4 GHz Typhoon (ARM v8-based)  \nGPU PowerVR GX6450 (quad-core graphics)  \nMEMORY  \nCard slot No  \nInternal 16/32/64/128 GB, 1 GB RAM DDR3  \nCAMERA  \nPrimary 8 MP, f/2.2, 29mm, phase detection autofocus, dual-LED (dual tone)\nflash, check quality  \nFeatures 1/3\" sensor size, 1.5 µm pixel size, touch focus, geo-tagging,\nface/smile detection, HDR (photo/panorama)  \nVideo 1080p@60fps, 720p@240fps, check quality  \nSecondary 1.2 MP, f/2.2, 31mm, 720p@30fps, face detection, HDR, FaceTime over\nWi-Fi or Cellular  \nSOUND  \nAlert types Vibration, proprietary ringtones  \nLoudspeaker Yes  \n3.5mm jack Yes  \n\\- 16-bit/44.1kHz audio  \n\\- Active noise cancellation with dedicated mic  \nCOMMS  \nWLAN Wi-Fi 802.11 a/b/g/n/ac, dual-band, hotspot  \nBluetooth 4.0, A2DP, LE  \nGPS Yes, with A-GPS, GLONASS  \nNFC Yes (Apple Pay only)  \nRadio No  \nUSB 2.0, reversible connector  \nFEATURES  \nSensors Fingerprint (front-mounted), accelerometer, gyro, proximity, compass,\nbarometer  \nMessaging iMessage, SMS (threaded view), MMS, Email, Push Email  \nBrowser HTML5 (Safari)  \nJava No  \n\\- Siri natural language commands and dictation  \n\\- iCloud cloud service  \n\\- MP3/WAV/AAX+/AIFF/Apple Lossless player  \n\\- MP4/H.264 player  \n\\- Audio/video/photo editor  \n\\- Document editor  \nBATTERY  \nNon-removable Li-Po 1810 mAh battery (6.9 Wh)  \nStand-by Up to 250 h (3G)  \nTalk time Up to 14 h (3G)  \nMusic play Up to 50 h  \nMISC  \nColors Space Gray, Silver, Gold  \nSAR 1.18 W/kg (head) 1.18 W/kg (body)  \nSAR EU 0.98 W/kg (head) 0.97 W/kg (body)  \nPrice About 400 EUR  \nTESTS  \nPerformance Basemark OS II: 1252 / Basemark X: 15841  \nDisplay Contrast ratio: 1213 (nominal), 3.838 (sunlight)  \nCamera Photo / Video  \nLoudspeaker Voice 66dB / Noise 65dB / Ring 72dB  \nAudio quality Noise -94dB / Crosstalk -73.4dB  \nBattery life Endurance rating 61h  \n  \n****** Awesome phone as usual like all apple phones. Great hardware, camera\nquality....just go for it...\n\n", "The said product is received ,but after opening item found damage\n\n", "A Must Buy If you are an Apple user !  \n  \nDesign and construction :  \n  \nThe iPhone 6 has soft curves and seamless joins between the screen and the\nback. It’s a very different look from the iPhone 5S, which has shiny machined\nedges. Barring some plastic detailing on the rear it’s all glass and metal,\nand thus looks Great . This is a very satisfying phone to hold and to use\nalthough The white bezel on the silver version ruins the seamless effect a\nlittle.  \n  \nDisplay :  \n  \nWith its 4.7in display, Apple has had to up the iPhone 6's resolution in order\nto keep the Retina tag. According to Apple, this is the point at which you can\nno longer see individual pixels. In the iPhone 6's case, this is a resolution\nof 1,334x750 - slightly more than 720p. While the resolution may be higher,\nthe pixel density is the same 326ppi as the iPhone 5S. In other words, you get\nthe same screen sharpness as before.  \n  \nBattery :  \n  \nThe Apple iPhone 6 comes with a non-replaceable 1,810mAh battery and has never\nfailed to make it through the day, even with heavy use.  \n  \nPerformance :  \n  \nThis handset uses the Apple A8 SoC, which has a dual-core 1.4GHz CPU. Compared\nto the 2GHz+ quad-core Android competition, this sounds a little slow, but\neven after a heavy use it's preety fast .  \n  \nCamera :  \n  \nThe handset comes with a 8MP camera, 1/3.06-inch sensor, true-tone flash,f/2.2\naperture dual-LED flash, phase detection and the picture quality is preety\ngood .  \n  \nMain disadvantages:  \n  \n>Has unimpressive screen to body ratio (the Nexus 5 fits a 5-inch screen in\nthis size of a body)  \n  \n>No microSD slot  \n  \n>Pricey memory upgrades, 32GB version should be standard for such an expensive\nphone  \n  \n>No user-replaceable battery  \n  \n>Protruding camera lens makes the phone wobble if you don't have a case on  \n  \n>Camera is still merely 8MP four years in a row (granted, it's getting better\nevery with every new generation)  \n  \n>No 4K video and video sound is still mono  \n  \n>Lacks the optical image stabilization of the iPhone 6 Plus  \n  \n>No enhanced resistance to liquids or dust  \n  \n>Too pricey  \n  \nMy Opinion :  \n  \nAlthough the iPhone 6 is considerably bigger than the iPhone 5S, Apple has\ndone a good job not making it feel so. As such, this feels like the natural\nsuccessor to the older smartphone and a worthy upgrade - it's faster and the\nbigger screen really works, making the previous model look a little old\nfashioned.\n\n", "Today I ordered my product but when I open the box it’s was totally empty  \nit was very disheartening for me ! What to do !\n\n", "Phone arrived but after switch on it just hanged where we select language, too\nbad no way to move forward, I tried to restart but still the same now I have\nto take it to the service showroom now\n\n", "apple dont need review... but i gave 5 star only because i got 20% cashback\nthrough this link Apple iPhone 6 (Space Grey, 32GB) i recommend people to go\nthrough this link so that they can save some money/\n\n", "Very bad product is there when i got the iphone i see the display in display\none line is there  \nDon’t purchase the online phone\n\n", "I am giving 5 🌟 because people can see my condition  \nIt's shocking to see new packed pieces is not working...it's duplicate\nmaterial pasted on the name of Great India shopping festival....\n\n", "By creating iPhone 6 and iOS 10 together, we optimized the software to enhance\nthe physical design. iOS swipe gestures were designed to be more fluid across\nthe seamless form, making it easy to navigate iPhone with one hand. With new\nfeatures like Reachability you can interact with the larger screen in\ndifferent ways, too. Simply double touch the Home button and the entire screen\nshifts down closer to your thumb. And to easily navigate Safari or Mail, swipe\nleft to right across the screen to go backward, or swipe right to left to go\nforward. With the new continuous surface of iPhone, all your gestures now feel\nsmoother than ever.  \n  \nWe also thought about how you use your iPhone every day and redesigned the\nbuttons to make it even easier to use. Elongated volume buttons are integrated\ninto the thinner profile, outlined to make them effortless to find by touch.\nAnd the Sleep/Wake button has a new home on the side of the device to put it\ncomfortably within reach. The result is an experience that’s even more\nintuitive.  \n  \niPhone 6 - Retina HD Display  \niPhone 6 isn’t simply bigger - it’s better in every way. Larger, yet\ndramatically thinner. More powerful, but remarkably power efficient. With a\nsmooth metal surface that seamlessly meets the new Retina HD Display. It’s one\ncontinuous form where hardware and software function in perfect unison,\ncreating a new generation of iPhone that’s better by any measure.  \n  \nThe Biggest iOS Release Ever  \niOS 10 is the world’s most advanced mobile operating system. And with\nincredible new capabilities and features designed to make the most of a larger\ndisplay, iOS 10 doesn’t just work seamlessly with iPhone 6. It makes every\nexperience feel bigger and better.  \n  \nOS iOS  \nRAM 1 GB  \nItem Weight 127 g  \nProduct Dimensions 13.8 x 0.7 x 6.7 cm  \nBatteries: 1 Lithium ion batteries required. (included)  \nItem model number iPhone 6  \nWireless communication technologies Bluetooth, WiFi Hotspot  \nConnectivity technologies 3G, WCDMA, 4G, WiFi 802.11 a/b/g/n/ac  \nSpecial features Single SIM, GPS, Music Player, Video Player, Accelerometer,\nGyro sensor, Proximity sensor, eCompass, Barometer, E-mail  \nOther camera features 1.2MP  \nForm factor Touchscreen Phone  \nWeight 125 Grams  \nColour Gold  \nBattery Power Rating 1810  \nPhone Talk Time 14 Hours  \nPhone Standby Time (with data) 240 Hours  \nWhats in the box Handset, Charger, EarPods, Lightning to USB Cable and\nDocumentation\n\n", "Received the product before delivery date.. It was super fast delivery..the\nproduct is awesome..bt im little wrry abt the battry issue.. Let me use it\nfrst..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 August 2017", "on 14 February 2018", "on 24 August 2017", "on 26 November 2017", "on 22 September 2017", "on 31 March 2017", "on 23 September 2017", "on 16 August 2017", "on 24 August 2017", "on 16 August 2017"], "reviewer": ["Sayantani", "jitender", "Srijan Sen", "Nikita bahuguna", "Vijay", "gourav kumar singh", "sunny", "Amit Bhalsod", "Onesimus Paigiri", "Sumon d."]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["SPEECHLESS,FATA FATI,.........UNEXPLAINEABLE  FEELING WHEN U BUY I PHONE 6 BUT PEOPLE ASK IS IT 7 PLUS OR BRAND NEW 8PLUS", "Most recent review after using ios11.0.2", "coool", "Very good purchase in early 2017. Go for it!", "... diagnose for three days and said every thing is fine but still i have so many issues in my ...", "iPhone buying guide", "Bad!", "Duplicate Product Received", "Giving 1 star since as there are no lesser options available", "May be I got wrong device but best service."], "review": ["i love amazon,delivered the product on time,for the first time the delivery\nboy collaborate with me to make a unboxing video,my heart was in my hand when\ni was unboxing but its my luck that i got the exact phone ,2nd thought came to\nmy mind that might not be the genuine phone so confirmed with apple and again\nits geniune .after a couple of weeks the product is running very good no\nlag,can compete any new android phone...if u update the phone to ios 11 , i\nwould recommend to call apple customer care for some tips and tricks which\nwill help in battery life and phone life,...  \ni have used a trick that made the phone look like i phone 7 plus at a first\nglance,below r 3 links plss do buy those product with the i phone..GADGETS\nWRAP Apple iPhone 6 (4.7) / iPhone 6s (4.7) Wooden Skin for Front and\nBack.....this product wil make ur phone wooden and will save ur phone from\ndust and at a high instance of water splashes have perfect whole for speaker\nand others...  \nIPHONE 6 6S AE (TM) 360 DEGREE BACK COVER WITH TRANSPARENT BACK 100% Original\nAE brand silicone protective cover shell Transparent Hard Back with Soft\nBumper Cushion Case For Apple iphone 6 6S BLUE....this product will make ur i\nhpone back transparent but is very handy as well as hardy...the back\ntransparent look will make the wooden gesture visible ..MTT 3D Full Body\nTempered Glass Screen Protector Guard for Apple iPhone 6S / 6 (Black).....also\nrecomende to buy this which willl protect the pfone with all edges....awesome\nexperience with amazon for this particular product and accessories  \n  \nMY FIRST SUGGESTION TO ALL VALUABLE CUSTOMER OF AMAZON IS THAT,PLEASE DO\nUNBOXING VIDEO IN FRONT OF THE DELIVERY BOY AND DONT LET THEM TO SCAN THE\nPRODUCT AS DELIVERED BEFORE YOU GET SATISFIED WITH THE PRODUCT,EVEN I CALLED\nAPPLE CUSTOMER FOR VERIFICATION OF THE PRODUCT WITH IMEI NO..AND IF THE\nPRODUCT IS NOT GENUINE DONT ACCEPT IT,[{BE READY WITH POLICE CONTACT AS IN\nMANY CASES DELIVERY BOYS R STATED GUILTY}I REPEAT THE SENTENCE UNDER THE\nBRACED IS MY OPINION,ITS ONLY MY OPINION}]  \nHOPE U R ALSO HAPPY ..  \nHAPPY DIWALI\n\n", "Its been one week using my iphone 6 from using new ios11 software , its only 7\ndays and i am really fed up😩 ! Sources have stated that apple is slowing down\nthe speed of ios 5,6,7 under the new software update (ios11), and its not a\nrumuor !  \n  \nWHATS NEW :  \n  \nHANGS : WHEN ios 11.0.0 came , iphone6 was hanging more than androids😱 , after\n11.0.1 sudden closedowns stopped , but still hangs !  \nAfter 11.0.2 , its a little better !  \n  \nBATTERY : As we know , its about 1600 mah , but battery used by software also\nmatters , and u should know that ios11 uses more than two times battery in\nbackground than ios10  \nAbout 15% battery gets lost 😱in one hour (15 minutes screen on only )I HAVE\nATTACHED PICS FOR SAME !  \n  \nSMART CONTROL CENTRE : its the first time that u can turn on/off mobile data\nwithout going to setting , also a whole new control centre is here , i loved😍\nit (pic attached -screenshot)  \n  \nFinally , i will like to say that i am fed up with my phone (main reason\nbattery )  \n  \nI myself owns a SPACE GREY 32 gb from last 6 months  \nLets share some of its experience  \n1#. Its performance remains constant , its speed doesnt get low according to\ntime as most of rumors say about it  \n  \n2#. Long lasting smartphone and having a HIGH QUALITY EARPHONES that other\ncompanies cant afford to give  \n  \n3#. CHARGING CABLE AND ADAPTOR are also convinient to use , size of adapter is\nsmall so its durable and its size is comfortable for pocket  \n  \n#4 its memorey is about 32 GB , and i think its sufficient for 90% of users ,\ni can keep about 40APPS , and 4-5 HD MOVIES and still 2-3 GB empty space , i\ndont recommend 16GB iphone 6  \n  \nI used it personally and recommend it for those who lives ONLINE  \n  \nI BOUGHT this phone from mobile store at ₹27300 but now its cheaper on amazon  \n  \nRIGHT TIME TO CHECKOUT  \n  \nREGARDS  \nKUNJ GOYAL\n\n", "got it for 24k ,happy  \ngot it today packing was good n sealed  \ntill now it's good.\n\n", "Very good purchase. Proper and timely delivery. Happy to get it for 27k\n(including cashback) in less than 24 hours.  \n  \nI was initially skeptical to purchase an iPhone 6 in early 2017. With its A8\nunit and 8 MP camera pitted against the newer specs in 6S and 7 really made it\nseemed an unattractive investment. But, I still went ahead due to the 32 GB\noption at this price point. Don't care which model Apple will announce in\nAugust this year.  \n  \nI'm happy to say that iPhone 6 runs pretty smooth on iOS 10.2 update and with\nover 50 apps installed.  \n  \nBattery is ok for business hours use. Need to recharge daily night.  \n  \nBoth the front/back cameras are above average and I'm happy with the clarity\nand quality of shots, even though the MP count on specs may force you to think\notherwise. This is a highly tuned camera and the shots are very good. I have\nalready captured few memorable shots with this.  \n  \nSlo-mo and video recording is also good.  \n  \nThe voice clarity and signal strength are great.  \n  \nDisplay is beautiful. UI runs smooth. I have disabled many notifications for a\nclutter free experience. iOS offers plenty of control over the device. This is\n2017 after all!  \n  \nNo comparison with Android. Very subjective opinion. I have owned Galaxy Note,\nGalaxy S4, Moto G2, Galaxy Note 4, Xperia Z1, OnePlus 3T, Redmi Note 4, et al,\nbut iOS is special.  \n  \nI'm not missing the 3D touch at all.  \n  \nThe 3.5 mm jack is also present :)  \n  \nI checked on Apple website and my device is original. Bought from \"E-Mobiles\"\nseller.  \n  \nGo for it. Very value for money choice if you want to own an iPhone.\n\n", "i got my product on march 10th and found some issues on second day itself and\ncalled icare for support then i went to icare service center for many time\nthey have diagnose for three days and said every thing is fine but still i\nhave so many issues in my phone, no is ready to help me, amazon shown there\nbad face.  \n  \nThe issues which i faced are,  \n  \n!. Bluetooth connectivity issue,  \n2\\. Phone hanging issue,  \n3\\. Messages are not receiving ontime, instead its receiving on delay of 5 to\n10min in both cellular and wifi network,  \n4\\. Phone is heating on charging,  \n5\\. Phone get locked automatically during cal for some times,  \n6\\. voice clarity issues on cal,  \n7\\. 4G data connectivity issues ect..  \n  \nI have attached some possible screen shot for issues, please ref,  \n  \nPlease never ever buy iphone from amazon, they will make you fool.\n\n", "These are the different iPhones currently sold in India as on Jul-17  \n\\- iPhone SE, iPhone 6s, iPhone 6s Plus, iPhone 7, iPhone 7 Plus  \n● There is no point in writing in length about these phones since everyone is\nvery well aware on the reasons why they may shop for an iphone. So, I thought\nit make sense to compare the prominet features that could help you to make\nyour decision easier  \n  \n** iPhone SE **  \n● This is a 4 inch phone that fits very comfortably into your hands and is\ngood for your wallet since the 16GB version costs around Rs.21,000  \n● This packs the same A9 processor, camera, fingerprint sensor and many other\nfeatures of iPhone 6S and 6s Plus  \n● The 12mpx camera is one of the best among phones around Rs.20,000. It\nsupports 4K videos, live photos, full HD slow motion video, etc.  \n● In terms of performance also, the phone stands one among the top in the list\nin the Rs.25,000 bracket  \n● If you dont like big screen phones, this is the best phone for you. But I\nwould say if you have used a bigger screen phone, you would definitely\nstruggle with this one since reading stuff on a 4 inch screen will be less\ncomfortable to you in comparison. In that case, spend this money on an Android\nphone and you will love it  \n  \n** iPhone 6s **  \n● The main difference 6s has over SE is that 6s has got 3D Touch and display\nzoom other than a bigger screen of 4.7 inches  \n● 3D touch is an amazing feature where the phone can understand the pressure\nyou put on screen while touching and can activate various functions like\ndouble click, left click or many other functions that could have been achieved\nby more than one click  \n● 6s also comes with a 128GB option while SE stops at 64GB  \n● 6s has got a larger battery, but there is not much difference in battery\nendurance due to the bigger display  \n● The selfie camera is also upgraded from 1.2mpx in SE to 5mpx in 6s  \n● So, if you are on a tight budget, but still want to go for an iPhone, this\none is the best choice. I bought the 32GB version for Rs.35,888 in Jun-17  \n  \n**iPhone 6s Plus **  \n● The only difference 6s Plus has over 6s is the screen size which is 5.5 inch\nand optical image stabilisation for main camera  \n● 6s Plus had been infamous for rumours that the phone could bend from the\npressures of your pocket, but Apple is reported to have addressed it by using\nhigh-grade aluminium  \n● Optical Image Stabilisation works can effectively eliminate effects of\ncamera shake and images are sharper. This is especially useful during low\nlight where the exposre is longer and there are more changes for your hand to\nshake or shiver during shooting  \n● The larger screen is good for watching videos, reading, etc. And if you are\na gamer, spending this much for a 5.5 inch phone makes sense. This is sold at\naround Rs.45,000 for the 16GB version  \n● The phone performance and battery endurance is very much similar to iphone\n6s  \n● If you dont have a need for a larger screen, I would not recommend to spend\nmore money, but iPhone 6s would do good for you. if you are serious on this\none, I would suggest to spend a little more and go for iPhone 7  \n  \n** iPhone 7 **  \n● iPhone 7 brings in a low of new features  \n● This comes with a 4.7inch display. The display is one of the best on\nsmartphones with a lot of new features. In practical, the display is brighter,\nvery easy on eyes and colour reproduction is more accurate  \n● The processor is upgraded to A10 and the camera sensor is also upgraded that\nexcels is low light photography. The dual camera system captures depth\ninformation  \n● There is no 3.5mm headphone plug, instead it packs the wireless earpods.\nHowever, it comes with a 3.5mm adapter that connects to the lightning port  \n● The phone is splash as well as dust resistant  \n● The jet black and red are the new colours iPhone 7 is sold in  \niPhone 7 is one of the biggest update and comes with a lot of exciting\nfeatures. The 32GB version is sold at Rs.49,000. If you are serious about\niPhone 7, you may need to think spending around Rs.60,000 for the black or red\nsince the phone does not look much different from iPhone 6s if not on these\ncolours  \n  \n** iPhone 7 Plus **  \n● This is only for those people who have got deep pockets. The base version is\nsold at around Rs.72,000  \n● The phone has got a bigger screen of 5.5 inch and a superior camera with\noptical zoom & telephoto aperture  \n  \n** Summary **  \n● Go for iPhone SE only if you use your phone mainly to make calls or if you\nare upgrading from a smaller phone. If you are moving from a bigger screen\nphone, the 4 inch display of this phone may not be that easier  \n● iPhone 6s is the phone that I recommend if you dont want to spend too much\nmoney, but would like to boast of your iPhone among your mates  \n● 6s Plus is not at all recommended because you will get iPhone 7 with a lot\nof new features if you spend a little more. However, if your only need is a\nlarger screen I wont stop you  \n● iPhone 7 is in a different league. Its the best iPhone available today\naccording to me  \n● If you are struggling to spend your hard-earned money, put it on iPhone 7\nPlus black or red where you will get an amazing gadget to show off.\n\n", "Damaged product, had to get it replaced from apple.\n\n", "Very worst product and of course this is a duplicate piece and Amazon is not\nresponding for my issues. Literally Amazon is not accepting any exchange or\nproduct support.  \nVery bad experience with this phone. Ultimately waste of money.\n\n", "\n\n I purchased this phone during Amazon Great Indian Sale. I always used this\nphone with cover on it and handle it with care. After 3-4 months now I can see\nthat there are spots in the back side of the phone. Seems like there are\ncorrosion marks in the gold color. The color is peeling off. This is looking\nquite bad and it doesn't seem that the phone is only 5 months old. Since Apple\nis a global brand. I am in doubt whether Amazon is selling genuine product or\nnot. Please take some responsibility and provide a replacement of this phone.\n\n", "I know, \"iPhone is best this is what all iPhone users will say.  \n  \nBut I am just posting my view on same.  \n  \nI got the phone little late than expected but it's okay. That's not a concern.  \n  \nWas really happy to received it, got initial needful work with any new phone\nin 15-20 mins.hich was pretty good.  \n  \n1st issue came after 2 days, I observed that battery of the phone is weak, As\nmy wife is using I phone since 2.5 years I could easily differentiate.  \nThough my usage was little higher than normal but battery never used to last\nfor more than 3 to 4 hours.  \n  \n2nd issue- may be a software bug, suddenly my hotspot used to stop working (\nmeans for some times I could not create hotspot and that to when I needed to\ndo it on priority.  \nNot acceptable at all.  \n  \n3rd issue- on 11th or 12th day I don't remember exactly about which day but it\ngot suddenly switched off and started after 10 mins without any reason. On\nnext day, this happened again for 1 hour or so, I could see only apple logo on\nscreen big reason to worry for me. When it started, battery drained to 12%\nfrom some 70% odd. And I could not charg it again.  \n  \nI got disappointed, may be I have got phone with hardware issues but certainly\nI had huge expectations from Apple.  \nDiscussed the same with Amazon, they asked job sheet from Authorised service\ncentre which I got very easily as issue was genuine and easily got refund\nprocessed.  \n  \nExtremely satisfied with the service of Amazon and Especially apple authorised\nservice centre.  \nBut disappointed with iPhone. Sorry iPhone users, but this is what it has\nhappened. There were no lags in the phone except mentioned above, it was\nbuttery smooth.  \n  \nThanks for sparing time to read this.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 October 2017", "on 5 September 2017", "on 16 August 2017", "on 14 March 2017", "on 1 April 2017", "on 6 December 2017", "on 27 August 2017", "on 4 January 2018", "on 22 February 2018", "on 16 April 2017"], "reviewer": ["RIIK SARKAR", "Kunj goyal", "raghav pareek", "Yogeshwar Rao", "Amazon Customer", "Friendly Sparrow", "Akash Deep Sharma", "BasavarajuN", "Abhishek Das", "Saurabh Bharat Joshi"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["~~~ Genuine and working great! ~~~", "Should you Buy it now (April 2017) ? Detailed Review with Battery performance Stats.", "The phone is Genuine", "iPhone 6 (Space Grey, 32GB) - The iPhone That Has Never Officially Launched By Apple Inc.", "Is is the best phone in the market at this price???? READ MY REVIEW TO FIND OUT......", "Some other phone in an iphone box!", "Four Stars", "iPhone 6 After Two Months Of USe", "It is worth purchasing in 2017 ? Must read before buy.", "I purchased it on 24 th april in evening. ..."], "review": ["\\- Bought from seller 'E-Mobiles' for 29k.  \n\\- Received a brand new phone.  \n\\- Everything is working fine. No flaws with the device.  \n\\- All the accessories were included. Verified that they were genuine Apple\nones as well.  \n\\- Verified that the storage indeed is 32GB (default installed apps and iOS\ntake up around 4GB out of this. That leaves 28GB free space).  \n\\- Able to activate with Apple for the default 1 year warranty.  \n\\- No 'tik tik' or any other weird sound while taking pictures (as has been\nmentioned by one of the other reviewers).  \n\\- Manufactured in Feb, 2017.  \n\\- Model is A1586  \n\\- Supports the following 4G/LTE bands: (1 (2100 MHz), 2 (1900 MHz), 3 (1800\nMHz), 4 (AWS), 5 (850 MHz), 7 (2600 MHz), 8 (900 MHz), 13 (700c MHz), 17 (700b\nMHz), 18 (800 MHz), 19 (800 MHz), 20 (800 DD), 25 (1900 MHz), 26 (800 MHz), 28\n(700 APT MHz), 29 (700 de MHz), 38 (TD 2600), 39 (TD 1900), 40 (TD 2300), 41\n(TD 2500)).  \n  \nBattery Life:  \nUnder light use (approx. 1-2 hours of calls, instant messaging, mostly\nconnected to WiFi) lasts nearly 50-60 hours on average.  \nUnder normal use, it lasts nearly 1 1/2 days and heavy use, approximately a\nday.\n\n", "NOTE:  \n@ I am Using this Phone Since March.(got it second hand from friend for\nTESTING)  \n# Though my friend originally bought it, But I confirmed from Apple store,\nthat its ORIGINAL Product and they cover it under Warranty.Just Remember to\nKeep the Invoice Safe and Check the Invoice Once properly & Always Purchase\nfrom Amazon Fulfilled Seller ONLY.  \n@ I currently have iphone 5s, iphone 6(16 gb)(32 gb) and iphone 6s(16 gb)(32\ngb) in my house.  \n@ This phone has VoLTE, which means you can use Jio or other sim cards for\nmaking 4G Calls.  \n@ This phone doesn't supports Quick Charging, but you can charge it slightly\nQuicker using 2 Amp Charger & its Safe.  \n@ I am Not mentioning Technical Specs, this Review is Purely from Normal\nUser's Point Of View.  \n\\---------------------------------------------------------------------------------------------------------------------------------------------------  \nPlease Read Complete Review, it will Help You to take a Decision if you are\nPlanning to Buy it in April 2017.  \n\\---------------------------------------------------------------------------------------------------------------------------------------------------  \nPros:  \n1) Screen Size is Perfect.  \n2) Light weight and very Compact.  \n3) I am Using JIO sim with it and phone handles maintains good internet Speed.  \n4) Super Durable, Anodized Back is effectively Scratch Resistant.  \nNOTE: I am a rough user( ex-Nokia User) and have dropped it many times from\nvarious heights, has got few scratches but are almost Invisible.  \n5) Considerably faster compared to its android counterparts.  \n6) Handles huge games like NOVA , MC 5, Asphalt 8 Flawlessly.  \n7) Camera Quality is Unbeatable.  \n8) Touch ID is better than Previous versions.( In terms of Unlocking Speed)  \n9) Lot of Accessories still Available.  \n11) Charger and Ear-phones are working fine.  \n12) It has 3.5mm Earphone JACK, which is handy.  \n  \nCons:  \n1) Memory Availability. You need to Keep on Deleting stuffs Regularly  \n2) Updates are Regular, but Consumes Lots of Storage.  \n3) Price is Still high and only occasionally drops, considering the Fact that\nit was Launched more than 2 years ago.  \n4) Battery Life is NOT Impressive.(check the stats below)  \n5) NO 3D Touch for screen.  \n6) Its more than 2 years old and soon will become apple's Entry level phone.  \n7) Not Priced appropriately.  \n  \nBattery Performance Stats:  \n# Charging from 0 to 100% takes almost 2 hours with stock charger  \n# Charging from 0 to 50% takes 45 mins 2 Amp Fast charger.  \n# Following stats. are observed over a period of 3 weeks  \n  \nUsage Mode ---> Battery Performance(Avg.)  \n================================================  \n@ Mobile Data(3g/4g) Used Continously ---> 10 Hrs.  \n@ Normal Calling Only + Standby ---> 20 hours.  \n@ Normal Calling + Music Playback( Continuous ) ---> 9-12 Hrs.  \n@ Music Playback ONLY ---> 15 Hrs.  \n@ Internet Usage on WiFi Only( No Calling ) ---> 8-10 Hrs.  \n@ Gaming ( Wifi) ---> 6-7 Hrs.  \n@ Gaming ( without WiFi ) ---> 7-8 Hrs.  \n@ Video Playback ---> 10 Hrs.  \n  \nSHOULD YOU BUY THIS PHONE in 2017 ?  \nIts a Straight NO, its almost time when Apple is going to Launch iphone 8 and\nthis will be basic Entry Model.  \nConsidering the Price, its kind a Affordable, but still investing more than\n25000 rupees in model aged 2years old is Not a Clear Decision to make.  \nIf you want you 1st iPHONE & if your budget is tight, then Go FOR IT.\nOtherwise opt for any better android counterparts, atleast you will get Value\nfor your Money.  \n  \nThank You for reading this review.\n\n", "Hello Guys,  \n  \nFirst time while shopping on amazon, i was apprehensive in buying this phone.\nAs, apple has not officially launched 32gb version of iPhone 6. And thanks to\nfew youtube videos which show that in china, its very easy to swap the memory\nmodule and repack the phone as NEW.  \n  \nBut I did a little bit of research on this model.  \n1\\. This phone has been launched in China & Taiwan in Gold version .  \n2\\. In April, the phone will be launched in Few European countries as well.  \n  \nVerdit: The phone is Genuine. It registered in Apple's website and shows 12\nmonths warranty.  \n( I have attached pics of the box for reference, serial numbers have been\nhidden for privacy & security)  \n  \nThe phone is arrived in a day of order. Amazon does a great JOB in delivery.\nThumbs up for that.  \niOS 10 is installed on the phone. Unlike 16gb version, where iOS 9 is\ninstalled.  \n  \nI was hoping iOS9, as iOS10 does reduces the performance of the phone.  \nMy Usage for the phone is Camera and storage. I wont be running many apps on\nthe phone. This is actually a second phone meant or entertainment. Thus iOS 10\nwill not be performance issue here.  \n  \nIphone 6 is a great phone, it had only one flaw, that the cheapest model was\n16GB variant. Today in keeping few apps, photos and music, 16gb memory is\nexhausted. But the 32GB version solves this problem.  \n  \nIphone 6 cannot be matched in the following aspects:  \n1\\. Looks: Slim profile with less weight  \n2\\. Camera: 8MP does a great job than many 12MP budget phones  \n3\\. Music : Apple music is amazing  \n4\\. Apps: Apps for iPhone are designed better than Android devices.  \n5\\. Overall feel of owing an iPhone is amazing.  \n  \nI would recommend this phone to people who have limited use like, email, music\n& camera. For them this phone is the best buy.  \nIf you can take apple care protection plan of Rs 4500, your warranty will be\nextended for another year. Even after using the phone for 2 years, your resale\nvalue of the phone will be at least Rs. 10,000.  \n  \nIf you are looking to get in the Apple ecosystem and have light usage, then\ndon't think twice. - Just go for it.  \n  \nIf you like my review, please hit the LIKE button. If you have any question,\nshoot a message, will reply to it asap.\n\n", "Hello Friends,  \n  \nI'm writing this review to clear some doubts and say something about the\niPhone 6 (Space Grey, 32GB), which came recently to amazon.in.  \nLet me also say that, this is not written as a user review of the product! Its\nonly purpose is to clear some doubts regarding the product.  \n\"All the views expressed in this review are are solely my own.\"  \n  \nLet me start the review by saying that, the 32GB variant of the iPhone 6 is\nexclusively only available on amazon.in and is not presently available on any\nother online or offline retailers!  \n  \nI found that, many fellow customers have some doubt about this 32GB variant.\nAnd, some of them are thinking that this one is a fake model!  \nMy friends, this one is not a fake model. Its an original product of Apple\nwhich runs under iOS 10.  \n  \nApple has never officially launched their iPhone 6 with 32GB internal storage\ncapacity!  \n  \nOne big thing to notice is that the 16GB variant of the iPhone 6 (which is\nalso available on amazon.in) has a price tag of Rs. 30,399/- whereas the 32GB\nvariant of the iPhone 6 is just available for Rs. 28,999/-  \nExchange offer of up to Rs. 8,550/- (it depends on the smartphone that you're\nexchanging) is available for the 32GB variant of the iPhone 6.  \nAlso note that the offer period ends on March 7, Tuesday.  \n  \nNow to some general specs:  \nThis one includes an 8MP rear camera with auto focus and 1.2MP front facing\ncamera. The phone has a display size of 4.7 inch (11.4 cm). As I had already\nsaid before, this smartphone runs under iOS 10 and also packs 1GB RAM along\nwith the 32GB internal memory. It also includes a fingerprint sensor -\nsecurity at your finger tips. Cannot insert two SIM, as it only has one nano\nSIM port! The phone has a battery capacity of 1810mAH. And, it also has 1 year\nmanufacturer warranty for device and manufacturer warranty for in-box\naccessories.  \n  \nNow, as a general note; after the launch of iPhone 7 and iPhone 7 Plus on the\nlast year, Apple had stopped the production of their iPhone 5s, iPhone 6, and\niPhone 6 Plus models!  \n  \n≧◠◡◠≦ I HOPE YOU FOUND MY REVIEW HELPFUL. IF \"YES\", KINDLY HIT THE \"YES\"\nBUTTON GIVEN BELOW ≧◠◡◠≦  \n  \n≧◉◡◉≦ HAVE DOUBTS OR QUESTIONS? PLEASE POST THEM AS COMMENT. SO THAT, I COULD\nSEE THAT AND GIVE A REPLY FOR YOU ≧◉◡◉≦  \n  \n≧°◡°≦ THANKS A LOT FOR READING MY REVIEW ≧°◡°≦  \n  \n≧^◡^≦ HAVE A GREAT DAY ≧^◡^≦\n\n", "Apple made a big leap forward with the iPhone 6 - one of the best phones it's\never created.  \nSure, it's not nearly as fast or powerful as Apple's new iPhone 7, this is\n2017's still-impressive flagship that you may want to consider next to the\niPhone SE.  \n  \nAlso worth noting that some iPhone 6 and iPhone 6 Plus users have encountered\nsomething that's being referred to as \"touch disease\". In other words, your\nphone is becoming unresponsive to touch. And if you search around the net,\nyou'll see that this is a fairly widespread issue.  \n  \nApple finally gave the iPhone a much-needed rethink, and the result is a\nproduct that is more like its competition than ever before, but also stands\nout just as well, if not better, in a seriously overcrowded market. As always,\nApple has managed to deliver more power, better aesthetics, improved cameras,\nand all-new software.  \n  \nThere will be some who will miss that 4-inch screen size, maintaining that\nthey don't want a bigger display on their phone – but nearly all of those\npeople won't have spent any appreciable time with a larger device, and I\nbelieve that a good portion of you thinking you need a smaller phone will\nquickly come to appreciate the power a bigger handset brings, without\ncompromising quality.  \n  \nWell, with the Apple iPhone 6 we're looking at one of the thinnest and\nsleekest handsets in the market – still. It's got a strong combination of\nmetal back (which feels exceptionally premium, borrowing bucket loads of\ndesign language from the iPad Air) and the way the screen curves into the\nchassis gives it a slight lozenge feel. The iPhone 6 is still just as much of\na premium device as ever; not a lower-end version of a new flagship.  \n  \nThe rear camera is still 8 megapixels, but the lens and sensor have been\nimproved to allow for better low-light shots and colour accuracy. Videos can\nnow be taken with continuous auto focus and improved stabilisation. 120 fps\nslow-motion, which was introduced with the iPhone 5 s now coexists with 240\nfps slow-motion.  \n  \n4 K video recording is missing, and the iPhone 6 falls behind its competitors\nin this regard. Even if you don't plan on shooting all your videos at such a\nhigh resolution, it's nice to have the option to do so. The low storage space\nwould also make it very difficult to store 4 K videos.  \n  \nImages taken during the day were crisp with accurate colours and superb levels\nof detail. Closeups were brilliant, and even distant objects were captured\nvery well. Low-light performance was also admirable - the iPhone 6 works very\nwell indoors as well as outdoors, even with minimal artificial or ambient\nlighting. We were constantly surprised by how well shots came out - there was\nnoticeable noise but details were still well defined when seen at reduced size\non a screen. Photos came out looking as though they had been taken in far\nbetter light.  \n  \nSpecifications shouldn't fool you into thinking this phone is any less\npowerful than an Android flagship. If you've been waiting for a reason to\nditch an old phone and jump onto the Apple bandwagon, the iPhone 6 is one of\nthe best reasons to do so. If you're thinking of upgrading from an iPhone 4S\nor earlier, you'll absolutely love what the iPhone 6 has to offer. Naturally,\nthe difference won't be as stark for iPhone 5 or 5 S owners running IOS 8, and\nthey can easily stick with their current phones for another year or so unless\nthey really feel like splurging.  \n  \nI would finally say that if you are an apple lover and want to buy a apple\nproduct only and in a price range below 30,000 then go for this. The phone is\nno doubt awesome, premium looking and very nice to hold. The camera quality is\nalso awesome.  \n  \nNOTE--- There are more powerful android smartphones available in this price\nsegment in the market. You can also reconsider them.  \n  \nThanks  \nIf you have read my review till here, then please vote for me...............\n:-)\n\n", "Received some other phone in an iphone box. Such awful experience did not\nexpect such a thing.\n\n", "Nice phone. I brought this phone rs24999 32gb.😍😍😍\n\n", "First of all, THANK YOU AMAZON India.  \n  \nMy first phone, from online store.  \nIt was a big step for me, after hearing online stores are some time fraud\nalso...  \nBut i really trust amazon India.  \nEven they proved it.  \n  \nI got my iPhone 6 in 1 day delivery as they promised.  \n  \nWhen i opened the box, the feeling was speechless...  \nThe phone was fully covered with glass paper as brand new. Every thing was in\nthe box. (Ear phone, power adapter, lightning cable, sim ejector, and the user\nguide)  \n  \nAfter registration, 1st i checked my warranty. It is correct.  \nAlso i checked every accessories, it's all was perfect as brand new.  \n  \nI am reviewing my phone after 2 month of buying.  \nToday also i did not get any issues.  \nAccept heating issue, I noticed that when i playing heavy game, video editing,\nit realises some heat. May be the reason is for its aluminium body, cause\naluminium is one of the best thermal conductor.  \n  \nBattery backup is also good, with normal use it gives you full day backup. For\nheavy use it will give you 4 to 5 hours.  \nFrom zero to full charge it will take 50 minutes.  \nSound quality is really very good. Louder also.  \n  \nAnd the main thing is camera, even 1.3 MP front facing camera also gives you\nvery good clicks. And the back is crystal clear with 8 MP.  \n  \nFor my opinion, under 25k iPhone 6 32 GB is best budget phone.  \nAnd there is nothing to worry about the phone, after all there service centre\nis also gives you hassle free service.  \nYou can make a insurance for more safety, if you want.  \n  \nOnce again Thank You AMAZON India.\n\n", "Summary:  \nNot 5 star due to battery. Overall the phone is good to use for the daily\npurpose. Battery could have been much better otherwise the device is a 5 star\nfor me. Nice product. Worth for money paid. Superb mobile, mind blowing touch\nand camera. Even high end android phones will not match with iPhone 6.YES,\ndefinitely go for this phone over iphone 7. Its value for money product and\nafter all its a iPhone. So far no issue reported .. Phone is awesome and\nproduct is genuine. Got it in much cheaper rate than Apple shops. It supports\nboth technology both 4G and $G Volte. It does not generate heat with gaming.  \n  \nWith finger print scanner,it does note have extendable storage space. Like an\nSD card. finger print scanner very well n very smooth in unlocking the device.\nIt work in different country with different charges based on country and your\noperator. Feels good in hand, Touch is too good.  \nAnswer: yes  \n\\------------------------------------------------------------------------------------------------------------------------------------------------------------  \nBest Phone Specs:  \n# 8MP primary camera with auto focus and 1.2MP front facing camera.  \n# 4.7-inch) HD touchscreen with 1334 x 750 pixels resolution.  \n# 1810mAH lithium-ion battery.  \n# 3G, WCDMA, 4G  \n# Screen Size is Perfect.  \n# Considerably faster compared to its android counterparts.  \n# Charger and Ear-phones are working fine  \n# Touch ID is better than Previous versions.  \n# Handles huge games like NOVA , Asphalt 8,MC 5, etc.  \n# I am Using aiterl 4G sim with it and phone handles maintains good internet\nSpeed. It gives better connectivity. clear voice call.  \n# Ultra-fast wireless. Faster Wi‑Fi.  \n# 12MP pictures. 4K videos. Live Photos. Lasting memories  \n,--------------------------------------------------------------------------------------------------------------------------------------------------------------  \nSensors: Accelerometer, Gyro sensor, Proximity sensor, eCompass, Barometer.  \n==============================================================================================  \nIN BOX=  \n# Ear Phones  \n# user manual  \n# charging cable  \n# Charging port  \n# Iphone  \n# Sim Tray pin  \n-==============================================================================================  \nProblem:  \nSingle SIM,  \nless power battery.  \nApple iPhones do not support fast charging as of now. Therefore, no fast\ncharger.  \nSome times Can’t send or receive iMessages and texts  \n================================================================================================\\  \n  \nThanks for reading.I hope my review helps making your purchase decision.\nPlease spend a sec to leave a thumbs up. I would really appreciate that.\n\n", "I purchased it on 24 th april in evening..& i found touch issue in phon its\ntouch not work...  \nI m getting frustrate now..  \nAmozon not taking any responsiblity regarding issue..i never purchased any\nproduct from here...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 March 2017", "on 24 April 2017", "on 18 March 2017", "on 9 March 2017", "on 10 August 2017", "on 22 July 2017", "on 17 July 2017", "on 4 July 2017", "on 15 August 2017", "on 27 April 2017"], "reviewer": ["OwlSays", "Sameer Patil", "Harsh Singhal", "GOVIND", "Arnav Agrawal", "Amazon Customer", "Amazon Customer", "Rahul_Ghosh", "Manish Mishra", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Should you buy Iphone 6 in 2017", "One hell of a purchase. Fantastic!", "Still a very capable iPhone. Just get a case.", "Wow wow wow..amazing amazon", "I AM NOT A APPLE FAN...100% Genuine Review", "Not up to expectation", "Defected producted sold thru Amazon", "best deal", "Awsum phone", "Worth buying in 2017?"], "review": ["Should you buy Iphone 6 in 2017  \nIn my opinion if you are looking to buy a phone with view of changing it max 2\nyears, then Iphone 6 is just for you (do not buy 16gb variant, you would\nregret due to low storage)  \n  \nI am personally using the 32gb variant on IOS 10.3.3, and do not find any lag\nin my day to day usage.  \n  \nBattery last for almost 6-7 hours of usage time and 16-18 hours of standy\n(point to be counted is I live at a very medicore network area, the network\nsignal is never full)  \n  \nCamera is decent for its price range and gets the work done.  \n  \nVideo recording is far better than other phones in its price range  \n  \nIf you are okay with small screen then would recomend Iphone SE instead of 6\n(far more better specs, camera and battery)  \n  \nIOS 11 would certainly make the phone a bit slow, but it would be hardly\nnoticeable.  \n  \nI purcahased the phone June, and completely happy with my decison no regrets\nin any department.\n\n", "Firtst time Iphone user- sharing review after using it for 3 weeks. The phone\nis fantastic. Its smooth,touchscreen works like a charm as if there is melted\nbutter over the screen. Music sound is pretty decent and amazing in the\nearphones. Battery backup totally depends on your usage. captures the clicks\nvery well in sunlight and moderate condition and as for low light the flash\ncomes for the rescue. I have been using android for over 5 years and was very\nsceptic abt iphones. But im glad i went for it and im pretty sure ill stick to\niphones in the future too.  \nNote: you might face issues when turned on the speakerphones where microphone\ndoesnt work/ the other party cant hear you during facetime or on calls on\nspeakerphones. The fix for the issue- update your phone with the latest\nsoftwares.  \nCheers!\n\n", "Still a great iPhone in 2017, may lose some of its charm in 2018-19 only.  \nGrab at a deal price and do yourself a favor - get a very durable case and\nscreen guard as this is still haunted by bendgate!  \nAround 23GB storage is usable.  \nNo lags or issues on iOS 11.  \nEverything else is same as other iPhone 6 out there.  \nYou know the deal with them all, so I need not chatter.  \nAgain, try to grab at a deal price - I got this for 19999.  \n  \nP.S.: If you’re ok with an even smaller screen size (highly unlikely, as this\none is very handy), go for the iPhone SE at similar price, as it has some\nbetter specs than iPhone 6, particularly camera and performance.\n\n", "Thank so much for delivering the amazing product.  \nI was not sure of ordering when it was available at low price that too 32 gb\nthought ordered it on risk and when it came just wow..  \n  \nI have been doing shopping on amazon a long time and never disappointed\nme..hope to continue the same ever\n\n", "I bought this phone for my personal Use, & writing review after use 1 month.\nThank you. Best of luck for your new iPhone.  \nI am not giving any information about specification because it already\navailable on site.  \n  \n+++ Point:  \n1\\. Good Camera  \n2\\. No heating issue even playing heavy game. (Please do not install any\nantivirous or RAM optimisation app)  \n3\\. Battery running one day full.  \n4\\. Getting full charge 10% to 100% in 70-80 min.  \n5\\. 100% Original iPhone with manufacturing warranty.  \n6\\. You'll receive genuine VAT/GST bill.  \n7\\. Really nice sound.  \n8\\. Amazon authorised iPhone selling partner as confirmed by Apple Inc.  \n10\\. Still this phone so fast & never old with in next 2 years.  \n  \n\\---- Point :  \n  \n1\\. Notification hub is not good from Blackberry or Android.  \n2\\. Phone is too slippery.  \n3\\. No FM radio is there.(Cant play radio mirchi or red fm,only internet\nradio)  \n4\\. Can not download any song from website ,& Music player play music from\nitune only.  \n5\\. App size are too big.  \n6\\. You cant use SIRI in daily life ,this is only for kidz play.  \n7\\. LED is not so bright.  \n8\\. Maximum apps are payable.  \n9\\. Double press to go task manager is very bad.  \n10.No water resistance.  \n11\\. Android or other charger port are totally different form iPhone charger\n,so you always need to carry your iphone charger.  \n12\\. No SMS delivery report.  \n13\\. Maximum apps are unstable like , notifications problem in olx,bbm,naukri.\nTyping problem in shopping app.  \n  \n14\\. Driving mode is not working properly.  \n15\\. Most unstable operating system iOS.  \n  \nTHIS IS GENUINE IPHONE & DON'T WORRY ! ,BUY AS SOON & GET INCREASE YOUR\nPERSONAL.  \n  \nEvery manufacturing company have some of lack ,some below quality product\nmanufactured ,so do not judge by bad review.  \nThank You.  \n  \nAFTER PUTCHASE I AM SURE THAT YOU WILL ASK YOUR SELF , WHY YOU WASTE YOUR\nMONEY ?  \n.\n\n", "Received the product with tempered seal ... not happy .. the plastic\nprotective cover also had bubble and dust which indicates it was opened\nearlier .\n\n", "Hi all  \n  \nI bought this product through AMAZON ,,the delivery is within 2 days ,packing\nis good ,AMAZON delivery is awesome..  \n  \nThe product is genuine and it connected with Apple I tunes and warranty got\nregistered ..after 2 weeks of usage the display gone ..  \n  \nUnable to switch on the phone,several attempts made but few seconds apple\nsymbol had come and gone..Complaint the issue thru on line Apple customer\nsupport,they directed to go the local service center in chennai,visited them\n,they said there was a error in OS(!!!!!),and corrected the device and\nreturned to me,after 3 days the display become full red,again complaint to on\nline customer support,,they directed to the local service center...  \n  \nThe way the mobile is working is pathetic ,my belief with he Apple brand got\nshattered ,its acting like a cheap unknown chinesh model..I am seriously\ndoubting about the AMAZON and APPLE combination,I hope they are selling the\ndefected products thru the AMAZON site (Both brands having a credibility with\ncustomers),,so with that they want push the defected products..Its big lesson\nfor me ..in future I shall not believe the brands blindly..  \nMy request to the buyers please think once again before buying APPLE products\nfrom AMAZON.\n\n", "best deal ever.. got it for 21000\n\n", "Well review is also posting by the same, awsum phone, it comes with 1gb ram\nbut working more better than the phones which is coming these days with 2-3gb\nram  \nI have 32 apps right now in my phones but no lagging at all 😎\n\n", "Should I buy it in 2017 or not considering its a 3 year old device. That is\nthe question I asked myself before buying . But trusting Apple, I plunged\nahead cuz I didn't want to buy a 70k phone for myself. Besides i had been\nusing my iPhone4 till 2016 and it did serve me well, but was quite lagging\nlately. Well I hoped if the 4 could be used , the 6 is definitely 2\ngenerations ahead.  \n  \nWell I was not totally wrong. It is still fluid and works well and serves the\npurpose I don't use it for gaming so can't say much but all my required\nproductivity apps, emails , messaging systems work flawlessly. Also the phone\nstill looks good and feels premium , no complaints there. So overall if it is\nserving me well why the 3 stars?  \n  \nWell couple of things which I don't expect from Apple  \n\\- There is a strange noise on the bottom right corner when you press the\nscreen. It's as if there is a space between the screen and the body of the\nphone. This kind of quality is not expected from Apple (remember the same\nissue was highlighted on the LeEco Max 2?)  \n\\- The Bluetooth works pretty strangely. Sometimes it gets connected,\nsometimes not. The same device (my Bluetooth speaker) works intermittently\nwith the phone. Even my other iPhone6 has the same issue so I don't believe\nit's a hardware issue. Many a times this phone doesn't even get discovered\nwith Bluetooth on.  \n\\- Selfies are really not worth taking with this phone.  \n  \nHence the 3 stars.  \n  \nRecommendation : If you are not a heavy user or someone who wants the latest,\nthis is still a worthwhile phone, but only at this cost. However if you are ok\nwith a smaller screen, go for the iPhome SE instead\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 August 2017", "on 21 August 2017", "on 6 October 2017", "on 10 March 2017", "on 16 July 2017", "on 10 April 2017", "on 10 May 2017", "on 4 January 2018", "on 7 August 2017", "on 1 July 2017"], "reviewer": ["Mr.Sanju", "Gairick Sachdeva", "Sachin", "Abhishek Singh", "Sourav Mitra", "Rahul", "Sheela", "Jitender Birua", "Amazon Customer", "Vikas Deshmukh"]},
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Still a best in 2017", "Dissappointed with Amazon", "Best and very durable device for normal users. For heavy users not gud.", "Apple is love. ❤️", "Gr8 product in ths range ...", "I am currently using a s7 edge as my daily driver but needed another phone and since the price was so good decided to get it and believe me", "Great for the iPhone lovers and still in budget", "Fantastic", "Poor quality phone", "Bad experience."], "review": ["Iphone 6 in mid 2017 sounds bit old.  \nBut this phone preformes like a beast.  \nIphone doesn't need 6gb or 8gb rams bcoz the ram management is so good.  \nThe camera is still the same from iphone 5s but great than lots of phones in\nsame price range. Good phone go for it.  \nThumbs up to Amazon for great service and genuine products.\n\n", "contact me on my no. as i have tried ur no. 40 times but couldn’t speak with\nexecutive.  \nThis is regarding my cashback of 10 percent on HDFC card\n\n", "Very happy with device. Following opinions:  \n\\- Great device all over  \n\\- One day battery backup usually  \n\\- heat while heavy gaming.  \n\\- No problem while normal use (daily use apps).  \n\\- Too slim and light weight  \n\\- Not good for heavy gammers  \n\\- For normal user best device ever no lag etc. while run dail apps and social\napps.  \nI6 vs moto g5 plus:  \n\\- Moto g5 plus rear camera is better. but iphone 6 produce more natural\npicture  \n\\- iphone 6 fron camera is better.  \n\\- moto 5g plus have gud performance.  \n\\- Using iphon6 is better experience.  \n\\- iphone 6 design far better than moto g5 plus  \n  \nSame day delivered sealed box.\n\n", "Apple been best from beginning. If you are bored from android just jump to ios\nor bbos. And its best. Enjoying using iPhone 6. 32gb is way alot storage for\nme. Camera is just awesome, focus is perfect. Low lighting mode is some what\nhazzy. But other else its best.\n\n", "I m dissatisfied with the delivery of product , it was too late .. ths is my\nsecond i phoneas before i had 4s .. this phone is gr8 as compared to others ..\nit has a little heating problem whn charging and playing game for long time\nbut overall performance is good .. i checked from apple india regarding its\nauthonticity and found ok... it has no fasting charging facility ... best\nproduct in this range with 32 gb internal memory .. i m satisfied\n\n", "Got this at an absolute bargain . I am currently using a s7 edge as my daily\ndriver but needed another phone and since the price was so good decided to get\nit and believe me, with just 1gb of ram it's still very responsive and even in\n2017 it's quite relevant\n\n", "Amazing! This phone is much much more comfortable in hand and feels really\ngood than 5s. 6s is too big for someone who's coming from using a 5s. The\nsound quality, the camera quality, everything is great! And the delivery! Just\nin 2 days. Loved this experience!\n\n", "Apple. It's just awesome. First time users would find a Lil difficult to\ninitialize but it's worthy. Mind blowing offer and very quick delivery by\nAmazon. Even the 6 model would match the flagship android phones coz it's\napple.. Give it a try\n\n", "Poor quality phone.... They send me a defective piece... It's has a white spot\non the screen. There is no preinspection about product or I think they have\nonly defective pieces.\n\n", "Received iphone 6 yesterday and found faulty display as display has vertical\nlines on it. Trying to return it but its taking to apple support center, get\nthe phone diagnosed but found hardware issue. Bad experience.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 August 2017", "on 27 December 2017", "on 17 August 2017", "on 13 September 2017", "on 20 April 2017", "on 26 August 2017", "on 8 September 2017", "on 25 September 2017", "on 18 October 2017", "on 27 September 2017"], "reviewer": ["jenil dave", "8826641721", "Ammy", "Amazon Customer", "NIKUN", "chandrakant  ezong", "Hitesh Kamra", "Ezhilvendan", "Raj", "Satender Tiwari"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Exchange", "Totally worthless....please dont buy", "Great buy for me", "Refurbished Product with New Labelling... i am cheated", "Original unused product", "It's good,. as expected", "Four Stars", "DEFECTED I PHONE", "Really Wonderful and Amazing Amazon", "Five Stars"], "review": ["I want exchange the my mobile becuase of display will broken so I m not\nsatisfaction plz exchange the gadget\n\n", "Please don't go with the price.... even I suggest that if this product will be\nget in INR 2000 that will be the expensive.... Camera quality is not up to\nmark... while capture pic in the night getting spotted pic ....also whenever\nusing internet on the phone it will be heating.... I think amazon make the\npeople fool about this product.... please don't buy.....it totally\nworthless....  \nAmazon sell this product as a new product but after using this I think it's\nrefurbished one.... if any one purchasing a phone of INR 29000/- so how can\nexpect he take the refurbish phone.  \nIn the same price having so many option in the market for brand new\nproducts...  \nAlso suggest to Amazon before adding the product for sale Amazon need to\nmention that it's new or it's will be refurbished....\n\n", "Okay here comes my review after using for 2 days now. First i was very afraid\nto buy this phone cos of the bad reviews being given by the customers. Still i\nbought it. And i think i made the right choice by doing so cos the iphone i\ngot is awesome. No heating. No lagging or hanging. 1 gb of ram and functions\nmuch better than those 3 gb ram androids. Im not a selfie fan so i dont care\nmuch about the front camera still the back camera is crystal clear.  \nThe phone is slim and sleek and once you hold it, it feels good in the hand. I\ndont even wanna hold a 5.5 or above inch sizes anymore. As for the battery,\nonce fully charge you can go through the day with about 40 pc remaining. I\nsuggest for you the seller EMobiles. Cos the product they deliverd is genuine\nand warranty fully covered by Apple. I am loving this phone to the very\nextend. About the storage, out of 32 im getting 22 and i think thats enough\ncos i dont usually keep much videos in my phone and always watches online. Mp3\nyou can keep it to thousands and thats awesome.  \nSo Im loving this phone and the price purchase and I would also suggest you to\nbuy it and it wouldnt dissapoint. Just remember to buy it from a trusted\nseller. For me mine was EMobiles if you need any suggestion.\n\n", "Got the refurbished product ... its damn slow and took various attempt to\nenter my apple id . this happens when the phone is 3 years and more old . On\nvery first call it got hang ... and after that almost 4-5 times it was hanged\nin 2 days only .\n\n", "Original unused product, I have checked in apple website for the date of\npurchase and I found it is very new.\n\n", "It's good ,.as expected ,😀\n\n", "\n\n", "not satisfied i phone is defected... bent pc.. kindly change my i phone\n\n", "Really Wonderful and Amazing Amazon !!! Also appreciate your Mr Karan of\nCustomer Care wing; he helped me out very well. Great Chap !! Keep it up Karan\nn Amazon !!!\n\n", "Simply awesome!!!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 December 2017", "on 22 March 2017", "on 15 May 2017", "on 9 March 2018", "on 21 November 2017", "on 30 January 2018", "on 13 February 2018", "on 15 March 2017", "on 1 October 2017", "on 31 January 2018"], "reviewer": ["chandu", "Amazon Customer", "Jeson kshetrimayum", "Jitender K.", "SONU JOHNSON", "Joban", "Amazon Customer", "Amazon Customer", "Taxap Peer", "Subisha"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Review after 2 months of useage", "Sh*t product", "Now had bought new Iphone 6 32gb for amazing price still its freaky 16gb is costlier than 32gb", "Seems like refurbished.", "delivery is good", "Very poor experience with this", "Really a nice phone The photo has been taken by iphone 6 ...", "5Star for Phone But 0 star for Amazon 0% EMI offier", "Accessories is local not original", "Fake iphone Dont buy...moreover check the link of this product it says.\" http://www.amazon.in/Exclusive-Dummy-ASIN197/dp/B01NCN4"], "review": ["I have purchased iphone 2 months back. This is my first apple product and I\nwas very much confused before buying this phone. I have seen a lot of negative\nreviews about this product and some have got defective piece, fake products,\nrefurbished phone etc. I have read lots of reviews and comparisons before\npurchasing, since I'm investing more than 25k for this phone. I was using\nandroid phones earlier, Samsung Htc etc, so I was not sure whether to go for\niPhone or not.  \nBut after 2 months of usage, I feels I have made right choice. The delivery\nwas fast and before expected date, also the product I received is completely\ngenuine and in perfect condition, thanks to amazon. I have confirmed the\nwarranty with apple website. 1 gb RAM in iPhone is far better than 3-4 gb\nandroid ph available in market. The camera is very good and it is up to my\nexpectations. There is not heating problems and also the phone never hangs\neven with lots of background applications. Only problem is with the battery\nlife, it discharges very fast and if you are using the phone continuously\n(movies, youtube, games etc) it will last for only 3 hrs max. But the best\npart is that when the phone is idle there is no discharge. Even with 20 %\nbattery the phone won't get switched off for 3-4 hrs.  \nPros: the brand value of iPhone  \nBeautiful, slim and unique design  \nGood camera and display  \nCons: battery drains out very fast  \nScreen is not gorilla glass, you will be in trouble if u dropped ph  \nSingle sim and no option for external memory card and expandable memory  \nLimited free applications in Apple Store  \nDisplay is not full HD  \nPrice is very high comparing to features and specifications .  \nOverall experience is very good till now and iPhone 6 met most of my\nexpectations\n\n", "Not even single star! I got a defected piece...\n\n", "I have 5s got broken but still going strong.Now had bought new Iphone 6 32gb\nfor amazing price still its freaky 16gb is costlier than 32gb:-) anyways here\nis my review. Quick delivery from amazon and iphone is really amazing its\nfresh and looking sexy, also conformed with apple warranty and IMEI tracking.\nJust started using haven't found any bug or hung or overheating. Time to\nrock!!:-)\n\n", "The charger not working. Seems like refurbished. Phone stopped working in 2\nmonths, I’m asking for the bill these people are not sharing.\n\n", "Product ( apple iphone 6 32 gb ) are Damage piece ( screen clicking problem )\n\n", "I received a shoap instead phone.  \nVery poor experience with this..\n\n", "Really a nice phone  \nThe photo has been taken by iphone 6 by me but I do say that the iphone 6's\nbattery life is a lil less but it's still fine to use those doesn't stick to\ntheir phone for hours. Really iphone 6 is better than iphone 6s . A guy is\nwasting his 10-12k for the 6s js for a 3d touch and live photos which the 6s\nusers dont use often . The 6s n 6 has the same speed and no one minds half\nsecond!!! I also say that iphone 6s is better than the 7 . Atleast u have ur\nheadphone jack ....lolN let me tell u that iphone 6 is the lightest phone ever\ncreated by apple ......\n\n", "Phone is good no doubt but the offer which amazon kept was for 0% EMI\ntransaction, i took phone under this offer , but amazon team deducted the EMI\nintrest + GST on that ,when we tried to reach put them , they diverted to bank\nand bank was saying we didn't got any information for 0% EMI offer .  \nEMI transaction in amazon website, but still interest was charged. after\nreaching out amazon several times no resolution , they divert it to bank and\nbank divert it to amazon.  \n  \nAfter many call i got frustrated and left that issue unresolved , as whenever\nyou call to amazon team their representative don't know the issue and again\nyou have to explain the issue and they will ask for 5-10 working days but with\nno resolution.  \n  \nso never go for such EMI transactions. better pay full and happy.\n\n", "This review after using 20 days. Mobile working excellent battery life is\ngood. Superb Camera quality.  \nBut i visit to I Phone center they told me mobile ear phone is local not\noriginal... So be aware.....\n\n", "Received a Fake product\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 June 2017", "on 15 May 2017", "on 2 May 2017", "on 8 October 2017", "on 25 March 2017", "on 14 April 2017", "on 1 November 2017", "on 14 September 2017", "on 18 July 2017", "on 26 March 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "Amazon Customer", "Pooja Khanna", "dhareshpambhar", "Vikash singh", "Amazon Customer", "Sandy", "Naresh", "Amazon Customer"]}
]