[
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["IMPORTANT: PLEASE READ THIS!", "Got the best deal :)", "HOLD YOUR HORSES", "GREAT FLAGSHIP OPTION.(see detailed review)", "One Star", "Great Hardware. Awfully Unintuitive And Impractical Software Experience!", "Apple iPhone 7 Review - Black Beauty !!", "Five Stars", "My review after almost a month of usage. Simply amazing!", "I Own iPhone 6s+ and upgraded to iPhone 7 plus but a huge disappointment from Apple. Nothing wow factor in new phone."], "review": ["I have used every model of iPhone since 2007, and I bought both iPhone7 and\niPhone7 Plus, so I think I can review this, but I am not going to. I think I\ndon't need to review an iPhone! It is out of the world, no doubt about that,\nbut I am here surprised because I actually got an email, asking me to give 1\nstar rating to iPhone7 on amazon.in, and in return, they'll send me some\nfreebies! This is both terrible and concerning. Looking at the reviews now, it\nis quite evident that people in India are obviously believing this. EVERY\n1/2/3 star review is fake, and it is really easy to spot one.  \n  \n\\- NONE of them have 'Verified Purchase' badge, infact as of now, I am the\nonly one with this badge!  \n\\- Most accounts were created on the same date to get the freebies.  \n\\- Most have only 1 item review history. I hope they all are getting their\nfree USB data cable.  \n\\- There are bots that can create these fake amazon accounts with disposable\nemail ID's.  \n  \nI have reported this issue to amazon, and I hope they are taking required\nactions.\n\n", "Bought this recently during the great Indian sale for 38000Rs (offer price\n39999Rs minus 1500Rs on HDFC credit card minus 500 Rs ( got cash back)for\nadding 5000 Rs in my amazon pay balance account ).  \n______________________________________________________________________________________  \nProduct delivered on time with NO DAMAGE and WELL PACKED.  \n______________________________________________________________________________________  \nBought a phone online for the first time and satisfied with what I received.\nEverything is working perfectly.  \n______________________________________________________________________________________  \nADVICE WHILE BUYING A PHONE ONLINE:  \n1) check the bill and box . IMEI number should match with the bill and box\nprovided. .  \n2)to be on a safer side take a video while unboxing. (There have been cases of\npeople not getting their money back even after they getting a different\nproduct ).  \n3)check all the features of the phone that includes  \na) is it able to read the SIM card ?  \nb) look for any scratches or damage/crack on your screen  \nc) check the camera ( both front and back )  \nd) fingerprint scan should be working properly  \ne) is it able to record your voice and activate SIRI?  \nf) call your family member and check the function of the speaker and\nmicrophone  \ng) other minor things to check - FaceTime,iMessage,wifi , mobile internet /4g\n,Phone speaker,etc  \nh)check the volume buttons and the earphone jack which is defective a lot of\ntimes when you buy online  \n_____________________________________________________________________________________  \n_____________________________________________________________________________________  \nWhich iPHONE 7 to buy ? 32GB V/S 128GB V/S 256GB?  \n  \nthe difference between the iPHONE 7 - 32GB(45,990Rs) ,128GB(56,999Rs) & 256\nGB(62,998Rs) is the PRICE and STORAGE capacity  \n  \nADVICE: iCLOUD is providing 5GB of FREE storage.  \nIF you want ADDITIONAL STORAGE the pricing is as follows :  \n>>>50GB- Rs 75/month . PER YEAR it comes to 75*12=900Rs(for 1 year\n)...1,800Rs(for 2 years)...2,700Rs (for 3 years)  \n  \n>>>200 GB- Rs220/month. PER YEAR it comes to 220*12=2,640Rs(for 1 year\n)...5,280Rs(for 2 years )...7,920Rs(for 3 years )  \n  \n>>>2TB- Rs 750/month. PER YEAR it comes to 750*12=9,000Rs(for 1 year\n)...18,000Rs(for 2 years )...27,000Rs(for 3 years )  \n  \nIF YOU WANT ADDITIONAL STORAGE GO FOR THE 32GB iPHONE 7 and buy the iCLOUD\nplan accordingly. YOU WILL END UP SAVING A LOT OF MONEY .  \n_____________________________________________________________________________________  \n_____________________________________________________________________________________  \nINSURANCE FOR YOUR IPHONE?  \nYes it is always good to have insurance for your iPhone. (My brother lost his\niPhone 7 Plus 128 gb during ganpati visarjan but got 45K back due to\ninsurance.)  \n_____________________________________________________________________________________  \nIPHONE 7 V/S IPHONE 8 . WHAT TO BUY ?  \nIf you already have an iPhone 7 there is no point wasting money for the iPhone\n8 . You may wait for the iPhone 10.  \nIf you compare iPhone 7 and 8 the iPhone 8 is just going to be a bit faster\nthan the older iPhone 7. Lot more processing ,opens faster and faster gaming\nthan iPhone 7. No major changes to get excited about .  \nPrices of the iPhone 7 and 7 plus have come down drastically and I would\nrecommend going for the 7/7plus . If you have the money and are willing to\nwait then you can go for the iPhone 10.  \n  \nNOTE: will update my review after unboxing iPhone 8 and 10.  \n  \n**********UPDATE (8th OCTOBER 2017)************  \nApple investigates reports iPhone 8 Plus batteries BURST OPEN while phone\ncharges. After this news I feel that people should not buy the new iPhone\n8/8plus and iPhone X till this matter is solved .  \nWill KEEP on UPDATING.............\n\n", "NOTE: This review is addressed to that class of people for whom Rs.60000-70000\nsmartphone is once in five years thing.  \n  \nBefore you judge the rating which I have given and draw conclusions, I just\nwant to let people who read this review realize that I am after technology\nwith some innovation and out of the box concept as I never use a smartphone\nbeyond 12 months. In this process, I literally used every high-end smartphone\nthat was launched after iPhone 3G (my first hold of a smartphone), be it\nxperia, blackberry, samsung, nexus, HTC, what not!  \n  \nNow, coming to the point of fake ratings. I am a bit surprised to see so many\nnegative reviews for an iPhone 7 on Amazon. KINDLY SEE FLIPKART, without the\nproduct even launched on their site, there are 864 ratings and as much as 4.9\nstars out of 5 and not a single review (I am enclosing a pic for your\nreference). So, there is something which doesn't catch our eye. But these are\nthe lame tricks that get played when you go neck to neck in competition, it\napplies to either side.  \n  \nABOUT APPLE  \nUndoubtedly, I give huge credit to Apple for introducing smartphone concept\nand in the process they slowly killed the once mighty Blackberry. Like Thomas\nEdison, credit goes to Apple for inventing such a masterpiece. But we are\nstill not using the same bulb which Edison has invented. There are so many\ncompanies which are reinventing bulbs every year. Apple followed it up for few\nyears with some changes in iPhone to keep the customer base solid. There is so\nmuch hype created over every Apple launch and in the process, the adversaries\ntried to copy the launch styles of Apple. So, they clearly have the margin.\nBut, they are surely lagging behind in terms of innovation. This year iPhone 7\nis one that's a perfect example.  \n  \nCOMING TO THE PHONE  \nWatched the launch event so closely, like I always do every year. I was using\nan iPhone 6 and was waiting for 7 (I have had an occasion to handle and\nexperience both iPhone 7 and 7 plus even before they were launched in India).\nAnd finally ended up with Galaxy S7 Edge for a reason (BEFORE COMMENTING, RE-\nREAD WHAT I HAVE WRITTEN IN THE FIRST TWO PARAGRAPHS OF MY REVIEW). I opted\nfor S7 Edge for its curvy screen design with brilliant colours and the camera\nwhich beats the iPhone The dual camera on iPhone 7 plus is not new to the\nworld before its launch. Secondly, they have their eyes set for the 10th\nAnnniversary of iPhone in 2017 and are holding their cards till then. Both iOS\nand Android have their own pros and cons. This is the area which I am\ncarefully and deliberately side lining and focusing on the phone.  \n  \nThis year launch of iPhone 7 is only for those geeks, unlike me, who actually\nstick to iPhone for life and for whom the price tag is just a symbol to\nflaunt. Honestly, as most of the Apple users agree, what matters is the design\nof the phone. If i see a person standing about 5 feet away from me with an\niPhone 7 (not plus) and me holding my iPhone 6, a third person will obviously\nthink we are using the same phone (not talking about brand). So, if I were to\nshell Rs.60000 for a phone which retains the same design crafted with\nprecision for three straight years, I better buy a device which satisfies me\nwith its looks and performs as closely as an iPhone but loses the battle. And\nwith Rs.20000 cheaper. I put my chips in there. Unless you have to run tasks\nwhich need some significant power like Games, it's not worth an upgrade or a\nfirst time buy.l  \n  \nI would request people to just think a bit before investing your hard earned\nmoney to go for iPhone 7. Join the line in which I am standing for the\n\"revolutionary\" design of an iPhone 8 in 2017. Because, that's when Apple is\ngonna show again to the world that they are masters of innovation.  \n  \nAll the best!\n\n", "I'm writing this review after using the iPhone 7 for about a week, here are\nthe things that I liked, disliked and thought are worth to mention.  \n\\-------------------------------------------------------------------------------------  \n-WHATS IN THE BOX-  \n==================  \n1\\. THE IPHONE 7 ITSELF  \n2\\. THE LIGHTNING EARPODS  \n3\\. LIGHTNING TO 3.5 MM JACK CONVERTOR  \n4\\. LIGHTNING TO USB CABLE  \n5\\. POWER ADAPTER  \n6\\. SIM EJECTOR PIN  \n\\-------------------------------------------------------------------------------------  \n-THE DESIGN-  \n=============  \nSo the new iPhone 7 black variant has a nice aluminum body with matte finish.\nthe iPhone 7 is also now waterproof with IP67 rating. the 12mp rear camera\nwith the led flash are present on the back, the power button with the I'm tray\nare present on the right side, the volume rockers and the profile button are\nlocated on the left side, on the front we have the 7mp f2.2 camera, ear piece,\nsensors and the 4.7 inch 1334x750-pixel resolution at 326 ppi display and the\nhome button are present, now the home button is not really a button, it has\nwhat apple calls the taptic engine which gives a haptic feedback and simulated\na real button, but doesn't really feels like a button, you can select the type\nof haptic feedback you like form three options. the home button also has the\nfingerprint scanner or touch id, its a nice quick and accurate scanner. the\n4.7 inch display great too. with great viewing angles, vibrancy, and color\nreproduction. the colors looks natural and with nice saturation and contrast.\nexpected nothing less from apple on this. now the biggest down side of this\nphone is the removal of the headphone, apple says that the lightning connector\nworks great as an audio source for headphones, but I still miss my the 3.5mm\njack, apple did provide a small lightning to 3.5mm adapter which is something\nyou also need to carry around if you want to listen from your normal\nheadphones or you have to switch to Bluetooth audio.  \n\\-------------------------------------------------------------------------------------  \n-THE CAMERA-  \n=============  \nthe camera has a good improvement from the iPhone 6s, it doesn't have dual\ncameras like the iPhone 7 plus, but it performs great. the are very detailed\nwith great color reproduction, contrast level. the images are vibrant with\ngood amount of saturation and sharpness. the 12mp camera now also have optical\nimage stabilization so the video are nice and stabilized as the iPhone 6s it\nalso shoots in 4k, the front facing 7mp camera has been improved a lot, its\nhas nice wide frame and the image quality is also very natural, the video\nquality of the front facing camera is also nice you have to be careful with\nlighting or otherwise the contrast levels sometimes gets messed up.  \n\\-------------------------------------------------------------------------------------  \n-THE PERFORMENCE-  \n======================  \nthe iPhone 7 has the apple A10 fusion chips with six core graphics and 2gb of\nram, the new processor performs great, it easily handles heavy usage and\ngaming, multitasking is also very fluid, it easily handles tons of app running\nin the background simultaneously with just 2gb of ram. the iPhone 7 comes with\nthe new iOS 10 which has great features like the new version of siri and\nimproved 3d touch. if you are a moderate user it will work flawlessly for you.  \n\\-------------------------------------------------------------------------------------  \n-THE BATTERY-  \n================  \nthe iPhone 7 only have a 1960 mah battery, but don't let that small size fool\nyou it easily lasts a day even under heavy usage you can easily get it to work\ntill night. another down side of this phone is that it doesn't support fast\ncharging, it takes around 2 hours to fully charge from 10% to 100%. but you\ncan also use an ipad charger to make the charging speed a little bit faster.  \n\\---------------------------------------------------------------------------------------  \n\\- THE PROS AND CONS-  \n-THE PROS-  \n==========  \n1\\. GREAT BUILD QUALITY  \n2\\. WATERPROOF  \n3\\. GREAT CAMERA  \n4\\. GREAT DISPLAY  \n5\\. FINGERPRINT SCANNER  \n6\\. GREAT FOR GAMING  \n7\\. GREAT FOR MULTITASKING  \n8\\. STEREO SPEAKERS  \n  \n-THE CONS-  \n============  \n1\\. NO HEADPHONE JACK  \n2\\. NO FAST CHARGING  \n\\-------------------------------------------------------------------------------------  \nFINAL VERDICT- The iPhone is a great flagship smartphone with great specs,\nperformance and camera, it might not be that much worth to upgrade from an\niPhone 6 or 6s but if you want the better camera, waterproofing you can\ndefinitely go for it.  \n\\-------------------------------------------------------------------------------------  \n[...]  \n\\-------------------------------------------------------------------------------------  \nTHANK YOU\n\n", "Got a defected piece\n\n", "Came to this phone after selling my Google Pixel XL, which was a great phone\non its own, but wanted to see what the fuss is about iOS and Apple's better\napp ecosystem and all that. My main comparison of this phone will remain with\nthe Pixel.  \n  \nPositives first:  \n  \n\\- Top class build quality. The phone looks solid, feels solid. Finishing of\nthe product is top notch.  \n  \n\\- Taptic Engine. Vibration motor of a phone is a hugely important thing and\nthis phone has the best vibration I have ever experienced. No Android flagship\nphone I have used has anywhere near the intensity or quality. Reminds me of\nthe olden days of them Nokia phones with huge vibration motor inside them.\nGreat job there hands down.  \n  \n\\- Camera is good. In low light especially. Noise are kept well in control.\nOverall the camera can't beat Pixel, can't beat a lot of other phones anyway,\nbut its a good camera, especially for someone who used to use DLSRs for long\ntime to appreciate natural, less saturated output. And video quality is\ntremendously good.  \n  \nThough the front camera is awful. I almost never use it, but coming from a\nPixel it felt like having a VGA front camera.  \n  \n\\- Fingerprint reader is in the best position in front, and it works every\ntime.  \n  \n\\- Smoothness. Well smoothness is good. Definitely much less frame drops\noverall across the UI than Pixel, but not to an extent where it could make\nsignificant difference anyway.  \n  \n\\- RAM Management. Excellent. For a phone having 2 gigs of RAM, well I can\nonly laugh at Android. Where Pixel reloaded apps with double RAM, this thing\ncan apps in memory.  \n  \n\\- Battery life. Very good. For a tiny sized battery, I am getting 6-7 hours\nof SoT with 24 hours of standby time.  \n  \n\\- RAW Speed. Needless to say anything about the A10 chipset. It chews\ngraphically demanding games and apps like nothing. There simply is no Android\nphone which can come anywhere close.  \n  \nNow the Negatives, which outdo the positives for my usage:  \n  \n\\- Most impractical and unintuitive OS I have ever experienced. The scrolling\nmechanism is stupid. You can't scroll fast up or down, it will stuck at a\npoint, so you will get tired. And it misses some touches in the process to.\nWaste of time. Free flow scrolling for life.  \n  \nThen there is no system wide BACK option. This will drive you bonkers if you\nare coming from android. Every app is different, where most apps do have the\ngesture support of left to right to go back to previous screen, its still\nnowhere near as fast as simply hitting a back button. And on some apps there\nsimply is no gesture support, like Paytm for example. And the back button is\nlocated on TOP LEFT corner, which you can't reach with one hand, and I am\nusing the smaller version of the phone. You can touch the home button twice to\nactivate a reduced sized display of current screen, but it goes away as soon\nas you do something which requires to move to another screen. Ridiculous\nbeyond explanation.  \n  \nAlso there is no share option to other apps like Snapseed or Drive or Google\nPhotos directly from the native Photos app! Another time wasting thing!  \n  \nThere is no T9 support on the native dialler. ROFL.  \n  \n\\- Call quality. I don't know but I just don't like the call quality,\nespecially when I am coming from a phone which had brilliant call quality.  \n  \n\\- SAR value! Don't know how it could be that absurdly high! Check GSMArena\nspecs! Scary really!  \n  \n\\- No fast charging. This simply should be here. Even this smaller battery\ntakes full two hours to charge fully, LoL.  \n  \nThat's it basically. When this phone works for a lot of people, who think that\nthis phone is miles ahead in terms of whatever, probably for the fruit logo at\nback side, this was simply not for me. Absolutely ridiculous amount of time I\nwasted trying to do simple things. I never did care about the Apple logo, God\nknows which type of people care about that, so for me, I need something which\nis much more practical, much more intuitive, and which won't drive me bonkers\nfor simple stuffs, so yeah that was Apple for me.  \n  \nBest of luck.  \n  \nRegards,  \nSaurav\n\n", "Overview - On the outside, the new iPhone looks basically the same as the\niPhone 6/6s. They are now water resistant, which is nice, although they’re not\nfully waterproof, keep them submerged in a meter of water for more than 30\nminutes and things might not go your way.  \n  \nOnce you wrap your head around the missing audio jack (it's not the end of it,\nyou can get a designated adapter for your favorite headphones), the Apple\niPhone 7 is a major upgrade. IP67-certified water-resistant body. Bigger and\nbrighter camera with OIS. New FaceTime cam. Stereo speakers. Faster processor\nand 50% GPU performance increase, more RAM. New pressure-sensitive Home key\npowered by a new taptic engine. Revised storage options.  \n  \nBattery - iPhone 7 is powered with the newest A10 Fusion chip. It is a quad\ncore processor which helps in better managing the battery life. It takes\naround 2hrs to completely charge from 0-100% and the battery usually lasts a\nday. I am a heavy user, and use the phone quite a lot during the day.\nWhatsapp, Twitter, Calling and Messaging are the main battery draining apps\nfor me. I will be left with 20-25% battery at the end of the day with typical\nusage.  \n  \nPerformance - Apple made the best mobile chipset from which others can only\nlearn from. Its dual-core processor, even without the help of the tiny energy\nefficient cores, beats any other processor out there. The A10 GPU is equally\nimpressive acing every graphic benchmark. The iPhone 7 is the fastest and most\npowerful smartphone in the world as of now.  \n  \nAudio - iPhone 7 has stereo speakers, considering my previous iPhone was the\n5s, it is a huge upgrade for me in the audio performance. Loudspeaker is\npretty good, audio output is loud and clear. Call quality is damn good.  \n  \nCamera - The colors and contrast are great and the dynamic range is simply\ngreat - much like you would get on dedicated big cameras. In any case, the\niPhone 7 delivers the most balanced dynamic range from any smartphone at the\nmoment. The optical image stabilization is the addition that really matters as\nit will keep the lens steady and won't allow for blurry shots at low-light.\nThe front-facing camera got its resolution boosted to 7MP and records 1080p\nvideo. It can use Retina flash, where your screen lights up in different\ncolors depending on the intended white balance of the scene. Pretty good when\ntaking selfies in dark environment. Coming to the 4k video recording, it is\nthe best camera when it comes to 4k Video, Period.  \n  \nOverall a great package and the phone will definitely last 3+ years if used\ncarefully. There won't be any performance issues considering Apple will\nprovide updates regularly and the phone won't lag after using it for a year or\nso unlike the android phones. The phone is also water and dust resistant, if\nwe accidentally end up dropping the phone in water, there is no need to worry.\nThe phone can even be used to take pictures in swimming pool and shallow\nwater(Be careful with the depth of water else phone will be toast). Putting a\ncase and a screen protector will ruin the beauty of phone and the phone won't\nfeel the same, but if you are the one who drops the phone constantly then Case\nand Screen protectors are necessary evils. I got it for a price of 36500/- in\nthe Great Indian Sale :p  \n  \nAbsolutely Loving it !!\n\n", "After initial hiccups it’s working nicely\n\n", "I have bought my iPhone 7 32GB Matte black on 8th Oct just the day after the\nphone has been launched in India. I have been using it since almost a month. I\nbought it directly from apple store. And truly i would say, its an amazing\ndevice. My reviews are below.  \n  \n1\\. Great display, its has more color gamut than its previous versions.  \n2\\. Great stereo speakers, as it has 2 speakers one at the head another at the\nbottom.  \n3\\. The antenna band is only 5% visible in bare eyes, until & unless you\nminutely see it. So the design at the back side looks really clean and sturdy.  \n4\\. Home button is no longer a physical button now, so it gives you haptik\nfeedback whenever you give an amount of pressure to it. So the amount of\npressure you apply decides what function it would invoke.  \n5\\. The iSight camera now has OIS. So no flickering even if you are shooting\nwhile running.  \n6\\. The touchID is much more faster than 6s. takes a bare minimum of 9-10s to\ncreate a touchID.  \n7\\. A full charge of battery on heavy usage lasts a day. But if you are a\nmoderate user it can last even more. And surprisingly it takes only 2 hours to\ncharge it 100%.  \n8\\. The Matte finishing on the back side is much more smoother and silkier\nthan 6s. And believe me just go for Matte black if you are planning to buy it.\nThe jet black version is a heck of fingerprint magnet, it takes a scratch even\nif your nails touches the back side. If you are going for a jet black version\nplease buy a leather back cover before you open the plastic seal of the phone.  \n9\\. Apple says the phone is splash resistant, but i have seen many of the\nvlogs the phone is actually water resistant upto 1 metre.  \n10\\. The conversion of 3.5mm jack to reversible connector has improved the\nmusic quality even more.  \n  \nOne important thing i would say to every apple user, please buy apple products\ndirectly from apple authorized sellers or re-sellers. You can buy it from\nReliance Digital, E-Zone, Apple store. Don't buy apple products from online\nportals, as none of them are authorized by Apple. So if anything gets damaged\nto your apple device Apple service center doesn't accept the product. And this\nhas happened with many a people.\n\n", "Sure, Apple's new iPhone 7 and iPhone7 Plus are amazing. They're fast. They\nhave cool new cameras. They're available in a sleek jet black finish. And\nthey're even water-resistant, so you can play Pokémon GO in the rain. But\nthey're not perfect, so before you shell out $650 or more for a new phone, be\nsure to consider some of the things that aren't quite perfect about Apple's\nlatest models.  \n  \n1) No headphone jack. We knew this was coming, but it still comes as something\nof a shock. The venerable headphone jack is gone. Apple is including both a\nset of earbuds that work with the iPhone 7's Lightning port, as well as a\ndongle that will let you connect your existing headphones to the phone, but\nthe company really wants you to switch to wireless headphones, something that\nwas emphasized repeatedly in the iPhone 7 launch event (and if you want to\ncharge your phone while also wearing headphones, that's your only option).\nWhich leads us to...  \n  \n2) AirPods aren't included. Apple's new wireless earbuds do look awesome.\nThey'll work with Siri. And the Apple Watch. And automatically pair with all\nof your Apple devices over iCloud. But they're $159, and won't be available\nuntil late October. So, be sure not to lose that dongle before then.  \n  \n3) Dual-lens camera is only available in 7+. Apple boasts that the new dual-\nlens camera is the best on the market, and with a real zoom lens and the\nability to do all sorts of slick depth-of-field tricks, it may indeed smoke\nall other smartphone cameras. Too bad it's only available in the iPhone 7+. If\nyou opt for the smaller, less expensive iPhone 7, you still get a camera that\nbeats the one in the iPhone 6, thanks to a better lens and image\nstabilization, but it's not the best on the market, is it?  \n  \n4) It's going to get all scratched up. Cult of Mac points out that Apple has\nwarned that that new, cool jet black paint job is more susceptible to \"fine\nmicro-abrasions\" than other colors. Not that it really matters, since...  \n  \n5) You'll need to buy a new case. Sure, despite a new color, the iPhone 7\nlooks almost identical to the 6/6s models it replaces. But looks can be\ndeceiving. While the dimensions of the iPhone 7 are indeed nearly identical to\nthose of last year's models, its new cameras mean that the camera cutout on\nmany older cases won't fit right. And instead of a headphone cutout at the\nbottom, you'll need a case with dual speaker cutouts for the iPhone 7's new\nstereo speakers. Bottom line: Be prepared to spluge on a new case to go with\nyour new phone.  \n  \n6) It's not waterproof. You may see references to the iPhone 7 being\nwaterproof, but it's not. Apple refers to it as being \"splash, water and dust\nresistant,\" and warns that its resistance level could \"decrease as a result of\nnormal wear.\" The company also warns that the phone's warranty doesn't cover\nliquid damage, so you may want to avoid any temptation to take your new iPhone\ninto the shower with you.  \n  \n7) It's an iPhone. If you're a fan, that's great. But if you're one of the\nmillions of Android owners out there (and globally, Android's market share is\nmuch bigger than that of Apple's iOS), it was just another opportunity to\npoint out how much better your favorite platform is (not that Android phones\ndon't have their share of problems).\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 October 2016", "on 29 September 2017", "on 9 October 2016", "on 23 November 2016", "on 24 July 2017", "on 7 May 2017", "on 2 September 2017", "on 2 October 2017", "on 31 October 2016", "on 13 October 2016"], "reviewer": ["Satyajeet Vishwakarma", "Dr Chail Shah", "Kamesh", "YASH GUPTA", "Amazon Customer", "Saurav Ghosh", "Samrudh", "Amazon Customer", "Rajdeep Sengupta", "Rahul"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Awesome phone", "Got it for Inr 42360 over prime and I am so so so happy with this buy.", "Ya a true good an genuine product", "Good phone but..", "Colour Peel off", "Four Stars", "GO for IT mAN", "Heating issue..but just go for it..", "Iphone 7", "Three Stars"], "review": ["Excellent phone; brand new with full warranty as checked online ; perfect\ncamera; powerful battery life; aesthetic design and great performance. No\ncomplaints whatsoever. Got jet black 128 GB below 50 K.\n\n", "Still super happy\n\n", "Ya a true good an genuine product ... but I have to check with the Apple guy\nbecause I think the product display is little yellowish...as photo is attached\nyou can see the color difference of the upper part is white an down keyboard\npart one is little yellowish .\n\n", "Good phone but go for iPhone 7plus if you can..  \nCamera and audio both are good but battery could have been slightly bigger May\nbe 2500 mAh  \nIn heavy use with gaming and internet battery lasts for 4 to 4.5 hrs. If not\nused, after a full charge battery will be around 95 to 92 % after 8 hrs..  \nScreen size is bit small compared to other phones therefore phone is also\nsmall and very slim..make sure that u purchase cover immediately after\npurchasing phone..it is bit slippery..  \nI purchased for 39500 at time of Amazon flash sale..processor is quite fast\nand no lags during heavy gaming can be noticed..  \nFront camera is also good..  \nStill I will suggest to go for iPhone 7 plus if you are bot tight on budget..  \nI'm posting this review after 2 months use..Thanks\n\n", "I bought apple 7 phone from Amazon, within two months the colour started peel\noff from ringer button and top of the phone. They sell a old mobile phones i\nguess. When I contacted customer service regarding the issue, they can't help\nme in anyways and they simply advised me to contact Apple Store. I have got\nthem denial letter as well as they have instructed. But no help finally.\nUnsatisfactory with product n customer service .\n\n", "\n\n", "Perfectly delivered by amazon. captured by this I phone 7 very happy with the\nproduct  \nDon’t see rumours initially I was also worried that if I get fake phone or\nbroken but I reviced real phone trust blindly on amazon loved it ❤️❤️❤️❤️❤️\n\n", "Thank you amazon for within 3 day delivery.. just got this Iphone 7 black\nyesterday. Everything is good about this phone..but found heating issue while\ncharging..that is why 3 stars only...\n\n", "Amazon iphone 7 is much good accessories all should be geniune and in\necommerce most of the sites gives copy accessories to customer. Or if some one\nwant to buy iphone 7 please choose gold colour.\n\n", "\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 February 2018", "on 17 July 2017", "on 17 November 2017", "on 19 July 2017", "on 19 August 2017", "on 11 January 2017", "on 9 December 2017", "on 28 January 2018", "on 28 December 2017", "on 28 June 2017"], "reviewer": ["Abhishek", "Mr.Perfectionist", "Amazon Customer", "Amazon Customer", "Manikandan", "Nagender kumar sharma", "Paras sendri", "Raghavendra raju", "Ricky", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Really good. Not Just A Phone.", "PERFECT except for that headphone jack and tricky home button", "iPhone 7 - Go for it", "The future in disguise  iPhone 7 and 7 Plus are deeply unusual devices", "*Plz Read This Rievew Before Buying* *[...]*", "BEWARE OF iPhone7", "Quality Issue", "Apple brings you the best yet. The iPhone 7 improvises on the best ...", "Best iPhone yet", "A phone for the purists (read full review)"], "review": ["This phone is not just a phone, but for many it is a status symbol, telling\nothers not only can I afford this new device but that I am technically savvy\nand keeping up with the Apple bandwagon of new devices in a fast moving\ntechnical field.  \n  \nTo be honest, there is very little change in the appearance to the new iPhone\n7 compared to its predecessor, however, that’s not the point as it is exactly\nwhat the Apple enthusiast would expect in that it is a visual attractive,\npowerful, reliable and an efficient device with some internal upgrades that\nwill help apps to work faster and additional obvious enhancements that will\nsatisfy the customers desire to purchase one.  \n  \nSo what is new and why did I get one?  \n  \nMemory size: The 258GB seems to be the best and most popular option with best\nvalue for money, as it is sufficient to carry all your apps, additional memory\nneeds and other normal things that you need to access. The 256GB is just a\nridiculous luxury and waste of money as there are very few users that could\nfill that size of memory.  \n  \nDesign: The design has not changed much in that the body and screen sizes are\nvirtually the same as the iPhone 6 and it still has round edges and a nice\nfeel in the hand. There is still a protruding camera lens on the rear that\nsome users might find irritating as this takes away a flush finish on the rear\nof the device.  \n  \nExternal Sound: This has been greatly improved by the introduction of dual\nspeakers positioned at the top and bottom of the device. This has improved the\nsound quality immensely, which now produces decent stereo sound, great for\nlistening to music or watching a movie without an earpiece.  \n  \nHeadphone Jack: This has been removed and replaced with a lightning port, but\nwhy is the question; simple answer is that it has released space for internal\nupgrades by removing the old out of date 3.5mm input. This could be a big game\nchanger for people who have bought expensive earphones that come with the\n3.5mm headphone jack capability only. However, you get an adapter with the\niPhone 7 that allows the 3.5mm jack to insert into the lightning port and the\niPhone 7 does come with a pair of lightning port compatible ear buds. They are\nactually really good and this new system is good, as Apple has decided to take\na bold step, embracing change for the better and the future in design and\ninnovation of smart phones.  \n  \nBluetooth: This has been enhanced with the addition of Apples own Proprietary\nwireless standard, which is so simple to use, where items such as the Apple\nAirPods (wireless ear phones) connect automatically when the AirPods are\nplaced next to the iPhone. These are brilliant as they are based on new tech\nwhere they pause music automatically when you remove one from your ear and\nthey automatically switch from iPhone to iPad, or Apple watch. You can buy the\near AirPods separately for 15,000 pounds and they are brilliant.  \n  \nWater resistant: I must admit I did have great fun taking pictures of my son\ndiving into a pool on holiday once with a waterproof phone. The expression on\nhis face as he entered the water was captured from under the water, which\nadded a new dimension to our holiday snaps. Therefore it is a great feature if\nyou are next to the pool or sea on holiday, or if you just want to watch films\nin the bath. On a more serious note, I have had a phone that accidentally got\nwet and was ruined and therefore even if it is only protection for such a\nvaluable and essential item then it is worth having the waterproof capability.  \n  \nBattery life: Apple claim that the battery life has been increased from its\npredecessor to an extra 2 hours in normal use. However, this is something that\neach user and the type of use with the device will no doubt determine.  \n  \nCamera: The rear camera still protrudes from the body however; you now get a\ndual lens main camera combining a wide angle lens and telephoto lens with much\nbetter low light capability, richer snaps and a faster shutter speed. The\nfront camera has also been increased to 7MP.  \n  \nMinor changes: The home button now vibrates under your finger rather than\nclicking all the way in and the finger print recognition requires more\npressure than previous iPhones. To be honest this is just a slightly different\nfeel for both functions but nothing to jump up and down about.  \n  \nScreen resolution: The screen resolution and appearance doesn’t appear to be\nany different even if there have been internal upgrades to 1080 resolution and\nto be honest Apple are still way behind Samsung with their OHD resolution.  \n  \nOverall there is not a great deal of change especially to the appearance of\nthe new iPhone 7, but with the internal upgrades and minor enhancements that\nthey have made it is enough to get any Apple enthusiast excited.\n\n", "GOOD:  \n\\+ water resistant - this is a huge improvement for me!  \n+increased speed is noticeable w Siri.  \n+the capacity is amazing! (I have the 256) I can keep movies, videos, books,\nphotos, music etc without having to store on iCloud or the like (which usually\ninvolves a monthly fee).  \n\\+ decent size (same as iPhone 6S) while remaining portable and although not\nas big as the 7 Plus, it can still fit in pocket.  \n+Widget feature (swiping to right at home screen) has been improved and now\nallows editing. You can add or delete features which can be key for privacy\nand being able to customize is always a good thing.  \n+has lots of added fun features in iMessage (not sure if its the updated\nsoftware or strictly iPhone 7) like memes, automatic replies and being able to\nwrite w your fingertip.  \n+camera takes much better pics (increased the megapixels and the difference is\nnoticeable) and it has 5X zoom capability.  \n+has the fingerprint option for quicker access after you enter your 6 digit\npass code to begin.  \n+the style and sleekness of the new Jet Black option is a thing of beauty.\nIt's almost criminal to cover it (but necessary for me).  \n+even slimmer than the iPhone 6 but still able to stand up against something\nfor convenient viewing.  \n+speaker upgrade as it now provides stereo (not up to audiophile standards but\nstill).  \n  \nBAD:  \n\\- no headphone jack!! but box includes dongle (see photo) which inserts into\ncharging port and provides headphone jack - I have a bet with myself on how\nlong it will take to lose. I know wireless headphones are the future but happy\nwith my old faithful headphones.  \n-the home button is not as well defined. Its gonna take longer than 24 hrs to get used to as it takes me a few tries to activate the home button. It requires the right amount of pressure and despite offering three different options, not easy. The guys at the Apple Store need to stop showing off - on the bright side, I'm thinking it's a learning curve thing and continued use should take care of this issue.  \n  \nFINAL THOUGHTS: Is it worth the extra money? I'm not so sure but despite the\ntwo drawbacks, which I think are a temporary, I'm loving the features and ease\nof the iPhone 7 and the Jet Black is beyond elegant and sleek. I will provide\nupdate after continued usage\n\n", "Got this product from amazon Diwali sale  \nOn time delivery  \nPacking was good  \nGenuine product and checked it on Apple website  \nBattery backup is good  \nCamera is excellent  \nVoice call quality is awesome  \nSpeaker sound effect is extraordinary  \nJet black colour makes this iPhone more beautiful  \niOS 11 is working smoothly  \nNo hanging issues  \nNo heating issues  \nFull Charging takes 2hrs duration\n\n", "he iPhone 7 and 7 Plus are deeply unusual devices. They are full of aggressive\nbreaks from convention while wrapped in cases that look almost exactly like\ntheir two direct predecessors. Even that continuity of design is a break from\nconvention; after almost a decade of Apple’s steady two-year iPhone update\npattern, merely retaining the same design for a third straight year plays\nagainst expectations.  \nInside that case, everything else about the iPhone 7 is a decisive statement\nabout the future. The dual cameras on the iPhone 7 Plus promise to usher in a\nnew era in mobile photography. The iconic iPhone home button is no longer a\nphysical button, but instead a sophisticated ballet of pressure sensors and\nhaptic vibration motors that simulate the feel of a button. The new A10 Fusion\nprocessor blends two high-power cores that rival laptop performance with two\nlow-power cores that combine with a much larger battery to extend run time by\nup to two hours.  \nAnd, yes, Apple has removed the headphone jack.Removing the headphone jack is\nan act of pure confidence from Apple, which is the only company in tech that\ncan set off a sea changes in the industry by aggressively dropping various\ntechnologies from its products. Floppy drives, optical drives, its own\nproprietary 30-pin iPod connector, flash, even USB — Apple decides that it’s\ntime to move on, and it has a massive installed base of customers that love\nand trust the company who make it happen. And now it’s decided that — yikes —\nthe headphone jack is over.  \nAfter using the iPhone 7 and 7 Plus for about a week, it’s clear to me that\nApple has forceful, but considered opinions about how the next generation of\nphones should fit into our lives. But it’s also clear that the iPhone 7 is a\ntransitional step to that vision of the future, not a complete expression of\nit. The question for would-be upgraders is simple.\n\n", "Curved wraparound screen? Nope. Wireless charging? Not yet. Are you bothered\nthat the new iPhone looks the same as last year's iPhone? If you are, I\nunderstand the feeling. The iPhone 7 doesn't feel like the \"whole new thing.\"\nDoes that bother you? Maybe. But is it better? Yeah, it is. Except for one\nsmall 3.5-millimeter thing.  \n  \nThe iPhone 7, as you may have heard (you've certainly heard), has no headphone\njack and it looks almost identical to the 2014 iPhone 6 and 2015 iPhone 6S.\nBut there are still compelling reasons to consider an iPhone 7, even if you\nown last year's model.  \n  \nThe iPhone 7 is now fully water-resistant (it can take a shallow dunking).  \nThe camera takes notably better photos, especially in low light, and adds the\noptical image stabilization feature previously restricted to the 5.5-inch Plus\nmodel.  \nThe battery lasts longer -- probably a couple of hours or more a day, under\nnormal usage. (We'll update this review after we test the battery in our lab.)  \nThe processor is faster, although you might only notice the speed on some\nintensive games and the video and photo-editing apps.  \nIt's also got a \"wide color gamut\" screen with enhanced color accuracy, and\nenhanced stereo speakers, though I didn't find those improvements as critical\nas the ones above. And the home button isn't \"clickable\" anymore -- it uses\nthe same pressure sensitivity and vibration feedback found on the 3D Touch\nscreen. It works perfectly well, but takes some getting used to because\nthere's no mechanical click when you press the home button.  \n  \niPhone 7 up close: Better camera, water-resistant -- and no headphone jack  \n  \nAs with last year's iPhone choices, you can also opt for the step-up iPhone 7\nPlus, which offers a larger screen (5.5 inches vs. 4.7 inches). But that\nmodel's big attraction is the dual rear cameras, which can stitch together two\nimages to offer unique effects such as 2x optical zoom and -- after a future\nsoftware upgrade -- a cool in-camera bokeh effect, which blurs the background\nwhile keeping the foreground in focus.  \n  \nNow, should you wait until 2017? All the rumors point to Apple delivering a\nmajor design overhaul for the iPhone's 10th anniversary -- anything from a\nGalaxy Edge-style wraparound OLED screen to a fingerprint sensor hidden under\nthe screen to wireless charging. It's tempting. But in the meantime,\nespecially if you want to take advantage of the various retro-contract \"free\nwith 2-year commitment\" offers, know that the iPhone 7 and 7 Plus are worthy,\nuseful upgrades to their predecessors -- even if they look almost identical\nfrom the outside.  \n  \nALL THINGS IOS 10  \n  \niOS 10: All the new features, tips and guides  \n23 hidden features in iOS 10  \n15 ways iOS 10 will make the iPhone better  \nLet's not diminish the missing headphone jack. The loss will hurt, especially\nwhile other iPhones exist that still have a headphone jack onboard. If you\nwant to plug regular headphones into your new iPhone, a process that seemed\nsimple and uncomplicated before, you now need to consider whether you brought\nthe included dongle, or have a pair of Bluetooth headphones. Or your special\nLightning headphones that come in the box. But it's surmountable. I lived with\nthe new iPhone 7 and 7 Plus for a week, and this is my story of life without\nthe jack and with everything else in the new iPhones.  \n  \nEditors' note: We're still testing the battery and performance of the iPhone\n7. Consider the ratings to be tentative until finalized.  \n  \nHeadphone jackless  \n  \nMark me down as someone who will miss the headphone jack.  \n  \nDespite living in a mostly wearable, wireless world, I don't like Bluetooth\nheadphones. And I also hate dongles. I'm learning to deal with both now.\nApple's new AirPods make a case for how more-advanced Bluetooth mini-earphones\ncould be fun to carry around. But to me, nothing beats a cheap pair of plug-\nand-play earphones for lazy convenience.  \n  \nI took the iPhone 7 in the shower. I dropped it in a fish tank a few times. I\nput it in a sink and turned on the tap and filled the sink with the iPhone in\nit. Stay tuned for further, longer tests. But it's survived every test easily.\nBut FYI, capacitive displays go nutty in water. You won't be able to use it\nwhen submerged -- nor should you.  \n  \nOther small perks: Stereo speakers, a slightly improved display, buzzier\nhaptics  \n  \nI couldn't appreciate Apple's wider color-gamut display on the iPhone 7, which\nis supposed to the best next to the iPad Pro 9.7 and 5K iMac, as well as 25\npercent brighter. It's good, don't get me wrong. But to my eyes, next to a 6S\nor 6S Plus, it felt the same. And in direct sunlight (I used it in seriously\nbright New York September sun), it was sometimes hard to see. Like all\niPhones, but not really better.  \n  \nThe speakers sound louder. They surround the left and right sides of the\niPhone now, instead of a single speaker down by the home button. It's better\nfor casual game playing or movie watching, but I'd take headphones every time.\nOr, if I was sharing with someone, I'd pick a larger screen. They don't always\nsound as defined and crisp as I'd like.  \n  \nThe display is still a bit difficult to view in direct sunlight.  \n  \nThe best improvement of all might be haptics: the vibrations, or rumbles, or\ntaps, or throbs the phone makes in response to your actions. Apple updated the\n\"Taptic Engine\" in the iPhone 7, which makes all the vibrations seem sharper\nand more defined. The silence mode is now a quick tip-tap. Pushing in on 3D\nTouch icons (if you even do that) throbs more readily. Some sounds and\nsettings now come with phone-rumbling enhancements. Change the clock time,\nfeel the click of the wheel as you spin it. It means that more tactile\nfeedback is possible, even in apps with onscreen buttons. It's like a phone-\nwide Xbox One rumble pack.  \n  \nNice camera bumps, especially in low light  \n  \nThe iPhone 7 gets an upgrade I wished were in the 6S -- namely, optical image\nstabilization (or OIS). The slightly wider f1.8-aperture lens also lets in\nmore light for low-light photos. OIS and that new lens both make a difference\nin everyday shots, I've found. Photos at dusk in my backyard that were barely\nviewable on the 6S looked far brighter on the 7.  \n  \nWith OIS, you can capture clear photos even if you have an unsteady hand.  \n  \nThe 12-megapixel camera's other improvements, including a new ISP for other\nimage improvements, might be too subtle for casual point-and-shooters to\nappreciate. The four-LED flash is brighter, and helped light up a room so well\nI could even shoot a barely passable photo of the darkened room next door.\nNote that Live Photo slows down the shutter speed, so turn it off for faster\nshots.  \n  \nThis photo was taken at dusk, and it was so dark I couldn't see the lawn. Big\nstep up from 6S.However, I still found that the I preferred the iPhone 7 Plus\ncamera. Part of that is obvious: It has a dual camera on the back that allows\nfor 2x optical zoom or extra levels of digital zoom. And the added screen size\nis more useful for looking at photos and editing them.  \n  \nFast, efficient  \n  \nThe iPhone 7's new processor, called the A10 Fusion, promises another\nsignificant set of speed bumps with two cores. There's also a new wrinkle: A\nlower-power battery-optimizing mode with two other cores. In classic Apple\nfashion, the phone switches between these cores automatically and you can't\ntweak it.  \n  \nThe iPhone 7 is equipped with an A10 Fusion processor.  \n  \nIn a few benchmarks using GeekBench 4 (an updated version of the no-longer-\navailable GeekBench 3 that we use to test phones), the 7 made big gains (3,488\nsingle-core, 5,605 multicore in case you're curious).  \n  \nThe phone is seriously fast. It's faster than any other iOS devices including\nthe iPad Pro, and faster than Samsung's last batch of phones by a significant\nmargin. But I have to say -- as I do many years -- that this iPhone feels\nabout as fast the last iPhone in most everyday instances.  \n  \nSomeday, maybe, we'll see phones stop getting relentlessly faster every year.\nFor now, it's something to appreciate. But I wouldn't drop everything and get\nthis phone just for any promised speed gains.  \n  \nBattery life: An extra jolt  \n  \nI wouldn't call the 7's battery boost dramatic, but I'd call it practical.\nBoth the 7 and 7 Plus seemed to last a whole day without needing a recharge as\nI'm pretty used to doing. Performance seemed similar to the iPhone SE,\nanecdotally. Full battery benchmarks are coming this week.  \n  \nBut I don't think battery benchmarks will tell the whole story this time. Our\nvideo playback test in airplane mode doesn't reflect what everyday internet\nuse is like, and with Apple's new power-managing processor, what you do will\npossibly cause different results.  \n  \nI liked having more battery at last, something I wanted in the 6S. Apple's\nattentiveness to more power-efficient processing is promising. But lots of\ngreat phones now have super-size batteries in them. Think of the Motorola Moto\nZ Play and Galaxy S7. Apple's battery capacities in iPhones, historically, are\nusually smaller.  \n  \nAnd no, there's no wireless charging option. Maybe next year.\n\n", "Phone dead in 7 days...overheats, hangs, huge network connectivity issues so\nmuch so that you miss important mails and messages, the phone has capacity to\ndoze off any time....such a waste of time and money\n\n", "Product Quality is Poor... because i received a defective Product.... My\npurchase value is 53000 rupees.. I'm totally disturbed with this items....\n\n", "12MP primary camera with optical image stabilisation, Quad-LED True Tone flash\nand Live Photos, 4K video recording at 30 fps and slow-motion video recording\nin 1080p at 120 fps, 7MP front facing FaceTime HD camera with Retina Flash  \n4.7-inch (diagonal) Retina HD 3D Touch capacitive touchscreen display and home\nbutton with 1334x750 resolution and wide colour, Splash, water and dust\nresistant  \niOS 10 and iCloud operating system with A10 Fusion chip with integrated M10\nmotion coprocessor, 128GB internal memory and single Nano-SIM  \nNon-removable Li-Ion 1960 mAh battery (7.45 Wh) providing talktime up to 14\nhours on 3G network  \n1 year manufacturer warranty for device and in-box accessories including\nbatteries from the date of purchase  \n  \nThe New iPhone is Here  \nFor all the iPhone lovers, Apple brings you the best yet. The iPhone 7\nimprovises on the best features of the previous generations of Apple phones.\nBe it the camera, the battery or the speakers, the iPhone 7 aces the game.\nExperience a power packed performance with the iPhone 7. Sporting a stylish\ncompact body, the iPhone 7 is splash proof and water resistant. From a\nbrilliant display to overwhelming sound quality, name it and the iPhone 7 has\nit all.  \n  \nStrong Water Resistant Body  \nNow, you can make the most of your pool parties and your outdoor games. Apple\nengineers have designed the iPhone 7 in such a way that it is water resistant,\nsplash proof and dust proof. So, whether it is raining or you are at a beach,\nlet nothing come in between your photo sessions and fun times.  \n  \nFeel the 3D Touch  \nThe sensitive touchscreen of the iPhone 7 also allows you 3D touch. Also, the\nnew Retina HD display incorporates the 3D touch facility across the iOS. Be it\nthe music, messages or your calendar app, connect with all that in a more\nresponsive manner with the 3D touch. See how the 3D feature works on the\nscreen and feel the difference. The iPhone 7 also includes a home button which\nis a one-touch button to reach the home screen. This button is designed to be\nmore pressure sensitive and is super responsive. In sync with the taptic\nengine, the home button responses precisely and is durable for prolonged use.  \n  \nOIS for Better Image Quality  \nIf you love capturing all your special moments, the iPhone 7 cameras will be a\ndelight for you to use. The optical image stabilization technology ensures\nthat your images are free from distortion. Even if your hand shakes while\nclicking photos or if the subject is in movement, the image stabilization\nfeature makes sure that your photos are crisp and clear. The sensor counters\nthe tiniest of movement and allows up to 3x times longer exposure. The iPhone\ncamera is powered by the image signal processor which makes your photos look\nperfect despite poor lightening and sudden movements. The image signal\nprocessor is built into the a10 fusion chip and powers over 100 billion\noperations to make your photos and videos look amazing. It also enhances the\nwhite balance in the photos and helps the auto focus.  \n  \nNow, even Facetiming is more fun with the iPhone 7. The 7 MP front camera\noptimises your experience of selfies and video chat by capturing life-like\ncolours and visuals even in low-light. The Retina flash ensures that your\nvideos and photos have more real natural colour tones.  \n  \nWatch the Display Come to Life  \nThe iPhone 7 sports a Retina HD display which is more vibrant and colour rich\nthan its previous generation of phones. Watch your photos, games and videos\ncome alive on this screen. The colour space employed by the iPhone 7 screen is\nthe same as that of the digital cinema industry, so you can expect a brilliant\ntrue-to-life display.  \n  \nAll Good Things Come in Small Sizes  \nThe A10 fusion chip is the smartest and most powerful chip ever used by a\nSmartphone. Let not the size fool you. It not just makes the iPhone work\nfaster, but also ensures that the functions are well executed. The processing\nspeed is higher than the previous iPhones and does not even require much\npower. The battery life is the longest that you have experienced in an iPhone,\nand you will require less of it every day as the phone has its own mechanism\nof preserving power.  \n  \nMusic to the Ears  \nJust when you thought the iPhone 7 can’t get any better, Apple brings you the\nadvanced stereo speakers. Producing twice as much the audio output of the\niPhone 6, the stereo speakers of iPhone 7 delivers a deep and dynamic music\nrange. So, tune in and rediscover your music.\n\n", "Upgrading from the 5S. I bought this with an HDFC card cash back.  \nThe phone is freaking amazing. The camera is WAY better than the 5S. (Night\nshots attached for comparison. The one with the street light flaring all over\nis from the 5S).  \nThe fingerprint scanner is lightning quick. iOS is smoother than it's ever\nbeen. Retina flash works surprisingly well. 3D touch is more useful than I\nthought it would be. The haptic engine response on the home button does take\nsome time to get used to, but now I think it's better than a physical click.  \nSo far, no complaints. I find it hilarious that the rating of this phone is\ndestroyed by retards who have never bought/used this phone. Check the verified\npurchase tag on a review.  \n  \nAmazon delivery with this product has been my best experience yet. I had\npreordered the phone and it was delivered to me on 8th early morning(the phone\nreleased in India on 7th) at my residence instead of office(whose address I\nhad actually given). Thanks to the Amazon executive for that.\n\n", "Here we go, this is my review of the iPhone 7! Let's see how does it plan on\nstanding out from the rest, this time.  \n  \nDesign: The iPhone 7 and 7 plus have mostly similar design language as their\npredecessors. Well, at least from the front. The rear end of the phone is\nwhere you'll find the slightly cleaner layout of the antenna bands, and a\nlarger camera sensor. There are two new colors: matte black and the super\nglossy jet black. I personally like the matte black. It's cleanest and\nstealthiest, but also the slipperiest among the other variants.  \nButtons are in their same places. The power button is on the right with the\nvolume buttons to the left and theres also the mute slider. On the bottom,\nthere are now 2 speaker grills. One is a speaker and other is just a\nsymmetrically cut microphone. Headphone jack is out, as we knew. You'll need\nto use the bundled lightning earphones or their weird looking, rather\nunreasonably expensive 'airpods'.  \n  \nThe home button is a pressure sensitive glass button. It doesn't press down\nanymore but instead gives you a haptic feedback. It doesn't feel quite same as\nan actual clicky button, but you'll quickly get used to it. There are now\nstereo speakers, as I mentioned in my first impressions. The earpiece and\nbottom speaker, both give out a pretty loud, punchy sound. There have been\nreports of hissing noises from these speakers. It's not very noticeable and\nso, may not matter as much to many people, so lets leave it out for now.  \n  \nDisplay: The new iPhones still have a 1080p IPS LCD panel with same sizes as\nbefore. 4.7' and 5.5' on 7 and the plus respectively. But the screen is\nnoticeably brighter and a bit warmer than the previous 6s. It can produce a\nwider spectrum of colors than the previous iPhones, so yeah. It really is kind\nof a big deal, as Apple shows it off. Outdoor visibility was never a major\nconcern before and it still isn't. In fact it has improved. I'm actually very\nimpressed with the deep blacks and excellent viewing angles of the iPhone 7,\nas expected. Though the iPhone 7 has lower resolution, it makes up for that\nlack of clarity with it's great colors. Both displays have maximum brightness\nof about 705 nits. It's nowhere near to note 7's excellent 1000 nits, but\ndefinitely more than enough for comfortable outdoor legibility.  \n  \nPerformance: Apple's new devices run on an Apple A10 quad core fusion chip.\nThe 7 has 2 gigs and 7 plus has 3 GB of DDR4 RAM. The newer processor are\nhands down, the most effecient ones on the market, overtaking even the\nbrilliant Snapdragon 820. Benchmarks show an impressive 3029 as single score\nscore, which is way more than Qualcomm's peak. The two extra low powered cored\nhelp save battery and give you more standby.  \n  \nApple says you'll get 2 hrs more on the 7 than the 6s, and 1 hr more on the 7\nplus. That'll obviously depend on your usage, bit I can tell you that the 7\nplus be able to please even some of the most hardcore power users, no\nproblems. The phones run on iOS 10. It's a bit more fluid than previous\nversions, as the control center now has multiple pages. Even the notification\npanel has been cleaned up a bit. There is a collective cards page to the left\nof your home screen , just like Google now. That's not to say iPhones are lag\nfree and stuff. Even the more powerful iPhone 7 showed few stutters during\ngaming!  \n  \nI never liked iOS because of it's rigidity. I still don't see any major\ncompelling points to change my views on it. iPhones are for those, who are\nwilling to adjust to the phone rather than have the phone adjust to them (like\nit should be😂). But I really see good stuff in there too. It's ability to run\nbuttery smooth with minimal hardware needs, still surprises me. Battery\nstandby is also usually good with iOS. So yeah, thumbs up with that👍.  \nThe endless complaints of people like me, have finally been heard and\nanswered. The base model begins with 32 GB now(finally!😅). There's no 16 GB\nmodel but 64 GB is gone too! Now you get 32, 128 and 256 GB storage options.\nThe glossy jet black has no 32 GB option. It only comes in 128 or 256 gigs.  \n  \nCamera: The iPhones of 2016 have new camera sensors. They're made by Sony,\nwith same 12 mp resolution but have a wider f/1.8 aperture. Now there's OIS in\nthe smaller iPhone 7 too! That's something which I always felt the absence of,\nin the 6s. Let's get to the interesting stuff, the 7 plus dual cams. One is a\nstandard lens or \"telephoto lens\" as they call it, the other is a wide angled\nlens. So you can optically get 2x zoom without a load of digital noise.\nThere's also 10x digital zoom. I must say Apple has done really well with\ntheir cameras this time. The 10x digital zoom is smooth and maintains good\ndetails overall.  \n  \nThe Camera has a brighter quad led flash, for brighter and more accurate\nluminance. The front cameras have been upgraded to 7 mp. Both cameras are\nexcellent. There isn't a lot to say in bright lights, but in lower lighting,\nthe new iPhones are a lot better. Autofocus seems to be much faster than the\n6s too. You'll love the crisp selfies and the rich colors of the new cameras.  \n  \nBattery: iPhone 7 has a 1960 mAh battery and the 7 plus has a large 2900 mAh\nunit. Battery life as I mentioned, is excellent. You'll easily get through the\nday with an average of about 4½ to 5 hrs of screen on time. This was the same\nwith last year's 6s plus. As long as it's great, I'm not gonna complain. Why\nfix something which isn't broken, right!?  \n  \nPrice: I'm not gonna say much here😅. The base model of the iPhone 7 will\nretail for about $650 or 47,000 INR and 7 plus base model will cost you about\n$770 or about 60,000 INR . As always, \"premium phone should have a premium\nprice tag\" mentality here. I can't recommend it as an all round upgrade over\nthe 6s. There are definitely improvements, but the price slash on the previous\nmodels make them *that much* more reasonable.  \n  \n​I can still say last year's 6s plus is a good phone, but if you want the\nbleeding edge of a particular ecosystem, in case of Apple, it's definitely the\niPhone 7 for you. If you're coming from an old iPhone, like the 5 or 5s, then\nyeah! you should probably upgrade. But if you're an Android user who wants to\ntry out Apple, I strongly recommend you buy the 6s plus and save your dough!\nOr wait for the price to drop a bit😅.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 September 2017", "on 25 October 2016", "on 22 October 2017", "on 24 May 2017", "on 31 October 2016", "on 21 October 2016", "on 13 May 2017", "on 24 August 2017", "on 10 October 2016", "on 27 August 2017"], "reviewer": ["SwordFish", "Sandip Reviews", "vignesh", "Vijay Kumar", "Çrìmíñàl RøçkS", "Amazon Customer", "Amazon Customer", "Onesimus Paigiri", "Dylan", "Hemanth Shenoy"]},
{"rating": ["3.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["New ios11 , battery usage ? Hangs ? Whats new ? Pls read", "Defective phone by Amazon .. pathetic", "Satisfied but not fully", "is it worth buying?", "One Star", "An excellent performing phone !!", "6 reasons why youshould n't buy Apple iPhone 7,iPhone 7Plus", "Excellent phone for apple lovers and also excellent service", "I got it for 36999/- which was great value for money", "Battery issue in just a month!!!"], "review": ["Its been one week using my iphone7 from using new ios11 software , its only 7\ndays and i am really fed up😩 ! Sources have stated that apple is slowing down\nthe speed of ios 5,6,7 under the new software update (ios11), and its not a\nrumuor !  \n  \nWHATS NEW :  \n  \nHANGS : WHEN ios 11.0.0 came , iphone6 was hanging more than androids😱 , after\n11.0.1 sudden closedowns stopped , but still hangs !  \nAfter 11.0.2 , its a little better !  \n  \nBATTERY : As we know , its about 1600 mah , but battery used by software also\nmatters , and u should know that ios11 uses more than two times battery in\nbackground than ios10  \nAbout 15% battery gets lost 😱in one hour (15 minutes screen on only )I HAVE\nATTACHED PICS FOR SAME !  \n  \nSMART CONTROL CENTRE : its the first time that u can turn on/off mobile data\nwithout going to setting , also a whole new control centre is here , i loved😍\nit (pic attached -screenshot)  \n  \nFinally , i will like to say that i am fed up with my phone (main reason\nbattery )\n\n", "\n\n I got defected phone .. it have hanging issue .. camera is not clear ...\napple care is not taking responsibility... blaming amazon .. amazon blaming\nApple ...☹️.. worst Experience\n\n", "Received the iphone 7 in good and excellent condition. As it was brand new\nphone. However, surprised to not see the warranty specified on the website.\nNeed immediate support and advice  \n  \nI just have the invoice which does not state anything about the 1 year\nwarranty on phone and 6 months towards accessories\n\n", "at this date iphone 7 32gb is available for 50k. i believe that this could be\nthe best price to buy this phone; but is it worth spending 50k? within a month\nfrom now samsung s8 is going to be in market, according to the promotion\nvideos and leaks s8 is going to be the best and most beautiful phone ever.\nsurely s8 will be the best looking phone with a lot of features nd other cool\nstuffs which other brands don't offer. but then people will judge me based on\nan os platform, its ios or its apple nd all. i would like you to be aware that\napple is also going to make huge changes this year as their 10th anniversary\nand according to leaks and rumors all over the Internet it will somewhat look\nlike Samsung s8 with edge display. you can check on youtube for visual ideas.\nmy recommendation is that keep your hard earned money 50k for upcoming\nreleases, if u are apple fan then u can go for iphone edition or if u wouldn't\nmind going to android then s8 is going to be the best phone this year. for me\n50k is a huge amount of money, if 50k is just your pocket money and u think\nyou can save another 50k till sept. then only u can think of buying iphone7.\nBecause after the release of new iphone edition (or iphone 8 whatever apple is\ngoing to name it) iphone 7 is going to loose its value to very much extent. if\nu will go to sell 7 32gb then the chances arw u wont get more than 30k, and\nnext iphone is surely be going to start at a price of 70-80k. so think wisely\nand analyse your needs and spend your money. 50k is not earned with a blink of\neye.\n\n", "Product was not sealed packed.the box was open and no information brochure in\nit.\n\n", "It's been a week I'm using this phone and till now I'm really happy with the\nperformance. I had been using the OnePlus One before and I'm extremely with\nthat phone too. So without wasting any further time let me note down what I\nfeel about the iPhone 7.  \nPros:  \n1\\. The UI is too easy to use. Yes, it'll take some time to get used if you're\ncoming from Android but once you get the feel of it it's super smooth.  \n2\\. The touch screen is superb. The feel and the UI response to touch is\nsimply superb.  \n3\\. The camera has been really good specially the Panorama part. Extremely\nhappy with both the cameras.  \n4\\. The display looks more natural and soothing to the eye.  \n5\\. The phone is really fast and till now, apart some network related delays,\nI've not seen any other delays which relates to the phone's processing.  \n6\\. The phone being small is easy to hold and operate. But still a cover is\nrecommended as the metal body feels slippery.  \n7\\. The finger print scanner is really good and identifies the finger from any\nposition literally.  \n8\\. The earpods are really good in sound clarity.  \nCons:  \nCouldn't find much but still for the sake of it.  \n1\\. Battery has enough life but could've been a bit more powerful to shake off\nall competition.  \n2\\. No extendable slot for memory - though I don't need as I've 128 GB\nalready. Also, extra memory card means virus/malware can come in unnoticed.  \n3\\. Lightning jack for earpods can be a bit troublesome, not with the quality\nbut with compatibility. Apple gives one Lightning to 3.5mm converter but not\nthe other way round which is a blockage. Also, you can't use your earpods\nwhile phone is charging.  \n4\\. Not a phone issue but still need to tell this. iOS11 has not been that\nkind to iPhone7. Different people facing different issues like sudden call\ndrop, screen not getting while at charge, bit slow speed etc.  \n  \nThat's it. can't think of anything else with only one week's use. Will update\nthis review once I get more feedback.\n\n", "Apple's latest iPhones are here. The all-new iPhone 7 and iPhone 7 Plus boasts\nof a faster processor, better camera, bigger battery and host of other\nadditions.The smartphones have received mixed review from analysts. While some\nare impressed, others really are not.You wondering if you should shell out big\nbucks (price starts at Rs 60,000 in India) for buying the new iPhones? Here\nare six reasons why you can give them a miss.No major difference in\ndesign2/7Both iPhone 7 and iPhone 7 Plus sport the same design as their\npredecessors -- iPhone 6s and iPhone 6s Plus. In fact, it is also the same\ndesign as that of the two-year old iPhone 6 and iPhone 6 Plus models.There are\nsome minor changes like the new handset has stereo speakers at the bottom,\ndual-rear cameras (applicable to iPhone 7 Plus), and antenna lines placed at\nthe sides for a cleaner look -- but as we said really no change to the look\nand feel.'Almost same' display as iPhone 6S3/7iPhone 7 screen features same\nRetina HD displayas the one in Apple’s previous-generation handsets (iPhone 6S\nand iPhone 6s Plus).However, Apple claims that the display now offers a wider\ncolour gamut as compared to the duo's standard RGBs display.No major\nimprovements in battery4/7Apple claims that both iPhone 7 and iPhone 7 Plus\ncome with longest-ever battery. However, in terms of hours it is two-three\nhours more for iPhone 7 and one hour more for the iPhone 7 Plusmodel as\ncompared to their predecessors.No headphone jack5/7As widely rumoured Apple\nhas removed the 3.5mm headphone jack from its new iPhone 7 range.This means\nusers won’t be able to use their existing 3.5mm headphones with the new\nhandsets till they use the Lightning to 3.5mm adapter.The smartphone, however,\nships with earpods with Lightning connectors and the adapter.\n\n", "Hello guys  \nRead this review before buy I PHONE 7 256 GB Black  \nBuying reason\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \nPremium design Powerful configuration Impressive cameras Large battery backup  \nBeware of\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \nExpensive Non-expandable memory  \nVerdict\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \nThe Apple iPhone 7 256GB comes with stunning looks and its fair share of\nbrilliance. The trademark of this year�s iPhone is the presence of the most\npowerful chipset so far that will let you achieve amazing results. The camera\nhas also been upgraded with several new enhancements and the selfie camera is\nmore powerful than before. The ability to stay submerged in water for up to 30\nminutes is also a great addition. Though Apple has not made any significant\nchanges in terms of looks, it is still a great device to own of you got those\nbucks.  \n  \nA brainy beauty  \nDisplay and Configuration\n------------------------------------------------------------------------------------------------------------------------------------------------------  \nThe Apple iPhone 7 256 comes flaunting a 4.7-inch IPS LCD (750 x 1,334 pixels)\nmulti-touch display with 3D Touch Touchscreen that offers 326 pixels per inch.\nThe display is capable of producing a wide range of colour gamut along with\ngreat viewing angles. The Home button on works on Taptic Engine which is\ncustomizable and responses to pressure too well. Apple has made this device\nsplash and water resistant so you need not worry about sudden rainfall or\nwater related accidents. Apple has re-introduced their Black colour option by\nmaking a Jet Black colour available alongside a Matte Black. Previously seen\ncolours like the Rose Gold, Gold and Silver are also there. But the Space Grey\nseems to have been ousted from the list.  \nThe smartphone functions on iOS v10 which is the latest software offering from\nApple. Under the hood the flagship device is powered by a quad-core processor\nthat sits on the A10 chipset specially built for this phone. The all new A10\nis a Fusion chip that has two high?performance cores and two high?efficiency\ncores and brilliantly adjust themselves to assist in the tasks that require\neither efficiency or high performance. To ensure seamless multitasking the\nsmartphone has 2GB of RAM.  \nCamera and Storage\n---------------------------------------------------------------------------------------------------------------------------------------------------------------  \nA 12MP rear camera is proudly situated inside the Apple iPhone 7 which\nproduces enhanced images than all the previous iPhones we have come across so\nfar. It has optical image stabilization, an Â\u0083/1.8 aperture, and a six-element\nlens and has four smart LED flash that delivers 50 percent brighter photos as\ncompared to the iPhone 6s. Another unique feature of this camera is the\nability to adjust its lighting while clicking pictures as per the environment.\nThis ensures that the snaps are well lit and sharp.The 7MP FaceTime HD camera\nis another upgrade and is as amazing as it can be. It uses wide color capture\nto take sharper and more vibrant selfies. The Retina Flash matches the ambient\nlight for a shot to produce natural-looking skin tones.  \nShooting videos is also a delight with this beauty as it can capture high\nresolution 4K videos to keep your memories from fading. With the new aperture\nsettings and OIS, videos shot in darker settings with iPhone 7 are also much\nmore enhanced than those taken by its older siblings.  \nIt comes with 256GB of mammoth storage to store all your needed apps and\nfiles. Just like all other Apple devices, the memory cannot be expanded.  \nAudio and Air-pods\n--------------------------------------------------------------------------------------------------------------------------------------------------------------  \nThe iPhone 7 256 comes with two stereo speakers that provide increased dynamic\nrange and two times the audio output of the Apple 6s. Apple has ditched its\nfamiliar 3.5mm headphone jack and replaced it by a Lightning port that\nsupports the newly introduce wireless Air-pods. It is easy to set and also\nallows access to Siri by simply tapping it twice. This does not mean that you\ncannot use your normal earphones. The 3.5mm headphone jack adapter is also\nincluded.  \nBattery and Connectivity\n--------------------------------------------------------------------------------------------------------------------------------------------------------  \nThe smartphone is juiced with a large 3,000mAh, li-polymer non-removable\nbattery. Connectivity options in the phone includes - 4G, 3G, GPRS, EDGE, Wi-\nFi 802.11, a/ac/b/g/n, Mobile Hotspot, Bluetooth, GPS with with A-GPS,\nGlonass, Computer sync, NFC, OTA sync, Tethering, TV-Out, UMA and of course\nthe Lightning port.  \nIt also supports Voice over LTE that makes your conversations sound as crisp\nand clear as if you were face to face.  \n  \nThanks for reading guys if you like this review then vote helpful...\n\n", "I got this for my wife after her Samsung Galaxy S7 edge conked out. I got it\nfor 36999/- which was great value for money.  \nNo problems with the product till date. Greenmobiles sent it super quick and\nwell packaged.\n\n", "Feel cheated.  \nThe product has failed in just a month.  \nphone is not getting charged above 4%.  \nThis is within approximately a month from the date of purchase\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 October 2017", "on 18 August 2017", "on 26 May 2017", "on 14 March 2017", "on 5 October 2017", "on 5 July 2017", "on 23 October 2016", "on 23 February 2017", "on 25 November 2017", "on 8 January 2018"], "reviewer": ["Kunj goyal", "AKAASH  ✅", "Simran", "chiku", "Smita mohta", "Arnab Chowdhury", "Avinash S.", "Ikrar A.", "JH", "Ankan S."]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["FULL REVIEW |IPHONE 7 AFTER 3 MONTHS |", "unauthentcaed product", "An end to the hype", "Overrated & Expensive- 6 Months review!", "Read your iPhone buying guide", "Camera and Flashlight not working", "GREAT FLAGSHIP PHONE FROM APPLE!", "AFTER 60 DAYS OF USING.", "The last thing to buy for organised folks", "Great Product and Classy"], "review": ["Iphone 7 is the best device out there.A 4.7 inch device with premium build\nquality and buttery smooth performance with the best camera ever made\n#compared with Google_Pixel# though looks similar to iphone 6 and 6s believe\nme its so much better even with same pixels as iphone 6 and iphone 6s its a\nlot better in color representation.  \n  \nLet me devide this revies into pro's and con's  \nPro's:-  \n1)running on the latest version of ios 10.3.3 and ios 11 beta it runs buttery\nsmooth without any lag and without any effort defeat's pixel  \n2)3d touch adds many functionality such as accesing the mobile data from the\nhome screen  \n3) even with the aluminium metal back no heating issues  \n4)military grade build quality  \n3)sound output through sterio speakers is excellent and through headphones is\nbest in the market  \n4)even with 750 pixels trust me the display is excellent  \n5)antenna bands are perfectly blended into the body  \n6)cellular call quality is excellent and there is loss of music quality\nthrough the lightening connector to 3.5 mm adapter  \n7)camera with electronic image stabilization is just awesome no words,the best\nin the market  \nCon's:-  \n1)battery is only about 1850mah which is pretty average in 2017  \n2)no fast charging takes about 2 hours for 0-100% charging and battery comes\nalmost a day  \n3)no 3.5 mm pin in the phone,a dongle is provided in the box for regular 3.5\nmm headphones but if lost costs about ₹800  \n  \nIF U LIKE LIKE MY REVIEW PLEASE GIVE A THUMB'S UP\n\n", "I have purchased the product on 3rd of November 2017. But on apple website it\nis showing that the product date of purchase 18th feb 2015. Is this product is\nduplicate.?\n\n", "I was very excited when I pre-ordered my iPhone 7 but the hype gets over from\nas soon as you turn on the phone. I've been using the Galaxy S6 edge and the\niPhone 7 hype made me to buy it, but as soon as I turned it on the screen\nturned my mood off, it's really a huge difference down from my 2k dual curved\ngalaxy s6 edge. From then on it kept me disappointing. Just like androids stop\nholding battery after 2 years and drains too fast, it came out of the box with\nmy iPhone, blame smaller battery or something else but it drains quickly in\nnormal use.. If you'll use your phone it'll swiftly drain battery which is\nvery Disappointing. Another hype was the fusion chip but you can't really take\nthe full potential of it due to poor fast draining battery and poor gaming\nexperience on this screen as compared to dual edge 2k display of my previous\nphone. Now if it's just about opening apps faster then I didn't feel\ndifference when I compared it with my s6 edge tho you should press the home\nbutton on s6 instead of back button as pressing the back button will restart\nthe app and will take less than half second extra.. Apple didn't care about\noverall experience and I'm pretty sad with this purchase. It has stereo\nspeakers and you can see speaker holes on both sides of lighting port but it\nshocked me when I didn't find any sound from one side, guess what? The another\nspeaker is embedded in the earpiece.. If you think you'll have loud stereo\nsound from it then you'll be disappointed again. It has also compromised in\nheadphones sound quality as the output is lower and just 16 not 32 if you know\nwhat I mean. I think Apple didn't do much with this smaller version of iPhone\n7 but the plus model is insanely heavy so I'll never go for it.. Put it side\nby side with the year and a half old s6 edge and the latter looks more\nattractive, iphone should be to change design as it's really boring now after\n3 years. Thank god my bro accepted to take it as I'll go for and also\nrecommend to wait for S8 but the iPhone 7 is really a failure.\n\n", "I’ve been using this device from past 6 months, the thing is I’m not so much\nimpressed by it.  \n\\- Iphone is way too restrictive(you cannot literally download anything\noutside App store)  \n\\- Multitasking is not there (Even nowadays a cheaper android phone provides\nmulti window)  \n\\- Display & Resolution (1334x750 are we in 2013 ? , and LCD Panel i mean\nseriously on 50k phone -.-)  \n\\- ios 11 (Havoc, Nothing New , worst)  \n\\- For all the people who are in love with their so called iPhones -.-\n‘IPhones hangs too , they are not perfectly fluid, and Touch ID is not the\nfastest.  \n\\- Camera performance is not that great , look for GPixel / Oneplus / Samsung/\nLG they’re offering much better camera.  \n\\- Price (Way too high for such average gadget)  \nAdvice: Got get a Oneplus flagship- bang for buget or If you need a great\ncamera go for GPixel or samsung flagship  \nI felt like I’ve thrown my money in gutter and also feel regret of my decision\nby buying this device.  \nI hope you agree !\n\n", "● There are the different iPhones currently sold in India as on Jul-17  \n\\- iPhone SE  \n\\- iPhone 6s  \n\\- iPhone 6s Plus  \n\\- iPhone 7  \n\\- iPhone 7 Plus  \n● There is no point in writing in length about these phones since everyone is\nvery well aware on the reasons why they may shop for an iphone. So, I thought\nit make sense to compare the prominet features that could help you to make\nyour decision easier  \n  \n** iPhone SE **  \n● This is a 4 inch phone that fits very comfortably into your hands and is\ngood for your wallet since the 16GB version costs around Rs.21,000  \n● This packs the same A9 processor, camera, fingerprint sensor and many other\nfeatures of iPhone 6S and 6s Plus  \n● The 12mpx camera is one of the best among phones around Rs.20,000. It\nsupports 4K videos, live photos, full HD slow motion video, etc.  \n● In terms of performance also, the phone stands among the top in the list in\nthe Rs.25,000 bracket  \n● If you dont like big screen phones, this is the best phone for you. But I\nwould say if you have used a bigger screen phone, you would definitely\nstruggle with this one since reading stuff on a 4 inch screen will be a real\npain for you. In that case, spend this money on an Android phone and you will\nlove it  \n  \n** iPhone 6s **  \n● The main difference 6s has over SE is that 6s has got 3D Touch and display\nzoom other than a bigger screen of 4.7 inches  \n3D touch is an amazing feature where the phone can understand the pressure you\nput on screen while touching and can activate various functions like double\nclick, left click or many other functions that could have been achieved by\nmore than one click  \n● 6s also comes with a 128GB option while SE stops at 64GB  \n● 6s has got a larger battery, but there is not much difference in battery\nendurance due to the bigger display  \n● The selfie camera is also upgraded from 1.2mpx in SE to 5mpx in 6s  \n● So, if you are on a tight budget, but still want to go for an iPhone, this\none is the best choice. I bought the 32GB version for Rs.35,888 in Jun-17  \n  \n**iPhone 6s Plus **  \n● The only difference 6s Plus has over 6s is the screen size which is 5.5 inch\nand optical image stabilisation for main camera  \n● 6s Plus had been infamous for rumours that the phone could bend from the\npressures of your pocket, but Apple is reported to have addressed it by using\nhigh-grade aluminium  \n● Optical Image Stabilisation works can effectively eliminate effects of\ncamera shake and images are sharper. This is especially useful during low\nlight where the exposre is longer and there are more changes for your hand to\nshake or shiver during shooting  \n● The larger screen is good for watching videos, reading, etc. And if you are\na gamer, spending this much for a 5.5 inch phone makes sense. This is sold at\naround Rs.45,000 for the 16GB version  \n● The phone performance and battery endurance is very much similar to iphone\n6s  \n● If you dont have a need for a larger screen, I would not recommend to spend\nmore money, but iPhone 6s would do good for you. if you are serious on this\none, I would suggest to spend a little more and go for iPhone 7  \n  \n** iPhone 7 **  \n● iPhone 7 brings in a low of new features  \n● This comes with a 4.7inch display. The display is one of the best on\nsmartphones with a lot of new features. In practical, the display is brighter,\nvery easy on eyes and colour reproduction is more accurate  \n● The processor is upgraded to A10 and the camera sensor is also upgraded that\nexcels is low light photography. The dual camera system captures depth\ninformation  \n● There is no 3.5mm headphone plug, instead it packs the wireless earpods.\nHowever, it comes with a 3.5mm adapter that connects to the lightning port  \n● The phone is splash as well as dust resistant  \n● The jet black and red are the new colours iPhone 7 is sold in  \niPhone 7 is one of the biggest update and comes with a lot of exciting\nfeatures. The 32GB version is sold at Rs.49,000. If you are serious about\niPhone 7, you may need to think spending around Rs.60,000 for the black or red\nsince the phone does not look much different from iPhone 6s if not on these\ncolours  \n  \n** iPhone 7 Plus **  \n● This is only for those people who have got deep pockets. The base version is\nsold at around Rs.72,000  \n● The phone has got a bigger screen of 5.5 inch and a superior camera with\noptical zoom & telephoto aperture  \n  \n** Summary **  \n● Go for iPhone SE only if you use your phone mainly to make calls or if you\nare upgrading from a smaller phone. If you are moving from a bigger screen\nphone, the 4 inch display of this phone will be a pain for you  \n● iPhone 6s is the phone that I recommend if you dont want to spend too much\nmoney, but would like to boast of your iPhone among your mates  \n● 6s Plus is not at all recommended because you will get iPhone 7 with a lot\nof new features if you spend a little more. However, if your only need is a\nlarger screen I wont stop you  \n● iPhone 7 is in a different league. Its the best iPhone available today\naccording to me  \n● If you are struggling to spend your hard-earned money, put it on iPhone 7\nPlus black or red where you will get an amazing gadget to show off.\n\n", "Got the delivery and surprised to see that camera and Flashlight are not\nworking. Rear camera is not working in camera app and FaceTime. Flashlight\ndoesn't work attached screenshots. Requested for replacement and waiting for\nAmazon confirmation. Will update once I have further updates.\n\n", "First of all, let me start by saying that I did not purchase this item from\nAmazon. But, here's my honest review on how the Apple iPhone 7 performs in the\nreal world and who this phone is for.  \n  \nLet me start with the design. It is a world class design, to say the least! I\nlove the Matte Black colour more than the Jet Black because of its matte\nfinish, but if you have really soft hands, it doesn't really matter what you\ngo with, because you're gonna have to put a case to protect the phone. I've\ndropped the phone 2 times without the cover, but nothing much happened, but\nI'd recommend getting a case. And the most important thing: No 3.5mm headphone\njack!! Apple earned a lot of hate with this move, but I don't think its much\nof a hassle, unless you're really careless that you loose your EarPods. They\nhaven't compromised anything about the EarPods though, it's build tough and\nthe quality of sound is exceptionally great! If you're having trouble with the\nwireless EarPods, you can get a EarPods with Lightning Connector for 2500 INR.\nBut, if you think from another perspective, which is the 'dust' perspective,\nless holes in the phone means less dust to destroy the internal boards!\nOverall, it feels really good in the hand and I really like the positions of\nthe buttons in the iPhone 7.  \nThe TouchID is tremendously improved in this phone! It's essentially like, if\nyour finger accidentally touches that Home button, it goes 'BAM' and unlocks\nthe phone! It's so fast and the engineers at Apple have really done a piece of\nwork in this 4th Generation of TouchID.  \n  \nThe iOS 10 is also really smooth to use. With the iOS 11 being released\ncommercially on September 2017, this phone would be super cool and a great\nexperience! As with the performance, I don't notice any kind of lag or\nsoftware glitch in the phone. If you notice that the phone is 'slow', then I'd\nassure you it's because of the network issue!! I did a multitasking test with\n10 apps open and essentially giving it some kind of a 'task' to do, and the\niPhone 7 didn't really slow down at any point. The 2GB RAM shouldn't be\nsomething you feel bad about, because it equally powerful as a 8GB RAM Android\nphone! Here comes the simplicity of iOS, despite low numbers in the\nspecifications column. I'm not a hardcore gamer, but just for the review sake,\nI played Asphalt 8 on this phone, and I should say, it was buttery smooth!  \n  \nOne particular aspect where I wanna salute Apple is the Camera(both Front and\nRear). They just blew me away! I was on this college trip with my whole\nclassmates, and we shot a 4 minute video with this phone alone, I should say,\nthe 4K footage and the slow motion are exceptional!! The OIS is an absolute\nbeauty, with very Jelly Effect. The only phone I've seen with better Image\nStabilisation is the Samsung Galaxy S8. But Apple really kills it with an\namazing performance! The front camera is also great for high quality video\ncalls, which makes it an even better Business Phone.  \n  \nThe battery on this phone could've been made better. I mean, it's definitely\nenough for a day, but at a point where Android phones are providing the\nconsumers with 2 or more days of battery life, Apple is definitely a step\nbehind.  \n  \nOverall, Apple has really done a great job with the iPhone 7, and when the iOS\n11 comes out, it would be a nice addition. Also, there are rumours of a new\niPhone release this year, 2017, with a bezel-less display and dual cameras.\nI'm sure it's gonna be dead costly, but a bezel-less phone from Apple would be\ncrazy. It's completely your choice whether to choose this phone or wait for\nthe iPhone '8' or '10'(whatever it's called). If budget ain't a problem for\nyou, then I'd suggest you to go with the latest model. I'll write a review on\nthe newest iPhone too, as soon as it's released. Thanks for reading! Have a\nnice day!\n\n", "I think leaks are hurting Apple sales a lot. There used to be a time when\npeople would applaud like crazy during keynotes. Now they just expect whatever\nis coming and are not at all willing to act. This underwhelming response on\nthe keynotes is largely mirrored by society's lukewarm reception to the new\niPhones. There is a new conception out there that Apple does little innovation\nand copies features from other manufacturers and embodies the same in their\nphones. I am not here to speak on behalf of Apple. I have had a love hate\nrelationship with the iPhones. My iPhone before this was the iPhone SE (Small,\ngood battery, good performer, inexpensive, good looking, headphone jack is a\ngo) but I wanted to try out the iPhone 7. But I didn't want to shell so much\nmoney on it. So I got a used unit (In excellent condiiton) for 42k. This was\nin late APRIL. It is late June now. Lets begin my review with the negatives.  \n  \n==================================================================================  \n  \nNEGATIVES / CONS / THE BAD  \n  \n1) iOS 10 is becoming more and more difficult to use. Apple is trying to\nincrease security but it is also making life and remembering iCloud passwords\ndifficult. The App Store is unfriendly and uninviting despite no lack of apps.\nThey need a friendlier tone. It shouldn't seem so DARTH VADERish.  \n  \n2) The HEADPHONE jack is going to be missed a lot. If I have 8% battery I\ncan't charge the phone and listen to music at the same time. I will have to\nput the phone on airplane mode to save battery to be able to use it. If my\nwife is asleep at night and I want to use my phone, I have to find that little\nconverter cable (easy to misplace) so I can plug in my old headphones. Else I\nwill have to use my iPad or secondary phone (S7 Edge) UTTER NONSENSE to make\nmoney. Nothing bold about it or anything else remotely positive.  \n  \n3) I don't want scratches on it so the front and back are covered with\nTEMPERED GLASS. I don't like using tempered glass becausei it makes my premium\nphone cheapy.  \n  \n4) LOW LIGHT PHOTOGRAPHY is impossible. When you are taking a photograph in an\nunevenly lit room with lights in the backdrop or if there is a source of major\nlight nearby - if you don't choose the best possible position to stand, you\nwill get the worst photos ever. It tends to distribute and ruin lights. Wish\nit was more even.  \n  \n5) Settings of changing video playback should be easier. Settings for\nswitching location services off should be easier to find and reach.  \n  \n6) Still not bright enough for a DELHI sun. And the heat in the sun is not\nfun.  \n  \n7) Expect the maximum of a ONE DAY BATTERY with this phone.  \n  \n8) Despite the best selfie camera ever, if you are more than 2 people, good\nluck getting everyone inside without making it seem desprate.  \n  \n==================================================================================  \nAnd now DEAR READER, I begin the PROS/ POSITIVES / THE GOOD  \n  \n1) The SPEAKERS are louder and clearer. On speaker phone, the caller is very\naudible. Even the earphone speaker for when you are on calls, you will hear\nthe person on the other end very well.  \n  \n2) Display has improved and my wife's 6s looks a little dated already while\nthe SE looks 3 years old.  \n  \n3) Selfie camera is the best in the world. It has improved so much. You will\nnever need to take 5-6 pictures in a variety of poses cause the first one will\nbe the absolute best. I must say this is what I love about this phone.  \n  \n4) The build quality is amazing and this phone should last you 3 years easily.\nAt which point you may wish to sell it for a fraction of its cost.  \n  \n5) The rear camera is good except in uneven light situations. Taking a photo\nof a laptop or an electronic device is amazing. If you go out for a walk in\nthe night, the camera can sometimes click stunning photos. It gets it good the\nfirst time. Which helps a LOT! [except when it misses completely]  \n  \n6) I used the accompanied headphones and I want to say they have improved a\nlot. You can totally use them with the device and never bother buying an\nadditional pair of headphones unless you love to have 4-5 at your disposal all\ntimes.  \n  \n7) The iPhones and their software has come a long way. One thing I really like\nabout the iPhone is the automatic battery saver. It gives the user enough time\nto find a charger. If you are out for a night and have just 20% back. Chances\nare you will return home with 2-4% left. Of course with bluetooth/location\nservices/brightness at a low.  \n  \n8) If you use the adapter that comes with the iPad (10W/12W) you can charge\nthis in 100 minutes flat. This is not bad for an iPhone.  \n  \n9) I almost forgot to mention. But the HOME BUTTON is a game changer. What\napple did is they basically took inspiration from the force touch trackpad on\ntheir 2015 RETINA MACBOOK and included that in this phone. The VIBRATION\ngestures are simply stunning. I doubt I will ever enjoy scrolling on any other\nphone this much. So the home button and the vibration haptic feedback are a\ncomplete WIN WIN situation.  \n  \n10) I am happy with the 128GB version. I have so much storage. I can download\nas much as I want and still be left with space. How do I accomplish this? Well\nwith every new iPhone I get, I delete the old photos and back them up to\nGOOGLE PHOTOS. I want a new life, a new memory, a new experience.  \n  \n11) It is WATER PROOF though I never use this feature, it always helps when\nplaying music in the shower.  \n  \n12) Excellent for one handed use.  \n  \nCONCLUSION : I am very happy with my purchase. I would be maybe 10-15% less\nhappy if I have to pay the full price for this.  \n  \nWhat case do I use? Speck Candyshell.  \nWill I upgrade to the next iPhone? If I get a deal, I will consider it but I\nam loving this phone 60 days on.  \nDo I recommend this? Yes.  \n  \nPlease click helpful if you found this remotely useful. It helps me know I am\nwriting sense.\n\n", "Well I moved from an Android to a iPhone 7 and it has been the most\ndisappointing purchase!  \n  \nAllow me to list down why an iPhone 7 is not worth its price or function. It\nlacks the basic of functionalities.  \n  \n1\\. Unproductive Call Manager  \n  \nThe default call manager doesn't store history of more than a week or so at\nthe most. You won't find an app to cover this as Apple doesn't allow third\nparty apps to import call history. In comparison to an android phone you would\nalways find an alternative to anything that you find lacking on your phone.  \n  \nOrganised call history with exact time stamp and duration of the call is the\nmost important of phone functions and even worse you can't have it for more\nthan a week - Ridiculous!  \n  \n2\\. File Manager  \n  \nThere is no concept of a file manager on an iPhone! One cannot view or sort\nfiles based on type, size or anything!  \n  \nThe convenience of opening a file manager, sorting through relevant files you\nneed is not available! No you cannot have a simple folder where can find your\nPDFs or zips or anything like that!  \n  \n3\\. Photos Management  \n  \nI moved a thousand plus photos (3 to 5 albums) to my new phone and then\nthought it best to sort it into separate albums like personal or trek or\ncollege and others.  \n  \nThe photos cannot be \"moved\" from any album to another, they can only be\ncopied into other albums causing duplication and a disorganised library!  \n  \n4\\. Custom Ringtone and Wallpaper  \n  \nMy friend, using a ringtone of your choice is an uphill task. You'll have to\nconnect your phone to your laptop, cut the file to 30 seconds update it into a\nparticular format and push it back to your phone before you can use it as a\nringtone, so much just to set up a ringtone?  \n  \nThe same on Android would just be a one step process!  \n  \nYour wallpaper cannot be customised to add text onto the lock screen, you just\ncannot do it unless you take time off use photoshop or something similar and\nembed text save it as a jpeg and then use it as your wallpaper!  \n  \n5\\. Basic Customisation  \n  \nThere is no option to customise your home screen with just particular\ninformation or whatever you like. What if you want your first screen to be\njust a wallpaper without anything else like network, time, battery, app icons,\nbut have everything once you swipe just right? Apple is sorry, you can't have\nany such customisation!  \n  \nOn the android swipe down menu, you can add, rearrange, move, toggle do\nwhatever you like, well the equivalent control panel on the iPhone is totally\nlimited and non editable. Functions which you feel are more relevant cannot be\nadded to the control panel and the irrelevant ones cannot be knocked off!  \n  \n6\\. Music  \n  \nGetting the music you love onto your phone is no straightforward task, connect\nto iTunes, click on a thousand different buttons and push back before you can\nhave it on your phone!  \n  \n7\\. There is no radio compatibility!  \n  \n8\\. iPhone does not sport a Corning Gorilla Glass  \n  \nThis leaves the iPhone heavily lacking with basics and ease of customisations.  \n  \nPs:  \n  \n1\\. Solutions via the use of a laptop to overcome the shortcomings listed is a\nwaste of time!  \n  \n2\\. The excuse of improved security (via not giving access to third party app\ndevelopers) limiting the functionalities of the phone is hopeless! Not\neverybody is a White House resident.  \n  \n3\\. If I told you how often the phone hangs, and just goes bonkers statue, an\niPhone will be last thing you buy!  \n  \n4\\. All of the above is just a take on what it is, you are free to have yours\nas well!\n\n", "Great product, same day delivery. This is my 3rd iphone.  \nGood packing by the seller, their is no damage with product. Everything is\nGood  \nYou buy this product 100% genuine\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 July 2017", "on 6 November 2017", "on 11 October 2016", "on 30 January 2018", "on 23 July 2017", "on 22 September 2017", "on 9 July 2017", "on 27 June 2017", "on 16 July 2017", "on 7 October 2017"], "reviewer": ["TECH NERD", "Ankit Dubey", "Amazon Customer", "Amazon Customer", "Friendly Sparrow", "Ramesh S.", "Asif Salil", "Kanwar Anand", "Viral", "Golu"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Awesome phone and best delivery by amazon.in", "An incredible machine !!!", "Good iPhone -- costly though", "Pure", "Missing rubber gasket in SIM card tray", "fake", "S7 Edge vs iPhone 7", "Best decision of July 2017", "Missing accessories", "Worst product!"], "review": ["First of all i would like to thanks amazon for their fast delivery, they\ndelivered My iPhone within 24 hours...  \nAnd as i used My iPhone 7 32 GB phone only few days so, i can't describe more\nbut till now every thing is awesome i found in comparison to android phones,\nsince i was using android phone from last 6 years.  \n  \nMy views:  \n1\\. 2GB RAM is more then sufficient because iPhone manufacturers and\ndevelopers has done good job to maintain background processes.  \n2\\. Nice thouch.  \n3\\. Awesome Camera, front and rear both.  \n4\\. All day battery backup on JIO 4G Network.  \n5\\. Awesome music sound.  \n6\\. Takes 2 hours to charge from 0 to 100%(which should be fast).  \n  \nThanks again amazon...\n\n", "First, I was very much skeptical to order an iPhone over the internet, be is\namazon or flipkart, I still feel its the luck factor when you still get your\ncostly devices in hand one piece as they should be; given the terrified\ninstances we have seen with many retailers. I understand there's little\ncontrol over these things, even from amazon's perspective (which they are\ndoing a splendid job), I feel the onus completely lies on the retailer.  \nAlright, so the core part of this......  \n  \nAmazing, superb, splendid, awesome, classic...I feel short on adjectives to\ndefine this masterpiece...Apple,,,I have started to fall in love with Apple\ndevices. I have resisted them over the years, but now I realize I have 3 of\nthem....you can choose to ignore but can't resist.  \n  \nA simple, yet powerful device, makes your life hell lot easy...powered packed\ncomponents. One thing which I admire about this is that they dont need jazzy\nadvertisements or fake ratings to promote apple devices, they are build the\nway you wouldn't hate them. Although the ram seems to be less, the memory\nmanagement is so efficient that you dont have to bother on clearing the cache\n(unlike android).  \nDisplay is superb, crystal clear...just make sure you get a tempered glass,\nand it adds an additional beauty to this. i still wonder when you made such an\nexcellent device, why cant apple build the glass that way.  \nSo far I feel 32 GB is enough although I have started taking more\npictures...you'll feel the need to do it given the camera quality. They should\nhave given an option for potrait mode (with some additional price ofcourse).\nThis is for someone who dont want a large screen but needs a dual camera and\npotrait mode. Still I am pretty much happy with the picture quality and the\ncomposition.  \nI like the touch button and the level of customization available.  \n  \noverall, not regretting the decision at all...happy about it....I think I made\nthe right choice.\n\n", "Some might say it is an overpriced piece of glass and metal.  \n  \nOthers echo what Apple says: It is the best iPhone ever made.  \n  \nI am somewhere in the middle. One can get all the cool smartphone features for\n~₹30k (e.g. OnePlus 3/3T).  \n  \nThe premium price you pay for the latest iPhone gives you guaranteed software\nupdates for minimum 3 years, awesome integration of software/hardware and\ntight integration within the Apple ecosystem.  \nSince, it is the current flagship iPhone it will still be blazing fast and get\nmost (if not all) of the software features when the next generation is\nreleased in fall 2017.  \n  \nOne of the best features in this year's iPhone is that the home button is no\nlonger a physical button -- so it cannot \"break\" in the traditional sense.  \nAdded water resistance is definitely a plus and something which was long\noverdue though I would recommend that one does not test it personally -- if\nsomehow water does enter the phone's casing, Apple will consider it out of\nwarranty. (Out of warranty replacement costs ~₹25.5k for 128 GB iPhone)  \n  \nAlso, my iPhone did face an issue immediately after I upgraded to iOS 10.2 --\nthe battery wouldn't charge. Apple Service centre replaced the phone as it was\na hardware issue.  \n  \nTo save money, one can get the 32GB version (it is plenty) or explore other\noptions like the 6s or the SE.  \n  \nIf you find my review helpful, please mark it as helpful; it encourages me to\nwrite more reviews.  \nThanks for reading and have a nice day :-)\n\n", "Best\n\n", "I bought an I phone 7 32gb. This phone is good, I mean it is the best. But I\nfound out that, my phone's SIM card tray doesn't have the rubber gasket.\nUsually, the sim tray must have rubber gasket because this phone is water\nresistance. I don't know why it is missing in my phone..!?\n\n", "fake received\n\n", "Review after using it for 1 months  \nI`ve been using S7 Edge for last 8 months and then i bought iPhone 7 128GB\nGOLD. @ 64,999 from TECHOHOLIC. This was the best deal and an additional\ncashback of Rs.2000.  \nPhone is very very premium everyone looks at the new phone. Looks are out of\nthe world. I suggest to buy only GOLD colour. jet black and matt black are\nnothing in front of gold colour.  \nBUT THIS IS ONLY FOR SHOW-OFF. THE QUALITY IS NOT COMPARABLE TO SAMSUNG.  \nHere is my points if i compare both phones  \n1.Build - Both phones are having the best build quality in the world.  \niphone feels like an empty box if you tap on both sides you will hear sounds\nlike an empty box, maybe because of 3D touch  \nS7 feels like i am holding a powerful phone. no empty box sounds.  \n2.Display - iPhone 5/10 , S7- 10/10  \n3.Main Camera (back) - iPhone 8/10 , S7-10/10 (Exposure is too much in iPhone)  \n4.Front Camera - iPhone- 10/10 , S7-9/10 (No wide angle in iPhone you cant\ntake group selfie)  \n5.Speakers - iPhone- 10/10 , S7-10/10  \n6.Touch Response - iPhone- 8/10 , S7-10/10  \n7.Fingerprint - iPhone -10/10 , S7 - 9/10 (iPhone is having the best\nfingerprint technology)  \n  \nMY S7 Edge is far far better than the iPhone 7.  \nIf you want to buy Iphone 7 then please think again Samsung quality if far\nbetter than iphone.  \ni bought these phones @ Rs.65,000(iPhone) vs Rs.57,000(S7 Edge)  \nIF YOU WANT TO SPEND MORE RS.10,00 ONLY FOR APPLE LOGO , THEN ITS YOUR\nLIFE.......\n\n", "Hahah when it comes to writing ,I am lazy. Still I must say, it's a wonderful\npiece of art. And I must be one among those lucky people who got iPhone 7 at a\nprice of 43824/- on 1st July and next day they revised price to 47k and\nfinally to 49k.  \n  \nBest thing: Camera: Live option is pretty cool,Battery, Fingerprint. Processor\nspeed  \n  \nBad thing : it's been a month and am yet to find one. Cool. Just buy and you\ngonna love the user interface. Coz I am using android also, last week one of\nmy colleague gave her Lenovo to download some app, I must say I took 5 minutes\nto find play store in that phone. Here things are streamlined, and android to\napple data transfer, perfect. :) Delighted customer\n\n", "Earpods with lightning connector, lightning to headphone jack adapter not\nfound\n\n", "Worst product!!!! Just becz of rain i got water damage!!! And apple service\nalso waste of time !!! Thy don't provide any warranty!!! So be careful not\neven take it in to rain '! Becz mokka mob ✌🏼And wifi not working properly bla\nbla many prob waste of money 🤷🏻‍♂️\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 October 2017", "on 27 July 2017", "on 8 January 2017", "on 6 February 2018", "on 8 August 2017", "on 20 July 2017", "on 22 November 2016", "on 31 July 2017", "on 2 January 2018", "on 9 August 2017"], "reviewer": ["Ved Prakash", "$hree", "thejunejaster", "Samar", "Sharan", "A.R Retailer", "Vicky Kumar", "Arun", "Tanya chahal", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Premium and Innovative Smartphone", "ASHAMED AFTER FEELING CHEATED BY AMAZON", "Amazon service good, product faulty though..", "(2 iPhone 7 plus) + (3 iPhone 7) = (5 iPhones)", "Nice mobile but after iOS 11 updates its started to ...", "It's a stunning piece of kit. Well done Apple.", "Still Phenominal", "Fake iPhone by Amazon", "Fragile screen", "Awesome!!!"], "review": ["Apple iPhone 7 (Black, 32GB) Very little new changes has been added to it\ncompared to the iPhone 6 series. The iPhone 7 is water proof and the battery\ncapacity has been increased to 1960 mAh from 1715 mAh in iPhone 6S, which\ngives improved charging capability of up to 2 hours. The display remain the\nsame with Apple’s old IPS LCD Technology since it’s not a AMOLED screen yet so\nghosting can still be issues while running some fast animations. Camera of\niPhone 7 has been bumped up to 12 megapixel of primary camera and 7 megapixel\nof secondary camera for selfies. Also the audio jack of the both 7 and 7 Plus\nhas been removed and only lightning port connection is there. However if you\nopt for apple's own air pods then it gives much better audio experience than\nthe iPhone 6 itself because it is wireless and communicate seamlessly with\nApple’s Virtual Assistant Siri for audio control. Air pods also comes in its\ncharging case with also enables it to pair with Bluetooth devices. The\nthickness and other dimensions of the phone are same as that of previous 6S\nbut now it feels more comfortable in hands. The Home button has also changed\nto solid state button which gives quiet good surficial control. iPhone 7 and\niPhone 7 Plus comes in limited color that is Jet Black, Silver and Rose Gold.  \n  \nSome of the pros and cons of the iPhone 7 and iPhone 7 Plus are as follows.  \nPros of the Device is  \n• It has water proof body That the previous iPhone version didn’t had  \n• Enhanced Camera Megapixels with Optical Image Stabilization. For Better\nQuality Photos and Videos  \n• Increased Battery Capacity. That enables to charge battery faster and also\nuse for longer time.  \nNow Cons of iPhone 7 is  \n• No microSD slot is provided for memory expansion  \n• Its own USB Connector is present.That is lightning cable is used for both\ncharging and audio  \n• Primary Camera is slightly bulged out.Giving a slightly more project at\ncamera than previous 6S  \nSo keeping all this mind iPhone 7 and iPhone 7 Plus is certainly the premium\nend smartphones for this price and as it always had been. But the price is not\nthat much high and in fact same as that of iPhone 6S and there are new\ninnovative changes also added. So iPhone 7 and iPhone 7 Plus is definitely the\nsmartphones to go for and existing iPhone users can also upgrade their\nsmartphones as new iPhone 7 is offering new end features with very little\nextra cost.  \n  \nTo watch the review video of this product visit my profile page, check the\nfrom the YouTube channel link and enter the product name in the channel page\nsearch icon to get the product review video.\n\n", "If there was any i trustes, except me, with buying the phone, it was Amazon.\nIf you check my ORDER HISTORY with AMAZON and if you check for the ITEMS I\nhave trusted AMAZON with so far, you would know how high I held AMAZON.  \nI bought this for my mother. Its not a cheap phone. Its a lot of money.  \nIt was only recently that i discovered that i cannot talk properly with her\neverytime she talks using the iPhone. She ran around and changed the sim five\ntimes because we couldnt guess the Iphone could have an issue, but that didnt\nhelp. Then she went to the nearby UNI / APPLE store and checked. The iPhone 7\nwas technically DEFECTIVE. I am shatterred that even after paying so much an\niPhone 7 is technically so defective that metallic voices and disturbances\nhave replaced all conversations with my mother. I dont stay with her and the\ndevice i gifted her to talk with her is something am crazily ashamed of right\nnow.  \nAny shame at your end AMAZON? Anything that you could anyhow do to undo the\ndamaged situation?\n\n", "Delivery was on time, product is legit with a proper Indian warranty as well.  \nBut the iPhone 7 I got has a 'microphone' issue, giving a hissing sound in the\nvoice calls and video recordings... Trying to sort out with the apple service\ncare, though they r taking a long time\n\n", "Bought two iPhone 7 plus and three iPhone 7. Now waiting for iPhone 8, 8+ and\nX.\n\n", "Nice mobile but after iOS 11 updates its started to hang and performance is\nslow battery life is also not that good can only use for 4-5 hrs and it needs\nto be charger overall it’s a good but costly product but not at all value for\nmoney. I am writing this review after one year of use and yes it’s water proof\nbut after it’s splashed with water it’s speaker 🔊 doesn’t work you have to\nmake sure that all the water 🚿 has been removed or leave it for 30-40 min then\nonly you can have clear sound all in all product is good but not at all value\nfor money 10-15 k is added to its price for nothing\n\n", "The regular 7 is the ideal size to fit your pocket and very lightweight, but a\nlarger version of the phone is available for avid gamers who like a bigger\nscreen and which has more camera functions too  \n1\\. The iPhone design as ever is a work of art, finely sculpted and\nproportioned; a pleasure to hold and use.  \n2\\. The screen is a big leap forward from the 6, with clear bright graphics\nand allowing you to choose icon and text size  \n3\\. The ring tone & speaker volume is clearer & louder on the iPhone 7 than\nany of its rivals  \n4\\. The new cordless airpods sense when they’re in your ears and pause when\nyou remove them, so finally an end to earphones with trailing cables  \n5\\. The iPhone 7 is splashproof and may be immersed in water for a time\nwithout damage; Apple though does not guarantee the phone will remain\nundamaged if it is accidentally left in a pocket and subsequently endures a\ncomplete wash/spin cycle  \n6\\. There’s no doubt about it, the new dual  \ncamera system on the 7 is fantastic. Camera takes awesome pics even in low\nlights.  \n7\\. . There are three options for memory capacity (naturally with rising price\ntags as you go up): 32G, 128G and 256G. I would suggest that unless you’re\ncontinuously streaming hi-def videos and downloading big games, 32G is going\nto be enough for most users  \n8\\. Everything you do on the phone including your contacts may be backed up on\nthe i-cloud  \n9\\. The price of the 7 is high for a buyer on a modest income  \n10\\. Make sure you buy a screen protector and a silicone rubber-back case to\nprotect the sides of the phone in case it gets accidentally dropped  \n11\\. Have used multiple SIM cards in it already with no issues.  \n12\\. It's a stunning piece of kit. Well done Apple.\n\n", "I had heard about the iPhone 7 not so great but an incremental upgrade in\ndesign and features for sometime now. The lack of headphone jack and the\ncontroversy surrounding that move by Apple was the main minus points about\nthis phone that I had noticed all over the web.  \n  \nI bought this and upgraded from my 6s a month back and I have to say, this is\nthe best performing device of the year by far. I use it with my Apple Watch\nSeries 2 and I’m a very heavy user all day long. I haven’t noticed any lag in\nthis device even on the iOS 11 beta that I’m rocking currently.  \n  \nPeople are looking forward to the iPhone 8 by now and so am I but this still\nstands as the best iPhone experience ever and will remain like that for at\nleast a couple of more years. So if you’re looking forward to a cheaper\nupgrade past iPhone 8 release, this is still the best experience you will get.\nThe audio out of the lightning port is phenomenal and I haven’t experienced\nanything negative about the lack of the headphone jack.  \n  \nThe screen is very bright and the display is by far the best display on any\niPhone.  \n  \nThe A10 Fusion chip is still the performer that competes with the latest of\nthe Android ecosystem flagships and there is no way this is slower than the\nlatest Samsung and LG offerings.  \n  \nSo If you can’t wait for the iPhone 8 and are looking for the performer and a\nlovely overall day to day experience at a cheaper price today, then this is\nthe device that is still challenging others in that price range.\n\n", "This iPhone looks like fake. The screen is too warm and not comparable to\nother iPhone. Very disgusting\n\n", "Im using from past 8months .phone is awesome.but Poor and fragile glass\nShattered by a drop from 5feet height.its also porne to scraches easily just\nby placing on table.  \nBattery life is (18hours with jio sim with mobile data on) and (8hours with\nbsnl sim mobile data on)\n\n", "Perfect phone with discount. Thank you so much Amazon!! I'm loving it\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 November 2016", "on 10 November 2017", "on 4 August 2017", "on 19 September 2017", "on 22 January 2018", "on 31 August 2017", "on 14 August 2017", "on 25 September 2017", "on 13 February 2018", "on 22 September 2017"], "reviewer": ["Finysel", "Roshni_Banerjee", "Vijay Shinde-Amazon Customer", "Apple Fan", "lubna", "Honest Reviewer", "amitkarir", "Amlaan Bhoi", "amith", "Chandra"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["but perfect product.", "Pathetic Voice Quality . Defective piece neither replaced by seller now Apple.", "Quality product", "It’s a great phone. The delivery was just a tad bit ...", "Reliable solid performance and buttery smooth Experience with impressive camera improvement", "Defective piece", "Truly good or just hyped?? All you need to know.", "bad paint iphone mate", "Iphone 7 gold (128gb) AWESOME!!", "Don't buy. Paints comes off in a month."], "review": ["Was a bit reluctant to order worrying abt d authenticity..... but perfect\nproduct...\n\n", "Amazon does not return apple products even when defective. The headphones and\naudio call quality even without them is extremely pathetic . I tried to return\nthe product but was refused .I went to apple store and they after discussing\nfor 3 hours said they cannot do anything , amazon is not even a offical\nreseller and they give light quality products . After spending hours with\ncustomer care executives on apple and amazon , I had to keep this pathetic\nhandset .\n\n", "Don’t worry, the product is genuine. Phone is as good as they come, a quality\npiece to say the least.  \n  \nNo audio jack is a positive in my opinion, the phone looks good without it.  \n  \nBeen using this for more than 2 weeks now and found no heating problem with\nheavy gaming whatsoever like so many of you experienced.  \n  \nJust check the basics whether the product is genuine or not and you’re good.  \n  \nGoodluck!\n\n", "It’s a great phone. The delivery was just a tad bit late. It arrived the day\nafter it was meant to be. The phone is totally genuine. And Jet black is a\ngreat variant to have.\n\n", "If you're going to buy a new iPhone, this is the one to get – there's a\nslightly longer battery life, a better camera, fast innards and protection\nagainst water. However, many of the changes are slight, and the iPhone 6S, for\nthe lower price, suddenly becomes a very attractive option.  \n  \nFOR  \nGood low light camera  \nWater resistant  \nDouble the internal capacity  \nAGAINST  \nLacks clear upgrades  \nSame design used for last three phones  \nBattery life unimpressive\n\n", "I have received a defected piece and when I asked them to replace it with a\nnew one they refused for the same\n\n", "Hey guys this is Ridhvik from YouTube channel PhoneRadius and you are reading\nmy full review of the iPhone 7.  \n  \nStarting with the Box Contents. You get  \n.An iPhone 7  \n2-pin USB Power Adapter (5V-1A)  \nA USB to lightning cable  \nEarPods with Lightning Connector.  \nLightning to 3.5mm Headphone Jack Adapter.  \nSIM ejector pin.  \nAnd Documentation.  \n  \nDisplay  \nRetina HD display  \n4.7-inch  \nMulti-Touch display with IPS technology  \n1334x750-pixel resolution at 326 ppi  \n  \nBattery  \nNon-removable Li-Ion 1960 mAh battery  \n  \nSplash, Water and Dust Resistant  \nRated IP67 technology  \n  \nProcessor  \nA10 Fusion chip with 64-bit architecture (quadcore processor)  \n  \nCamera  \n12-megapixel camera  \nƒ/1.8 aperture  \nOptical image stabilisation  \nSix‑element lens  \nQuad-LED True Tone flash  \nFaceTime HD camera  \n7-megapixel  \nƒ/2.2 aperture.  \n  \nPhysical overview  \nRight : Power button and SIM slots  \nLeft : Volume rockers and mute slider  \nBottom : lighting port , speakers and microphone ( NO 3.5 MM HEADPHONE JACK)  \n  \nThe new iPhone 7 comes with a new home button which does not press but gives\nhaptic feedback when touched. The pressure for the feedback back can be\nadjusted. It has Siri built in.The phone now supports stereo speakers as well.  \n  \nNow let's start with the review.  \nPros :  \n. The new iPhone 7 has a huge upgrade in the camera department when compared\nto the 6 or 6s  \n. The output from the speakers is very good thanks to the stereo speakers  \n. Though it supports only a 1960 mAh battery the battery life is very good\nand. Can give one hour more screen on time than the 6s.  \n. It can handle any game with ease and no lag  \n. The general performance is top notch  \n. The processor is the best and most powerful processor.  \n  \nCons :  \n. The worst part is the absence of the 3.5 mm headphone jack. You need to\ncarry the dongle to use headphones or use a wireless one .  \n. The supplied charger is very slow  \n(5V-1A).  \nThat's all . I hope you liked the review if you did please press the helpful\nbutton. ( It means a lot) and do subscribe to my channel PhoneRadius (no space\nbetween phone and radius ) on YouTube.  \nThank you.\n\n", "I bought the iphone 7 got it 29th of Sep 2017. It was fully covered and the\nproduct of the iPhone is original when i checked with apple warranty check\nsite. The product is fully black mate. its worst panel i am using the iphone\nproduct almost 5 years. start from iphone 3 but never see like this painting\nback of the panel paint is faded not sure how it got.\n\n", "After a lot of research and study finally i decided to buy iphone 7 gold\n128gb. It cost on 49999/- on 26/10/17.  \niphone 7 is one of the most stable product from apple and comes with all\nissues fixed.  \nprompt delivery by amazon. I checked the purchase at nearest apple store and\nis authenticated by Apple. Product is under legitimate warrenty.\n\n", "One month in the usage, the paint on the back panel started to come off and\nthat too when I had it in a cover all the time. I am using a Matte Black\nfinish. The company doesn't take any responsibility for the quality of surface\nfinish that the phone has. There are quite a lot of users worldwide facing the\nsame issue but the company has turned a blind eye to it. Shame that a company\nlike Apple would do this to its customers. One expects a certain level of\nquality while purchasing a phone worth 50000 bucks.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 September 2017", "on 29 December 2016", "on 23 September 2017", "on 15 February 2018", "on 20 September 2017", "on 14 July 2017", "on 18 February 2017", "on 2 October 2017", "on 29 October 2017", "on 12 June 2017"], "reviewer": ["deepak singhal", "Amazon Customer", "Tarandeep Singh Nagpal", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Ridhvik Makootan", "Amazon Customer", "Amazon Customer", "ASHIT PAWAR"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Sheer bad experience 😡😡", "Started liking it..", "Should you buy it in 2018...?? Let's see", "Is iphone really worth your money..?Read the review to know more..!", "A Describe Review of iPhone 7", "There received a defective product and when I called the ...", "A big fault from Amazon", "SMALL! BUT ONLY IN SIZE", "BEST BRAND IPHONE 7 HRX EDITION UNDER 57,000", "iphone7 is not water resistant and home button stopped working within 1month."], "review": [" Such an awful experience to receive a soap in a box of iphone7 ! Watch the\nvideo attached.Thanx to one of the customers who made a similar video and gave\nme an idea to he careful. Sheer bad experience 😡😡\n\n", "Got it in two days over Prime. Packing was good as expected from Amazon. The\nonly issue I see is the screen looks too yellow to my liking. Even the screen\nclarity is not as expectional as I thought and even my Mi4i screen is at par\nwith IPhone7. Also the phone was imported on December 2016. Almost 6 months\nold.Not expected this.I will update the star and comments further after a\nwhile of use.\n\n", "Bought this in 2018 during Republic day sale, have been using this for about\n20-25 days till now  \nThis review is for those who want to shift into Apple's ecosystem ( I was a\ndie hard nexus fanboy and God how much I love XDA :-P) After being fed up of\nAndroid’s standard bugs and glitches especially the most prominent SLOWDOWN I\ndecided to make the move…well the experience was really nice… and let me spoil\nit for you. it’s worth it...  \nI'll tell you why  \nWhat are the things we want in a smartphone.  \n1.Performance (4.6★)= Well coming from nexus 5x and Mi A1 I have seen one\nthing that this thing is really fast. I mean the real gem of apple is hands\ndown their iOS. Almost 99 times out of 100 it will deliver it to you. But\nthere's one catch There is SCROLLING LAG...On youtube comments section,\nscrolling down some settings...There it just lets us down....I hate hate hate\nlags and stutters...Although it's way lesser than android... Switching through\nthe apps is buttery smooth. If you're not a nitpicker like me...you won't feel\nthe difference at all. I have attached the Antutu scores @4% battery to\nsatisfy the thirst of benchmark diggers. So it flies that test too.  \n2\\. Camera (4.3★)=NO PORTRAIT MODE SUCKS.. There is low to moderate pixelation\nin bad lighting (but way better than mid range phones). During daylight it\nworks like a charm. I don’t usually click pics so it's alright for me. Front\ncam is decent back one is good. And yesss OIS works very well.  \n3\\. Battery Life(4.0★)= Here's where it gets ambiguous. People have been\ncomplaining about battery drain on Ip7 and 7+ after the iOS 11 update. Well\nthey might be correct but one thing i learned is you can suck the hell out of\nyour iPhone if you know how to do that. I have attached the screenshot where i\ncould suck the SOT of about 7.30 hrs. which is pretty good for me. Previously\nI used to get 6 hrs on Mi A1 and just 3.30 hrs. on Nexus 5x. MAYBE IT'S PRETTY\nEARLY TO SAY since it will degrade with more number of charging cycles.\nFingers crossed :-P  \nNO FAST CHARGING TOO...When was the last time I saw a 5 W charger...Umm 2015\nmaybe...They seriously need to improve the charging standards...COME ON APPLE…\nGROW UP  \n4\\. Display(4.2★)= It's not that the display is bad but it seems old and dull\nin front of mighty Samsung display where they just kill every competition.\nAlthough I like it at mild color punch but sometimes I also want a feat for my\neyes :-/. Smart invert is still in infancy…Needs a lot of improvements. 3D\nTouch is bliss…It makes life so so so much easier. TRUE TONE DISPLAY>>>>SUPER\nRETINA DISPLAY  \n5\\. Ergonomics(4.8★)= My oh My Don't get me started on this....IT IS THE BEST\nSIZE EVER( or maybe 5\" but still) it feels so so so good in hands. IT JUST\nSTANDS OUT OF THE CROWD...and looks.. OMG…Yeah Yeah everyone digs the half\neaten apple But it is classy and premium. Jet black is a\nSUPERFINGERPRINTMAGNET :-/ So it's like you can’t show it off even though your\nheart just dies to do so... Put a good case soon after you get it...Prefer\nglossy transparent ones for Jet black...  \n  \nWho should buy this  \nThose who need a smaller screen phone, ergonomically the best for one hand\nuse.  \nWho do not do much customization to their phones and are willing to stick with\nwhat Apple gives for at least two more years.  \nThose who want buttery smooth performance along with Premium looks and feel.  \n  \nWho shouldn’t buy this--  \nThose who like android’s freedom and flexibility.  \nThose who dig portrait mode, big LED screens, looking for Value money kind of\nphone.  \nThose who can’t live without Fast Charging and big batteries.  \nThose who can live with lags and stutters :-P\n\n", "Hai Everyone..!  \nI am going to share my first i phone experience over here.Its going to be a\nbit lengthy so just relax and take a deep breath..!😌  \n  \nHere we go..!👍  \n  \nI received i phone 7 as a gift from my brother.Previously i was using an old\nandroid mobile so i am a newbie to the IOS world.Entirely IOS is different\nfrom a typical android OS..!😇  \n  \nNow lets come to the product-:  \n  \nThe package contains mobile,a head set,charger and a cable for connecting\nheadset with the charging port.☝  \n  \n1.Display-:✌  \n  \nIt has a retina 4.7 inch HD display diagonal wide screen LED and it is very\nmuch convenient to carry in pockets and bags(My android mobile have 5.5 inch\ndisplay).👌  \n  \nIt also has multi-touch display with IPS technology.👍  \n  \nThe screen resolution is 1334-by-750-pixel resolution which is so much good\nfor video watching.👍  \n  \n2.Designing-:✌  \n  \nThe metallic body gives a premium look just like old days.👍  \n  \nI checked the water resistant capacity of this mobile and i can say blindly\nthat its water proof(Accidently the mobile had fallen into my aquarium\neventhough i dont have the courage to do so and there is no problem at all)👍  \n  \nThe finger print sensor works 100% perfectly.(I would say its far far better\nthan android finger print sensor)👍  \n  \nThe weight of the mobile is just 138 gms.👍  \n  \n3.Camera-:✌  \n  \nThe primary camera i just 12MP and secondary camera 7MP but i can feel the\ndifference between android and iphone cameras.The pics have quiet good\nquality(May be better than android 16MP camera)👍  \n  \nThere is also digital zoom upto 5X.👍  \n  \nThere is autofocus,body and face recognition,Panorama and Timer.👍  \n  \nVideo recording is possible in 1080p with continious auto focus(Its not\npossible in my android mobile)👍  \n  \n4.Processor-:✌  \n  \nThe procesor is A10 fusion chip with 64-bit architecture embedded M10 motion\ncoprocessor and it works fantastically.👍  \n  \nI played almost every mobile games in the itunes and every games runs\nsmoothely.(No issues of game crashings)👍  \n  \nBattery-:  \nIf there is only normal usage then it is gonna lasts for 1 day.🤕  \n  \nSound-:  \nThe headset and the mobile speakers have decent sound quality.(Not a hardcore\nexperience for me)😒  \n  \nNegatives-:  \n  \n1.The battery drains so fast if i play online games.👎  \n  \n2.Sometimes it is inconvenient to connect the intermediate cable between\nheadset and the charging port.👎  \n  \n3.Whenever i press the home button i feels that the entire bottom portion of\nthe mobile is clicking along with it(Personal opinion)👎  \n  \nVerdict-:  \n  \nIf you are planning to make a diversion from android mobile to IOS then you\nmay find it difficult to use it initally.Once you started to use it,you will\nbe amazed..!😇  \n  \nIf you are an iphone user,then i dont need to say anything..!You know your\nchoice..!😒  \n  \nThats all i wanna share..!😇  \n  \n👉Thanks 4 reading..!👈\n\n", "The iPhone 7's notable camera, battery and water resistance improvements are a\nworthwhile upgrades to a familiar phone design, but ask yourself if you really\nneed an upgrade...and if the Plus might be a better choice.  \n  \nGOOD SIDEs (+)  \n______________  \n# Improved cameras very well,  \n# The front with 7 MP camera is giving you really good pictures.  \n# Even the back shooter also is a very good camera.  \n# Beautiful design  \n# Screen and battery life is also improved  \n# Water resistance  \n# Tap-tic engine feedback is neat  \n# Powerful dual speakers  \n# Starts at 32GB, finally  \n# Ios 10, it actually really works well with the hardware of the phone. Every\nthing run smoothly, looking from gaming to test massaging or browsing the web\nat the same time, every thing is very smooth  \n# Software update is always on time, this is the apple's best thing  \n  \nBAD SIDEs (-)  \n____________  \n# No headphone jack  \n# Iterative design  \n# Many of the \"groundbreaking\" features have been on Android phones for a\nwhile  \n# Wireless audio ecosystem is immature  \n# Jet Black model scratches easily  \n  \nReasons to BUY The iPhone 7  \n_________________________  \n# VERY FAST.... Giving apple A10 fusion chip, which is 40% faster than\nprevious, as well as 50% faster graphics.  \n  \n# FLASH DRIVE.... If you are worried about storage, then, SanDisk offering\n\"iXpand\" Flash drive upto 128 gb at 8500/- Rs.  \nproduct link >  \n(( http://www.amazon.in/SanDisk-iXpand-Flash-iPhones-\nComputers/dp/B01F6RWV94/ref=sr_1_1?s=electronics&ie=UTF8&qid=1499795607&sr=1-1&keywords=external%2Bdrive%2Bfor%2Biphone&th=1\n))  \n  \n# WATER & DUST RESISTANCE.... Now the iPhone 7 has IP67 water resistance, no\nneed to worry about the water under 15 cm.  \n  \n# CAMERAS..... We have some great cameras on iPhone 7 or 7 plus. Now iPhone 7\nhas optical stabilization, which something we didn't having in previous\niPhone, also get 1.8 aperture. And 7 MP front facing camera which will give\ndecent photos, also 1080p video recording from front.  \n  \n#STEREO SPEAKERS..... This time around we don't have 1 speaker, we have 2\nspeakers, one at the top and one at the bottom. they are very loud, which is\nreally need.  \n  \n# COLOR... Now iPhone comes with beautiful jet black and matte black. You will\nfall in love with the phone.  \n  \nReasons NOT To Buy The iPhone 7  \n_____________________________  \n# DESIGN.... Apple making almost same design from so many generation. Its nice\nto having something nice, some thing new. all other competitors are trying for\nsomething new.  \n  \n# CAMERA BUMP..... The camera bump looks ugly, If apple had make the device a\nlittle bit thicker, there would be no camera bump, and you have the space for\nBIGGER BATTERY, which will made big deference. It have longer life battery\nbecause of optimization of new processor.  \n  \n# BATTERY..... We still don't have the fast charging or wireless charging. Now\nwireless charging i get not everybody use this, But fast charger we really\nneed for this. Yes we have fast charger with iPad, but we need fast charger\nalong the iPhone itself, which will charge faster.  \n  \n# HEAD PHONE JACK..... This is a too much of big a deal, Yes they are giving\nlightning converter, but if you listening something to your headphone wide,\nworking on your phone, and you need to charge, that will be big issue.  \n  \n# MICRO SD CARD SLOT.... Specially i really miss the absence of Micro SD card\nslot. I think every body is. We really need micro SD slot on iPhone for more\nspace option. But yeah this option will little bit slow down to iPhone\nperformance.  \n  \n# CUSTOMIZABILITY ON IOS.... If you are a person that really like to customize\nyour phone, then ios is definitely not for you.  \n  \nSo that is it. Thank You.  \nI THINK IT WILL HELP YOU.  \nThank you Amazon India\n\n", "There received a defective product and when I called the customer service for\na replacement, I was told by the customer service that there is no return\npolicy on apple products.\n\n", "Jet black colour is only available in 128gb variant. Here amazon is selling\njet black colour in 32gb variant.. Lol\n\n", "iPhone is now considered a fashion accessory and can easily be compared with\nexpensive jewelry and purses. Apple has changed its design for the iPhone 7 if\nminor changes in the camera rim are considered. Though the smartphone industry\nis moving towards larger screens, Apple still cares for its loyal customers\nwho prefer a small and portable device. Let us walk through the different\nfeatures of this phone and decide whether it is a worthy upgrade from the\nprevious generations.  \n**** NEW HOME BUTTON  \n1\\. The new capacitive home button takes a while to get use to. The device\nprovides a haptic feedback through the phone's vibration system and has\ndifferent intensity to suit your personal needs. After using this, the\nprevious hardware home buttons already feel a bit clunky. The touch ID has\nimproved and has better accuracy if it already didn't.  \n**** IMPROVED CAMERA  \n2\\. Apple boasts about the dual camera set up on the larger variant but the\nsmaller one does not fall way behind either. The f 1.7 aperture with OIS\nperforms great under low light. The 4k video recording is also a great add-on.\nIf you are a camera freak then you should definately go the larger variant.  \n**** IMPROVED IPS LCD DISPLAY  \n3\\. Apple claims to have improved its color gamut on its display. The display\nis definitely better than the 6s but falls behind of the AMOLED technology.\nThe viewing angles have also improved and the brightness also increased\nsignificantly.  \n**** STEREO SPEAKERS  \n4\\. Apple ditched the old 3.5mm jack and instead placed a stereo speakers. The\nspeakers are not bottom facing as one speaker is at the bottom while the\nearpiece at the top acts as the second one. This provides great immersive\naudio during gaming and entertainment.  \n**** iOS 10  \n5\\. Apple's latest hardware is complemented by the latest in-house software.\nThe new OS provides better gestures to interact with the device and provides\nadditional productivity features.  \n**** DESIGN  \n6\\. I personally prefer the matte black variant as the antenna lines perfectly\nblend in. The cellular reception falls slightly behind the 6s on this model.\nThe Jet Black color looks gorgeous but is definitely a fingerprint magnet and\ngets scratched easily.  \n**** BATTERY  \n7\\. During my review period, the battery lasted for a day easily. The stand by\nmanagement of iOS is the best out there in the industry.  \n  \nVERDICT  \n1\\. With simple, robust and efficient operating system, this phone is\ndefinitely a must buy for users you want a simple yet intuative interface.  \n2\\. The stereo speakers combined with better display definitely allows for a\nbetter entertainment experience.  \n3\\. Water-resistance is a welcome feature as it can now easily withstand\nnormal shower and rains.  \n4\\. It is a must upgrade from the iPhone 6 but if you are running a 6s then it\nis up to you if you want to trade in your audio jack for stereo speakers.\n\n", "Hi this is a very good product under 57,000 also it is a iPhone 7 brand hrx\nedition I really loved it. Below are some features and brief description about\nit.  \n  \nBRIEF DESCRIPTION:-  \nFor all the iPhone lovers, Apple brings you the best yet. The iPhone 7\nimprovises on the best features of the previous generations of Apple phones.\nBe it the camera, the battery or the speakers, the iPhone 7 aces the game.\nExperience a power packed performance with the iPhone 7. Sporting a stylish\ncompact body, the iPhone 7 is splash proof and water resistant. From a\nbrilliant display to overwhelming sound quality, name it and the iPhone 7 has\nit all.  \n  \nStrong Water Resistant Body  \nNow, you can make the most of your pool parties and your outdoor games. Apple\nengineers have designed the iPhone 7 in such a way that it is water resistant,\nsplash proof and dust proof. So, whether it is raining or you are at a beach,\nlet nothing come in between your photo sessions and fun times.  \n  \nFeel the 3D Touch  \nThe sensitive touchscreen of the iPhone 7 also allows you 3D touch. Also, the\nnew Retina HD display incorporates the 3D touch facility across the iOS. Be it\nthe music, messages or your calendar app, connect with all that in a more\nresponsive manner with the 3D touch. See how the 3D feature works on the\nscreen and feel the difference. The iPhone 7 also includes a home button which\nis a one-touch button to reach the home screen. This button is designed to be\nmore pressure sensitive and is super responsive. In sync with the taptic\nengine, the home button responses precisely and is durable for prolonged use.  \n  \nOIS for Better Image Quality  \nIf you love capturing all your special moments, the iPhone 7 cameras will be a\ndelight for you to use. The optical image stabilization technology ensures\nthat your images are free from distortion. Even if your hand shakes while\nclicking photos or if the subject is in movement, the image stabilization\nfeature makes sure that your photos are crisp and clear. The sensor counters\nthe tiniest of movement and allows up to 3x times longer exposure. The iPhone\ncamera is powered by the image signal processor which makes your photos look\nperfect despite poor lightening and sudden movements. The image signal\nprocessor is built into the a10 fusion chip and powers over 100 billion\noperations to make your photos and videos look amazing. It also enhances the\nwhite balance in the photos and helps the auto focus.  \n  \nNow, even Facetiming is more fun with the iPhone 7. The 7 MP front camera\noptimises your experience of selfies and video chat by capturing life-like\ncolours and visuals even in low-light. The Retina flash ensures that your\nvideos and photos have more real natural colour tones.  \n  \nWatch the Display Come to Life  \nThe iPhone 7 sports a Retina HD display which is more vibrant and colour rich\nthan its previous generation of phones. Watch your photos, games and videos\ncome alive on this screen. The colour space employed by the iPhone 7 screen is\nthe same as that of the digital cinema industry, so you can expect a brilliant\ntrue-to-life display.  \n  \nAll Good Things Come in Small Sizes  \nThe A10 fusion chip is the smartest and most powerful chip ever used by a\nSmartphone. Let not the size fool you. It not just makes the iPhone work\nfaster, but also ensures that the functions are well executed. The processing\nspeed is higher than the previous iPhones and does not even require much\npower. The battery life is the longest that you have experienced in an iPhone,\nand you will require less of it every day as the phone has its own mechanism\nof preserving power.  \n  \nMusic to the Ears  \nJust when you thought the iPhone 7 can’t get any better, Apple brings you the\nadvanced stereo speakers. Producing twice as much the audio output of the\niPhone 6, the stereo speakers of iPhone 7 delivers a deep and dynamic music\nrange. So, tune in and rediscover your music.  \n  \nFeatures & details:-  \n12MP primary camera with optical image stabilisation, Quad-LED True Tone flash\nand Live Photos, 4K video recording at 30 fps and slow-motion video recording\nin 1080p at 120 fps, 7MP front facing FaceTime HD camera with Retina Flash  \n4.7-inch (diagonal) Retina HD 3D Touch capacitive touchscreen display and home\nbutton with 1334x750 resolution and wide colour, Splash, water and dust\nresistant  \niOS 10 and iCloud operating system with A10 Fusion chip with integrated M10\nmotion coprocessor, 256GB internal memory and single Nano-SIM  \nNon-removable Li-Ion 1960 mAh battery (7.45 Wh) providing talktime up to 14\nhours on 3G network  \n1 year manufacturer warranty for device and 6 months on in-box accessories\nincluding batteries from the date of purchase  \n  \nSo if this review helped you please vote it helped.\n\n", "iphone7 is not water resistant and its home button stop working just in\n1month. Now to fix the issue Apple is asking me Rs. 30000 to pay. Apple is\nsaying that iphone7 is water resistant, but if anything wrong will happen\nbecause of water then apple is not responsible for it. \"Water Resistant is not\ncovered in Warranty.\"  \n[...]  \n[...]  \n[...]\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 October 2017", "on 22 June 2017", "on 10 February 2018", "on 13 March 2018", "on 12 July 2017", "on 29 June 2017", "on 14 October 2017", "on 8 October 2016", "on 31 December 2017", "on 8 December 2016"], "reviewer": ["malika", "Soumitra Khuntia", "Mayur Shahare", "✌Ramees Rahman✌", "Rahul_Ghosh", "Subroto Ghosh", "Faiz Ahmad", "Bhavik", "MAYURESH CHAVAN", "sanjay kumar"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Amazing Phone", "Fooling customers amazon website", "Finesse, Performance, Dual cameras; but it’s still a tough call", "One Star", "Coruscating performance. Price is possible disquiet.", "Great product - But terrible delivery experience", "Worth it", "Yellowish screen problem", "Black beauty...my daily driver...loving it.", "Switching from Android to iOS: A good decision"], "review": ["Apple iPhone 7 (Black, 32GB)  \n  \nReview for Apple IPhone 7 - 32GB - Purchased during the last sale of Amazon at\na cost of rs. 39,999 . The cost seemed to be on a higher side initially,\nhowever since I have been using Android for last 4-5 years, and already made\nmy mind to move from Android , so I had no choice if I wanted to upgrade.\nThere were two choices Apple 6s and Apple IPhone 7. I chose 7 since this was a\nhigher version with improved processor as compared to 6s.  \n  \nWell, actually IPhone 7 does not need a review, however since I generally\nreview every product I buy from Amazon, this is again the same.  \n  \nNot going much with the Specs, the first thing I noticed is that this phone\nnever hangs as compared to the recent Android Nougat which stands no where in\ncomparision to IOS 11. IOS 11 is much stable than Nougat. IOS used 2 GB ram\nvery effectively which an Android phone with 4 GB Ram also could not use it\nvery optimised. The IPhone can multitask easily, the applications can run in\nbackground without affecting the performance of the application which is in\nforeground. This does not impact the application you are using currently.\nWell, coming to the delivery, the Amazon Prime delivery was amazing , the\nphone was delivered within 48 hours of the order. This is so far the most\nstable phone I have used.  \n  \n1\\. Not bulky.  \n2\\. The screen is 4.7 inches, fits easily in your pocket.\n\n", "It was not a original apple phone when i checked serial no on apple website it\ndoesn't show any details and totally different back view shame on amazon for\nentertaining this type of products on amazon for fooling innocent customers\nvery disappointed regarding this purchase and i have also missed deals on\ngreat India sale on amazon regarding this phone.\n\n", "Build and Design: 8/10  \nThe iPhone 7 Plus does not come with a drastically new design. You can look at\nit more of adding finesse to the iPhone 6 Plus and iPhone 6s Plus designs. The\nsimilar design is now in its third generation. Is Apple holding out till next\nyear, to release a brand new design language? Not that it is bad in the\ncurrent state, but it dosen’t make it stand out from its predecessors. Not to\nmention, the designs from its Android arch-rivals has certainly seen changes\nover the years.The first thing that you will notice when you handle the phone,\nis that the visible antenna lines have been nicely camouflaged. While it is\nstill visible to an extent on the Rose Gold, Silver and Gold variants of the\nphone; on the Matte Black and Jet Black versions, you have to really look for\nit.The rounded edges, power / standby, volume rocker buttons and the ringer\nnotch are all in the same spot as the iPhone 6s Plus. So is the home button.\nBut there’s a catch. The circular button isn’t a push button anymore but is\nsupported by the Taptic Engine’s feedback mechanism. The Taptic Engine which\nsupports the 3D touch mechanism for the display, also controls the touch\nresponse on the button. You can set the levels of feedback for the button, and\nhonestly after a while you forget that the button isn’t there. It is one cool\nimplementation. And it is such fine design details that make Apple products\nwhat they are.The edges are 7.3mm thick and it weighs around 188 grams. While\nthe thickness is the same as its predecessor, it is around 4 grams lighter. In\nterms of overall feel of the phone and sturdiness, there isn’t much different\nfrom the iPhone 6s Plus. And the complaint we had with the 6s Plus remains.\nThe iPhone 7 Plus offers a terrible body to screen ratio as compared to some\nof its Android flagships such as the Galaxy S7 edge or the newly launched\nGoogle Pixel XL, which offers 5.5-inch display in a more compact body.The rear\nside has a bump in the top left hand corner which houses two 12MP camera\nsensors. Snapping on cover on the iPhone brings the camera bump with the plane\nof the iPhone back.There is one important addition though. It is IP67\ncertified which makes it water and dust resistant.Metal back is still as\nslippery as its predecessors. Apple has some really cool leather covers with\nmetallic button areas if you have buttery hands. They sell separately, of\ncourse. Snapping them on further reduces ease of one-handed use. And no, you\ncannot use the last generation covers on this phone for obvious reasons. I got\nthe matte black variant to review, and it looks quite wonderful, as compared\nto the other three colours. The Jet Black variant is still the more premium\nvariant, and I would not be surprised if we see more Jet black or piano black\nphone colours over the coming months.  \n  \nFeatures: 8.5/10  \nThanks to a limited product portfolio in its smartphone segment, Apple really\nensures that the internals get a good amount of upgrade in the coming\ngenerations. To that extent, the iPhone 7 Plus comes with the Apple A10 Fusion\nchipset which has a quad-core processor clocked at 2.23GHz. This is paired\nwith 3GB RAM. It comes with a 5.5-inch Full HD resolution display.There are\nthree storage variants – 32GB, 128GB and 256GB of which we have the 256GB\nvariant for review. There is no expandable storage.  \n  \nIt runs on iOS 10. A single nano SIM card slot is present on the right hand\nside, just below the power/standby button. It supports dual band Wi-Fi 802.11\nac, Wi-fi hotspot, Bluetooth 4.2, GPS with A-GPS and GLONASS, NFC only for\nApply Pay which is not available in India. And also, no FM radio.The big\nchanges on the features front is the dropping of the 3.5mm audio jack. You\nwill need a lightning port connector on your earphones. Apple bundles a pair.\nOther option is using a Bluetooth headset to enjoy your music. Apple has also\nbundled in a lightning port to 3.5 mm audio jack adapter for those who still\nwant to rely on their personal audio gear. This is one move that drew a lot of\nflak as a lot of us still prefer using personal earphones / headphones which\nstill have a 3.5mm jack. But give it some time and you will see a lot more\nlightning port earphone accessories, going by Apple’s history of spawning off\naccessories market segments. The iPhone 7 Plus comes with stereo speakers\nfinally, with one being at the base and the other on the earpiece speaker.  \n  \nOn the camera front, you get two 12MP sensors on the back and there is a 7MP\nfront-facing FaceTime HD camera. Apple has implemented the dual rear cameras\nin a way that you get to use true 2x optical zoom.  \n  \nDisplay: 8/10  \nThe iPhone 7 Plus sports a 5.5inch FullHD display which gives a pixel density\nof 401PPI. The panel is an LED backlit IPS LCD panel. However with the iPhone\n7 Plus, Apple claims to be using a wide gamut display (cinema standard). When\nplaced side by side with the iPhone 6s/6s Plus, I noticed that the iPhone 7\nPlus had a slight warm tinge to it. The iPhone 7 Plus is definitely a notch\nbrighter than the 6s Plus. The Night Shift mode lets you select the time when\nyou want to display to control the blue light, and it also lets you select the\nshade of yellow that you are comfortable with. This added granularity is a\nnice touch.  \n  \nColour reproduction is spot on and it is still a class-leading display among\nsmartphones. Colours aren’t unnecessarily vivid. Legibility in sunlight is not\nan issue, as its auto-brightness mode works quite well. The display, as has\nbeen the case with previous generations, is quite glossy. It was while\nshooting in bright sunlight where at times all I could see on the display was\nmy reflection, specially when shooting from chest height. Not so much at the\neye level.  \n  \nThe black levels on the display are quite good and watching movies or playing\ngames is a lot of fun. Games such as Vain Glory, Real Racing 3, Nova 3 look\ngorgeous on this calibrated display.  \n  \nSoftware: 8/10  \nApple iPhone 7 Plus comes with the latest iOS 10 operating system. The one\nrunning on the review unit was 10.0.3 on which majority of the testing was\ndone, before switching to the 10.1 beta to access the Portrait mode in the\nCamera app. The iOS 10 is refined and operationally quite smooth on most\noccasions. There were a few instances of apps not registering action on first\ntap.  \n  \niOS 10 dosen’t look very different from its predecessor, but packs in a lot of\nnew features. For starters, you can now uninstall the native Apple apps if you\ndon’t need them. I figured I would do without Stocks, Home and a couple of\nother apps which I deleted. Technically it just hides the icon and deletes all\nthe app data from your phone. You can reinstall the app by searching for it in\nthe App store.  \n  \nThe 3D touch still offers the Peek and Pop features, with support added to a\nlot more apps than we had seen when the 6s Plus launched.  \n  \nMessages has got a complete revamp with the app letting you add in GIF\nanimations; finger gestures – creating animations such as heart break, beating\nheart and more; send photos from the camera while in the app; share music and\nso on. While these additions are playing catch up to the likes of apps such as\nTelegram, it makes little sense to use Messages if your family or friend\ncircle isn’t on Apple devices.Control Centre has been modified, with the music\ncontrol shifted to a new tab. Also the four icons at the base – torch, timer,\ncalculator and camera support 3D gestures, letting you access more functions\nwithout leaving the Control Centre screen. iOS 10 also lets you do a lot from\nthe lock screen itself. You can swipe left to open the camera or swipe right\nto access widgets or swipe from the top to bottom to see notifications.\nThere’s also the ‘Raise to Wake up’ feature which wakes up the display when\nyou just lift your iPhone to your face if its lying in the sleep mode on your\ndesk.Music app has got some design changes. Instead of My Music, you now get a\nLibrary tab which lets you enlist a variety of options from Playlists,\nArtists, Album, Songs and so on. You can download songs if you are a\nsubscriber, optimise storage by setting a limit on auto downloads, auto-\ngenerated playlists in the ‘For You’ section and more.  \n  \nThe Photos app has got some additions in the form of Memories, where in iOS\nmakes albums based on your photos shot at a particular location. In short,\nthis is Apple Photos playing catch up to Google Photos, which has much more\ninteresting features.Siri was the star feature of the iPhones when it was\nfirst announced back in 2011. Since then Google has been getting better with\nits AI-backed virtual assistant game – first Google Now and this year the\nGoogle Assistant. Between the two, we noticed that the Assistant was able to\nunderstand accents better and let you have contextual conversations, whereas\nwith Siri you still have to pay attention to your diction.Even asking Siri\nsimple questions such as “what was the iPhone 7 Plus pricing for India” or\n“when was Siri released?” the responses weren’t very forth coming. Also\nbetween the two I also realised that most of the times you have to ask Siri\nquestions in a particular way, and you cannot ask follow up questions and get\nsatisfactory responses as you do with Assistant. Apple says Siri is a self-\nlearning system, so maybe it needs more usage. But after using it for a week,\nit isn’t significantly better than Google Assistant. One thing I would grant\nSiri is the way it presents card information – is much more richer and\ninformative than Google.  \n  \nPerformance: 9/10  \nCall quality is top notch with audible earpiece speaker even in high traffic\nsituations. The iPhone 7 Plus supports Cat 9 LTE, voice over LTE, Wi-fi\ncalling. I did not find any connectivity issues with a Jio SIM card on it, and\nwas able to make successful VoLTE calls.With the latest Apple A10 Fusion\nchipset paired with 3GB of RAM (the highest seen on an Apple iPhone) you get a\nwicked fast device. The A10 Fusion chipset houses a quad-core processor, with\ntwo high power cores clocked at 2.23GHz and two low power saving ones. There’s\na six-core GPU as well. The single core performance score of 3445 observed on\nGeekBench 4 was the highest we have seen on any smartphone we have tested so\nfar. Even the multi-core score is only second to Huawei P9. The AnTuTu\nbenchmark gives 186093 – again the highest score.  \n  \nIn terms of raw numbers, the iPhone 7 Plus comes out tops. In real life usage\nthough, the phone runs lag free and things such as app switching, finger print\nscanning work fast. The phone does get warm when you are on a particularly\nphotography heavy day, but never crossing 36-38 degree mark on the Fluke IR\nthermometer.  \n  \nGaming on the phone is smooth. No frame drops were observed on high end games\nsuch Vain Glory, Nova 3, Real Racing 3 and so on. Watching movies with the\nstereo speakers is quite a fine experience. The speakers are quite loud, but\nin certain applications such as YouTube, we observed that using the headphones\nwas a battery option.  \n  \nCamera: 8.5/10  \nOne of the highlight feature of the iPhone 7 Plus is the presence of the dual\nrear camera setup. Sure, this isn’t the first time we are seeing a dual camera\non a smartphone. Huawei and LG have done this before. But just like all things\nApple, the implementation is different. There are two 12MP sensors, one is\nstandard camera which has an equivalent focal length of 28mm (with an f/1.8\naperture) and the other sensor has a telephoto lens having a 56mm focal length\n(with an f/2.8 aperture). The standard 28mm lens comes with OIS, whereas the\ntelephoto lens does not. This implementation lets the iPhone 7 Plus offer true\n2x optical zoom. The Camera app lets you easily switch regular wide angle shot\nand the 2x optical zoom shot. This ensures that there is no loss in detail\nwhen taking 2x zoom photos.While it may seem like they are two different\ncameras, they do tend to work together everytime you fire off the shutter. You\ncan use these two lenses when shooting videos as well, but switching to the 2x\nzoom, will remove the OIS feature. The two lenses work quite well in the\nPortrait mode which is currently available on the iOS 10.1 beta. Also another\nthing to note is that the telephoto lens can only be used in well lit\nsituations, and if the light isn’t enough, the iPhone 7 Plus will use the\nregular lens with 2x digital zoom. Apple’s image processor takes this decision\non the fly.  \n  \nThe iPhone 7 Plus has a 7MP front facing FaceTime HD camera and quad LED flash\nunit on the rear side. Features carried forward from the iPhone 6s Plus\ninclude the live photos, phase detect autofocus. The Camera app is also\nsimilar to the one seen in the last generation.  \n  \nComing to the image quality, the iPhone 7 Plus just like its predecessors,\ndelivers. Colours come out natural and at times it may look a bit too dull\nwhen compared with images coming out of say a Samsung Galaxy S7 edge or even\nthe latest Google Pixel XL. Apple iPhone 7 Plus gives a neutral output, with\ngood amount of detail, great dynamic range. Optical zoom works quite well in\nbright outdoors. You also get the option of using 10x digital zoom for still\nimages and 6x digital zoom for video. Use this only in emergency situations as\nthere is a lot of artifacts you will get in the final images. When forcing the\nHDR mode, we also noticed some artifacts around the edges if the subject moved\ntoo much, as is seen in the fur of the labrador in the image below, around the\nright paw.Panoramas come out really good, and there is good exposure control.\nYou can also get HDR Panorama shots with the new camera app. There were\ninstances when shooting panoramas in bright sunlight, where I noticed mild\nchange in the sky exposure. But the image stitching is relatively better than\nthat seen on Android phones. The 2x optical zoom also offers Panorama\nmode.Focussing is relatively quick. But time to first shot is still slow as\ncompared to the quicker ways in which you can turn on cameras in some Android\nphones. Double tapping the home button to launch the camera is really a no\nbrainer which Apple should implement.Low light image quality is good, but in a\nside by side comparison with the Google Pixel XL, I noticed that the Pixel XL\nclearly took the lead there. I’m not saying iPhone 7 Plus is a bad camera in\nlow light – far from it. But the noise control, detail retention, dynamic\nrange seen on the Galaxy S7 and Pixel XL is notches above the iPhone 7\nPlus.The Portrait mode was one area which Apple spoke about a lot during the\nlaunch. During the time of testing it was only available on the beta, though\nit is now available to everyone. Once you turn on the Portrait mode, you will\nget instructions below the rounded square frame, whether you need to move\ncloser or farther. Once you get the lock, the focussing frame becomes yellow\nand you fire the shutter. Images clicked in the portrait mode turned out good,\nit works specially well when you are in a well lit area and there is\nrespectable distance between the subject and the background. The blurring of\nthe background is nicely done and isn’t as aggressive as what we have seen\nwith other dual camera phones. The good thing is that you can see the shallow\ndepth of field while you are composing the shot. But the problem is that it\nwill take some practise to get the shot faster. Your subject will have to\nreally be patient till you get everything right. This may be cool when\nshooting friends and family, but if you are on the street and want to get that\nquick portrait with a defocussed background, then that can prove difficult.  \n  \nOn the video front, the iPhone 7 Plus can shoot up to 4K resolution videos.\nThe OIS on the phone ensures that there is minimal camera shake, although you\ndo see a slight jello effect when walking and shooting. The camera region does\nget warm when shooting videos. But not enough to cause it to shut down, as I\nhave observed with Sony flagship smartphones.  \n  \nBattery Life: 8/10  \nComing with a 2900mAh non-removable battery, the iPhone 7 Plus has seen a bump\nin this department as compared to the previous generation. In a word, the\nbattery life is excellent. There wasn’t a day in the two weeks that I was\nusing the phone, when I found the battery to be draining out before my work\nday. In fact, with a 100 percent charge at 8AM, and after a day of regular\nusage, I would still have around 20 percent charge remaining till around 10PM.\nHeavy usage including playing games, streaming video, calling, messaging via\nmultiple apps, using the camera extensively did drain out the battery by\naround 9PM. The battery usage numbers show some really good numbers with a 16\nhour plus usage time and standby time of over 40 hours. It also offers the Low\nPower mode, which further extends the battery.Charging seems to take forever\nthough. It easily takes over 3 hours to go from sub-10 percent to 100 percent\ncharge. In an age of rapid charging technologies available on all Android\nflagships, where you can go from 0 to 100 in just over an hour’s time, Apple’s\ncharging technology seems dated. The good thing is that the iPhone 7 Plus can\nhold the charge for that much longer vis-a-vis an Android phone. But it’s\nabout time Apple get some sort of quick charging onboard. Is it holding that\nout for the 10th anniversary edition?  \n  \nVerdict and Price in India  \nAll things considered, the Apple iPhone 7 Plus is a great device. It excels in\ndepartments such as battery life, performance, display among other things. The\niOS 10 also brings a lot of new features to the table. The implementation of\nthe dual rear camera is quite intelligent. Also portrait mode will be quite\nloved by those who love that kind of photography – it will just require\npatience though. While the camera image quality is good, the Apple iPhone 7\nPlus still leaves scope for improvement in the low light photography\ndepartment as we observed in out Pixel XL vs iPhone 7 Plus shootout.  \n  \nIf you are on the iPhone 6/6 Plus and are looking for an upgrade, the iPhone\n7/7 Plus could be considered. For the 6s / 6s Plus users, there is little to\nno reason for upgrade. You would rather wait out this iteration for the 10th\nyear iPhone edition.  \n  \nWhile the iPhone 7 Plus is good, it looks like Apple is leaving the better\nthings for its 10th year edition. Things such as similar design, no quick\ncharging support, similar camera app (which still makes you dig into the\nGeneral settings to make tweaks in resolution and the like) among other areas\nhave been carried forward from previous two generations. There’s a high\npossibility that some of these issues would hopefully be addressed in the next\ngen iPhone.  \n  \nPrices start from Rs 72,000 for 32GB, Rs 82,000 for 128GB and Rs 92,000 for\nthe 256GB variant of the iPhone 7 Plus. The prices are high, and yes you can\nget a lot more in that amount. But if you want to invest in an iPhone, this is\nwhat you have to pay. A lot of telcos are offering the iPhone 7/7 Plus with\nvarious data packs as compared to Android competition. Thankfully, the pricing\nis in line with what it was last year. If 5.5-inch is too large a size for\nyou, then opt for the iPhone 7 which still retains most of the internal\nfeatures seen on the iPhone 7 Plus.  \n  \nIf you are still not convinced about the iPhone 7 Plus, or are short on\nbudget, the Android flagships that you can consider include the Samsung Galaxy\nS7 edge which is still a powerful device. I have been testing the Google Pixel\nXL for some days now, and it has already shown its capability in the low light\ndepartment as compared to the iPhone 7 Plus. So that could also be a possible\ncontender.\n\n", "Waste mobile device loosing its colour\n\n", "Performance: 8/10  \nSecurity: 10/10  \nDesign: 9/10  \nSound: 8/10  \nCamera: 8/10  \nBattery: 7/10  \nCompatibility: 2/10  \nSoftware: 8/10 (10.3 upgrade fixes a lot of bugs)  \n  \nVerdict: 7/10.  \n  \n(Q) Who should buy?  \n\\- Those who are using iPhone since at least 2 years and have at the most\niPhone 6 model.  \n\\- Those who are frustrated from technical snags in Android or other firmware\nand want stability and performance as first and last resort.  \n\\- Those who are Not inclined on value for money. Believe me, iPhone would\nalways seem exorbitant on price.  \n  \n(Q) Who should Not buy?  \n\\- Those who have iPhone SE or 6s. Both models are very close to performance\nof iPhone 7. You'd perceive the difference only with resource intensive gaming\nor apps usage on daily basis that is least likely. On comprehensive note, yes\niPhone 7 has quad core processor but there's no radical difference compared to\nSE and 6s.  \n\\- Android users who are cogitating first time experience for iPhone. Rather\ngoing for iPhone 7, step down to iPhone 6 at almost half the price. Use it for\na year and then if you are determined, go for latest Sept. 2017 release. You\nwill not regret decision at that point with still good resale of 6, and\ngetting latest release for coming years.  \n\\- Camera? No, it's definitely good but not worth of the whooping price tag.\nCompared to S7 and Pixel, the images are dull in color and sharpness.  \n\\- If you can't handle it properly. Just a slight drop may cost you fortune\nand a never ending dinning table lecture. Repair charges are maddening for\ncustomer damaged phone. Though it's water and dust resistant (not proof) but\nstill make sure you have best in class protective cover (Spigen) and tempered\nglass.  \n  \n(Q) Any software glitches?  \n\\- Plethora of with 10.2 but an upgrade to 10.3 would solve most of the bugs\nand performance is back as supposed with Apple product. Highly recommended.  \n  \n(Q) Is iPhone 7 a bad choice?  \n\\- There's no iPhone that you can call bad if you know what you want. There's\nnot even a competition in countless facets such as smoothness, vivid display,\nsecurity, and much more that takes user experience in premium tier. iPhone\neffortlessly stands out of the crowd. It won't compel you for a gmail account\nand then leak your information in incalculable direction while you are all\noblivious. That's why the number is drastically less for iPhone users who\nswitch back to any other firmware.  \n\\- The support is like traveling in most expensive luxury air suit. The only\ntrouble you got to take is visiting Apple center on the unfortunate event of\nissues with phone. Any manufacturing defect will mostly lead an instant\nreplacement. Strictly, no procrastination of a resolution.  \n  \n(Q) Anything else for scientists?  \n\\- There are two variants of iPhone 7 models, A1778 with Intel and A1660 with\nQualcomm chipset in modem for signal reception. Lot of reviews advise Qualcomm\nis better with latest LTE bands compatibility and signal reception; but the\nmodel A1660 is available only in US. India has A1778 model and that is point\nof anxiety only if you plan to use the handset in US, and with Sprint or\nVerizon carriers. I did some checks near dead spots with iPhone 7, 6s and 5s\n(in India) and nowhere A1778 showed major difference than 5s and 6s. The calls\nand signal strength was almost identical, you could do same tests in elevators\nor in other dead spots.  \n  \n(Q) Battery, music?  \n\\- Battery would last for a day comfortably on general usage. Gamers, depends\non GPU engagement. Hotspot and 4G as well will drain faster but there's rarely\ngoing to be sight you making to home with phone shutdown for low battery.  \n\\- Speakers are stereo, one is at bottom and other is within earpiece. The\nmusic quality however is inferior compared to iPhone 5s/ 6s.\n\n", "There's not much left to say about the iPhone 7 and I'm incredibly delighted\nto have bought one. But I had a pretty terrible delivery experience.  \n  \nThe product was supposed to have arrived within two-days. What else do I pay\nthose extra 100 Rupees for? But it was late and their \"Track Package\" feature\nis not updated as often as it should be. The information it gives is also\nquite vague (perhaps intentionally).  \n  \nWhen the package did arrive finally a day after the promised date, I was made\nto walk about 2km from my delivery address because the guy who is delivering\ndid not want to take a U-Turn. He did provide me the attractive option of\nhaving it delivered at my doorstep, albeit one more day later. His exact words\nwere - \"Come here to pick it up, or wait another day\".  \n  \nI hope this was just an aberration to Amazon's delivery experience and not\nwhat is to be expected from now.\n\n", "I had been using this phone for the past 7 months so can give you my\nperspective.  \nI Had been using Android flagship( that too a nexus) for over past few years.\nAnd that nexus was unusable after 2 years.  \nAnd on top of that Google stopped android updates after 2 yrs of phone's\nrelease which was main driving force for me to switch over to Apple.  \nAnd that decision could never have been better.  \nSo coming to phone itself,it's amazing. Let's list them as pros and cons:  \nPros:  \n1.UI is buttery smooth  \n2\\. Camera is great with snappier response.  \n3\\. Processor is way ahead of the Android counter parts.  \n4\\. Many Ios apps are better optimized than. android versions.  \n5\\. Dust and water resistant. (IP67)  \n6\\. Thin,light and amazing for one handed use.  \n7\\. Great battery life can last you a day easily with moderate to heavy use.  \n8\\. Future ios updates are guaranteed unlike in case of Android.  \n9\\. Best IPS panel in the market with spectacular viewing angles.  \n10\\. Call quality is best in class.  \n  \nCons:  \n1\\. Low resolution screen (720p)  \n2\\. Kind of limited flexibility as compared to android (which is a trade of\nyou have to make if u buy ios devices)\n\n", "Guys big problem with iphone 7, have yellowish screen problem with many users.\nJust checked on google. Mine too have yellowish screen and bad camera due to\nthis. However phone is gr8. Amazon please help ke what to do\n\n", "i upgraded to the iPhone 7 lately as my 16GB iPhone 6s was running low on\nspace and also got a good deal at amazon...  \n  \nI immediately loved the whole black look (being the fanboy that i am...) and\nalso the phone noticeably weighs lesser. Ofcourse its as slippery as all the\nother iPhones, so a good cover/Case is a must.  \n  \nTh courage that apple showed in getting rid of the 3.5mm jack, really is an\ninconvenience and in order to charge the phone and make a phone call/listen to\nmusic has become a pain.....and that little adapter is of little help. so i\nhad to buy a good pair of bluetooth earphones....  \n  \nThe overall size and feel overall layout of the buttons is similar to the\niphone 6s (apart from the home button which i like), so its easy to get used\nto.  \n  \nI loved the audio quality which is much better than the 6s and also the video\nquality is much better.  \n  \nThe setup was simple and a cakewalk overall, as with all apple products was\nuser-friendly...  \n  \noverall really loving the 7....if the price goes down ...grab it while you\ncan. you will love it.\n\n", "Got the iPhone 7 for 43K on Prime Day Sale. Have been using it for almost a\nmonth now. It came in authentic Apple box. Checked all the contents inside\nafter opening. All genuine. Mine was shipped by Cloudtail. The experience has\nbeen sublime so far.  \nI'm a convert, from Android to iOS. The first thing that struck me after using\nthe phone for the very first time was that it's super user friendly. The M10\nprocessor is the fastest processor on a smartphone yet. It's capable of\nperforming endless tasks in one go. I didn't even bother to switch off any\nbackground apps for a few days. It's damn fast. Also, the iPhone is built in\nsuch a way that it can extract the maximum juice out of its hardware. Its 2GB\nRAM is more than capable of performing all your tasks without any fuss.  \nThe camera is impressive too. The pictures have minimum noise. The details are\npretty sharp. I've seen a better camera phone than this though (OnePlus 3/3T,\nfor instance).  \nThe stereo speakers are one of the best speakers in a smartphone right now.\nTheir performance is awesome. The sound gives a theatre like feel to the\nmusic. The EarPods are great too. I'd recommend to set the volume at 50%\nthough. They can get pretty loud.  \nThe battery backup is decent enough. My phone lasts the entire day on full\ncharge. I only charge it once in 24 hours. Lasts about 2/3rd of the day on\nmixed usage (browsing, video playback, music).  \nAll in all, it's a worthy investment as you'll get updates for three years and\nthe hardware is capable enough to last that long.  \nAlso, get a solid case for protection from slips as it's a bit on the slippery\nside. Spigen is a good option.  \nGo for it if you've been thinking of switching loyalties.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 October 2017", "on 27 January 2018", "on 10 March 2017", "on 20 September 2017", "on 4 November 2016", "on 22 October 2016", "on 4 March 2018", "on 11 July 2017", "on 9 August 2017", "on 8 August 2017"], "reviewer": ["Amit Arora", "santanu singh", "Navneet Nishant", "GANJI MOHAN ARAVIND KUMAR", "Cisco Networld", "cafesolo", "Saurabh", "Amazon Customer", "Vinay  :)", "Vishal Agnihotri"]}
]