[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Must buy !!!!", "In love with the sound", "Bang for buck!", "Smooth and engaging sound. Best in this price range.", "I have been using these earphones from last one month sound output is awesome. Same is the bass", "Don't think . Just go for it.", "Awesome earphone ever", "Matching with my Bose and apple headphone", "Best headphone under Rs.1000", "Go for it"], "review": ["At this price point, JBL C100si is one of the best shots. About the product :  \n  \nPros first  \n1\\. Best BASS.... It is substantially more than Sennheiser CX213  \n2\\. Noise Cancellation is also better than cx 213  \n  \nCons  \n1\\. Vocals could have been better.  \n  \nIf you want a decent sound quality and good pair of earphones with above class\nbass, just go with these. Typically American product. Fits better too.\n\n", "JBL earphones are my favorite one.  \nYou would get excellent sound quality for sure. For those who are searching\nfor good sound in affordable price and who really fond of listening good\nshould go for it with the eyes closed.  \nActually, I had bought in Jan of last year and unluckily, I lost it. But,\nAgain I bought the same model because It's long lasting and is really good for\nwhom who have short of cash.  \nHope, My review help you in buying a good earphone.\n\n", "C100SI headphones from JBL is one of the best budget earphones if you prefer\nusing smaller sized in ear headphones rather than on ear set. Lets review the\nJBL C100SI dynamic wired headphones and see what it has to offer.  \n  \nThe headphone packaging comes with a user manual, 1 year warranty card and two\nextra pair of earbuds of different sizes. It is available in red, white and\nblack colour. If we talk about the design, the earphone is completely made in\nplastic with a classy JBL logo at the housing body. It also comes with a\npinhole speaker at the housing for noise cancellation and base compensation.  \n  \nLike we see on most of the JBL earphones the ear buds are quite soft and\ncomfortable to wear.The best part of this earphone is that it comes with a\nmicrophone which is a major add on. The mic is attached to a controller with a\nbutton which can be used for various functions like play/pause, receiving and\nending calls, skipping to next track and much more. However, there is no\nvolume control option in the controller.  \nCable is 1.2 m long but it is not the tangle free type of chord and the cable\nquality is decent. It comes with a 3.5 mm gold plated jack which ensures\nbetter connectivity. The headphones have a frequency response range of 20 –\n20000 Hz and impedance rating of 320 Ohms.  \n  \nIf we talk about the sound quality, it has a descent and powerful enough bass.\nThe treble action also feels fine but it lags a bit in mids due to which\nvocals sometimes might sound unclear. The overall sound quality is amazing and\nupto the mark.\n\n", "Hi,  \n  \nBought these earphones recently, based on some good reviews across the web.\nWhile watching some reviews on youtube, I noticed that the design of the ear\nplugs is very good. So wanted to give it a try. Here are my observations.  \n  \n============  \nBuild Quality  \n============  \n  \n\\+ Quality of the plastic casing and cables is very good. The quality exceeds\nthe price level of Rs. 800.  \n\\+ Seems to be durable enough and can tolerate some rough handling  \n\\+ Mic and a single button remote are intelligently provisioned in the cable\njunction. Easy to find the remote when needed.  \n\\+ 2 additional ear buds of Small and Large sizes are provided. Medium size\ncomes fitted to the drivers.  \n\\- No carry case. A cloth pouch should have been included.  \n  \n===========  \nDesign  \n===========  \n  \nConsidering that the earphone is sold for around 800 bucks, one cannot ask for\nmuch, but believe me this earphone is beautifully designed.  \n  \n\\+ The angle of ear plug is very accurate and should fit most of the ears\nperfectly. Remember, good seal is one of the very important aspects of in ear\ntype earphones.  \n\\+ Sound isolation is good.  \n\\+ It is available in good color options.  \n  \n==============  \nSound Quality  \n==============  \n  \nComing to the purpose these are made for. The Sound....  \n  \nThe sound is amazing and engaging. The sound signature is so good that you\nwant to keep listening to your favorite tracks all day....these earphones by\nfar outperform their price class.  \n  \n\\+ V shaped sound signature, which is enjoyable and brings life to any track  \n\\+ Very good sound stage with clear separation of instruments  \n\\+ Good bass. Not overwhelming but punchy enough.  \n\\+ Can be driven easily due to the low impedance rating.  \n\\+ Smooth sound suitable for long listening without any fatigue  \n\\- Mids may be slightly rolled off in certain tracks. But this is expected\nwith a V shaped sound.  \n  \n===========  \nVerdict  \n===========  \n  \nSimply go for it...If you are looking for a budget earphone for daily use with\nyour mobile for handling calls and good quality music, you need to look no\nfurther. It is the best in-ear in this price range.  \n  \nHope you will find my review helpful. Cheers.\n\n", "Close ua eyes and buy them .  \nI have been using these earphones from last one month sound output is awesome.\nSame is the bass .mic is also doing a good job because of which call quality\nis very good....  \nOnly thing where it could have been improved is the built quality I am not\nsaying it's bad either. It's buit quality is good.but not upto the mark like\nsennheiser cx 180 ..that is why I am giving it 4 stars otherwise I would have\ngiven in 5 stars..thanks 4 reading.\n\n", "I ordered this product (JBL C100SI In-Ear Headphones with Mic) 5 days\nback.Finally they delivered it today.  \nThough it was bot late from Amazon but it was worth waiting for the product.  \nMy 1st earphone was also JBL and i was totally satisfied with that.  \nThis is my second JBL earphone and as expected JBL did not disappoint me.  \nI have used this for one day and here is my review.  \n  \nPros:  \n  \n\\- Design is very good.  \n\\- You feel comfortable while you put it in ear.  \n\\- It is a perfect combination of BASS and treble.  \n\\- If you are a sound freak then this is the product for you.  \n\\- I am using it with my Honor 5x and I am totally satisfied. Thanks to JBL.  \n  \nCons:  \n  \n\\- Length of wire is little bit less.  \n\\- They did not provide any pouch this time.  \n  \nDon't think about it . Just go for it.\n\n", "Awesome earphone i was waiting for this type of earphone. Its music and bass\nare very good .in my view this one is best ever earphone with mic.  \nThe mic is place between both the earcords. And we can talk easily with this\ntype of earphone.  \nThe price is also in budget ₹569.In the range of 999 we can any one with mic\nwith all possible features and comfort but not like this one.Its the best one\n. I will rank it No.1.\n\n", "Excellent clarity and bass output. On the very same day received a Bose and\napple headphone from my sister as gifts, but this product matched with their\noutput, but may be bass wise sony headphones do tend to beat them all but Sony\nheadphones can't be heard for a long time due to its immense bass output.  \nMoreover received the product within 2 days.\n\n", "Was worth the money. awesome product with this price range. Before buying this\nproduct I was confused between audio technica clr 100 and this one , but the\nsound clarity of this headphone is awesome the bass is not so high, the build\nquality is average. It must be the best option for a music lover under 1000\nRs.But if you are a bass lover then don't go for it because it doesn't make\nyou feel the BOOM BOOM feeling .\n\n", "Hi,  \nI got Such a good earphones from amazon.when iam listening music this will\ngive extra beat with the complete details in the music. Noise cancellation is\ngood and another thing is which is perfectly fit for my ears. When you buy\nthis product you will get two extra earbud for your fit.  \nGood built quality  \nWirel ength is comfortable  \nComfortable fit  \nNo other irritations for ear  \nMic position is also perfect  \nSize of the ear phones are small and perfectly in the ear.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 31 January 2018", "on 5 December 2017", "on 8 October 2017", "on 2 January 2017", "on 3 November 2017", "on 8 July 2016", "on 22 November 2017", "on 22 January 2018", "on 15 November 2017", "on 1 November 2017"], "reviewer": ["Rishabh Rajbhar", "Amazon Customer", "udayan nayak", "Pavan.K", "Ahmed", "Preetam", "SAMEER RM", "DIPABRATA SUR", "Santanu Saha", "Alex"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Don't take any product that comes from Bhivandi.", "I love this earphone..", "All you need to know", "WORTHY👍✌", "Best Under Rs.1000", "JBL I Love....", "After 1 year of usage", "Best under 700. (Among with-mic headphones)", "the best and balanced sound i had experienced is from this ...", "Definitely would recommend ! ^_^"], "review": ["I have another JBL headset. Using that we can listen for a long time. But this\nis like ordinary China headset with worst quality. Box was already opened.\nPerhaps replaced with duplicate one either by the previously replaced person\nor by the seller. What seller Will do by replacing?  \nNo Bass in this headset. Some others saying good bass.\n\n", "I got it for 699 in the lightning deals during the \"Great Indian Sale\" Guys\nthis is rarely available in the market, give it a try. I like the base and\nclearity of this earphone very much compared to any other earphones in this\nrange. This is my second one. Only thing is, it gets tangles but that u can\nmanage. The length of the wire is pretty comfortable. Packaging was also good.\nGive it a try and you would not regret it! pic Attached for the reference in\nred.\n\n", "HELLO GUYS ...  \n\\----------------------------.  \nBefore Starting With The Review of the . I was provided the product by the\namazon seller am here i am after using it for 1 week ..  \nFor My review to start i must say that JBL Is a good renouned Well known\nforeign Brand Delivering Products and Other Stuffs  \n\\-----------------------------------------------------------------------  \nSO NOW COMING ON THE REVIEW  \n\\---------------------------------------------------------  \nLOOKS AND DESIGN _  \n==================  \nWith a cool outer finish it looks premium and its quite light weight can go\nfor long , it has pair of ear buds on the tips of the earphones they are\npretty decent and soft , dont heart the ears .  \nthe earphone has a inlet microphone with pause and play button added as an\nexternal feature.  \nGoing down at the bottom you will find a 3.5mm jack which is 3 strokes ...  \nit has a normal wire connect to the earphones....  \nOVER ALL LOOKS ARE DECENT  \n\\----------------------------------------------------------------------------------------------  \nSOUND  \n===============  \nComing to most important thing of an earphone which you see and buy ....sound\nquality i must say this jbl can perform like a big dude can deliver a good\nquality as well as clarity sound .... the sound is quality sound it wont hurt\nyour ears nice and comfortable  \nWhen i first received the product and opened it i wasnt expecting that kinda\nsound ,,,, but infact when i head the first sound from those pairs i was\namazed with the clarity and as well as thrilled with the BASS . Honestly i\nwasnt Expecting that amount of Bass but it turned out to be superb for me  \n\\---------------------------------------------------------------------------------------------------------------------------------  \nBUILD QUALITY  \n\\-------------------------------------------------------------------------------------------------------------------------------  \nThe build quality of this pair of earphones are of decent type . though it is\nmade up of plastic , i must say its made up of good quality of plastic  \nthe wireing is good and can go for long it wont get damaged with rough usage\n.overall the build quality is good for this Jbl product in this price segment  \n\\------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \nSUMMARY  \n\\------------------------------------------  \nRATING IN POINTS  \n\\---------------------------------------  \nBASS-- 9/10  \nTREBLE -- 8/10  \nMIDS AND LOWS --8.5/10  \nQUALITY AND CLARITY ---9.5/10  \nBUILD QUALITY --- 8/10  \n  \n=======================================================================================================  \nMY FINAL VERDICT  \n\\------------------------------------  \nIF YOU ARE ON TO A BUDGET OF AROUND 500-800 ODDS AND YOU WANT TO TRY NEW\nBRANDS .. THEN YOU SHOULD DEFINITELY GO FOR IT .. I HAVE USED IT EVERYTHING IN\nTHIS IS FINE AND AS YOU KNOW JBL IS A FAMOUS BRAND FOR GOOD PRODUCTS SO YOU\nCAN BUY THEM WITH EYES CLOSED (just saying ) THE EARPHONES ARE GOOD FOR DAY TO\nDAY USE AND UNDER A BUDGET  \n%## THEN THIS IS THE BEST BUY FOR YOU %##  \n\\----------------------------------------------------------------------------------------------------------------------------------------------  \n\\---------------------------------------------------------  \nIF YOU LIKED MY REVIEW GUYS PLEASE HIT THAT HELPFUL BUTTON THERE --- YOUR ONE\nHELPFUL BUTTON HELPS A LOT  \n  \n==================================================================================================  \nTHANK YOU  \n=========================\n\n", "Amazing product. Bought it 2 weeks before. As an user I recommend the product\nfor everyone. Under 1k its the best earphone (with mic) we get. The wire is\nmore than 1m long, but its not tangle free. And the wire quality is not very\ngood, but its Worthy for 899 bucks... The music experience is amazing. It\nnever disappoints... And it's JBL...\n\n", "There are lots of options available if you have to purchase headphones under\n1000 but the thing which makes me buy the JBL C100SI headphone is due to its\nbuilt quality, Sound output.  \nThe sound quality of JBL C100SI headphone is excellent also it provides you\nthe MIC facility So overall the product is good. You can definitely go with\nthis product.  \nAlso you get 3 different ear buds with size Small, Medium & Large which helps\nyou to get comfort.\n\n", "Yeh JBL 100csi earphones Maine Feb 2017 ko kharida guys this earphones is\nreally amazing for bass lovers Maine 22 Tarik Ko yane yeh 2018 senhiser ka cx\n180 kharida ekdam bakwas sirf clearity acchi hai Lekin bass nahi hai agar\naapko bass pasand hai to JBL hi kharide but paining in ear bas baki quality\nroach number\n\n", "After 1 year of usage they stopped working. I have noticed cuts in the wire\nnear jack(as it doesn't have a 90 degrees bend model) and near plugins due to\naverage built quality of wire. As far as sound is concerned it is good.\n\n", "Best under 700, mic and control switch is big plus . Sound quality is fine .\nLight weight. comfortable . build quality is average. My suggestion- just go\nfor it (only if u need mic, otherwise go for sennheiser cx180 which is better\nin sound quality but don't have mic & control switch)\n\n", "I had used Philips, Skullcandy JIB and Boat Basshead earphones so far, but,\nthe best and balanced sound i had experienced is from this earphones.  \nFollowings are the Pros.  \n1\\. Very comfortable and lite weight i wear this earphones listing mild music\nfor almost 5 hrs but still my ears weren't bothered unlike Boat earphones\nwhich were so heavy that i used to remove them after half hr.  \n2\\. Best sound. of course this is the trade mark of JBL earphones  \n3\\. Value for money. the pair of earphones i purchased at Rs. 710 (100 bucks\nextra as compared to boat earphones) which way way more worth than boat\nearphones.  \n4\\. Build quality. although it would seem like the earphones are delicate, yet\nit has the nice build quality. of course you have to be careful when you are\nin a rush (like Mumbai Local train) otherwise it has good quality cables.  \n  \nThe only con is that there are only 2 colour options (Black and White). the\nonly side where Boat and JBL earphones win. seriously i am a big fan of colour\ncombo like Blue and Black, Red and Black or yellow and white. but, this would\nbe subjective for different buyers.  \n  \nIf you want a great earphones at the price of less than 1,000, go grab this\ninstead of wasting your time on reading my feedback.:)\n\n", "Amazing product. The sound is heavenly. I bought it on an offer and I'm 100%\nsatisfied with it. The microphone is also very good. No problem with it\nwhatsoever. I've been using this for around two three months I think.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 January 2018", "on 30 September 2017", "on 27 September 2016", "on 6 January 2018", "on 27 October 2017", "on 25 January 2018", "on 22 March 2018", "on 29 January 2018", "on 2 February 2018", "on 17 March 2018"], "reviewer": ["Srinivas G", "BeLiVE", "Pulkit jain", "RIJOY", "Niraj Ingole", "Pramod mate", "manoj", "shobhan sarkar", "anurag tiwari", "Jisha V J"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Best In-Ear Type Headphones At Below Rs:1000/- (Check Full Review For Detailed Information)", "Poor sound quality. Treble too high. BEWARE BUYERS.", "Value For Money 💰= 3.5* , Genuine Detailed Review, Must Read Before Purchasing", "Blown away by the Sound Quality it offers in this price range⦿Read the full review for detailed overview.", "Best Of Budget In-Ear headphones", "Trusted and better than expectation  :-)", "Stock Headphone Replacement", "Damaged product", "Just Go for it.", "Okay earphones for the price, nothing special"], "review": ["So,After 3 months of usage. Review Time !  \n  \nWhat's Inside The Package:  \nSome paperwork (Information Manual,Warranty Card),3 pair extra ear\nplugs(small,medium and large size) and the Earphones itself.  \n  \nLooks And Build Quality:  \nTotal Plastic,a cool looking JBL branding,you also find a bass compensating\nand a noise cancelling pin hole speaker.As all other JBL earphones,these\nearplugs are totally soft and comfortable.you also get a microphone and a call\nreceive/reject button(You can also use this button to pause/play music or play\nnext track etc.).The cable is 1.2 Meter long And The 3.5 mm jack has gold\nplated finish,which will ensure you quality and a better connectivity.  \nLooks:  \n7/10  \nBuild Quality:  \n9/10  \n  \nBass And Sound Quality:  \nThe Audio Quality Is Greart At This Price Range.The bass output on this\nearphones are decent enough.Treble is just awesome as expected on JBL.Mids and\nvocals some time gets a little bit muddy.  \nBass: 8/10  \nTreble: 9/10  \nMids And Vocals: 7/10  \n  \nHow Comfortable It Is:  \nYes,these earphones are highly comfortable.The ear plugs are fairly soft as i\nmentioned before.However I won't recommend you to use these earphones while\nyou're jogging.As I'm a music lover also,I used it 2-3 hours listening music\nwithout any irritation on my ears.  \nComfortness:  \n8/10  \n  \nPros:  \nLooks Nice  \nDecent Sound Quality  \nHighly Comfortable  \nCons:  \nOn This Price I Didn't Found Any  \n  \nOverall Rating:  \n8/10  \n  \nShould You Buy It:  \nObviously You Can Buy It If You Are Finding A Good Looking,Good Bass And Audio\nOutputable Earphones At Below Rs:1000/-  \n  \n[...]Thanks :)\n\n", "guys m really honest here while writing this review. i have used snhsr cx180.\ncreative ep630. sony mdr ex150. jbl 150.  \ni really dont have any idea what these guys here r talking abt. i dont\ncriticise anybdy bt i wonder how cm i am the only one here who is not at all\nimpressed. i bought them after reading all positive reviews.  \nwat i found is  \nbuild quality is good.  \nwire is a bit short than any other earfones  \nfinally the most imp thing sound is too irritating. treble is too high. it\npains in ears.  \nthere is no balance between bass and treble. i tried with diff devices bt\nresults are same. please do not get motivated by believing reviews. these days\neven reviews r fake n paid.  \ni returned it on 2nd day.  \nthe thing which i want to mention here is  \nThere was a time when i used to see the reviews and just buy. but guys it work\nanymore. the time has come when you has to do your own research and then go\nfor a product.  \neverybdy out there reviewing these products seem to be their own people. I\nrequest you all to not to buy something based on these fake reviews. These\ndays when a seller launches his product on e shopping websites they launches\ntheir own reviewers too. It has become a trend now as shoppers just check out\nthe rating of product n they can even buy S*#it if reviews say to go for it.  \nso buyers BEWARE\n\n", "Hi Guys, Today i am Going To Give my Genuine Review of JBL C100SI Earphone\nAfter Using 15 days. I will Discuss all the Questions asked Above and will\nalso Tell you How to Identify The Fake Product. And will give you a Solution\nFor Best Performance. Lets Begin the Review :  \n  \n================  \nUNBOXING REVIEW :  \n================  \n  \n1 - EARPHONE  \n  \n2- WARRANTY CARD  \n  \n3- ADDITIONAL EAR BUDS  \n  \n4- MANUALS  \n  \n=================  \nEARPHONE REVIEW : (3.5* out Of 5 Value For Money 💰 )  \n=================  \n  \n4* out of 5 for Premium Looks.  \n  \n4* out of 5 for Build Quality.  \n  \n4* out of 5 for Comfortable.  \n  \n3.5* out of 5 for Sound Quality  \n  \n3.5 * Out of 5 for Bass Quality.  \n  \n3* out of 5 for Treble.  \n  \n3* out of 5 for Noise Cancellation.  \n  \n3.5 * out of 5 for Ear bud Quality  \n  \n==============================  \nADVANTAGES / Why Should You buy :  \n===============================  \n  \n1- Premium Looks at this price Range  \n  \n2- Good BUILD QUALITY in this Price.  \n  \n3- JBL is a trusted Brand.  \n  \n4- Good Comfortable while Listening.  \n  \n5- It has a Mic .  \n  \n6- Warranty Of 1 year.  \n  \n===========================================  \nWHY I Gave Medium Ratings/Value For Money 💰=3.5*  \n============================================  \n  \nI got Really Disappointed as for Quality of sound. These are the cons i Felt.  \n  \n1- Quality of Sound is not above Average. In this price range We can get\nHigher Quality of Sound from Panasonic she, Skull candy. I was Expecting alot\nfrom JBL.  \n  \n2- i am not happy with the noise cancellation for a Earphone of price 1399\n(without offer). I expect alot as i am a Music Lover.  \n  \n3- Mic is not that Clear , Low voices are Difficult to transmit. Not at all\nhappy with this.  \n  \n4- If You are really a Music Lover or you like Quality of Music always , i\nwill not Recommend you. There are other options in this Price range.  \n  \n=======================  \nHow To check Fake Product :  \n=======================  \n  \nStep 1- In front of the Box , Under C100SI you will see its Written \"In EAR\nHEADPHONES\". It Must be Written in white Colour. If its Written in Red or\nanyOther ,its a duplicate.  \n  \nStep 2- Turn the Box to back side , Your price will be written in a separate\nPaper. (Small) like a Sticker. Duplicate will have a Big Sticker.  \n  \nStep 3- Open the Box , In orginal You will get Warranty card but Not in\nduplicate.  \n  \nStep -4 : The size of Mic should be Small, not a wide in comparison with\nDuplicate.  \n  \nStep -5 : JBL logo should be Bold and written with Premium .  \n  \nStep 6- Go to YouTube , Check bass Checking Videos ,if your Earphones are\nsustainable ,then your is orginal.  \n  \n=================================  \nHow to Enhance / Get Better Efficiency :  \n=================================  \n  \nIf you have already Purchased it and thinking how to Increase the bass and\nQuality, i will recommend Go to Play store, there are plenty of Music apps\nwhere to customize basses and all needs. I will suggest Go for POWERAMP music\nplayer. I personally In Love with that app.  \n  \n=============  \nCONCLUSION :  \n=============  \n  \nThis product which is 1399 (without Discount) is really Not Worthy for Value\nof Money. But if this Product is Under 699 (offer) than its a Good Deal if you\nwant a Mic . So for me VALUE FOR MONEY 💰-= 3.5 *  \n  \n============  \nMY OPINION :  \n============  \n  \nIF You want a Earphone which have A premium Looks with mic Under This price\nRange then Go for it.  \n  \nIf you want an Earphone Under 500 , Go for Philips Extra Bass . For Mic Mi In\near.  \n  \nIf you want an Earphone under 600-650, Go for Panasonic she , for MiC Sony MDR\n150 Ap.  \n  \nIf You want an Earphone under 700-800, Go For Cx 180, for Mic Go for this\nproduct.  \n  \nIf You want an Earphone under 1000k Go for One piston.  \n  \nIf you want an Earphone under 1200k Go for SONY MDR XB 55.  \n  \nIF YOU want an Earphone under 2K with mic Go for SONY MDR XB 55AP.  \n  \nI have Used all the products and Recommending you. If you want those Reviews,\nGo to my profile and check the Reviews..  \n  \n=====================  \nWas my Review HELPFUL :  \n======================  \n  \nI hope i have Discussed all the questions asked above. If you still have some,\nYou can comment Below .i will Help you as soon as possible.  \n  \nSorry For this Long Review, Thanks For Your Patience. Have a Safe and\nProductive Day ahead. Jai 🇮🇳.\n\n", "Note:- My friend own this JBL C100SI earphones. He's been using it comfortably\nfor more than 6 months. He always suggest me to buy JBL earphones instead i go\nfor skullcandy, sennheiser etc. I thought of giving it a try, so i took this\nJBL earphones from him, tested it for one week & here is my review about this\nproduct.  \n  \n•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••  \nKEY SPECIFICATIONS AND FEATURES OF THE EARPHONE  \n•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••  \n  \n⦿Design: In ear  \n  \n⦿Microphone: inline mic  \n  \n⦿Plug: 3.5 mm  \n  \n⦿Impedance:16 ohms  \n  \n⦿Frequency response : 20 Hz – 20,000 Hz  \n  \n⦿Driver Unit: 9 mm  \n  \n•••••••••••••••••••••••••••  \nLOOKS AND DESIGN  \n•••••••••••••••••••••••••••  \n  \nThe C100SI is a lightweight earphone which is designed to perfectly fit inside\nthe ear and provide a solid audio experience.  \n  \nThe earphones are very light and come with 3 different sized buds which can be\nused as per your preference and your ear canal opening.The wires are of length\n1.2 mts and are easily manageable but are not tangle free but can be handled\neasily without severe tangling.  \n  \nThis earphones offer noise cancellation and do look stylish  and modern with a\nmic to make calls or record audio while these comfortable earphones are\nplugged in to your ears and the jack is a 3.5 mm jack.  \n  \n•••••••••••••••••••••••••••••••••••••••••••••••••  \nPERFORMANCE AND SOUND QUALITY  \n•••••••••••••••••••••••••••••••••••••••••••••••••  \n  \nThe bass performance on the JBL C100SI is pretty good earphones with a\nfrequency response of 20 Hz – 20,000 Hz the impedance of 16 ohms the product\nworks really well and delivers good bass and nice treble.  \n  \nThe mic works well and can be used to record audio or make calls very easily\nand the voices can be heard clearly as the buds provided help in isolating the\noutside environment and noise.  \n  \nThey come with the typical JBL type controller with the inbuilt mic so that\nyou can control your calls on the go and is easily compatible with iOS and\nandroid devices,overall the headphones offers good and crisp sound quality\nwith average noise cancellation and a balanced sound experience.  \n  \n✔✔✔✔✔✔✔✔✔✔✔  \nAdvantages (PROS):-  \n✔✔✔✔✔✔✔✔✔✔✔  \n  \n▶️Design.  \n  \n▶️Sound clarity.  \n  \n▶️Bass.  \n  \n▶️Comfort.  \n  \n▶️Noise Cancellation.  \n  \n✘✘✘✘✘✘✘✘✘✘✘✘✘✘✘  \nDisadvantages (CONS):-  \n✘✘✘✘✘✘✘✘✘✘✘✘✘✘✘  \n  \n▶️Product Reliability.  \n  \n▶️Volume.  \n  \n◘◘◘◘◘◘◘◘  \nFinal words:-  \n◘◘◘◘◘◘◘◘  \n  \nThe JBL C100SI is a very lightweight and a well built earphones which look\npretty good and offer pretty nice bass and some really nice audio quality\nhence this product is a good purchase for anyone looking for some nice quality\nheadphones and a good audio experience.  \n  \nShould You Buy It:  \nObviously You Can Buy It If You Are Finding A Good Looking, Good Bass And\nAudio Outputable Earphones From A Well Known Company At Below Rs:900.  \n  \nThanks for reading. I Hope this Review was Helpful.  \n  \nKeerthi kanth.\n\n", "In this review i will tell you almost all the things about this in ear\nheadphone so if you are going to buy it or you are confused then read the full\nreview so lets get started.  \n  \nI received them on time by amazon. i opened it very quickly as i was very\neager to use them. the sound quality was awesome with a nice punchy bass. the\nearphones/headphones were awesomely packed.  \n========================================================================================================  \nwhat is inside the box-  \n1)A manual  \n2)A warranty card  \n3)Total three pair or earbuds ( Including those who are already with\nearphones)  \n4) A card in which something is written in Chinese ( i don't know Chinese)  \n  \nGoods-  \n1)they deliver awesome sound with great bass output because they have 9 mm\ndynamic driver.  \n2) frequency range is 20 to 20000KHz  \n3)build quality is good  \n4)three earbuds are provided with them so you can choose the beast earbuds\nsuitable for your ear.  \n5) comfortable in ear  \n6) available in three color  \n7) Nice branding  \n8) Mids and high is good  \n9) Mike is provided  \n10) remote is also there  \n11) silicon material is soft  \n12) the length of the headphone is good  \n13) Mike output is good  \nBads-  \n1) Not tangle free  \n2)Distort at higher volume when listening to the track less than 128Kbps  \n3)Some distortion during call  \n4) A carrying case is not provided  \n  \nLets talk like friends-  \nIf you are going to purchase this then go for it without hesitation. Because\nwhen i purchased i was very confused that which headphone i should by. i\nresearched a lot but not found any satisfaction because in some headphones\nMike was missing and in some headphone the bass was not good. My budget was\nalso around 700 so I decided to choose the best of budget with nearly all\nquality. So i chooses them. So you can purchase them my friend. I know that\ndifferent type of headphone are there in your mind. But if you want a complete\nheadphone with mike and remote you should by them.One of my friend has\nJBLT100A they are also nice. he is using them with his redmi note 3.  \n  \nIf you are LeEco le2 user then please do not buy them because the output from\nthe adapter is not good and you will not get the actual sound of these\nheadphone. Because le2 do not have 3.5mm jack. le2 user should choose\nBluetooth headphone or the CDLA headphone.  \n  \nLet me tell you the alternative of it with there cons in this budget  \n1)senniser CX180  \ncons- No mike and remote so disappointment  \n2)Boat headphone  \nGood but we want a big brand  \n  \n====================================================================================================================================================================================================================  \n  \nHope you guys understood. PLEASE support me and upvote me so that my effort\ncan be appreciated.  \n  \n============================================================================================================================\nCHECKOUT MY PHOTOS THAT I UPLOADED======================\n\n", "My experience and product detail -  \n  \nHi guys recently I purchased JBL C100SI in-ear earphone. this is very nice\nearphone. sound quality of these earphone is best ever I used. best thing is\nthat bass is very nice and clear. with this earphone we get extra ear buds\nsets of different sizes. so we can set it according to your ears. normaly we\nget 1m length of wire but in this we get 1.2 m length.  \nthe body of speaker part is not too big we can easily use them when we sleep.\nlooks of this ear is very pretty and in white colour it looks damm cool. I am\nusing this earphone from last month so my experience is very good. I got this\nearphone in sale so I feel very very lucky because this item is worth of money\nat its original price and I got it at huge discount. if you are going to\npurchase it believe me your decision is very smart.  \n  \nBest ear phone under this range -  \n  \nThe jbl c100si is the best earphone avaliable in market because of its price\nand quality .the bass of this earphone is good as per the the price the\ntriable us fantastic and the main thing about the earphone is it will got a 1\nyear warrenty .if u buyed this on amazon great indian sale than u will get it\nfor rupees 599  \n  \nThe best earphones with mic under 800  \n  \nbest sound quality -  \n  \nThe JBL C100Si earplugs are really a blaster and have crystal clear sound\nquality!  \n  \nI am using this earplug since last 3-4 months and now I am addicted to music\ndue to it. It feels really rocking while I listen to music in these headphones\nand JBL has shown its worth by producing such awesome sound gadgets.  \n  \nLook wise the earphone looks nice and well but perform better than any other\ncompany's gadgets.  \n  \nThese are a bit costlier than others prevailing in the market but can prove\nthe reason behind high cost by its sound quality and clarity.  \n  \nI am in love with the headphones and at an overall point of view, I would say\nthat true sound quality can only be judged through the JBL headphones.  \n  \ntrust me it is a best deal....\n\n", "You might have seen thousands of earphones, maybe there are people who tend to\nchange the earphones every two three months, im a music lover and i do have\nmany earphones before this and this is my second JBL earphones, im very\nimpressed with JBL wire quality as it last very longer and also prevent your\nheadphone wire from tangles, my older earphones are not at all damaged, they\nare with me from last 2 years, and so it got me to get this JBL earphones.  \n  \nWHAT I LIKE ABOUT THIS EARPHONES:  \n* The bass for sure it adds the extra bass to the music tracks  \n* The wire quality  \n* It is sweat proof not mentioned anywhere but let me tell you i use this earphones for my GYM and the are just working fine till date  \n* The rubber bud quality is also up to mark it will not disappoint you, wont get hard enough after a year too.  \n* Comes with a 1 year warranty.  \n* Supports all iPhone  \n  \nWHAT I DONT LIKE:  \n* The design of the earphone is in such a manner that it automatically slips out of your ear while Running  \n* Im 6.2 in Height and the wire is bit Short but you can manage that very easily  \n* It sure adds that extra bass to the sound track but when you listen to classic music its doesn't goes that well. the terrible is low if you are one of  \nthe gazal and classic songs listener then i will not suggest you this\nearphones.  \n  \nThe brand and the affordability makes this headphone a best buy under a price\ntag of just 700Rs, you should definitely buy this if you are looking for a\nstock headphone replacement.Reviewing a product does takes hours and i do them\nfor you all so that before buying you get an idea of the product, i would\nrequest you to take a moment of your time and mark this review as helpful if\nit helped you, it keeps us motivated Thank you so much :)\n\n", "Pro: Good bass. Good for music.  \n  \nCons: Everything else.  \nNoise cancellation is bad. Does not have volume control. The button on the mic\nworks on its own whims.  \n  \nSo buy it if you’re going to predominantly use it for music and not talking.  \n  \nPersonal Grievance: the ear bud on one side was broken. Even though I pointed\nit out to the delivery man. He said it’s not Amazon’s responsibility. I’d have\nsued both the seller and Amazon if I had more free time.  \n  \nPS: It’s the first time I ever faced problem with a product I purchased from\nAmazon.\n\n", "Price : I got it at a cheaper price for just 699r  \nso, after 1 week of usage .Review time !  \n  \nContents of the Package :  \nHeadphones ,user manual ,ear buds(s,M,L) and A warranty card.  \n  \nBuild and Durability : the Body is completely plastic and flexible too.there\nis a clear Brand mark Of JBL over the ear Piece .the body looks durable enough\nby the looks of it.the buds are comfortable and doesn't falls off .the mic is\non the center of the headphones,making it difficult u to speak through it, u\nhave to held it close to ur mouth in order to speak through it ,otherwise it\nis not audible to the listener.  \n  \nScore :7/10  \n  \nClarity & Bass: the Name Jbl speaks for itself there is no stretching of sound\neven at higher volumes ,a good aspect for me.the bass is normal not deep bass\n, there is a noise cancellation feature which makes the sound appear pleasant\ntoo.Bass gets a little too loud rather than getting deep at higher Volumes .  \n  \nSore : 7/10  \n  \nPros :  \n-Noise Cancellation  \n-Voice clarity  \n-Comfortable Buds  \n-Looks Good.  \n-Good Bass.  \n-Firm Grip.  \n  \nCons:  \n-Mike not upto mark.  \n-No deep Bass.  \n  \nConclusion.  \nOverall a nice headphones under 1000rs.only thing is that mike is not upto the\nmark,i would suggest to go for the black variant as it would not get dirty and\nlooks cool too.  \n  \nClick the helpful Button if u liked it.  \nThanx.\n\n", "First thing, I got the notification regarding delivery of earphones on Sunday\neven though I had not received them! I contacted customer service and the lady\nassured me not to worry as the delivery partner had scanned wrong code for\nwrong delivery. It happened with me for the second time. First time was few\nmonths ago when I had ordered kaspersky antivirus. I think they do it on\npurpose to boast about fast delivery record!  \nAnyways, the earphones arrived 2 days later and the first impression regarding\ndelivery wasn't so good as there was simple plastic bag without bubble wrap,\nprobably because product costed less. Still, I don't think it would've costed\nAmazon too much to add bubble wrap.  \nEarphones were in a plastic box, so they were safe anyway, but bubble wrap is\na nice touch, so I request Amazon to add it again even for deliveries under\n1k. The plastic box was also not properly sealed on both sides (no tape or\nanything on one side. Could easily open in 1 second). Thus, at first I\nsuspected a used product but earphones were tucked inside properly like new\npair and also didn't feel like used when took them out. I'd recommend proper\nsealing to manufacturers, just to eliminate doubt!  \nEarphones are not so sturdy looking. A thin wire as compared to my previous\nearphones which came with my Nexus 5. They lasted 3.5 years and were nice.  \nPerformance wise, bass is just about OK, treble is more pronounced and mids\nsound flat. Voice of artists and mid notes lack punch. If you intend to listen\nto voice details in songs like classical singing, natyageet, bhaktigeet, or\nrate voice of an artist like Arijit, Anand Bhate, Mahesh Kale, Rahul Deshpande\nabove music, then you'd be a little disappointed.  \nOf course, I am saying this because I also own Sennheiser HD 202 II headphones\nand they are just amazing for sound details, clarity and overall sound\nexperience. I understand that these two are from totally seperate catagories.\nBut I just want to say, if sound (and specially voice in songs) is of utmost\nimportance to you, please try different brand, preferably Sennheiser.  \nMic is good. Made couple of calls and the other person could hear me perfectly\nwithout issues. Changed songs with the button (play, pause, next, previous\neverything worked well). At home, I use Sennheiser HD 202 II. I bought these\nmainly to use them when I go for a walk so that I can listen to songs and\nreceive calls. They serve their purpose well...therefore gave 4 stars!  \nComfort level is good. I am typing this review with earphones in my ears, and\nI've been wearing these since past 1.5 hrs. Medium level plugs that were\npresent on earphones as default are good enough for me. Haven't tried small\nand big ones.  \nI take good care of my earphones and that's why my previous ones lasted 3.5\nyears. I don't have high hopes form this Jbl pair though. Let's see!  \nFinally, these are good earphones from a reputed brand for general purpose,\ndon't expect anything special!  \nSpecial Note: These are made in China, its mentioned on box and also on a tag\non earphone wire. So if you have decided to stop buying China manufacturerd\nproducts, stay away regardless of cost, quality, comfort, warranty.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 March 2017", "on 9 August 2016", "on 14 October 2017", "on 23 October 2017", "on 19 March 2017", "on 28 January 2017", "on 26 March 2017", "on 10 October 2017", "on 2 October 2017", "on 29 September 2017"], "reviewer": ["Vishal", "M. Sharma", "Genuine Review✔️", "Keerthi Kanth", "H. SHARMA ", "Ayush patidar", "Karan Singh", "Abs", "Deepanshu", "PD2091"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["◆ I know it's Somehow lengthy. But trust me, worth your Time ◆", "PLS READ FULL BEFORE ORDER.", "Love'n it", "SOUND QUALITY JBL", "Not So Good As Compared To Other JBL Ear Phone Of Same Price Range", "Mic is not working properly", "Pretty good earphones", "Best choice for me..", "Five Stars", "Unreliable product! Don't Buy even for free, 60% discount trap"], "review": ["This is my honest & full review about the JBL C100SI In-ear Headphones. Few\nDays ago i bought this device from Amazon as one of my good friends suggested\nme.  \n  \n\" The review may be somehow long but it will help the customers in making a\ndecision. \"  \nI'll be sharing my good as well as bad experience in this Review !  \n_______________________________________  \nSo, here it starts:  \nJBL's C100SI combines style with sound like never before. The In-Ear design of\nthe C100SI brings you professional audio with JBL's superior sound which\nensures good clarity.  \n  \nThe JBL C100SI comes with one button  remote and microphone for Android and\niOS owners which lets you play, pause, skip tracks and answer calls. 3\nsilicone sleeves are supplied in the box to find the ideal fit for your ears.  \n  \nSuperior JBL Performance  \n  \nThe JBL C100SI brings with it quality JBL sound with its small yet potent 9 mm\ndrivers that are capable of producing clear and powerful bass beats.  \n  \n  \nConvenient Inline Mic and One-Button Remote  \n  \nThe inline mic and single button remote allows you to receive calls when\nplugged in to your phone and switch between songs. The mic works with Android\nand iOS devices and the remote makes call control simple and convenient.  \n  \nEnhanced Bass Response  \n  \nThe frequency response of the JBL C100SI is extended and the bass on these\nearphones are more pronounced. JBL drivers generally deliver precise, powerful\nsound for an exceptional listening experience.  \n  \nColour Options  \n  \nThe C100SI is available in 2 basic yet smart colour options of Red and White.\nThese earphones are both lightweight and thus travel well and are good for\nwork environment.  \n  \nSoft Silicone Sleeves  \n  \nThe JBL C100SI come with three pairs of silicone sleeves of small, medium and\nlarge that you can choose from to fit your ears comfortably.  \n  \nWhat's in the box:  \n  \n* JBL - C100SI Earphone  \n* 3 sets of Eartips (S, M, L)\n\n", "Very cheap..no get a good feeling...no provide good sound..like a duplicate\nproduct.dot buy this.i have purchased this in grate india fest.on oct17.i know\njbl provide good sound system.but this not.  \nPlease dotot fool.i am try to return but no option for refund only\nreplacement.so don't buy.actually it is not a jbl its \"JBL byHARMAN\"\n\n", "Good quality sound. I would recommend. Comfortable ear piece , it comes with\ndifferent sizes of extra buds.\n\n", "awesome experience to listen bass boost and mind-blowing paking ...time to\ntime delivery and great sound quality than others and obviously its JBL...\n\n", "Its my 2nd earphone of JBL, precious product was much better as compared to\nthis one both in case of sound quality & bass. i was trying to get that old\nproduct unfortunately dont have model name or number.Snap attached of old\nproduct, try that instead of C100SI. Old product was having JBL pouch, C100SI\ndoesn't have that.\n\n", "I have been purchased my headphone on october.. but My headphone mic is not\nworking properly. There is some issue with my mic.. plz try to resolve it as\nsoon as possible ....\n\n", "Pretty good earphones. The sound quality is excellent and the base is pretty\ngood too. With a mic , it is completely worth the money. I got it at a good\ndiscount too - thanks Amazon!!\n\n", "Product packaging was too much ordinary, no bubble wrap around that for extra\ntransport protection.  \n  \n◆ Initial impression was too good. I think JBL C100SI made for high bass lover\nlike me ☺️. Sounds good but I noticed in high treble little distortion is\nthere. Wire quality could have been better cause it's JBL.\n\n", "Good product even after falling in water and just by drying it was good as new\nagain without any noise which thought will be happen .\n\n", "Unreliable product! Don't Buy even if you get for 60% discount, I fell for\namazon discount trap and bought 2 headphones for my family.  \n  \nShockingly BOTH ear plugs of BOTH headphones eventually stopped working within\nroughly 4-6 months and that too inspite of the cautious and careful usage.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 January 2017", "on 10 October 2017", "on 8 March 2018", "on 10 February 2018", "on 22 September 2017", "on 29 December 2017", "on 19 December 2017", "on 30 September 2017", "on 28 January 2018", "on 18 October 2017"], "reviewer": ["Arjun Pal", "Ashifa", "lothung", "NIRAJ", "Ankur Mishra", "Sunil", "Amazon Customer", "Subhojit Ghosh", "Shouvik Nath", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Nice product,", "JBL will be The King ( see detailed review )", "good even on look and hearing method", "Best JBL speakers", "Clear and pitch perfect...", "The best headphones you can find at this price range !", "I would like to give less than one", "if you want rock music the jbl lacks little bit behind for extra bass but quite it is good product go for", "Duplicate product", "Best in class under 999"], "review": ["Incredible earphone ,  \nSound quality is just Fabulous.  \nWhen i opened the package the jbl box was open from the bottom, it may be due\nto pressure inside delivery boy's bag🤔🤔  \nBut product is new, and working very well.\n\n", "HELLO GUYS ...  \n\\----------------------------.  \nBefore Starting With The Review of the . I was provided the product by the\namazon seller am here i am after using it for 1 week ..  \nFor My review to start i must say that JBL Is a good renouned Well known\nforeign Brand Delivering Products and Other Stuffs  \n\\-----------------------------------------------------------------------  \nSO NOW COMING ON THE REVIEW  \n\\---------------------------------------------------------  \nLOOKS AND DESIGN _  \n==================  \nWith a cool outer finish it looks premium and its quite light weight can go\nfor long , it has pair of ear buds on the tips of the earphones they are\npretty decent and soft , dont heart the ears .  \nthe earphone has a inlet microphone with pause and play button added as an\nexternal feature.  \nGoing down at the bottom you will find a 3.5mm jack which is 3 strokes ...  \nit has a normal wire connect to the earphones....  \nOVER ALL LOOKS ARE DECENT  \n\\----------------------------------------------------------------------------------------------  \nSOUND  \n===============  \nComing to most important thing of an earphone which you see and buy ....sound\nquality i must say this jbl can perform like a big dude can deliver a good\nquality as well as clarity sound .... the sound is quality sound it wont hurt\nyour ears nice and comfortable  \nWhen i first received the product and opened it i wasnt expecting that kinda\nsound ,,,, but infact when i head the first sound from those pairs i was\namazed with the clarity and as well as thrilled with the BASS . Honestly i\nwasnt Expecting that amount of Bass but it turned out to be superb for me  \n\\---------------------------------------------------------------------------------------------------------------------------------  \nBUILD QUALITY  \n\\-------------------------------------------------------------------------------------------------------------------------------  \nThe build quality of this pair of earphones are of decent type . though it is\nmade up of plastic , i must say its made up of good quality of plastic  \nthe wireing is good and can go for long it wont get damaged with rough usage\n.overall the build quality is good for this Jbl product in this price segment  \n\\------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \nSUMMARY  \n\\------------------------------------------  \nRATING IN POINTS  \n\\---------------------------------------  \nBASS-- 9/10  \nTREBLE -- 8/10  \nMIDS AND LOWS --8.5/10  \nQUALITY AND CLARITY ---9.5/10  \nBUILD QUALITY --- 8/10  \n  \n=======================================================================================================  \nMY FINAL VERDICT  \n\\------------------------------------  \nIF YOU ARE ON TO A BUDGET OF AROUND 500-800 ODDS AND YOU WANT TO TRY NEW\nBRANDS .. THEN YOU SHOULD DEFINITELY GO FOR IT .. I HAVE USED IT EVERYTHING IN\nTHIS IS FINE AND AS YOU KNOW JBL IS A FAMOUS BRAND FOR GOOD PRODUCTS SO YOU\nCAN BUY THEM WITH EYES CLOSED (just saying ) THE EARPHONES ARE GOOD FOR DAY TO\nDAY USE AND UNDER A BUDGET  \n%## THEN THIS IS THE BEST BUY FOR YOU %##  \n\\----------------------------------------------------------------------------------------------------------------------------------------------  \n\\---------------------------------------------------------  \n[...]  \n  \n==================================================================================================  \nTHANK YOU  \n=========================  \n  \nYOU CAN FOLLOW ME ON YOUTUBE AS I AM A YOUTUBER ----- An Indian Consumer\n\n", "The product is v.good even on look and hearing method.  \nThe bass is decent and perfect bass lover need it.  \nAnd the single button as JBL icon use multile function call and songs change\n..  \nonly one disadvantage is volume control is not given in earphone\n\n", "These is a very good product made by JBL company.I loved it I think that other\ncompanies are best for speaker but JBL is at top.The new JBL C100SI is a\ndynamic, ultra-lightweight in-ear headphone. Its powerful 9mm drivers deliver\nthe feel-it-in-your-bones bass response and legendary sound quality you expect\nfrom JBL. They’re feather-light for all-day comfort. An in-line microphone\nwith universal remote control lets you talk and manage your calls on Android\nand iOS devices.  \n  \nFeatures & details  \nSuperior JBL sound, with bass you can feel  \nThe 3 sizes of ear tips that are included allow you to choose a size that\ngives you the most comfortable listening experience even for longer listening\nperiods  \nOne-button universal remote with mic: Answer and manage your calls\neffortlessly, with the touch of a button  \nSEE MORE  \nSEE LESS  \nFeatures & details  \nSuperior JBL sound, with bass you can feel  \nThe 3 sizes of ear tips that are included allow you to choose a size that\ngives you the most comfortable listening experience even for longer listening\nperiods  \nOne-button universal remote with mic: Answer and manage your calls\neffortlessly, with the touch of a button  \nDriver Size: 9mm  \nWorks with Android and iOS devices  \nFrequency Range: 20Hz to 20kHz  \n3.5mm connector with 1.2m long cable.  \n  \nSo,I think these review will be helpful for all\n\n", "Best ever ear phone...under 650...bass is awesome..and also the sound quality\nis clear and pitch perfect..one of the best buy's..u can go for it nd i am\nsure that u will be pleased with ot...go for it blindly... Although i bought\nit at rs 619\n\n", "The best thing i like about this headphones is it's really comfortable for\ncontinuous long hours of use. it's lightweight and has good build quality, i\ntested it on several devices and the sound quality is impressive (Set the\nequilizer first) may be the best at this price range. it has 1 year warranty\nand noise cancellation is also good.  \nif you are interested in watching the unboxing - sound test and review video -\ngoto youtube search for \"blackbeads\" channel.\n\n", "I would like to give less than one, but it's not option for that. It is not\noriginal one, I am using original JBL. Left side in picture is original one. I\nwouldn't suggest to purchase.\n\n", "Awesome one.. Mic quality is too good... Bass quality as well.. Looking\nforward for the best performance...  \nthe sound is quite smooth for soft music, if you want rock music the jbl lacks\nlittle bit behind for extra bass but quite it is good product go for it\n\n", "This is not original product. Left side ear phone was not at all working. This\nis duplicate.  \nBelow items were not there in box  \n3 sets of ear tips (S, M, L)  \n1 Warranty and safety card\n\n", "Just love this JBL Earphone.. Suberb BASS and sound quality..9/10...but the\nfittings in the ear could be little bit better.. but at this price can't\ncomplain.. I was using MI Capsule earphone before... They are not close to JBL\nC100si Sound quality... It's this best.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 March 2018", "on 28 August 2016", "on 16 February 2018", "on 13 February 2018", "on 17 February 2018", "on 19 March 2018", "on 22 March 2018", "on 23 January 2018", "on 8 March 2018", "on 27 January 2018"], "reviewer": ["Aditya", "Dhruv Naidu", "shyam prakash", "ANIL MANDE", "Anupam karjee", "Black Beads", "Amazon Customer", "Swapnil Gaikwad", "dilip", "Tamal Howlader"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Firstly what you like the most is it's sleeky design", "Highly recommended", "Good package but not long lasting", "Worth it.", "Bass and treble are awesome, perfectly fits in ear", "it's sound quality nyc like am used one", "Fake 1 year warranty", "Best budget Inearphone for bass lovers", "Not for base lovers....", "Do Not Buy These Earphones"], "review": ["Go go for it!!  \n  \nI am writing this review after my 3days of usage. Firstly what you like the\nmost is it's sleeky design. You get very good bass, treble tried playing all\n320 kbps songs sound is crystal clear. Worth for money. Best buy no\nregrets,You can never get better product @ Just 699 MRP on the product is\n1299.\n\n", "I just got my earphones. Perfecto. I'm listening the 6th song on a row now.\nLmao. The delivery came earlier than the due date and it is very comfortable.\nThe mic is clear and good top.\n\n", "After one week use the right side is not working.at this price very good\nproduct but not that good sound.over all a good product but not sure about the\nlong lasting.\n\n", "If you are looking forward for a decent sound quality and within budget then\ngo for it.  \nSound quality - 4/5  \nBass - 3/5  \nBuilt quality -4/5  \nLength is awesome. -0.8 to 1 metres.\n\n", "It's worth the money.... Bass and treble are awesome, perfectly fits in ear,\nwire is long enough.  \nSure it will last long... Nice built quality..  \n  \nGo for it.\n\n", "Am delivered my JBL c100si yesterday....it's sound quality nyc like am used\none.....but am compared this new one to my old c100si..... It's so pathetic...\nIt's build quality so poor..... they reduces the build quality a lot.....I\ndon't know it's fake or not..... anyway am already sent a return request....\n\n", "Very bad and frustrating service of JBL. My earphone stopped working in 7\nmonths so I took it to the service center to replace. They didn't replaced\njust because of minor cut on its rubber wire. This is common sense that if you\nusing this quality of rubber wire it will definitely have some minor cut on it\nand then it's fake to give 1 year warranty then...Will never buy jbl earphone\ndue to these liars...\n\n", "First impression is good of this jbl c100si in earphone. Just got delivered\ntoday and sound is amazing. Specially the bass is good. This Best budget\nearphone cost me as low as 700 rs only. Time to test it and i will again\nreview it on amazon within couple of months!!\n\n", "Awesome audio people who love to listen melody songs go for it but base is not\nthat much heavy but it's decent..  \n1 con is build quality is not that good it's ok loved it if it had t angled\njack\n\n", "Please do not buy this product.  \nBought it on 19th of March 2017 and one ear stopped working mid October.The\nwire quality is also not good.Mine had already started to break at 2 different\nplaces.I do not recommend this product to anyone.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 October 2017", "on 23 January 2018", "on 11 February 2018", "on 29 January 2018", "on 12 February 2018", "on 23 November 2017", "on 28 January 2018", "on 28 October 2017", "on 6 December 2017", "on 2 December 2017"], "reviewer": ["Sagar Arjun", "Atish P.", "Noor nizami", "Rathod Jagdish", "ding tonsing", "joe", "Prashant kumar", "Shubham Jain", "manjunath", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Value for Money, best buy!", "... THEM AT 599+90 cashback(as i payed through amazon pay) Amazing earphones at this price pros", "Just Awesome", "Amazing..just received!!", "BIGGG smile on my face...", "Decent Bass with Good Sound quality. But don't expect too much.", "After using for week compare with my other headphones", "Very nice in ear headphone with mic", "Satisfied", "JBL - The Name Is Enough !"], "review": ["Very nice ear phones with excellent sound quality at this price range. Best\npart is the shape of its ear piece which are very comfortble and fits\nperfectly to the ears unlike many other available earphones in the market. You\nget additional in-ear tips in 3 different sizes.\n\n", "JBL C100SI  \n  \ni am reviewing these earphones after a rigorous use of 72 hours  \nI GOT THEM AT 599+90 cashback(as i payed through amazon pay)  \nAmazing earphones at this price  \n  \npros:  \n*** bass is very good  \n*** sound quality is very good  \n*** look wise they are awesome  \n*** wire length is also sufficient  \n*** gets fitted in your ears completely  \n***you get a mic too  \n*** and at last it is JBL  \n  \nand amazon delivery was awesome i got them within 48 hours  \ncons:  \n** noise cancellation is OK but not extremely good  \n  \naccording to me this was the only problem with the earphones  \n  \nbut these earphones are i guess the best at this price and they are with mic\nas well  \nso if you have a budget of around 700 bucks go for them.\n\n", "I bought these for 799₹ its costly.  \nBut Price keep changing. So wait for the price to go down before you buy them.  \nSound Quality =4/5  \nBass=3.5/5  \nBuilt Quality =4/5  \nLength=0.8-1 meter\n\n", "Quick delivery and amazing sound quality..bass is amazing and no sharpness..\nSmooth sound and quality is amazing. Till now. Volume up down button is not\navailable and the mic button is kinda lose but smooth\n\n", "The best in-ear headphones in this price range, it produce best sound\nexperience, good quality in and out...  \nBass is just awesome...  \nIf you want to buy in-ear headphones below 1200rs then go for it \"JBL\"  \nEnjoy The Music... 😉\n\n", "One of the Best In-Ear Headphones at this price range. Currently, the price of\nthis headphones is Rs. 1299 but I bought these headphones for a discounted\nprice of Rs. 835 only.  \nNow talking about the content in the box, you will get the main unit in-ear\nheadphones and a couple of different sizes of ear buds which are large and\nsmall and the medium size of ear buds are already install on the headphones.  \nTalking about the physical quality of these headphones, the wire of these\nheadphones feels like very rubbery and the ear buds also feel like a rubbery\nbut it fits perfectly in the ears and the ear cups feels like plasticky but it\nis very comfortable.  \nSound Quality: At this price tag, you will get a decent sound quality with\nthese headphones. You will get a good clear sound for music and also you will\nget a good amount of bass, but not expect too much when it come in the term of\nbass. The bass is ok in these headphones.  \nPros and Cons:  \nPro:  \n1\\. lightweight and Comfortable.  \n2\\. Good Sound Quality.  \n3\\. Decent Bass.  \n4\\. Wire length is enough.  \nCons:  \n1\\. Wire and ear buds feel rubbery.  \n2\\. Ear Cups feel very plasticky.  \n3\\. In some smartphones, the In-line microphone's button doesn't work at all.  \n  \nRating:  \nSound 8/10  \nLooks 9/10  \nBass 7/10  \ncomfort 10/10  \nphysical quality 7/10  \n  \nTalking about the price to performance, yes you will get good sound quality\nbut honestly, you will get better headphones than these.  \nBut if you get a discount like I get then surely go for these headphones you\nwill get a decent product but do not expect too much.\n\n", "After using a week here is my review about this product.  \n\\---------------------------------------------------------------------------------------------------------------  \n# good things .  \n==============  \n1\\. Packing of the headphones and thes are original headphones.  \n2\\. Package consists of headphones,3 pair of extra silicon ear buds, User\nmanual and warranty card.  \n3\\. The headphones are very lightweight and are easy to use and fits in ear.  \n4\\. The size of headphone is small as u can see in the pics.  \n5\\. The quality of sound is excellent  \nbass-- 9/10  \ntreble - 9/10  \nclarity - 10/10  \nbeats - 9/10  \n6\\. These headphones also have a mic and is working preety well.  \n7\\. Build quality is very good and it has Gold plated 3.5mm headphone jack.  \n===========================================================  \nBad things  \n  \n1\\. The wire of the headphone is tangible.  \n===========================================================  \nNote;- The sound quality of these headphones is better than boat bass 200 ,\nsamsung basic in ear headphones, mi piston 3.  \nso go for it..\n\n", "Very nice in ear headphone with mic. Amazing sound quality, good bass and\ntreble. Music lovers will really love this product. Very light weight. Can\ncontrol call accept, make calls, play/ pause music tracks. Noise cancellation\nmic is present here. Also the wire is long as needed. Everything is well\nmaintained. Strongly recommended. Purchased in Great Indian Sale in just Rs.\n610(including all discounts). Go for it..\n\n", "It's really good product. Nice base quality.fast delivery and also free\ndelivery. Thnk u #amazon. If anyone wants to buy it don't hesitate you can buy\nit.\n\n", "Surprisingly The Product Got Delivered Just Within A Day & Was A Very Good\nService Indicator.The Packaging Was Very Well & No Negative Points.The Product\nIs Just Amazing With Amazing Bass & Sound Quality Or Can Say Better Than\nApple's Earphones Too.They Dont Hurt At All After Hearing For A Long Time\nToo.The Product Doesnt Feel Cheap At All From Looks Too.Will Surely\nRecommended Anyone To Buy This Earphones.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 January 2018", "on 26 January 2017", "on 8 March 2018", "on 15 February 2018", "on 25 January 2018", "on 2 June 2017", "on 9 October 2016", "on 30 September 2017", "on 9 March 2018", "on 17 September 2017"], "reviewer": ["Shubh", "satinder singh", "Baban Dadage", "Rishav Singh", "Amazon Customer", "Akshay Lamsoge", "techgogs", "MIZANUR RAHAMAN", "Abhijit kaibarta", "Manav Jain"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["BEST PRODUCT FOR THIS PRICE", "Four Stars", "THE BOX WAS ALREADY OPENED", "Good Headphone", "Value for money", "nice one. support mic and support all the phone ...", "Good for new user", "Quality sound", "Worst earphone and its a duplicate product", "It worked for 3 months"], "review": ["Supeb product for the best price.....Sound quality is BRILLIANT....U don't\nhere anything other than the music after u put this Headphone...  \n  \nLIKED IT :)\n\n", "good headphone..i used this headphone samsung galaxy grand max ,apple 6s,5s\n,mackbook air,pro,HP pavilion... its sounds good.\n\n", "The box was already been opened by someone i will give more info if earphones\nworked properly or the product is duplicate or not later . Sound quality is\nfine\n\n", "Nice headphone 🎧  \nAll are good but less Bass sounds  \nAll over headphone is good\n\n", "Excellent earphones  \nBass ,Treble is nice  \n1\\. Please go for it if you want earphones with mic  \n2\\. If mic is not your priority then check sennheiser cx180\n\n", "nice one . support mic and support all the phone model that support jack.\n\n", "Review after using 2 days  \nGood bass, Average sound clarity  \nNot premium looking as shown in image  \nMade in China.\n\n", "These are super comfortable in your ear for long hours and don't pop out of\nyour ears so you can even sleep on your ear and that won't hurt you a lot. The\nsound quality is incomparable in this price range, can hear every beat very\nclearly. Could have included the volume controller though.\n\n", "The worst earphone got me by this seller pls dont buy this jbl earphone it\ncontains cloth made wire and the audio quality is so poor its an duplicate jbl\n1st copy i got by this seller\n\n", "These inear headphones were awesome but didn't give me life I bought on\nSeptember saying one year warranty but in 3 months this ear phone works only\none side can't return the product too\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 January 2018", "on 1 March 2018", "on 4 January 2018", "on 7 March 2018", "on 9 January 2018", "on 7 March 2018", "on 9 February 2018", "on 19 September 2017", "on 26 November 2017", "on 9 December 2017"], "reviewer": ["Amazon Customer", "Biswajit roy", "DARWIN V TOMY", "Karan Rathod ", "Vikram Ramesh Yadav", "abilash", "SHIVAM TYAGI", "Sufiyan Khan", "Maveen", "Dickens"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["You won't be disappointed.. Take a leap of faith", "Great earphones in budget price with microphone and such sound quality<3", "Down down JBL!! Worst!", "The sound quality is very good and have fine bass but this made in china ...", "One word Awesome", "Nice product", "Best in range. 9mm drive*", "No second thought just go for it", "Excellent headphones...!", "Average product."], "review": ["If I had to give one word for these earphones, it'll be Amazing! I've just\nreceived them and this write up will be the initial impressions they had on\nme. To all those who are very serious about spending their money on reliable\nearphones, can Zero In on these.  \n1\\. Their delivery is loud enough that I didn't even need to surpass the\nvolume past the half mark.  \n2\\. Even after being a bass addict, I had to put the equalizer of my player on\n'balanced'. The bass is so on point that you would be satisfied.  \n3\\. The treble and the vocals are not compromised by the bass. You will even\nbe able to listen to musical instruments/ electronic beats being played that\nyou never did before.  \n4\\. Music can be paused and played by clicking the button once and the track\ncan be skipped by double clicking so dont worry about that. I read, someone in\nthe question / answers had mentioned it doesn't but that's not true. It does\nperform the function of taking and disconnecting calls, needless to say.  \n5\\. The wire is long enough to fit into the trouser pockets without tension\nand is of good rubbery quality. Its not glossy and seems like it won't tangle\neasily. The earphones are light weight as well. Won't fall off during jogging.  \n6\\. The noise cancellation is up to the mark.  \n7\\. The call mic is good as well.  \n8\\. The music seems more pleasant on these whichever genre it may be. I have\nit all, from Queen to Metallica to Ed Sheeran to Marshall Mathers to Coke\nStudio to Gurubaani.  \n9\\. I experienced a little pain in my ears and back of my head after an hour\nof listening songs though. I'd recommend you to use these with intervals.\nThere's another downside of these, it's that the connector (from where the\nwire connects to the aux of earphones) seems weak on the first look. May break\nif handled aggressively. (That's why I gave it a star less)  \nThe delivery was quick and before due date. This review will be updated on the\nday these earphones malfunction (if ever)\n\n", "JBL C100SI In-Ear Headphones with Mic (Black)  \n  \nCould give 5 stars but amazon delivery gave me worst experience this time due\nto sending via India Post. Post office staff is really worst.They never come\nto deliver any package and shows delivery failed with reason that no one was\navailable to take delivery, while actually no one came to deliver. I had to\ntake delivery from post office and if at the end I have to pick up from a\nplace then I can select our pick up locations, why to choose home delivery?\nAnyways, let's move towards product review.  \n  \nJBL has manufactured best earphones in budget price of 719/- only.Great bass,\nsound clarity, microphone etc..  \nI have been using sennheiser cx-180 street || since last 2 years and they were\nreally fantastic.  \nAlthough this C100SI is also great, but not as of that cx-180 in terms of bass\nand clarity as well as vocals.  \nBut best part of C100SI is microphone which is plus point against cx-180 and\nthat influenced me to purchase.  \nNow, let's see pros and cons:  \n  \nPros:  \nBass 9/10  \nTreble 9/10  \nMicrophone 9/10  \ndesign 10/10 (No need to set repeatedly in ear)  \nWire length 9/10  \nEarbuds 7/10 (Not soft as CX 180)  \nTangle free wire 8/10  \nGold plated earphone jack (pure output) 10/10  \n  \nCons:  \nLess clarity compared to CX 180  \nLittle hard earbuds that may cause pain in ear after long use  \n  \nThat's all...!  \nYou can definitely go for it if you want high quality bass powered earphones\nwith microphone!  \nThank You...!\n\n", "Guys don't go for this, too much treble and it has very less bass.. you will\nhave to adjust it often to hear that less bass.. very cheap effect to ears..\nyou would doubt at some point if this is really Harman product..I regret\nbuying this product and sadly there is no return n refund option.. you can\nonly exchange for another new set which obviously be the same.. these days\nordinary head phones are good n this by JBL such a disgusting sound quality...\n\n", "Is it a fake Chinese product?  \n  \nThe sound quality is very good and have fine bass but this made in china tag\nis itching me🤔\n\n", "Paisa vasool product , good bass and trebles ... Fully balanced sound.\n\n", "The sound quality is good,noise isolation is perfect (it's little bit good\nthan my previous earphone which was boat 220).  \nAlthough the earphone lacks tangle-free cable and premium look which my boat\n220 had.  \nBuild quality is good.I bought it recently ,so don't much abt life etc.The\nbuds fits perfectly in ear for better experience as my boat 220 fell every\n10-15 min from ear.  \n  \nOverall it's good just lacks look and tangle-free cable\n\n", "Best for the cost of RS 600 thanks to Amazon pay offer . Good sound quality &\nbass thanks to 9mm drive in headphones. Build quality is also good but wire is\nnot tangle free so it is not for ppl who ll handle it rough . Light weight ,\ncomfortable do come with 3 sizes of ear buds. Due to 9mm drive it bit big and\nfitment in ear could be the issue. One button mic to attend calls and control\nmusic ll comes in handy .\n\n", "My iPhone’s earphone accedentally got damaged. So I was confused whether I\nshould go for iPhone’s earphone again(need high amount for this) or I should\ngo for other than iPhone’s earphone. I decided for JBL after lots of R&D.\nAfter using iPhone’s earphone I thought JBL won’t match its level but believe\nme it does. Not exactly same but it’s quite close.  \nIt has high powerful bass, clear mic sound quality, perfect for iPhone\ndevices.  \n  \nCons-  \nThe only negative point I can see in this earphone, the mic is placed little\nlower ( little far from mouth), you may have to put little effort while making\ncalls. However I tested by making calls, no issues. You need not to hold mic\nnear your mouth during calls.  \nSo I highly recommend this earphone. I bought this one in just 799/- with 75\ncashback in pay balance. Always grateful for amazing Amazon. Loved it!!!\n\n", "I bought this earphone on Republic day sale in Amazon. Initially I was a bit\nskeptical about the quality of the headphone looking at the price at which it\nis being sold and many negative reviews. But after using this headphone for a\nweek now I will say this is one of the best headphones in this budget.  \n  \nPros:  \n\\- Decent Build Quality.  \n\\- Comes with different earbud sizes.  \n\\- Good bass and balance in sound. Bass does not override the voice, so you\ncan enjoy each musical instrument playing.  \n\\- Silicon earbuds are good and soft.  \n\\- One button Microphone quality is very good. I have used it for conference\ncalls.  \n\\- The button can be used to play, pause, 2 press forward, 3 press reverse,\nanswering and disconnecting calls.  \n\\- I generally use this 3/4 hours in a stretch and no pains in ears. This is\nreally important as many in ear headphones cause pain the ears after long use.  \n\\- I have used sony, senheiser, skullcandy, boat bassheads headphones till\nnow. I would rate the sound quality better in JBL C100SI.  \nCons:  \n\\- Nothing as of now.\n\n", "I got these earphones about 2-3 weeks back. At first the impressions were\npoor, but then I used it for a couple of hours and adjusted the equilizer\naccording to my choice of music and it worked fine.  \nSo in order to get good feel of music you have to set the equilizer. I've set\nthe equilizer to high bass and it does give me good bass.  \nThe wires are not tangle-free, it often gets difficult to untangle the wire.  \n*Note : It has lots of treble, if you're purchasing the product then you need to reduce the treble in equilizer settings.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 September 2017", "on 9 January 2017", "on 28 September 2017", "on 25 September 2017", "on 8 October 2017", "on 20 March 2018", "on 3 January 2018", "on 7 December 2017", "on 5 February 2017", "on 8 November 2017"], "reviewer": ["Lalit Dogra", "Omkar Panchal", "Umesh", "Dewoo C.", "Saurabh", "Amazon Customer", "Sathya", "Ram", "Bijay", "Rakkshit"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["JBL vs Sennheiser", "Worst earphone in this price segment.", "Don't buy.. Less sound is coming from one ...", "Very poor performance.. Waste of money.. Cheap quality", "GOOD STUFF 1", "you can't get better than this", "Best", "Audio was good while it", "Little care and enjoy original sounds..", "Pure Music to your ears"], "review": ["I’ve bought JBL C100SI and Sennheiser CX-180, both are amazing..! I love\nSennheiser for somethings and somethings for JBL  \n  \nWhat i like in Sennheiser?  \nWhen I play a song, the feelings of the songs i feel every time and when i am\nclose my eyes, i feel the original and beautiful sound of the singer Camila\nCabelo! I feel the voice is playing from the backwards and also note the\ninstrument music, bass frequency, the music and the voice of the singer are\nalways cuter then JBL C100SI! Guys, if you falling love with English or\nEspanyol songs, then go for Sennheiser.  \n  \nWhat i like in JBL?  \nGuys when i listening JBL and Sennheiser at the same time, i note JBL have\nmore sound of instruments and beautiful bass than Sennheiser! If you falling\nfor bass, than go for JBL.  \n  \nBoth are comparable and both are good and JBL have high quality microphone but\nSennheiser haven’t any mic!\n\n", "I've tried Senheiser, JBLT150, and BOAT Nirvana 225 before this headset and\nI've never had such a bad experience.  \n  \n1\\. Build quality: The product feels cheap and the material of the wires feels\nplastic and very weak.  \nThe joints near the earphones and the jack is already in a sorry state and\ncould break any moment without even applying much pressure.  \n  \n2\\. The sound quality was below average. The audio is clear but you don't\nexpect such poor sound quality with an earphone in a price segment of\nRs699-899. My BOAT 225, which costs only 499, has a better sound quality, loud\nand clear with great bass.  \n  \n3\\. I've had an issue where one side of the earphone stopped working even\nafter 2 days of usage. I raised a return request because it was under 15 days\npolicy. What if others are not as lucky as me and their earphone stopped\nworking after 15 days. You don't have JBL after sales service in every part of\nthe country.  \n  \nDON'T BUY THIS EARPHONE. It will not last. And for this price there are a hell\nlot of options out there.\n\n", "Don't buy .. Less sound is coming from one of the two earplugs. You can buy\nskul-candy instead . My last earphone was 💀 skul-candy and it lasts for\napproximately 2 years .\n\n", "I opened just now.. And immediately sent for return..It's a cheat.. Be\ncareful.. The performance is very poor.. With high treble noise.. Zero I say\nzero bass.. It's just like 50₹ head phone we get in Grey market.. Please don't\nbuy expecting it to be a normal good headphone\n\n", "GOOD STUFF  \n1.There are 3 different sizes of ear tips that are included allow you to\nchoose a size that gives you the most comfortable listening experience even\nfor longer listening periods  \n2.it has One-button universal remote with mic,you can use it for Answer and\nmanage your calls effortlessly, with the touch of a button  \n3.Driver Size is 9mm  \n4.Works with both Android and iOS devices  \n5\\. Frequency Range of this earphone comes upto 20Hz to 20kHz  \n6.It has3.5mm connector with 1.2m long cable.  \nBAD STUFF  \n1.It has too much treble which is not liked by everyone  \n2.The maximum lifetime is around 3-6 months  \n3.There is no proper warranty or customer care  \n4.Microphone seems to be defective  \nAfter all the considering all the points,the JBL C100SI is to be performing\namazing FOR A LIMITED PERIOD OF TIME  \nIF YOU FOUND THIS HELPFUL PLEASE CLICK THE HELPFUL BUTTON  \nPICTURES GIVEN BELOWJBL C100SI In-Ear Headphones with Mic (Black)\n\n", "Honest Review after one day use:  \n  \noutstanding earphone in this price cap. you can't get better than this. i am a\nhardcore audiophile since my schooldays and now a proffessional musician. i\nbought this one as a backup, bcz i forgot my sennheiser earphones at my\nrelative's house, and unable to get those back within 2-3 months.  \n  \nmany are complaining about the earphone. some say Bass is low, some saying\ntreble is high and intolerable. I would like to say its is not right to blame\nany earphone completely for the sound quality and that too of these world's\ntop brands audio products. The sound production comes with the performance\ncapability of the complete hardware & software package (chipset,audio\nchipset,audio codec and the music player). And these days android phones are\nselling like Hot Kachauris. Its obvious that only few companies concentrate on\nthe sound quality, as they need to concentrate more on CPU,RAM,Camera,Storage\netc.... and that too in a very competitive price.  \n  \nNow about the earphone...  \nIt has more than enough Bass, just tweak the equalizer appropriately. It will\nsatisfy anybody, except those who just want to listen bass like a real\nsubwoofer. for those, i would suggest XB series of Sony or something like\nthat. But that XB comes with the compromise of Mids,Vocals & Highs... and they\nare not good for ears. Believe me...The bass in these JBL is just awsome.  \n  \nFrequency response is a bit low (20Hz-20KHz), but that's ok for this price.\nMany won't even recognise it's effect.  \n  \nYes, Treble is slightly high. But not like Intolerable type. Again you can\ntweak the equalizer. The desired sound is fully achievable.  \n  \nI have tested the earphones on my PC, Lenovo Vibe K5 Note, Lenovo A6000, LYF\nFlame1, Samsung Galaxy Grand Max, Sony MP3 Player, My Roland Octapad SPD-30\nV2.0, And even on my BOSS ME-25. It proved full paisa vasool earphone. The mic\nand its button works fine.  \n  \nFrom my personal experience i would recommend to use Jet Audio as music\nplayer. It is the best audio player for all the platforms. PCs & Smartphones.  \n  \nCons:  \nCable is a bit short. the wire length may fall short from pant's pocket to\nears.  \ncomfort level to me was low. you will feel it's presence after inserting in\nyour ear.  \n  \nBottomLine: At this price range, this is the best one. I found it even better\nthan one of my friend's Sennheiser CX180. And it has a mic and a button for\nvarious functions.\n\n", "HELLO GUYS ...  \n\\----------------------------.  \nBefore Starting With The Review of the . I was provided the product by the\namazon seller am here i am after using it for 1 week ..  \nFor My review to start i must say that JBL Is a good renouned Well known\nforeign Brand Delivering Products and Other Stuffs  \n\\-----------------------------------------------------------------------  \nSO NOW COMING ON THE REVIEW  \n\\---------------------------------------------------------  \nLOOKS AND DESIGN _  \n==================  \nWith a cool outer finish it looks premium and its quite light weight can go\nfor long , it has pair of ear buds on the tips of the earphones they are\npretty decent and soft , dont heart the ears .  \nthe earphone has a inlet microphone with pause and play button added as an\nexternal feature.  \nGoing down at the bottom you will find a 3.5mm jack which is 3 strokes ...  \nit has a normal wire connect to the earphones....  \nOVER ALL LOOKS ARE DECENT  \n\\----------------------------------------------------------------------------------------------  \nSOUND  \n===============  \nComing to most important thing of an earphone which you see and buy ....sound\nquality i must say this jbl can perform like a big dude can deliver a good\nquality as well as clarity sound .... the sound is quality sound it wont hurt\nyour ears nice and comfortable  \nWhen i first received the product and opened it i wasnt expecting that kinda\nsound ,,,, but infact when i head the first sound from those pairs i was\namazed with the clarity and as well as thrilled with the BASS . Honestly i\nwasnt Expecting that amount of Bass but it turned out to be superb for me  \n\\---------------------------------------------------------------------------------------------------------------------------------  \nBUILD QUALITY  \n\\-------------------------------------------------------------------------------------------------------------------------------  \nThe build quality of this pair of earphones are of decent type . though it is\nmade up of plastic , i must say its made up of good quality of plastic  \nthe wireing is good and can go for long it wont get damaged with rough usage\n.overall the build quality is good for this Jbl product in this price segment  \n\\------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \nSUMMARY  \n\\------------------------------------------  \nRATING IN POINTS  \n\\---------------------------------------  \nBASS-- 9/10  \nTREBLE -- 8/10  \nMIDS AND LOWS --8.5/10  \nQUALITY AND CLARITY ---9.5/10  \nBUILD QUALITY --- 8/10  \n  \n=======================================================================================================  \nMY FINAL VERDICT  \n\\------------------------------------  \nIF YOU ARE ON TO A BUDGET OF AROUND 500-800 ODDS AND YOU WANT TO TRY NEW\nBRANDS .. THEN YOU SHOULD DEFINITELY GO FOR IT .. I HAVE USED IT EVERYTHING IN\nTHIS IS FINE AND AS YOU KNOW JBL IS A FAMOUS BRAND FOR GOOD PRODUCTS SO YOU\nCAN BUY THEM WITH EYES CLOSED (just saying ) THE EARPHONES ARE GOOD FOR DAY TO\nDAY USE AND UNDER A BUDGET  \n%## THEN THIS IS THE BEST BUY FOR YOU %##  \n\\----------------------------------------------------------------------------------------------------------------------------------------------  \n\\---------------------------------------------------------  \nIF YOU LIKED MY REVIEW GUYS PLEASE HIT THAT HELPFUL BUTTON THERE --- YOUR ONE\nHELPFUL BUTTON HELPS A LOT  \n  \n==================================================================================================  \nTHANK YOU  \n=========================\n\n", "Bought this in July 2016 (for 750₹) and after some heavy usage with Audiobooks\nin the past 2 months one side has stopped working..  \nThe connector got damaged by repeated stresses in a tight pocket (5.5 inch\nphone)..  \nAudio was good while it lasted\n\n", "The headphone is undoubtedly giving ultimate sound quality while keeping the\nbass and treble at the correct levels. Just listened in iTunes really awesome\neven with half volume, when gone beyond ¾ volume it would not be nice to hear.  \nNotice cancellation is done purely gud.  \nHope it doesn't disturb u when hearing in a bus or train journey.  \nI noticed that it's very light to handle and also gets tangled very rare even\nwhen we keep in bag, purse, pant pockets. It would be an additional info that\nyou should handle with some extra care to keep it alive atleast for 6 months.  \n  \nDon't bother about the less weight, and need a perfect quality sound from JBL\nin this price range, just buy it now, the Amazon packaging was not that better\nthough the headphone cover was well. Thanks JBL.\n\n", "This small package is pure bliss for your ears.  \nI have been using this for the past 4 months and the experience is just mind-\nblowing.  \nOnce you get addicted to these awesome pair of earbuds you'll find other\nearphones and headphones a bit \"feeka\".  \nInitially the earphones don't sound as good but after a few hours of\n\"breaking-in\" the bass and the punches are really on point!!  \nOne small con is that these tangle easily. And also the wire is thin so it\nseems that they may break easily though it may not be real case.  \nBut at this price point and even much much higher these are best ones I have\nheard in a long long time.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 February 2018", "on 9 October 2017", "on 19 December 2017", "on 22 September 2017", "on 3 March 2018", "on 19 August 2016", "on 1 September 2016", "on 27 August 2017", "on 18 December 2017", "on 7 March 2018"], "reviewer": ["Nirzar", "Abhishek Kumar", "Amazon Customer", "Raj Surya", "sabari vijay", "Srijit Chatterjee", "Ishant Gupta", "Pradeep Somu", "Kirubhakaran", "Prakhar"]}
]