[
{"rating": ["3.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Sound quality is as usual good. But why is the design is somewhat bulged ...", "Audio was good while it", "Above average, comfortable earphone that died way too early.", "Best budget Inearphone for bass lovers", "First copy of JBL,please dont buy folks", "Awesome product", "Do not buy by just looking at WARRANTY period", "Best budget earphones", "Value for money", "A Quality Product by JBL! Must Purchase!!"], "review": ["This is my second headset from JBL. Sound quality is as usual good. But why is\nthe design is somewhat bulged and mic very low need to hold in your hands\nwhile you speak.In my old headset there is little provision to adjust the\nlength of the wires in left and right side.Wires are also very thin some for\nrough use it may damage. I dont know why this is missing.Brought it for Rs 899\nwith 10% cash back offer. Felt I have spent extra 300 on trusting the brand\nblindly.\n\n", "Bought this in July 2016 (for 750₹) and after some heavy usage with Audiobooks\nin the past 2 months one side has stopped working..  \nThe connector got damaged by repeated stresses in a tight pocket (5.5 inch\nphone)..  \nAudio was good while it lasted\n\n", "The base is quite good, the treble is too sharp for my liking. Don't know\nabout the longevity of the product.  \n  \nHowever any pressure on the wire leads to excess noise in the ear. So, you\nneed to care about that.  \n  \nThe best quality about these earphones are they are extremely snug within the\near, I used to run wearing this earphones, it felt light and comfortable.  \n  \nNot awesome, but above average earphones. It died too early for a 700 bucks\npiece.  \n  \nEdit. Stopped working after 4 months of usage. Getting to JBL service centre\nis so much of a hassle I just got a new earphone from a different company.\n\n", "First impression is good of this jbl c100si in earphone. Just got delivered\ntoday and sound is amazing. Specially the bass is good. This Best budget\nearphone cost me as low as 700 rs only. Time to test it and i will again\nreview it on amazon within couple of months!!\n\n", "Mainly while listening it is creating harmonic distortions, chinese headphones\nr better .I ordered it and got a used piece but thanks to amazon got it\nreplaced. I used the new replaced piece for 2 days and realised its a first\ncopy of jbl, no warranty card, no additional buds and producing harmonics\nwhile listening music. I suggest not to go with GMT mart and this product is\nwaste of money.\n\n", "Good quality product with good bass. 4-star coz missing out noise cancellation\nfeature. Good shopping with Amazon they have maintained their level here.\n\n", "Few things you should know before buying it. The warranty they have given is a\nscam. Let me tell you how. In a country of 1.3 billion population, they(JBL)\nhave only 4 repairing centers and all in major cities. So if it stops working\nafter some time they will waste your time via mails for at least few weeks and\nin the end they will give you address for their centers saying go and repair\nand yes you will responsible for all type of expenses involved. Unless you are\nliving near a repairing center, you would rather buy a new one.  \n  \nFor me it worked well for 6 months and then one of it's side suddenly stopped\nworking and next day other one did the same. I contacted them but they are\nnever any help.\n\n", "Very Good base compared to senhiser CX 180 .  \nVocaliser may not be too good as compared to senhiser  \nI bought it for 650/-(you won't get this cheap at any special offer/festival)  \nWorth price , wait for some offer day price get reduce to around 700 . It also\nfell in water but still after drying it nothing happed it still working as new\nas when it arrived\n\n", "excellent sound quality. base as well as highs both are good. bought it for\n725/- so for this price point these are good ones.\n\n", "I'll get to the point straightly.  \n  \n~Box Contents: A pair of earphones, a warranty and, a safety note  \n~Build Quality: Seems to be slightly delicate  \n~Compatibility: Windows, Android, and iOS (Not sure about MacOS and Linux)  \n~Sound Quality: Adequate, might experience crackling sound if used in high\nvolume  \n~Mic: Yes (At the division of the wire)  \n~Bass: Medium  \n~Lenght: nearly 100 cm  \n  \nGo for these if you want a balanced sound experience\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 November 2017", "on 27 August 2017", "on 5 June 2017", "on 28 October 2017", "on 17 March 2018", "on 29 December 2017", "on 29 October 2017", "on 12 October 2017", "on 31 May 2017", "on 14 March 2018"], "reviewer": ["Manibharathi", "Pradeep Somu", "Saurav", "Shubham Jain", "Fahad", "rajesh", "Manish Sihag", "rishabh soni", "Anil Swarna", "Asif Kalluru"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["599 headset of MI is little better than this but JBL has an upper hand as ...", "Great audio pairs for your daily, casual and travel needs....simply go for it !!", "I have used the Sennheiser CX Street II earphones as well and it has much better sound quality", "Best earphone at price of 700 to 900", "Unmatched at this price.", "sound quality is not good, it cannot produce clear sound output at high ...", "Good earphone under 1k", "Nice product from JBL", "Good set of earphones", "Quality was not good"], "review": ["JBL C100SI Average product in proper price range.  \nAlthough I felt lesser output when compared with basic Mi Basic headsets. I\nknow! some of them may have suggestion to change the headphone settings and\nthen check the output and all.  \nI felt Rs.599 headset of MI is little better than this but JBL has an upper\nhand as its fit in the ear which is nice and will not ache your ears whereas\nMi headset will do for a while util you are use to it. Happy with the product.\nHope it is durable enough!\n\n", "Amazing sound quality with best price range. The bass and noise cancellation\nfeatures are quite remarkable with robust build quality.  \nWould definitely recommend the product to others who wish to get the best\nvalue for their money within 1000 bucks.  \n  \nAmazon again lived up well to my expectations in terms of delivery.\n\n", "Found it to be a bit overrated and overpriced. I have used the Sennheiser CX\nStreet II earphones as well and it has much better sound quality. Only CON is\nthat doesnt have a microphone. This earphone is good but not worth the\nexcessive price. Got it for INR799 but the same day it was selling for INR699\non the official website harmanaudio.in. So make sure you check the price on\nother websites before buying it from Amazon\n\n", "Best earphone ....its better then my Sony MDR xb50 ...really loved it u should\nsurely buy it best product ..bass 9/10 treble9/10 and sound quality 10/10 its\njbl by Harman bro go for it u will not regret it at all.......also got it at\n700 rs on lightning deal thanks amazon for best deal and shipping....... Have\nfun with these earphone guys\n\n", "Best at this price, treble and bass are balanced, I bought both shenheizer and\njbl, the price of former was 599,without microphone, but latter exceeds a step\nahead with microphone, also not going technically, in simple words if you want\nto enjoy light and sweet music, with balanced treble and bass, blindly go with\nthis jbl in ear headphone.\n\n", "Not impressive...sound quality is not good, it cannot produce clear sound\noutput at high frequencies!! Very dissatisfied. Bass is not good, noise\ncancelation though very well. Built quality very poor as far as the brand name\nis concerned. Not comparable with Sennheiser cx180 which is far better than\nthis mediocre earphone!\n\n", "Good earphone under 1k.little difference between Sennheiser 180 and jbl\nc100si.Sennheiser hv better sound quality than jbl.but jbl provide mic which\nhas advantage.but sound quality improve by music player app .i am using pi\nmusic app.which is enhance its quality. i hv earlier Sennheiser 180.but\nunfortunately i lost it.my recommendation between two is jbl.\n\n", "Just buy if you are a BASS music lover. Sound quality is good as well. I just\nbrought it @899 it is not worth for this price, @699 is fine.  \nI preferred Google play music to get actual bass & quality of the product (on\nMi A1).  \n  \n\\----Pros  \n1\\. Deep bass  \n2\\. Clear sound  \n3\\. Mic & button for manage calls & music (play/pause, next/prev).  \n4\\. Light weight & small.  \n  \n\\--Cons  \n1\\. After 1 hr of continuous use, your ear will got pain. Too hard ear buds.  \n2\\. Average quality of wire, not Tangle-free.\n\n", "Good set of earphones, although the finish is somehwat unsatisfactory as\ncertain sharp protrusions exist on the earpiece. Also, when the product was\ndelivered the seal was broken, and the warranty card missing. It's working so\nfar, so no complaints yet.\n\n", "Not a good quality  \nStop working after 3 months\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 February 2018", "on 4 December 2017", "on 15 November 2017", "on 26 September 2017", "on 8 February 2018", "on 20 December 2017", "on 24 January 2018", "on 26 February 2018", "on 23 September 2017", "on 27 June 2017"], "reviewer": ["Sandeep Morey", "Amazon Customer", "Ayon Das", "Kritik", "dhananjay kumar", "Roy", "Jitendra", "Vishnuprasad", "Vivek Menon", "Mohit Borisagar"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Great in ear headphones", "Jbl brand kept its name!! (Wonder if its original or not )", "NO CUSTOMER CARE NO & NO SERVICE CENTRE", "Worst post-sale service by Harman/JBL", "Poor Quality one side headset not hearing after 6 months", "Amazon selling Duplicate product", "JBL never disappoints... amazing sound quality... thanks amazon", "Beast for a simple price", "Easily the Best in its Class", "2nd best under 1000"], "review": ["This is a great in ear headphone. Works pretty well with my iPhone. The sound\nis amazing. The sound quality won't make you feel that it's a cheap headphone.\nI felt the sound is at par with my friend's klipsch headphones( that was worth\n3k) and even my friend was surprised with the quality. In addition, the\nheadphones come with 3 sizes of caps for ear plugs as well. That's a good\nthing since don't know why the caps on my ear plug come out often. Guys you\ncan go for it.\n\n", "Worth for the price @Rs.699  \n  \nI wonder where the product is made from !! Is it USA or CHINA ?? Check the pix\n!!  \n  \nreceived it today oly !! works well !! hope it works the same for long !!\n\n", "Got defect in product in just 3 months & even worst part is that there is no\nJBL Customer Care number working in India. JBL Website doesn't correct contact\nnumber & mail contact is even not working & got to know JBL Service Centre is\nclosed in Delhi NCR & no longer available to claim warranty. Really not sure\nwhy JBL is selling product in this area if doesn't have any customer service\ncenter or contact number.\n\n", "Earphones stopped working within 6 months. Even though it's within warranty,\nthe service provided by Harman is worst. You have to send the product to\nservice center in Chennai, Bangalore or Delhi, that too after contacting them\nmultiple times and then you have to wait for months to get the product back,\nif at all.\n\n", "Poor Quality one side headset not hearing after 6 months. I bought 4 headsets.\nBut the 4 headsets is not working after 6-9 months. warranty is there for one\nyear but how to claim is not clearly mentioned. Seller r Product defect.\nAmazon please review.\n\n", "Hi I bought this product on the belief of brand Value, Sound quality is\nOK..but the mic is having problem, its not working, the voice is not reachable\nto the person on other end. In addition the Mic button is also not working.\nIts only 2 weeks passed bought from Amazon. Both the company Amazon and JBL\nhas such brand value , however the product selling is very pathetic and\nunsatisfactory. I will post this review on social network as well. Either the\nAmazon is selling duplicate product on the name of JBL or JBL has decreased\nthe making quality product. Don't buy any electronic product from Amazon .\n\n", "Using this for last 3 months... Very nice sound quality... affordable price\n699... the cord is actually tangled free... the tangled free cord thing\nsurprisingly works... I had doubts but headphone sound turned out to be\ngreat... JBL never disappoints ... I accidentally drove my car over the\nheadphones ... after that incident, it is currently little beat up... left\nside has low sound but surprisingly it still works ... that proved the build\nquality is tough... because I used it roughly, I eventually have to buy a new\none soon... so I am buying the same again... hoping this product gets\ndiscount. waiting waiting\n\n", "Rcvd the earphone just nw, I got them at a festive price of 699. These\nearphones are really awesome. I was previously using the Sennheiser CX213.\nThis product isn't any less compared to the sennheiser, I must say! Specially\nthe bass is better than cx213. Also, it has got a Mike which is missing in the\ncx213. Overall satisfied with this. Now lets wait and see it is robust or not,\nas my cx213 lasted for entirely 3 years since my purchase and it broke down\nonly after a mice tore down its wires! Will post again after using it for a\nmonth or so..\n\n", "This is arguably the best in-earphones with mic you can get for less than 1K.\nThat honour previously belonged to the Cowon EM1. This goes a step higher.\nThey fit perfectly in my ear and are very light n comfortable for long hours.\nThe sound is balanced with fairly distinct highs, lows n mids reproduction.\nThe bass is abundant yet tight. Wires are a little thin n seem delicate but\nthere has been no noticeable wear n tear even after months of usage. I picked\nthem for Rs 599. Simply brilliant for that price. Just go for it without a\nsecond thought if you spot it for Rs 900 or less.\n\n", "Simple review based on Amazon's two top selling eraphones boat 225 and\nJBL100si  \n1)Boat bass head 235  \nPros  \nExcellent pricing  \nGood build quality  \nGood bass  \nDurable  \nCons  \nOften earbud comes out ear  \nSound purists don't like  \nMids are not that greate  \nExtra bass(con or pro According to you)  \nHeavy weight  \n  \n2)JBL 100si  \nPros  \nBalanced sound  \nLight weight  \nComfortable  \nGood sound quality  \nSound puriat prefer this over boat  \n  \nCons  \nDecent build. Boat has better build and cheaper price  \nCosts more  \n  \nSummary  \nIf you are on a tight budget and want good sound you can go with boat.\nEventhough it has extra bass. It's good earphone.  \nIf you want more pure sound then go with JBL. It is not the most pure sound.\nBut it is good. And little bass is boost. Which is good. I am giving second\nplace to JBL under 1000rs .\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 June 2017", "on 6 October 2017", "on 28 August 2017", "on 12 November 2017", "on 5 September 2017", "on 15 March 2018", "on 5 January 2018", "on 12 October 2017", "on 25 June 2017", "on 9 November 2017"], "reviewer": ["Madzz", "Amazon Customer", "PRACHETA", "Amazon Customer", "Mahendran", "Shoaib", "Aditya Gade", "Anmol Sinha", "Ameya", "Sherin paul"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["JBL I Love....", "Good quality & value for money", "JBL Makes Lifelong Earphones", "amazon rocks !! the best online shopping !!", "Poor quality. China product", "Headset is very good!! bass is blowing out my head and ...", "Worst worst forest product", "Good quality for the price.", "Cool stylish comfortable durable everything", "Build quality is nice and sound to is very good only one thing ..."], "review": ["Yeh JBL 100csi earphones Maine Feb 2017 ko kharida guys this earphones is\nreally amazing for bass lovers Maine 22 Tarik Ko yane yeh 2018 senhiser ka cx\n180 kharida ekdam bakwas sirf clearity acchi hai Lekin bass nahi hai agar\naapko bass pasand hai to JBL hi kharide but paining in ear bas baki quality\nroach number\n\n", "Quick delivery. Fits well into my ears. Cord is long enough, good quality\naudio and microphone. Value for money. Glad I bought this.\n\n", "Best Upgrade For JBL T150A & 100A  \nLows 4/5  \nMids 5/5  \nHighs 5/5  \nClarity 5/5  \nComfort 5/5  \nQuality 5/5  \nBest Product Go For JBL  \nIf You Want To Change Your Earphones Every Month  \nDo Not Buy This  \nBecause It Lasts More Than 1Year😂😂😂\n\n", "Product is simply awesome\n\n", "Poor quality.China product. Not so usable. Left side of ear phone and mic are\nnot so working. So go for some other brand.don't try to buy this.I was\ncompletely disappointed with is product.\n\n", "Headset is very good!!bass is blowing out my head and also if you love bass\nthen you can go for this headset!!treble also good and also the built quality\nis fair!!and also it is better than Sennheiser CX! finally you can buy this\nheadset if you are bass lover\n\n", "U JBL cheaters.after one month of buying this product, 2 sides of earphones\nare not working. Why the hell would u sell cheap products at high rates.  \nAtleast give me a link to replace for warranty\n\n", "I have been using this earphone for about two weeks now and here are my\ncomments:  \n  \nPROS:  \n1\\. Good quality for this price. (Rs. 699)  \n2\\. Mic works fine while moving.  \n3\\. Overall quality is good.  \n  \nCONS:  \n1\\. The quality of insulation is not that good and may tear with rough use.  \n2\\. Earbuds slip out of your ears easily.  \n  \nCONCLUSION:  \nIf you intend to buy an earphone below 1,000 rupee, go for this one.\n\n", "Value for money.. initially took time to adjust with the buds because this are\nmy first earphones but now it has been a week and they are quite comfortable\nand the bass is amazing.. overall in the price range this is the best deal. Go\nfor it if you are spending under 1k and need a mic.\n\n", "Build quality is nice and sound to is very good only one thing that I would\nlike to change is the microphone position which should be near left corner but\nis placed in middle so while talking you have to hold it continously.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 January 2018", "on 17 November 2017", "on 22 January 2018", "on 15 September 2016", "on 28 December 2017", "on 25 September 2017", "on 5 July 2017", "on 21 October 2017", "on 9 January 2018", "on 25 November 2017"], "reviewer": ["Pramod mate", "Sunny G", "Susheel Kumar", "Ronny !!", "RAJESH M", "Amazon Customer", "kurella", "Amazon Customer", "Iamhtr", "Ketan Parmar"]},
{"rating": ["3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["An average product. After my review there will be some positive reviews,don't get confuse.", "Superb", "... for more than 6 months and still works perfectly fine.. doesn't get entangled which usually is the ...", "Decent ear phone for this price.", "just wow", "but honestly speaking this one is much more better than sennheiser cx180", "Perfect light-weight earphones", "If you are looking for a very good one at this price... Just buy!!!", "Nice product", "Good earphones with a below average build quality."], "review": ["Not a very good product,as per some of the reviews i thought this product\nmight be the classy one.  \nAn average product in this budget.  \nYou will get two extra ear buds. The tiny one is best for the bass effect and\nthe largest one will gave good treble output.\n\n", "It's good in-ear earphones. If we compare it with creative Ep 630 then\ncreative is much better than this jbl. It also depends on your mobile phone. I\ntried in so many brands like mi, sony, samsung . Result was different for each\nbrand best i got in Samsung note series or premium series.  \nIf you try it for some lower range mobile then you can't feel the jbl quality.  \nOverall it's good choice\n\n", "I've been using this earphones for more than 6 months and still works\nperfectly fine.. doesn't get entangled which usually is the case.. built\nquality looks delicate but it definitely isn't. Amazing sound quality and\nperformance with proper noise cancellation..!!\n\n", "Decent ear phone for this price. However the bass is a bit on the lower side.\nI also use a Panasonic ear phone which cost me way less than this product but\nhas excellent bass & better hearing quality that this item. Otherwise, OK for\nthis price.\n\n", "it is more than good for its price range.......but not ad good as cx130.....if\nu are good with no mic and button then just go with cx130 else u can buy\nthis...it has great highs and good bass...better comfortability as the\nergonomics is great...all the edges are rounded\n\n", "Many people says that this earphone is similar to sennheiser cx 180..... but\nhonestly speaking this one is much more better than sennheiser cx180. I have\nused both of them ... but i think the base of the c100si (c150si) is little\nbit louder than cx180. The mid of the cx180 is little bit better than this\nproduct. And the vocal is almost equal. But the basic difference is this\nearphone comes with a mic. But there is no mic on sennheiser cx 180. Therefore\nI must suggest u this earphone in this range.👌\n\n", "Best product in this price range. Got it on a Lightening Deal in just 699, and\nthe earphones are just perfect. Deep bass and balanced treble.\n\n", "You'll have a lot of doubts before buying it. You will also go though many\nreviews before buying it.  \n  \nI got it for 799rs and that is value for money. That's the best review you can\nsay.  \nYou'll get the sound quality that you expect from JBL. Maybe the best one with\nmic you can get for this price. Better than all those headphones you get along\nwith your phones.  \n  \nExpect the quality that you get with the headphones of an apple iPod (for\nthose who have tried them.\n\n", "The sound quality is good,noise isolation is perfect (it's little bit good\nthan my previous earphone which was boat 220).  \nAlthough the earphone lacks tangle-free cable and premium look which my boat\n220 had.  \nBuild quality is good.I bought it recently ,so don't much abt life etc.The\nbuds fits perfectly in ear for better experience as my boat 220 fell every\n10-15 min from ear.  \n  \nOverall it's good just lacks look and tangle-free cable\n\n", "Good earphones with a below average build quality (sound quality is good\nthough). I don,t expect the plastic cords to last for more than an year on an\naverage use.. This was the very reason that I had to order a new earphone.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 November 2017", "on 13 February 2018", "on 28 October 2017", "on 31 December 2017", "on 26 September 2017", "on 22 October 2017", "on 25 September 2017", "on 8 March 2018", "on 20 March 2018", "on 20 October 2017"], "reviewer": ["Saurabh", "Chirag", "Amazon Customer", "Amazon Customer", "AKSHAY ARUN RAJPUT", "Zabid kaizar saikh", "Mayank Agnihotri", "Rajesh Sham", "Amazon Customer", "AmzonCust"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["More than expected", "One of the best product in this range", "Pure Music to your ears", "I’m in love with this product", "The best value for money.", "This product is not registered on jbl. You can ...", "Pathetic product.... poor sound quality.. Please take it back and refund my money.", "Not worth Spending this much money even!", "... of JBL earphones is that wire is not a good quality After 1 yr the wire will torn and ...", "Better the Apple earpods"], "review": ["Bought this after 2 years of using 2 sennheiser cx 180 earphones they both\nstopped working one side after a year of use. This earphones have a slightly\nbetter sound quality than cx180 and these have microphone also so it's a plus\npoint. Bass is also somewhat better than cx180. So whoever got bored with\ncx180 these are the better option to go for.\n\n", "Hi, first of all I will tell you one thing..JBL by Harman is the world top\nleading brand..and Harman is producing the product with always world best\nclass.awesone sound quality., Bass effect, terrible quality all are\nperfect.wire is tingle free.i got this item in offer as 699 INR , under this\nrange I got best product.even mic is awesome.blindly can go and use this..\n\n", "This small package is pure bliss for your ears.  \nI have been using this for the past 4 months and the experience is just mind-\nblowing.  \nOnce you get addicted to these awesome pair of earbuds you'll find other\nearphones and headphones a bit \"feeka\".  \nInitially the earphones don't sound as good but after a few hours of\n\"breaking-in\" the bass and the punches are really on point!!  \nOne small con is that these tangle easily. And also the wire is thin so it\nseems that they may break easily though it may not be real case.  \nBut at this price point and even much much higher these are best ones I have\nheard in a long long time.\n\n", "Jbl C100SI is one of the best headphones.  \nI’ve used sennheiser cx180 street 2 for almost 4 years & the sound quality was\ngreat on that but this earphone is also very good.  \nSound quality is very good but I didn’t got any extra ear tips I don’t know\nwhy.  \nBass is good, not so punching or very powerful but it’s okay whenever it’s\nneeded, most importantly it has a microphone which is quite good. While\ncalling someone, the other party never complained.  \nBest for buy  \nWorth for money  \nIf you want decent quality earphones then go for it.  \nIn the price point of 700 it’s a very good earphone.\n\n", "Purchased in a lightnjng deal for 650 rupees and it was a grab. Before I\nfinally manage to lose them, the earphones worked brilliantly for the first 6\nmonths and were just incredible at below 800 rupees category. The sound was\nbalanced and bass rich. However the bass never seemed to be too much to muffle\nother frequencies. The earphones delivered crisp sound and the in line\nmicrophone was clear and responsive.  \n  \nThe build vould have been a notch better, however these, according to me were\nthe best value for money product at this price. Any complaints are absolute\nnit-pickings.\n\n", "This product is not registered on jbl . You can check by serial no by call jbl\n0008000401973.  \nSo i doubt that this product original or fake.  \nIt is only brand name's rupees otherwise in market u can get this typ of\nearphones around 300to400.\n\n", "I bought this headphones JBL C100SI In-Ear Headphones with Mic (Black) on 6th\nFebruary. The product seems to be fake and the sound quality is horrible. In\nfact there is no quality in the sound so; it would be a shame if I even write\nsound quality together while describing it. Requested replacement as it\ndoesn't allow me to request for refund in the order but the second one also is\nsame. So; it's not a defect but the product is made that way. No credibility\nof a JBL branded product.  \n  \nPlease collect the product and refund my money. No more buying electronics\nfrom Amazon. Let my buying be limited to books as it has been.\n\n", "Quality seems to be Average or rather poor considering the price tag. If you\nactually like listening good sound/music, better think again for this\nearphone. I found my default Samsung earphones, normally which come with\nphones, better than this. Not worth of spending this much amount just because\nof unnecessary hype.\n\n", "Only one word \"Amazing\"  \nThis is my third JBL earphones  \nT 100a  \nT 200a  \nAnd this  \n  \nThey are so amazinggg  \nBut the con of JBL earphones is that wire is not a good quality  \nAfter 1 yr the wire will torn and we have to do jugaad😉  \nElse everything is alright\n\n", "I am an iPhone user.  \nThis headphone is way better than iPhone earbuds.  \nI can hear so many extra sound in music which I was missing.  \nThe guitar strums sounds so clear the bass is so deep..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 October 2017", "on 27 September 2017", "on 7 March 2018", "on 14 February 2018", "on 22 March 2018", "on 29 September 2017", "on 19 February 2018", "on 5 November 2017", "on 10 October 2017", "on 21 November 2017"], "reviewer": ["sagar k", "rafique ahmad", "Prakhar", "Sayan Bhowmick", "Raj Singh", "Being Indian", "Amazon Customer", "Amazon Customer", "Saisrinivas", "Neo"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Amazing headphone from JBL", "Good for the price but not for bass heads.", "Loveeeeeee", "Go for it.", "Hassle free warranty claim", "The base is low i mean not very much low but if little more base is added i will satisfy 100 % base lovers will slightly disappointed", "Not so good", "Decent pair of headphones.", "Best audio....Medium build quality", "Awesome sound quality, value for money!!"], "review": ["After a thorough search on leading online portals I bought JBL c100SI\nheasphobe. Having used it for the past 10 days, I really enjoyed it. The sound\nquality is amazing. Noice cancellation is outstanding. Enjoying music /\nattending a call even at the noisest place is smooth. Thanks JBL & Amazon for\nthe product. I recommend the product.\n\n", "Good earphone as this price range. Thou as promised in the details the bass\nisnt that great. If you are a bass lover then this might not be for you (go\nfor sennheiser cx100). But if u want are looking for sound quality and clear\naudio like me go for this earphone. i would give an overall score of 8/10 for\nthis earphone. a better choice for a cheap budget is audio technica clr100.\n\n", "Ordered three times....I just love them....Once Misplaced...Second time my pup\ndestroyed them...But can't get over it so got them third time too......Just\ngreat sound......\n\n", "At first, I wasn't very satisfied with the product. The bass was quite\nsatisfactory and not up to the level I was expecting. It took me a few weeks\nto appreciate the output the earphones offered. Either it could be due to the\nincreased burn-in or I just got used to it.  \nOverall:  \nBass: 8.5/10  \nTreble: 7.5/10  \nMids: 8/10  \nNoise cancellation: 7/10  \nMic quality: 9/10  \nBuild quality: 7/10  \nComfort: 9/10 (The lightest and best fitting pair of earphones I've worn so\nfar)\n\n", "I bought this earphone in December 2016. But it stopped working in June 2017\n(within 6 months). Since it was under 1-year warranty, I went to the service\ncenter at Grant Road, Mumbai. Within 1 week they replaced my earphone and gave\nme brand new JBL C150SI in-ear earphones. Thus I am very happy with the after\nsells service.  \nAs far as the earphones are concerned, I love both C100SI and C150SI. They\nboth produce balanced sound as required by me.\n\n", "awsome ear phones the only thing missing is the base.The base is low i mean\nnot very much low but if little more base is added i will satisfy 100 % base\nlovers will slightly disappointed.vocals and treble are very good\n\n", "I bought this product seeing so many positive reviews. But within 2 weeks\naudio output became very less from left side earpiece. Taken it to the service\nCentre but got older version headphone as replacement!\n\n", "#Build Quality- 7/10 ( doesn't have flat cables, and I noticed that while\nusing it used to get tangled often)  \n  \n#Bass- 8/10 (many people are interested in the bass of this. Here, the bass is\nnot overpowering. Although it is there when you need the punch from the\naudio.)  \n  \n#vocals and mids- 7/10 (Bit of a mixed bag here. I noticed that the vocals\nwere crisper while using the earphones with my Laptop. But when using it with\nmy smartphone, the vocals were a little low in crispiness.)\n\n", "Sound quality is good..... Actually better than expected ...Bass is clear...No\ncomplaints regarding audio quality but cable wires seems of low quality....Bit\non a harder side and can't take high flexes .....The buds seem to be a bit\nrough but you'll get used (you will get 2 sets extra buds)...\n\n", "Awesome sound quality, pretty good built in and quite comfortable as well as\nfit easily in ears. The 3.5mm jack is gold plated so that's gonna last long,\nthe quality of the wire is pretty good its feel strong but not that hard to\nmake you uncomfortable so that's great. You get 3 ear buds S M & L to fit\naccording to your comfort. I would say totally value for money.😊\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 October 2017", "on 3 October 2017", "on 8 December 2017", "on 11 March 2018", "on 19 July 2017", "on 30 September 2017", "on 27 June 2017", "on 26 February 2018", "on 31 January 2018", "on 25 November 2017"], "reviewer": ["arun vijayan", "Chris John", "Porus", "Niranjan", "Omkar", "Venkata sudheer", "R Chakraborty", "Abhijit Panda", "Karthi", "Rahul jaiswal"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Good sound, mic. Wire is thin", "I'm happy with the purchase.", "single button multi function, very nice product", "Love u jbl", "Worked very well for few  months", "... using it for quite sometime now and its working awesome. Value for money and the listeners on the ...", "Worth every penny", "Best headphones", "Don't buy these earphones.", "Quality issues"], "review": ["Sound is very good. High grade. Mic even it is way low, callers could hear\nclearly. But wire looks very flimsy and damage any time. Else it is a 5 stars\nproduct.\n\n", "Audio output is awesome and clear. They fit perfectly in my ears. Mic records\ndecent quality audio. Overall a best earphone under 800₹. I also got 2\ndifferent sizes of earbuds.\n\n", "very nice product, good bass and it has single button but it can change the\nsong to back and forth with that single button  \nsingle press -> stop/start music or call  \ndouble press -> plays next song  \ntriple press -> plays previous song  \nwith this setting and the sound quality I am satisfied.\n\n", "Actually am never writing any products reviews but dis jbl earphones forced me\nto write review bcz these earphones r best ones sound quality is awesome mids\nhighs lows n bass treble all r balanced whatever d song u play u ll get best\noutput just love des earphones  \nBasss ispowerful its so much fun\n\n", "I ve bought this in January, The product worked very well for 7 months, then\nvolume in one of the left side reduced while right side still worked fine, now\nit completely stopped working on left side while very low volume is being\nheard from the right. I tried calling the call center using number mentioned\nbut it says invalid number.\n\n", "Been using it for quite sometime now and its working awesome. Value for money\nand the listeners on the otherside dont have any complaint on the noise and\ndisturbances. Another good quality product from JBL.\n\n", "Super awesome .... bought @699/- but every penny is worth it .  \nThe bass is way beyond its price . Being a first time JBL user , I am actually\nhighly highly impressed .  \nA MUST BUY , affordable and super awesome\n\n", "Writing review after almost 1 year of usage. Still these headphones are\nrocking. No distortion in sound, can here clearly all crispy beats with full\nbass. Button with Mic is very handy and works seamlessly with Poweramp music\nplayer allowing me control playlists on presses. Best headphones in market.\n\n", "The bass of the earphones is not good.If you are a bass lover you will\ndefinitely hate it.  \nThe vocals are average and treble is not good.  \nThe build quality is in between average and good.The quality of the mic is\ngood.  \nThe overall audio quality is poor and not clear.  \nIf you are at a budget below 1000 go for sennheiser CX180.Those are very good\nearphone for the price range below Rs.1000  \nRating:Build quality: 3.5  \nBass:2.5  \nVocals:2  \nSound quality and clarity:2  \noverall:2\n\n", "Everything went well until somehow one earphone started producing low voice.I\nthink there's something wrong with JBL products.The plastic used for JBL j88\nwas also of low quality.Anyways,bad experience with JBL.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 October 2017", "on 10 October 2017", "on 7 October 2017", "on 21 November 2017", "on 14 November 2017", "on 24 August 2017", "on 25 September 2017", "on 13 November 2017", "on 24 February 2018", "on 3 July 2017"], "reviewer": ["PCM", "Amazon Customer", "Customer", "Mitesh", "sasidhar", "Ambareesha", "Mohit", "Vicky", "msk", "lakshay bagga"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["JBL at its best", "The king", "Best earphones with mic for this price!", "Below average Quality audio", "Very sturdy and good sound quality", "Good but...", "Product was good sound quality is good and clear but it stopped ...", "Good earphones", "Just for the Brand JBL", "Clear Sound"], "review": ["Best earphones in its price range .Good sound but mic lags in grabbing voice\nbut Otherwise its worth for money.\n\n", "The perfect bass and clarity comes in packed with it, it really persnofies\nsound and makes music more pleasing to listen.  \nThe bass buds ensure it that every aspect of the music gets into your ear with\nspeculation.\n\n", "For this price segement, this earphone is the best. Apart from this earphone,\nI own Sennheiser 275s, Sennheiser CX180 and JBL T100A. This earphone is way\nbetter than JBL T100A and competes well with Sennheiser CX 180. If your are\nthinking of one to buy between CX 180 an JBL C100SI, I would recommend the JBL\nones as you get a mic as well.\n\n", "Trebles are too high even with equalizer controls, bass is not good just\nmissing the depth of feeling. I didn't expectJBL earphones to be so pathetic\nsound. No in ear noise proper cancellation..\n\n", "I have been using these headphones for 6 months now and for everything from\nphone calls, video calls on laptop, play music while working out or sleeping\netc. They have performed very well and have lasted a lot of rough usage (which\nmight sound impossible given it's delicate looking build quality).  \nIf you are looking for basic earphones with decent sound quality, reliable\nbrand and on a budget, this would be good option.\n\n", "This headphones have got great bass but , the overall voice is not up to the\nstandard. It gets overpowered by its bass which is the only drawback. Nice\nbody , in the ear system , mi is not that good. If you couldn't afford more\nthan this , go with this .. else try for something better.\n\n", "After using it for 1 year im saying this.. Product was good sound quality is\ngood and clear but it stopped working after 6 mnts.. And it is a big task to\nclaim the warranty .. Although its a big company they not even respond u\nproperly.. I tried to claim my warranty but they not even attend the calls or\nrespond to my mails.. So.. If u wanna buy it irrespective of the warranty it's\ngood to buy..\n\n", "I have previously used the JBL T100A and when I switched to c100si I feel that\nthe bass is a bit low in this one but the sound clarity is good.You can\ndefinitely buy this one if you're more inclined to a balanced or neutral sound\ntone.If you're a bass head then I would recommend you to buy Sennheiser CX180\nwhich has good bass.\n\n", "This product is quite decent with good sound quality. Not really recommend if\nyou are looking for outstanding experience because there are many other brands\noffering much better quality sound quality for similar price range.\n\n", "Decent sound quality with hard type bass and clear treble.  \nOne drawback is the earpods are tough and may be uncomfortable for some people\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 May 2017", "on 29 September 2017", "on 28 January 2018", "on 9 October 2017", "on 18 March 2018", "on 16 October 2017", "on 10 November 2017", "on 22 October 2017", "on 27 July 2017", "on 30 October 2017"], "reviewer": ["Ragul Kumar", "Yathartha Saraswat", "Anuraag Singh", "Guddu", "Customer", "Raghav", "Saikumar", "Nikhil S Joseph", "Neel", "Ayan"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["First Impression is last Impression..super job JBL. loved ur product.. ;-)", "Average", "if you want rock music the jbl lacks little bit behind for extra bass but quite it is good product go for", "Matching with my Bose and apple headphone", "Not very happy!", "Nice product", "The Good Earphone By JBL", "Amazing sound quality", "Worth the price", "A best purchase🤘"], "review": ["Recommendable no doubt..  \nToday I got this product..I'm completely satisfied.  \nI have HTC desire 816 and with this phone this JBL earphone is rocking, great\nbalanced sound productivity.  \nYou will feel decent bass which is more than enough, no vibration at all in\nears, trouble does match with bass, you will feel stereo effect as per song.  \nonce it fixed in your ear then forget about the surround noise and moreover,\nif you are using for long time, you won't feel irritation.  \nFirst experience with JBL with great one earphone in reasonable price. loved\nit!! super job JBL.\n\n", "They pain my ears after regular use (binge watching 2 tv shows on netflix).\nSound is nice. Decent if you want good sound but I found it too uncomfortable\nfor long usage. Also remember you can't use them while eating or moving, the\nbuds pop out of your ears.\n\n", "Awesome one.. Mic quality is too good... Bass quality as well.. Looking\nforward for the best performance...  \nthe sound is quite smooth for soft music, if you want rock music the jbl lacks\nlittle bit behind for extra bass but quite it is good product go for it\n\n", "Excellent clarity and bass output. On the very same day received a Bose and\napple headphone from my sister as gifts, but this product matched with their\noutput, but may be bass wise sony headphones do tend to beat them all but Sony\nheadphones can't be heard for a long time due to its immense bass output.  \nMoreover received the product within 2 days.\n\n", "I am not sure if the product failed to deliver as I got it on a discount sale.  \nThe speaker is quite good.. i am extremely happy when I listen to music, but i\nbought this piece not only for music but also to help me while i make calls.  \nThe mic and speaker is quite bad and at times I cant hardly heat whats\nhappening at the other end. Nor can my voice be heard. And this isnt happening\nalways.  \nI noticed this only after the exchange time had elapsed. I am not even sure if\nan exchange was allowed or not.  \nFor electronic products like these, a minimum window of 1 month should be\ngiven so that the user gets time to identify a flaw, if any!\n\n", "Writing after two month use,  \nInitially seemed little bad because I was used to using Sony mdr xb50ex\nseries, but after few hours of playing,it got better.bass is not as good as\nSony headphones but still it's almost there, treble and everything else is\nbetter than Sony and value for money, go for it blindly .\n\n", "Perfectly balanced sound and crystal clarity.  \nSound 9/10  \nBass 7/10  \nTreble 9/10  \nBuild quality 8/10  \nNoise cancellation is pretty good.\n\n", "I have bought two of these now and sound quality is amazing especially the\nbass. Another advantage is that unlike other earphones there are too bulky,\nyou can put these on while wearing a helmet because of its compact size.\n\n", "Nice sound. If turn on 80% volume on my phone then I can not hear outside\nnoise at all. But downside is that my music which is being played can be heard\noutside if a person is sitting next to me.\n\n", "One of the best earphones I have used thus far. Didn't even knew my favourite\nsongs contained the bass and the beats within them until I heard it using\nthis. Good purchase, JBL rocks.🤘  \nAmazon is awesome as always.❤\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 November 2017", "on 10 January 2018", "on 23 January 2018", "on 22 January 2018", "on 2 November 2017", "on 19 January 2018", "on 12 February 2017", "on 13 January 2018", "on 5 June 2017", "on 26 November 2017"], "reviewer": ["prak madarson", "Vivek Braganza", "Swapnil Gaikwad", "DIPABRATA SUR", "Amazon Customer", "Junaid", "ViPiN", "Darshit Shah", "Kirtimaan", "Dharmesh Vithalani"]}
]