[
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Totally I am in love with it", "Honest review for lenovo k8 note", "Two Stars", "Killer note 👌", "Just go for it....", "Not very satisfied with it", "Value for money !", "It is a good phone. Works fine", "Lenovo K8 Note 2 day review", "Value for Money"], "review": ["Totally I am in love with it. Call quality, network access, internet, battery,\ncharging time etc. absolutely love it. Camera front is impressive but the rear\ncamera is a little disappointing in case you are using a depth enabled mode\nshot or low light shot. I am still using it and will soon update my\nexperience.\n\n", "Hi  \nCheck my honest review  \n  \nIn day to day life it's best phone to use. But battery life is issue with\nheavy users, some lag will be seen also by me like keyboard is also hang up.\nAnd phone is giving awesome performance. Camera is pretty good in outdoor\nlighting conditions. Lenovo is doing pretty well with this kind of budget\nphone.  \n  \nThis much features with price of 14000 is absolutely acceptable.  \n  \nI am quite satisfied with phone.\n\n", "Overall phone is good, but Camera quality is worst.  \n8 megapixel Camera is just better than Lenovo ki Note\n\n", "This is the honest review I m giving after using this phone for 2-3 weeks,\nfirst of all , let's talk about camera the depth enabled mode(dual camera)\ndoesn't meets my expectations, and results of back camera is ok ok let's say\nonly good ! Nothing special but very satisfied with the front camera . Even in\nlow light ,it captures good pictures , now the battery life is good (as it's\n4000mah) but sometimes it drains very rapidly even without heavy usage and\nsometimes it drains very slowly even in heavy usage! LoL, let me mention one\nthing that it's rapid charger not fast charger, it takes almost 2hrs to charge\nfrom 0-100 only when ur not connected to any internet network or not using ,,\notherwise it takes more than 4hrs , and this isn't mentioned anywhere that I\nam going to tell u that when u play video with quality 360p or less than that\nor 420p or less than that it looks worst ! Ssly worst !! Other specifications\nare at it's top ! 4gb ram and 64gb rom with 10 core processor it doesn't lag\nat all no matter what u do ! Overall the device is good , near to awesome if\nkeep it's price range in mind ! I suggest u to buy this device if the above\nmentioned cons doesn't matters to you !\n\n", "The best all round performance you can find in this price range.  \nNow for Pros n Cons....  \nEverybody knows the Pros,but let me share the cons which I feel very annoying  \nFirstly the screen- random application gets opened as you speak over the phn,I\nmean the screen responds to even ear touch,inspite the proximity sensor\nworking just fine.  \nSecondly the dual camera...USE IT ONLY DURING DAYLIGHT....The camera performs\nmisserably under low-light conditions,More over there is no stabilization on\noffer,getting good photos out of this...Hmmm u just have to depend on nature.  \nWell I guess both these cons can be solved by an update.  \nSo just deducted a star.\n\n", "Not very satisfied with it, it just capture some good images, apart that\nnothing is good in this phone..sometimes lags too much, msgs just gone\ndisppear for while, sometimes doesnt show the contact Name, sometimes doesnt\nopen the required app..before this phone. i was using Lenovo P2, i thought,\nlenovo has upgraded this phn with some extraordinary apps, but this phone\ndissapointed me..\n\n", "HD display, along with free cover, deca core, 4gb ram, dual camera, selfie\nflash, separate sd card slot along with dual SIM and of course 5.5 inches...\nComplete package in this cost.\n\n", "It is a good phone.Works fine.Display is sharp.Speakers are loud and\nclear.Camera quality is okay,but not everyone is a social media addict.  \nIt is good value for Money.However the phone itself doesnt come with any\nfreebies.There were no headphones.  \nWhat i would like to point out is that the headphone it supports are 3.5mm\njack but not every headphone on the street works on it.I had to search quite a\nbit to get an ideal headphone.It takes a bit of an effort to shove the\nheadphone in,You may feel you are damaging the phone...  \nI would say it is great value for money and a bit more reliable than xiomi.\n\n", "I have been using this phone for 2 days now, so I haven't explored all the\nfeatures of this phone completely as yet.  \n  \nGood Things:  \n1\\. Charging is fast considering this to be a 4000 mAH battery.  \n2\\. Sound quality is good, especially on good quality earphones.  \n  \nNot so good:  \n1\\. This is not a 4G + 4G dual standby phone as mentioned in the description.\nThe SIM you select for your data becomes 4G. The other can best support 3G. So\nif you have Jio SIM and it is not selected for data, then that SIM just\nswitches off.  \n2\\. Stock android will take some time to get used to. Missed apps for Music\nPlayer, Photo Gallery that come pre-bundled with other phones.  \n3\\. Photos are not great but of good quality.  \n  \nOverall satisfied with the purchase.\n\n", "So far so good ... Have been a Lenovo user for a while . The phone does not\ndisappoint... It is for sure value for money. Just one issue , I am unable to\nrecord calls on the go . Please do not buy it for the camera . Otherwise it\nwill take care of your basic daily requirements for a phone\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 January 2018", "on 13 September 2017", "on 31 August 2017", "on 1 November 2017", "on 25 October 2017", "on 18 October 2017", "on 24 September 2017", "on 23 October 2017", "on 29 November 2017", "on 13 September 2017"], "reviewer": ["Chinmaya M", "Nandan", "Avi Shekhar Singh", "Honey Meghani", "S ROY CHOWDHURY", "Prem Kumar", "Amazon Customer", "Arvind A.", "Rahul Prabhudesai", "Abhinav Srivastava"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best of 2017", "Three Stars", "An amazing phone", "Wonderful smart phone", "Lenovo K8Note-Battery discharging quick when net in ON condition & phone not used (kept ideal), no default call recording option", "One of the best budget phone to buy in around 14k Have been ...", "Check for a better option", "Value for money", "best smart phone in 2017", "Really a Killer one..."], "review": ["Best Phone at this Price  \nRear Camera Clarity is Phenomenon  \nDepth Enabled Camera results are also Satisfactory  \nNot as good as Apple  \nVideo Quality is Incredible  \nSome Popular apps like Instagram and few others crashes in between in this new\nOS 7.1.1  \nOverall Happy user since last 20 Days.  \n#Cheers\n\n", "Good performance but heats up quickly.....Charging too slow...Shows 6 hrs\nuntil full even with turbo charger\n\n", "An amazing phone....  \nPros-  \n1\\. Excellent cameras (both front selfie camera & rear primary camera) in this\nprice range. Even low light photography using flash in both the cameras was\nfar better than other phones in the 15k range. The camera is fast and very\nresponsive.  \n2\\. A superfast phone for people who multitask a lot. Didn't even hang with\nheavy online gaming.  \n3\\. Superb battery backup. Even with the data continuously on and continuous\ngaming the battery gives a backup of more than 6 hrs. Lasts more than 12 hrs\nwith normal usage. And with the turbo charging feature the phone charges real\nfast.  \n4\\. The phone has a premium look.  \n5\\. Comes with preloaded Microsoft office package.  \n  \nCons-  \n1\\. Is the company fooling us by saying that it's a Gorilla glass????? My\nphone fell lightly from less than a feet and the display got shattered.\n\n", "Got my lenovo K8 note next day of my ordering.  \n  \nThe screen has superb look and feel.  \n  \nThe amazing part is battery and turbo charging.  \n  \nAll the apps from my old android phone were transferred easily to new phone.  \n  \nCamera is great, Sound is good and the system is quick and responsive.  \n  \nHappy to have selected this phone.  \n  \nOnly difficulty I have faced is to cast screen to my Tv\n\n", "Lenovo K8 Note - Battery discharging quick when net is in ON condition and\nphone not used (kept ideal), There is no default call recording option in this\nmodel alone  \nAm purchased this Lenovo K8 Note mobile through online (Amazon) on 09.10.2017.\nFollowing problems are noticed,  \n1.Battery discharging quick when net is in ON condition but phone not used\n(kept ideal),  \n2.There is no default call recording option in this model alone whereas other\nmodels have this option.  \nActually am planned to purchase this phone brand (Lenovo K8) for think of this\noption & 4000MAH battery only. I couldn't see this mobile demo before purchase\nbecause this is online purchase model.  \nBut now am facing difficulty. Expecting a software upgrade with default call\nrecording option (as like other models) and suggestions for Battery saving.\n\n", "One of the best budget phone to buy in around 14k  \nHave been using this phone from one month & haven't received any problems in\nparticular.  \nSound is good & camera quality is also nice.  \nBattery back is superb & needs charging only once in whole day.  \nSelfie camera is good & along with moon light flash it works great even in low\nlight.  \nApps run quickly & dnt get hang in between.  \nOverall a great phone to buy.\n\n", "I am posting this review after 3 months of usage.  \nInitially the phone looked good, but as i started using i found many problems.  \n1\\. If you go to contacts and click on any contact the screen goes blank and\nyou cant open the contact.  \n2\\. Mirroring function is not there, so if you want to do mirroring on your TV\nor projector its not possible  \n3\\. Bluetooth doesnt work, the phone is not searchable by any other bluetooth\ndevice or it cant search any active bluetooth device  \n4\\. Camara is ok nothing great to have duar camara at the back, and front\ncamara has average result.  \n5\\. Charging takes long time in some sockets, dont know why.  \n6\\. Front sensorts are not that great.  \n  \nMy overall verdict is if you can get a better option at this price then go for\nit.\n\n", "Yeah Lenovo k8 note is good phone under budget, tough competition to mi ,  \nPerformance of the phone was very good,  \nBattery backup was decent,  \nCamera is also decent,  \nSound system was very clear (Dolby) 😍 .  \nYou will love music wen u hear with your headphones ,\n\n", "best smartphone in 2017 because it has all the rich features like 18/5 mp\ncamera dual cameras and dual led flash and best selfie camera and 4000 Mah\nbattery and good built quality and the fastest processor which is faster then\nocta core and best fingerprint sensor and so many good things so finally I\nlove it and its working perfectly\n\n", "First of all no other phone in this price have cameras (both primary and\nsecondary)better than this phone . With a mediatek's deca core chipset it's\nquite faster in multiple operations but ya it drains battery faster in compare\nto snapdragon . But it can be managed though company's software update.  \nSecondly​ it's really tougher​ in term of built quality .It have a nanocoting\nprotection for water resistivity , it can even work after bent and it also\nhave a Gorilla glass protection.  \nAll these features are available in just 13,000/- which are missing in xiomi\nnote4, honor etc lying in same price range.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 September 2017", "on 25 August 2017", "on 29 October 2017", "on 1 October 2017", "on 2 November 2017", "on 21 September 2017", "on 30 November 2017", "on 19 September 2017", "on 15 October 2017", "on 20 February 2018"], "reviewer": ["@PratikPower", "pratheek", "SAURABH KUMAR", "Giriraj Bhatia", "BALASUBRAMANIAM", "Aniket I.", "Herbal Bay Healthcare", "Amazon Customer", "Anil Shekhawat", "Utkarsh B."]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Heating like hell. Hanging.. battery draining fast", "Faulty phone", "Frustrating experience with Lenovo K8 Note. Not recommended at all.", "Very bad experience with this phone", "As other are saying it gets heated so yes but only when it is in charge but gets cool down quickly", "Not happy", "Awesome excluding some minor problems.", "sound quality was worst, Camera is not good as of 13 mp", "Value for money!!", "but Hybrid SIM slot makes me disappoint. I just share my view and level of ..."], "review": ["Its heating like hell. don't buy it. Lenovo should need improvement. Hanging\nissues. Camera is like I'm using MP camera. Battery draining fast. I loved\nprevious Lenovo's K4 note phone before but now they changed their product's\nquality. Also their Service centre's staff are not professional. They don't\nhave even basic Knowledge about possible issues in phones and they compare\nservice with Samsung and Iphone. Lol..\n\n", "Worst response from lenovo, received a faulty phone and no response from\nlenovo, hope I will get a call at least after this feedback\n\n", "Frustrated with the brand Lenovo. Heating issue is the main problem here.\nAlso, this handset keeps asking for some version update but if you click on\nupdate, without updating itself it gets restarted. Seems a defective item I\nhave received. Have not explored much yet as I was relatively upset and\nscrewed up due to these issues.\n\n", "Very bad experience with this phone.  \nIt had very lowest battery backup.  \nThis phone had heating problem also.  \nHeating on playing games, playing music, playing videos & on charging also.  \nIt's worst phone I have ever puchase in my life.  \nI want my money back.  \nWill I get it or not\n\n", "I am using this mobile from last one month. It never hangs doesn't matter how\nyou r using it??  \nAs other are saying it gets heated so yes but only when it is in charge but\ngets cool down quickly.  \nCamera is ok  \nSpeaker is ok  \nProcessor is damn good.  \nBattery stands till one full day if u r regurarly using it n gets full charged\nfrom zero within 1 & half hour with quick charger.  \nThis is not the best phone but in this price range this is a very good deal.\n\n", "Does not have cast screen which is a disappointment to buy a Chromecast to be\nable to connect to my smart TV. This feature is available in Lenovos older\nmodels but not in this. The speaker conked off and the phone is not even a\nmonth old. Going to the service center tomorrow. Hope they can help and don't\ngive a run around. Not a bad phone, but not happy either due to the above\nissues.\n\n", "Except phone gets warm very fast battery performance is not as described one\nsimple word for this phone is awesome. Headset is not provided with the box.\nAlso in this version gallery is not available so arranging your photos and\nvideos are little difficult.\n\n", "Don't buy this phone,  \nMobile was hanging , sound quality was worst ,Camera is not good as of 13 mp,\nspecially front one is worst.  \nHeating problem is occurred during playing game and video's.  \nIt is heated up drastically on calling and sound quality goes down drastically  \n  \nI have return it to Amazon but still money have not been refunded.  \nnow a days Amazon brand name has become cheater company.\n\n", "Lenovo keeps coming up with surprises and great upgrades. Had used k3 note.  \nThough some features of K3 are done away with but no complaints. The other\nfeatures make up for it!!  \nGood start to New Year.  \nDelivered two days earlier than promised... Keep up the good work Darshita\nElectronics.  \nLooking forward to many more associations in future.\n\n", "I bought this mobile a month ago. Actually I waited for NOKIA 6, but Hybrid\nSIM slot makes me disappoint. I just share my view and level of satisfaction\nhere.  \n  \nPerformance and multitasking is awesome.(with the split screen).  \nHD display is good with 1080p movie(:O).  \nBack Camera is awesome. and front camera is good.  \nHigh End gamings are working charm.  \n  \nDolby sound is not that much effective.  \nI've a doubt, Is that really a dash charger??? (It taking 1 & 1/2 hrs to get\ncomplete 100% from 10%) :(  \nLittle bit tough with single hand usage (especially while selfie).  \n  \nOver all .... Performance wise, Budget wise and storage capacity wise its\ngood. My rating is 3.8/5\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 March 2018", "on 21 September 2017", "on 2 September 2017", "on 6 September 2017", "on 10 October 2017", "on 11 October 2017", "on 17 September 2017", "on 17 March 2018", "on 10 January 2018", "on 21 September 2017"], "reviewer": ["Hussain Memon", "Sughosh P.", "Bibhas Nandy", "Vishal Patel.", "GOTHAM", "Rahila Mansurie", "Showvik", "Ravi Bhushan Kumar", "DEBASHIS", "sathish kumar"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Value for money with some cons and more pros", "Five Stars", "Overall a nice deal", "NEVER BUY THIS PRODUCT", "nice", "The Real Beast in Budget", "defective phone delivered.", "impressed by lenovo", "Very nice mobile", "I have always been using high end smart phone. Before this I was using Google Pixel ..."], "review": ["This is very unlike of mediatek processor device. It has 10 cores which runs\njust fine.  \nOverall good phone, with good display.  \nCamera images with dual camera depth looks somewhat like software depth rather\nthan hardware depth from dual cameras. But overall pic quality is nice.  \nHeavier in weight a bit and It feels so. Mi note 4 is lighter than this.\nPerhaps some work needed there.  \nLess bloatwares, nice performance.  \nAspect ratio is a turn off. These days 18:9 is popular, but this phone has\nunwanted space near earpiece. A lot actually. And software navigation buttons\ncould have reduced weight, improved aspects ratio.  \nPrice is perfect.  \nI could see too much gap or a black gap line between screen boundaries and\nbezels. This black gap makes you feel odd but it's not much of a problem.  \nSound is good. Speed is okay, looks value for money.\n\n", "Excelent delivery & team is good followup with customer, msg update time to\ntime. happy with this product. 😃. Issue of Cast Screen is not functionable,\nRinging Volume is common for notification msg. also. Inbuilt Call Recorder\nfunction is not available. Plastic Back Cover Quality is so much of worst.\n\n", "Package arrived well before the time promised.  \nPackage was in nice condition.delivery boy asked to open the parcle and check\nwhether everything is right or not.  \nNow about the product. ...  \nEverything is just as promised but the battery life is not up to the mark as a\n4000 mah battery should be.  \nGets a little bit worm while charging. .overall performance is good.  \nBoth the Camera are also good.feels solid in hand...a bit slipry...  \nMy vote is 9.5 out of 10  \n.5 deducted for battery.\n\n", "Worst product I have received ever from AMAZON. It is a completely defective.\nAccessing data/internet is a nightmare. Don't buy this product. It is pathetic\nthat AMAZON did not allow me to return this product giving some absurd\nexcuses. NEVER BUY THIS PRODUCT\n\n", "I was using Xperia M Dual C2004, I can only compare K8 note with the one I was\nusing,  \nProduct is very nice and everyone will like it,  \nIt is heating up than sony Xperia,  \nSound quality is very good with the help of dolby atmos. Speaker is not loud,\nbut much louder.  \nWhen watching movies I felt Xperia screen clarity is better.  \nCamera is better in k8,\n\n", "Using this phone for almost 3 months, now i believe i can give u a fair\nreview.  \nI got this one for 12300 due to some cashback with HDFC Credit Card.  \nAnd with that money segment i will say it is a very good buy.  \n1) I never felt the heating problem, even when it is charging i am using it\nfor heavy games with WIFI, it was nominal heat.  \n2) There is a nominal lag in this phone, it is not that much but I was not\nexpecting a lit bit of delay as it is having 4GB Memory. Memory Usage in this\nphone is quite poor and Lenovo should work on this one to make it a better\nphone.  \n3) Camera: you won't be disappointed  \n4) Volte: Jio Sims work fine, Airtel 3g on sim 2 along with JIO on SIM1. so no\ncomplain in that part  \n5) Battery: Continous Consumption(Beast usage) will make the phone to dry by\n10 hours, but if using wisely more than a day backup.  \n6) Charging: Turbo Charging at its best, complete charging (0-100%) in 1:30\nhours  \n7) Speaker: Dolby Sound can't complain at all  \n8) Waterproof: Survived its first Holi without any issue, DO I NEED TO SAY\nMORE  \n  \nThe Memory Management is poor in this phone which gives you lag occurrence\nwhen you are using multiple things. But the other qualities of the phone are\nmore than enough to make it a must buy.\n\n", "phone delivered was defective its internal speakers were not working. i have\nreturned it. expecting a new phone.this kind of defective phone from amazon\nnot at all expected. it waste of time and money.\n\n", "this review is being written after usage of 1 day.  \ni have spent 12-14 hrs with the handset.  \ni earlier used samsung on nxt, xiaomi mi4i  \n  \nyou all know the specifications.  \nlets start with  \nprons:  \nbeautiful screen  \nlag free switching b/w apps  \nsolid body  \nfront camera worth 14k mobile range  \ndual rear camera woth 14k mobile range  \nbattery backup and charging speed as expected (i.e. good)  \ntransparent crystal clear back cover in box  \nstock android nougat  \nscreen viewing very good under sun  \n  \ncons:  \nno handsfree in box  \n  \ni am a heavy user, but i don't play games in my phone.  \nthe phone is working fine.  \nafter lot of comparison and watching and reading reviews of, redmi note 4,\nhonor 6x, moto g5s, asus zenfone 3, samsung on nxt,  \ni took my risks  \nbought this one.  \n  \nand i am a satisfied customer.\n\n", "Good mobile.....Simple cost And it have good features..Good battery life .I\nget more than one day battery back up and 18hr battery life when I use this\nphone continuesly.i brought this before 7months ago.still it have no\ncomplaints and no hanger problem.the only thing is the depth mode camera is\nnot have much use\n\n", "I have always been using high end smart phone. Before this I was using Google\nPixel 128 GB.  \nSo  \nHere is my review of this wonderful smart phone  \n  \n1\\. Not only expensive phones are good, this affordable smart phone , I\npersonally find even better than Google pixel .  \n2\\. What you expect as far as performance , feature , battery life , ease of\nuse , this phone will not disappoint you.  \n  \nLast but not the least , I am a pro photographer, hence do not use mobile\nphone camera , but the camera both rear and front did impress me too.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 October 2017", "on 1 February 2018", "on 18 October 2017", "on 28 January 2018", "on 27 September 2017", "on 8 March 2018", "on 8 December 2017", "on 23 October 2017", "on 9 October 2017", "on 29 October 2017"], "reviewer": ["Sandeep P", "Nilesh", "bhavesh", "Amazon Customer", "ശ്രീ. Sreekanth", "udit", "chankari Srinivas", "Pankaj Kushwaha", "Ganesh", "Shamim Akhtar"]},
{"rating": ["4.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best ever phone around 15k", "Comparison between k8 Note and k8 Plus", "Not working with my Jio sim", "It was awesome. Everything was fine", "Really good phone.", "poor software support", "KillerNote Should have Dual 4G Standby.", "0 to 30% within 20 mins.", "Lenovo K8 note feedback", "Best product."], "review": ["Very good product at this price range . It's not like other device which has\nmore power only in one aspect ex: processor , battery , camera , music ,\ndisplay , built quality , storage etc. This phone is an all rounder in all\naspects & this phone belongs to an above average to flagship level category .\nI would like to say it's an flagship phone in premium mid range category .\nForget about mediatek processor & compare with Redmi note 3 , you will\ndefinitely find that this phones performance ​is far better than Redmi Note 3\ndue to it's 20nm processor unlike the 28nm processor of Redmi note 3 . In\ncomparison with Redmi note 4 , K8 Note's processor is better in performance\nbut note 4's processor is good in battery life & in moderate use I get minimum\n9-10 hours of battery life in K8 Note .Also K8 Note comes with Turbo charger .\nAfter a big exploration I found K8 Note is best at this time & in this price\nrange . I will definitely recommend this phone to anyone who wants an all\nrounder phone . I gave 4 star coz of Amazon's delivery & packing otherwise\nthis phone deserves 5 star out of 5 .\n\n", "I will not recommend this phone . Its battery back up is poor and video\nquality doesn't match with the same end phones.  \n  \nI want to suggest buyers who are planning to buy this phone don't buy this ,,\ninstead of K8 Note go for K8 plus ..K8 plus and k8 note has small difference\nin specs but very big differences in performance. K8 plus has good battery\nlife and last for almost 1 day after heavy use (in my case)., k8 note has same\n4k mah battery but drains very quickly.Gaming experience quite nice on k8 plus\nand k8 note both..No lags. K8 NOTE has some heating issue while charging but\nk8 plus has very minor or no heating problems.I have both the phones and among\nboth of them k8 plus seems good to me.Thank u.\n\n", "Last 4 day back i bought K8 note. but I am very upset it's not working with my\nJio sim. Mobile having heating problem also. I have put return request but\nthey are saying they will not refund the amount only replacement can be\nplaced. :(\n\n", "When i got this phone, i was fully surprised. It was awesome. Everything was\nfine, touch was smooth, display viewing angle was quite brilliant, video\nplayback was up to the mark. Having inbuilt Dolby Atmos is like butter on\nbread. but after two or three hours , i noticed that , battery started\ndraining continously, turbo charger taking too long to charge approx 4-5 hrs\nto charge from 40% to 100% . after that, it took 100% to 90% in just 10 min,\nwith just simple music playback, i was surprised, even battery was draining in\nidle condition, i thought there might be an issue with my battery, then i\ncontact AMAZON SERVICE they remotely access my device and after review they\nsaid nothing is wrong with your device. everything is fine. then i thought i\nhad to fix it on my own, after some tweak, it went back to the track. Now my\nbattery is working fine , max 7-8 hrs on heavy usage and 1.5 day on normal\nusage. #satisfied.\n\n", "Really good phone.. Front Camera is equal to 20mp camera of vivo v5s phone.\nFront flash is also good. Back camera is better than vivo v5s. Fast\nprocessor.. Full Battery charges within 1 hr. Bt battery drainage little bit\nfast.. Bt thats manageble compared to its other facilities. No previously\nstored apps.. Good Looking. Quite heavy set bt thats managable if u use back\ncover.. Overally good phone in betn 20k smartphones group. I got 4gb ROM and\n64gb RAM at ₹11,999. Thnku amazon\n\n", "heavy , average battery life , frequent app crash , poor software support ,\nhotspot issue atleast with my laptop , no calls on volte while using battery\nsaver mode , no screen mirroring needs a lot of improvment .go with mi note 4\n\n", "Good Mobile.  \nDual 4G Standby is not available.  \nHandset Appearance is awesome  \nBattery Backup is Fantastic  \nNeed Gear up the RAM Speed.  \nScreen Shot Shortcut Button is not available at Notification Bar.  \nOver all Mobile is Good.\n\n", "excellent Mobile. best part is long battary and faster charger. 0 to 30%\nwithin 20 mins.\n\n", "Firstly product not delivered on time dissatisfied 2 weeks.  \nSecondly Android 7.1.1 naugat doesn't have call recording option  \nThirdly when selling product cost was 13999/- now why drastically dropped.\n10999/-  \nFourthly when talking over the phone feels like nerve pulling to much\nradiation need immediate fix on this matter as it's safety and security of\ncustomer.  \nFifthly if any issues in hardware issues please let us know the service\ncenters location. And please ensure hardware availability should be there at\nany time when customers booked.  \nFinally as discribed about product all features are ok no issues found as\nmentioned earlier if call recording option would have added the this product\nwould have been met the expectations.  \nCamera quality is good not bad snap attached.\n\n", "Best product.....  \nValue for money  \nSmooth touch  \nClear n bright picture  \nSomething disappointing while using dual camera  \nBut over all product is supebbbb  \nIf you are confused in redmi note 4 and lenovo k8 note, I will prefer you to\ngo for lenovo...  \n😎😎😎\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 September 2017", "on 5 February 2018", "on 13 November 2017", "on 28 October 2017", "on 20 October 2017", "on 4 October 2017", "on 25 September 2017", "on 7 December 2017", "on 6 October 2017", "on 8 October 2017"], "reviewer": ["Himanshu Bhusan Barik", "Satyendra kumar", "Amazon Customer", "Rajan sharma", "Lopamudra samantaray", "Amazon Customer", "vijaykumar g", "remo", "Manoharbabu", "Shubhankar Singh"]},
{"rating": ["2.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["2 Stars", "... cons already mobile started hanging  camera quality is not good , I will not recommend this phone to others,", "This phone is awesome with camera and functioning that is ram is good ...", "Neither bad nor good", "Close ur eyes and buy it!!!!!! Superb product! 😘", "Very mediocre phone in this price range", "Low price and high value for money.", "great deal 4r this price tag", "4 stars.. One star less for short battery life.", "Amazing Product! With some areas to improve upon!!"], "review": ["Loving stock Android. After 3 months of use, after paying 14k for this phone,\nI would say don't buy it. Camera has worst quality in this price range. When\nyou view photos taken from this camera on computer then you will understand.\nAlso no inbuilt gallery app. Google photos compresses photos reducing quality.\nBattery backup reduced after latest update.  \nNo 4k video recording.\n\n", "Memory speed is okay  \nSound clarity needs to be improved  \nNo inbuilt gallery  \nOnly wall papers can be changed  \nNo additional themes  \nDual camera I do no know how it works  \nExpecting a software update  \nEven there engineers would have noticed some cons  \nUntil they update the software I will not recommended this phone to other's\n\n", "This phone is awesome with camera and functioning that is ram is good and it\nalso runs good at multitasking and in processing functioning there is no prob\nbut the sound quality is not good that much as seen in Lenovo k4 note and\nDolby Atmos is not good in k8 but in k4 it's awesome and battery performance\nis good camera is awesome sound quality is not good with Dolby Atmos and it\nhas less guestures but in k4 note it has more guestures\n\n", "Neither bad nor good. Camera is good. But battery doesn't last long on a day.\nThat gorilla glass gets scratches if you don't use extra protection. Hangs\nsometimes. Little heavy phone.\n\n", "Awesome phone. Better than any. I cpared with one plus 5 and new apple phone.\nPics,voice clarity, speed and battery.. all r awesome!!  \nI'm a wineows fan. And now I'm liking Android because of Lenovo k8 note. My\nparents have Lenovo p2 and Lenovo zuk phone. I check my phone speed and each\nfeature with one plus 5 ..asphalt started 5-6 millisecond before one plus 5.\nJust loved it. I bought t approx for 8 k using card and during offer. Wow\nLenovo! I love ur product!! Bravooo!! 😍😘  \nMy hubby uses mi a1i guess that resent model on same day.. he was Lind of\nupset his phone is not as good as mine..though his phone was costlier. Deca\ncore. Mediarek was a small worry when I bought..everyone said no.cos it's\ninferior. I took my chance and found it's really really really awesome! I'm\nloving my Dolby Atmos..woah wata difference. I've used Dolby n my Sony experia\nphones..bt it wasn't dat good ..though dat was yrs back. I compare it with one\nplus five. Bt I felt mine is jussssttttt aweeeesomeeeee 😘\n\n", "Much better phones for this price range are available in the market. Phone\nswitches off after getting charged, takes forever to boot up, Magic button\nnever worked for music but at least it's working for capturing screenshots\nnow.  \nThough from parent company of Motorola, this doesn't get OS upgrades (it does\nget updates for the same OS).  \nI'm not sure if this is an Android feature or of this phone- there's no way to\nforget a WiFi network AND have the phone remember not to connect to it in the\nfuture. The phone reads an unsecured network at work and connects to it every\nday even though I keep selecting \"Forget network\".  \nWon't ever buy a Lenovo again.\n\n", "Under this price range no other brand can beat this smartphone.  \nGuys just enjoy it's decacore perormance  \nTrust me I am a extreme user and this phone last a day with me easily\n\n", "I am writing this review after using this lenovo k8 note 4r 2 weeks  \nPremium build quality I have that venom black varient its really solid to hand  \nDedicated SD Card is there its cool to expand memory  \nExclusive MUSICAL KEY is Awesome  \nCamera is really great both front & back with flash I recommend who give prior\nto camera aspect. Initially some problem on depth mode but lenovo assured to\nfix in next update. I really surprised that I got 2 updates in 2 weaks  \nOne for improve camera & one for improve battery , security patch update hate\noff. Now iam wi8ing 4r Oreo. Battery almost last more tha a day. Display is\nalso good & bright. One of the highlight is that the processor it build with\nhelieo x 23 performance is very fast & accurate finger print also.. So overall\nsuch a great phone frnds defenitly consider this if ur budget is 13k\n\n", "One of the best buys I have done. The only thing is the battery life. Wish the\nbattery lasted a bit longer. Battery lasts 24 hours with extensive data usage.\nI am not much of a gamer.. but the speed is super awesome. Features are\nbrilliant, stock android is great.\n\n", "Superb phone for the given price. 11700  \n(13000 - 10% cashback.!)  \nThough it's DUAL Camera doesn't even match iPhone 5s, it's mediatek processor\nis probably one of the fastest.  \nNo super AMOLED but still display is great.  \nAlso Corning glass makes it smooth.  \nNice volumes of music!  \n2 sim + 1 dedicated memory card slot  \nReliance JIO also works on it even if it shows no network..that's the biggest\nadvantage!  \nHowever I was not offered insurance for the phone like we get if we were to\nbuy offline.  \nAmazon must create this system!!  \nAll major games functioning!  \nMany apps open at a time without slowing down  \nFingerprint sensor stops working once in a week..it starts working after\nresetting the fingerprint..!  \nHeating may be an issue if used much.  \nDeca core 4gb + Android 8 update is added benefit!  \nBattery runs 1 entire heavily used working day (office hours) (>10 hrs.)  \nLastly, to show attitude, the phone has a Nice look for show off!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 October 2017", "on 30 August 2017", "on 15 September 2017", "on 25 November 2017", "on 26 October 2017", "on 6 February 2018", "on 24 August 2017", "on 30 September 2017", "on 19 October 2017", "on 29 September 2017"], "reviewer": ["sadipash", "Ramesha K C", "Vishaal", "vegi", "Niki", "Amazon Customer", "chamkaur singh", "mohamed shameem", "Navarathna Sanjeev", "Karan Kapadia"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Camera is good.. but when you check dept mode it's ...", "Can go for it !!!", "Recommend to buy", "same sim working good in other device", "No earphone received", "Good phone", "One Star", "All about true and myth", "the volume of speakers isnt good. No call recording is possible even with external ...", "Best phone under 15000."], "review": ["Camera is good..but when you check dept mode it's become poor while detecting\nthe object , there is another problem..... heating while you play heavy games\nlike MC5 or Asphalt 8,, battery life is good ,but at 5% it drain faster even i\nhave turn on the inbuilt battery saver.....so these are the\nproblem.........overall it's awesome..... gorilla glass 3...Speaker is\nkiller.... recorder too,,can handle any type of game , music key help to open\napplication easily......\n\n", "This phone is worth for the money. It works as expected. But Depth mode in\ncamera needs to be enhanced. Good battery life. No lag in performance. No\noverheating. It's like an all-rounder phone!\n\n", "Got this phone on 5th sept.Great battery life of 24 hrs with normal\nuse.Requires 2-2:30 hours to completely charge if battery is on 1%.Slightly\nheats up while charging but NO heating problem while gaming or playing\nvideos.Back camera is not as good for long distance shots.Front camera is\ndecent.Works smooth and fast.Only sometimes it malfunctions but it rarely ever\nhappens..Bit heavy and u have to be careful while handling. Display is nice\nand bright.I m still confused with the sound quality..else i enjoy my phone :)\n\n", "There is something wrong with this k8 note as the phone is unable to receive\nthe signals properly, most of the time it's showing phone is switched of or\nout of coverage area, same sim working good in other device. Every time we\nhave to restart or remove the sim to get phone active. This is pathetic\nindeed.\n\n", "Received phone but no headphone inside the pack although in limited warranty\nbooklet there is a warranty of 3 months for earphone\n\n", "Good phone but I did not get that \"wow\" factor with respect to camera. Samsung\ncamera quality was indeed better than this one. Other than that charge stays\nfor more than a day and there is a lot of memory which is definitely a plus.\n\n", "there is huge network issue so i suggest, don't buy this phone\n\n", "Its a great mobile with great processor. Faster than redmi note 4 and\nsnapdragon 625. But negligible heating compare to snapdragon but speed is\nsuper fast than all. Camera is great on both sides front and rear but some\nissues with blur effects. But dont warry its fine with back camera it is take\npictures up to 8 mb size so you dont loose any information while you capture\nphotos with hdr mode on.  \n  \nIt has quick changer you think what if i have not quick charger but when you\ntravel or in some emergency you can chare 0 to 30 percent in just 10 minutes\nand 0 to 100 in just 1.5hr its great.  \n  \nThis is the best processor of mediatek with 2.3 GHz frequency its not just on\npaper but its really working. belive me i used thise product and i brought\nthise phone at price 10000 only were Amazon sell was on.  \n  \nI recommend you to buy this phone at price of 11000 to 12000 for 4gb of ram.\n\n", "Though it says Atmos Dolby, the volume of speakers isnt good. No call\nrecording is possible even with external apps. Lenovo is very bad with the\nupdates. While other manufacturers are rolling out the updates as soon as\npossible, Lenovo will take 7-8 months. Go for Mi A1 instead\n\n", "After two days use  \nSound quality superior in this range.  \nPicture quality very good.  \nSo best phone under 15000.  \nBetter then red mi note 4.  \nScreen is superb.  \nVery fast processor.  \nBack cover given by lenovo is additional advantage.  \nBut sad part is that it is LTE not volte.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 December 2017", "on 31 January 2018", "on 16 September 2017", "on 19 September 2017", "on 30 August 2017", "on 27 September 2017", "on 29 August 2017", "on 15 February 2018", "on 9 January 2018", "on 2 September 2017"], "reviewer": ["Sarthak Rawat", "Amazon Customer", "chitra", "Chetan chauhan", "SUJOY KUMAR BHATTACHARYYA", "ramya ram", "Ankit saurav", "NAKUM NILESHBHAI", "J", "pankaj thakur"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Value for money, absolutely worth buying", "Worth buy..", "Otherwise​ it's the best in all ways", "Got slow in just 4 month. Battery not that great", "This product is not much good as it's features seems to be", "Price Worthy", "Very Good Phone But Could Have Been A Little Bit Better.", "Nice phone. Replacement was perfect.", "Disappointing", "Screen size is perfect. Battery life is descent"], "review": ["Best \"value for money\" phone out there. Also, quite good looking. It feels a\nbit heavy though, but maybe it's due to the huge 4000mAh battery and Aluminium\nbody which are absolutely worth it. Power management is great and that adds to\nthe already great battery life. Just after setting up the phone it asked for\nabout 4 system updates, which gave it the slow motion video capture mode @720p\n(it wasn't available before). The split screen mode for multitasking works\nexcellent. Camera quality and features are also above expectations for this\nprice range. The only problem is that, the sound quality is below par as it\nshould be with \"Dolby Atmos\".  \nOverall, this phone is really worth buying, it has no comparison in this price\nrange and can even compete with the ones priced higher too.\n\n", "Awesome mobile ..  \nCamera quality is gud(both front and back,only depth mode to be improved)  \nGud ram & speed , no lag at all  \nQuick charging  \nCharge last for one day..  \nVenom black is cool ..  \nFingerprint works very fast..  \nNo heat at all..  \nUsing from 19th Aug\n\n", "The device which I got was having a small black dot on the screen...Thought,\nit was dust at first ....When I wiped it .....It was not dust or something.  \nGot a defective screen...  \nBut it's too small to see ,if I'm using it in white screen then it's visible .  \nOtherwise​ it's the best in all ways\n\n", "Its been 4 months and Though the product is getting a bit slower to use even\nthough i have not filled it up with space and apps. Calling is a big problem.I\nwould recommend using MI products. I am not really happy with the value for\nmoney. Battery is not up to the mark. Charger is good. Display is good. Camera\nis good. But the phone is slow.\n\n", "This product is not much good as it's features seems to be..... Battery is\ndraining very fast as it would not last more for more than 8-10 hours.network\nbandwidth is not good,music is not playing via Bluetooth,heating issue.This\nphone supports turbo Charging but it's take more 3.5 hors to charge full\nbattery.overall I would suggest not to buy this product because many products\nare available in this price range.\n\n", "Excellent phone.Turbo charger works awfully.Elegant look....Camera is\ngood...depth mode needs to be improved by giving software upgrades...Overall\nit's a very decent phone in this price segment....Lenovo must take care that\n..updates are given regularly..as lenovo is very notorious in this aspect.\n\n", "I got this for my mom and here's what I think..  \nPros  \nNice built quality  \nIncludes a case in the box itself(hard transparent case)  \nDisplay quality is also good  \nCamera is also good in good lighting conditions  \nDolby Atmos also works properly and gives you a little bit of depth in the\nloudspeaker.  \nBattery Backup is good..  \n  \nCons  \nProcessor is a mediocre not good, they would give this phone at least a\nsnapdragon 625 for performance because gaming is not that good.  \nBattery Backup is good but as the phone 4000mah battery we would have also\nseen some better results.  \nCharging time is just little bit faster than normal charger.  \nGets a little warm while continue using it for like gaming or multitasking.  \nIf you find it useful than please like it.\n\n", "Good phone in its price range. Stock Android does the job nicely. The camera\nis good and battery life is excellent. The turbo charger is effective. Was\nfirst delivered a phone with faulty camera. I initiated the replacement. The\nengineer visited home to check the mobile. Got a replacement phone within a\nweek. Liked the promptness shown by Amazon.\n\n", "I am a movie lover. Wanted to watch them on my big TV screen by casting them\nfrom my new K8 note. I have an android TV box - not chrome cast  \nThere is a option in phone to cast under display,but disappointingly the phone\ncould not find the TV.  \nTo me this a major draw back. It may not be a serious issue for those who do\nnot use mirroring.  \nWorst thing was when I wanted a solution from Lenovo team through live chat,\nthe person who was chatting, one Mr Saleem says K8 can cast only through\nchrome cast.further when I was typing my next question, he abruptly\ndisconnected.  \nThere are also lot many posts by several users complaining about the casting\nissue on K8 note.\n\n", "I was preparing a lot for this buy. I am not a heavy user. But see a lot of\nvideos and listens to music too. Screen size is perfect. Battery life is\ndescent. Clarity of photographs is excellent.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 January 2018", "on 28 August 2017", "on 22 September 2017", "on 17 February 2018", "on 17 September 2017", "on 10 October 2017", "on 1 March 2018", "on 25 September 2017", "on 18 September 2017", "on 3 October 2017"], "reviewer": ["Amazon Customer", "vigneswaran.s", "vivek patil", "Mukund", "niraj kumar", "Abhirup Roy", "Dharmik", "Partha", "vasuki", "VP Ananth"]},
{"rating": ["3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["All rounder except overheat.competes with iphones.", "Don't buy this phone", "Excellent phone", "and on amazon replacement policy is very not good.", "A decent mobile not for a selfie lovers.", "Good product", "Better than average performance", "Not worth", "Not so good .", "Worst mobile. Dont by this"], "review": ["FULL REVIEW IN SHORT Good phone and smooth experience but some cons:-  \n1.depth enabled camera is not that good,normal camera is crystal clear.  \n2.update doesn't seem to make any difference.  \n3.overheat when on 4G  \n4.screenguards available does not fit the screen as it is a bit curved.  \n  \nPros:-  \n1.front camera rocks during the day  \n2.scrath resistant screen.really!!  \n3.includes Microsoft word,excel,powerpoint etc..  \n4.big screen for smooth use.  \n5.vr stunns  \nAN INDEPTH PHOTO ATTACHED ALONGWITH NORMAL ONES.\n\n", "I have been using this phone about 8 months  \nThere are lot of issue.  \nBattery drains very quickly.  \nHeating issue  \nCamera quality is very bad.  \nI faced network issue with Lenovo. One of a sudden both network was lost and I\nhave to give my phone to repair.  \nWorst part is Lenovo customer care.  \nI am totally disappointed with Lenovo. I have been a customer of Lenovo from\npast 3 years but now I m not gonna take any more product\n\n", "Excellent phone in the world. I just loved it. It is so perfect and amazing.\nGreat touch, great texture, great camera, user friendly. Looks like iphone.\nIt's just so awesome. I m loving it 😘😘😘 the best of Lenovo. Everyone should\nbuy it. Somehow Lenovo never disappoints.\n\n", "i have bought this phone, when i have checked it i have found left speaker of\nthis phone is not working, and on amazon replacement policy is very not good.\n\n", "The only problem I felt is with the Front cam. Images blurred wen u take\nselfies closer. Much better when u take it longer shot in selfie. Secondary\ncamera is really a good one. Heating problem is acceptable .Any mobiles will\nheat up when u use such high power turbo charge. Even apple gets heat up.\nStock Android is a huge plus. Smooth and good responsive UI. Battery stands up\nto 24 hours with moderate usage.\n\n", "After 1 week usage I found these as pros and cons  \nPros - 1. Good clarity 2. Front and rear camera super 3. Battery last for two\ndays 4. Dolby sound 5.quick charging  \nCons - 1. Slight heating issue while using camera\n\n", "Good product with some cons.  \n1\\. Battery Drains very quickly  \n2\\. Sometimes turbo charger, charges very slowly.  \n3\\. Photo quality low with low light (not always).  \n4\\. Sometimes software hangs  \n5\\. Need to hold carefully as it is slippery, good if you use some sort of\nback cover  \n6\\. Since build with stock OS, some basics missing (example, network speed,\ncontact alphabetic list)  \n7\\. You need to buy headphone separately  \n8\\. Gets warm  \nPros  \n1\\. Good Photo quality for out door  \n2\\. Accessing Speed is good  \n3\\. Video steaming is good  \n4\\. Audio quality OK.  \n5\\. Frequent callers are sorted automatically so that we can have top caller\non the top of the list  \n6\\. Separate slot for sd card is an added feature  \n7\\. Has Front flash\n\n", "I wonder how this product is released in to the market without proper\ntesting.Because this device isn't stable.  \nI ll make it simple, charging will be dried out by evening even for moderate\nusage. 4GB RAM or processor, I am not sure about the culprit.  \nWhen ever i open images, it hangs and shows error message. My Lumia phone with\n512 MB RAM is better than this.  \nCamera is awesome.  \nI feel that i wasted my money.\n\n", "Don't buy this plz .the lens of the back camera is not good after 2 mounth\nit's take bad picture.ami it has helio x20 processer . Honor is best and moto\n\n", "Worst mobile. Dont by this. The company says it is killing one sure it is\nkilling our money. It is worst among d Lenovo series. It does not have even\ngallery, option for editing pictures even we can't crop d pics, it does show d\nbattery percentage, data speed n have no facility to merge duplicate contacts\nn block a saved no. directly fm contacts. If we compare k4 note, k6 it is most\nworse. The battery is also having no back up though they says it s of 4000mah.\nDon't buy it\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 March 2018", "on 16 March 2018", "on 24 September 2017", "on 29 August 2017", "on 29 September 2017", "on 24 August 2017", "on 3 March 2018", "on 24 November 2017", "on 5 October 2017", "on 29 December 2017"], "reviewer": ["Amazon Customer", "Aby", "Amazon Customer", "Amazon Customer", "Ranjith", "Amazon Customer", "Amazon Customer", "arun", "Rajiv bhowmick", "Muraleedharan"]},
{"rating": ["3.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Features are good, but more heating", "Perfect for the price.", "Mid range Phone", "No Direct Casting. Coolpad cool Vs K8 note", "Very good product", "Finger print is working fine. camera is also good and great", "I was using note 5 and had loved it. I used for a year and half", "I didn't like camera otherwise the phone is top notch and reasonable price and reasonable price", "Loved it. Hands a few times while playing games", "Great features but POOR Performance"], "review": ["Features are good,but more heating,sometimes automatically switched off during\ncharging,if camera opened for more than 10min ,again getting heated,first one\nI was not used the set as I was waiting for screen guard,within 2 days I got\nsomany technical problems,I called Amazon to replace with new set,but as it\nwas 12th day,they rejected my request by telling that with in 10days only we\nwill replace.called to Lenovo ,they suggested to give to service centre for\nrepair of new set which was not used properly for one week.  \nWith in 10 days how could we know all technical issues,so dear customers\nplease start to use the new set early & check for quality\n\n", "This phone is great in terms of daily usage and doing muti task.  \nThe screen is crisp and bright, and is full HD so the pixel per inch is also\npretty good.  \nIt has Dolby surround sound and it is pretty good for a phone at this price.  \nThe dual camera's does a decent job indoors and captures some crisp pictures\nin good lighting conditions.  \nThe battery lasts a whole day easily so that too is not a problem.  \nThe competition for this phone comes in the form of redmi note 5 and Moto g5s\nplus.  \nSo you could go for it.\n\n", "1) Camera Quality is Very Bad 13Mp or 5Mp Dual Camera Not Improve.  \n2) Overheating ⚠️ Problem  \n3) Hanging ⚠️ Problem  \n4) Display Quality is Very Good 👍  \n5) Available In Amazon.in\n\n", "I brought this mob after using Coolpad cool (glass broken). I expexted a lot\non chnaging to a bigger brand name of Lenovo. But the phone is not performed\nas expected.  \nI liked to compare Cool pad cool with k8 note  \nPros.  \nBetter look. Nice to hold  \nComparing to Coolpad cool, Thats all  \n  \nCons  \nNO DIRECT WIFI CASTING TO TV, you need chrome cast to cast or screen sharing.\nThis was totally disappointing.  \n  \nBluetooth connection in car is not so smooth. But the connection from Coolpad\ncool was just superb.  \n  \nDepth sensor of rear camera is not that good comparong to Coolpad cool.  \n  \nI am writing this because if someone said this previously i will never buy\nthis phone.\n\n", "Very nice product at that price value of the money  \nCamera quality is good front facing best for selfie  \nBack camera is little bit confusing between object and background  \nBetry performance is unbeatable  \nFHD Screen  \nVery less processing time  \nOnly the processor is mediatek but it is 10core also for batter  \nAll the things are the best so good\n\n", "There were so many features are missing, where when we compare to other lenovo\nphone.  \nBattery is not much worthy and it is been mentioned 4000 mah but the battery\nback up is too low.there was lot of bugs were seen in one day usage\nitself.Finger print is working fine.  \ncamera is also good and great,  \ndesign of the mobile phone is good.  \na dedicated memory card slot is very good and we can use both sim and a memory\ncard. that one of the biggest advantage in this  \n  \nIn overall, it is not worthy for 13k mobile, if more features are been added\n,may be it can be worthy for that amount\n\n", "I was using note 5 and had loved it. I used for a year and half, never faced\nany issues in any areas.. based on this I bought note 8, but it's not up to\nthe mark. There are many problems with this phone..  \n  \n1\\. Didn't understand the duel sim technology. If am on a call I don't get\ninternet. It's not compatible.  \n2\\. Within a month charging cable stopped working.  \n3\\. There is no auto call recorder like note 5.  \n4\\. Other things too but I am lazy to write.  \n  \nI was so much fan of lenovo that I bought same for my mom.\n\n", "If you are looking this phone, phone have 10 core MediaTek processor which can\ngive very good performance as compared to a Snapdragon 625 but the camera of\nthis phone is little compromise because it have a dual setup of camera and the\nphoto which is in portrait or depth mode is not quite good as compared to\nportrait mode camera which is having dual camera compare with MI A1 so if you\nwant good performance in games and some dual portrait mode photos you can buy\nthis phone in very good price\n\n", "Loved it .  \n  \nHands a few times while playing games. But that's ok (I can live with it)  \n  \nSpeakers could have been a wee bit louder, but I normally use Bluetooth\nheadphones, so it really doesn't matter.  \n  \nThe stock OS , was not very pleasing to the eyes nor was it mouldable. So I\nhad to overlay third party launcher. And now I'm quite happy.\n\n", "The features are excellent but the usability isn't there. Despite a 10-core\nprocessor, 4 GB of RAM, it hangs out quite frequently. I have an old Huawei\nHonor 6, 3 GB RAM - 2015 model, which is better than the new device. Also\napplications keeps on crashing quite frequently.  \n  \nCamera is of not good use too. The pixel clarity is inefficient as it gets\nblur upon zooming (after clicking of photographs). Also the time taken for\nsaving the picture is +3 seconds after the click, which is quite high as I\nhave never used such a slow camera in any phone.  \n  \nBattery life is good. With constant data, frequent calling and mail checks, it\nruns for 8-10 hrs. Also turbo charger is a great advantage.  \n  \nSpeakers are another strong point in the phone. The sounds are great, means\ncomparable or better than my Vaio Laptop.  \n  \nThe phone boosts of Gorilla Glass, but got scratch within a week of use while\nkeeping it in pocket only.  \n  \nLenovo doesn't have any Gallery or Music Player apps, so had to download it\nfrom google play, which again either comes with advertisements or I need to\npurchase those. Hence, I am stuck with the advertised versions of basic apps.\nAlso, had purchased New System Updates, still had to update 2 GB of updates in\ntotal 3 times. Still Oreo update would be available only in June/July.  \n  \nThe worst part is I had gifted it to my wife, and now what I got in return is\nthe complaints part, that too all the time. Means despite spending 10k\napprox., this device does not fulfil its advertised words.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 September 2017", "on 19 March 2018", "on 17 September 2017", "on 28 February 2018", "on 22 October 2017", "on 26 October 2017", "on 23 February 2018", "on 11 November 2017", "on 28 November 2017", "on 23 February 2018"], "reviewer": ["Gururaju.Y", "mustafa", "Manish Pandit", "Jojan", "Rohit rajput", "Lokesh Bala", "Kumar A.", "Hema", "Christopher Pereira", "Anuj Wadhwa"]}
]