[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["For those who need less performace and geat battery life", "Sleek, Lightweight, High Performance Device Meant To Appeal All Your Senses - A Good Buy!", "Giving Best Performance and I bought the laptop at INR 44990 Rs. better to buy in this price", "Best laptop under 50K", "Terrible exp. Motherboard crashed within a year.", "I don't know why people are giving one star. ...", "No wonder mac is awesome product but buying it on heavy discount on amazon ...", ",", "perfect for everyday use and small scale professional use", "Pure luck no cost emi cost me this lappy jus for 43,208/-😂"], "review": ["I have been a Macbook pro user for last 2 years. I came across the new Macbook\nair and got a chance to put hands on it. So here is a brief review on my first\nimpressions. Basically i will be comparing this with a regular laptop of\nsimilar price range and Macbook PRO  \n  \nAir benefits compared to Non Apple laptop:  \n# Slim and light weight for daily travel  \n# 10-11 hours battery backup on normal usage  \n# Apple touch pads are awesome, smooth and responsive compared to any premium\nlaptop  \n# Audio quality on speakers is good, but not as loud as my Macbook Pro 13  \n# Apple front camera works the best in low light, best for low light skype\ncalls  \n# SSD - Apps launch very fast despite the low power processor  \n# Metal body construction  \n# Mag safe charger- If you are really careless this helps very much.  \n# Ambient light sensor that adjusts brightness automatically ( Many people are\nnot aware of this feature)  \n# Keep your Air closed or leave somewhere idle and check back after 2 or 3\ndays, you will see battery has dropped less than 3 or 4 %  \n# The best part - Mac OS, contains all that you need, a neat calendar, Todos\napp, notes, Quicktime, Mail app etc. Hassle free OS  \n  \nAir demerits compared to Non Apple laptop:  \n# Performance is on lower side  \n# Good for basic usage only, internet, movies, video calls, spreadsheets, mail  \n# You will get better display(Full HD) if you buy a 999$ Ultrabook from US (In\nIndia they come at premium)  \n  \nShould you consider Macbook PRO? - PRO advantages  \nI know a lot of people might be confused whether to go with PRO for some\nadditional bucks. So listing benefits of pro from my experience  \n  \n# Force touch - More comfortable touch pad, less finger pain compared to\nbuttons on Air, Adjustable pressure  \n# Retina display - More pixels, Better viewing angle. Air is 1440x900 while\nPRO is 2560x1600 pixels  \n# Better performance - Pro CPU is actually about 50% faster than AIR, but in\nreal world tests, apps launch at similar speed in both PRO and Air. The\ndifference is notable only when you run CPU intensive tasks like Programming,\nVideo encoding, Photo editing, Raw conversion etc. Those who are not into this\ncan go with Air and save some money.  \n# Newer CPU - Macbook air has not evolved much compared to PRO. The 2017 Air\nuses the same fifth generation CPU as the previous version (2015). But with a\nlittle upgrade in CPU speed. ie 1.6 GHz to 1.8 GHz. The newer PROs come with\n7th generation Intel processors. The difference is mainly with the energy\nconsumption.  \n# HDMI port - You don't need display port adaptor  \n# New keyboard - The 2016 PRO has the same keyboard as the \"Macbook\". Keys are\nless deeper and more wider. This makes it little more comfortable to type. Air\ncomes with the same old keyboard as 2015 PRO  \n# Wider touch pad - Not a big deal. But if someone loves that, its a bonus  \n# Color options - Yes, Air is only available in Silver, PRO comes in 3 color\noptions  \n  \nIf you think, all the above justifies the price difference between the PRO and\nAir, go for the PRO. The only benefit that Air offers is battery life. PRO\noffers 8-9 hours only, while Air offers, 11-12 hours battery.  \n  \nWhom Air is for?  \nMacbook air is not a gaming machine or for hard core users. Its for people who\nlove to watch lot of movies, work on documents, browse and some basic\nprogramming. When i say programming, Xcode works fine on Macbook air. But\nSoftware like Android studio, Photoshop seems to struggle a little on Air. But\nif you are once in a while user of intensive apps, you can ignore this.  \n  \nI will update my review with more details after a few weeks of hands on\ntesting and usage. If you have any queries leave a comment below. I will try\nto answer in a day or two.  \n  \n[...]! Thanks\n\n", "Macintosh has come a long way since its inception back in 1984 and continues\nto delight us with its innovation mixed with futurist thinking. This 2017\nversion of MacBook is basically an ‘old wine in a new bottle’ getting a\nminimal increase of 0.2 GHz in processor speed over the 2015 version. Despite\nhaving negligible changes, MacBook Air 2017 remains the best choice for the\nIndian masses.  \n  \n:::::::::::::::::::::::::::: Why a MacBook Air? ::::::::::::::::::::::::::::  \n  \nAnyone trying to get their hands on this sleek beauty should definitely ask\nthis question to themselves. Only after getting satisfactory answers, should\nthey go forward to even ‘think’ of owning it.  \nIf you are into playing high graphics games, fancies in having terabytes of\nmovies as a collection or gets pleasure in listening to loud music minus\nheadphones, this device is definitely not for you to wish upon.  \nHowever, if you are a frequent traveller, interested in neck-breathing\nperformance coupled with really long battery life and is conscious of fashion\netiquettes, this product is a must buy.  \n  \n:::::::::::::::::::::::::::: Positives ::::::::::::::::::::::::::::  \n  \n1) Sleek and Ergonomic Design -- MacBook Air is a piece of silvery beast,\nergonomically designed to appeal your senses, simultaneously making a fashion\nstatement.  \n  \n2) Quite Lightweight -- MacBook Air justifies its name, feels very light and\nhence much portable.  \n  \n3) Excellent Backup -- Apple has definitely amazed me with the battery backup\nof the device which touches 11 hours on full charge. Additionally, if you\nleave it on sleep mode for a couple of days, it will hardly deplete even 2%\neach day. Don’t believe me? Try it out!  \n  \n4) Lightning Fast Booting -- The device boots itself in approximately 3\nseconds and takes hardly 4 seconds to shut down.  \n  \n5) Sugarcoated with Solid State Drive -- Since this device used Solid State\nDrive (SSD) as its storage medium; it is not only super fast but also\nextremely quiet.  \n  \n6) Fast MagSafe Charger -- Well, the Air comes with MagSafe 2, a magnetic\nconnector which attracts your charging inlet when taken near it. The charger\ncharges the Air from 0 to 100 percent in less than 90 minutes, which is damn\nfast.  \n  \n7) Noise Less Front Camera -- The camera it possesses is practically noise\nfree and can impart exceptional picture even in low lighting conditions.  \n  \n8) Ambient Light Sensors -- As all of you might have known, MacBook comes with\nkeypad lightning, not to mention the backlit Apple logo. All of these are\nsensor enables and thus adjusts according to the lighting conditions.  \n  \n9) Ample Key Spacing -- Apple packs a well designed keyboard in a 13.3 inch\nlaptop giving ample amount of space between the keys and this is what I call\nan engineering marvel.  \n  \n10) Mac OS -- The presence of Mac OS is solely enough to own a MacBook, taking\ninto factor the OS’s multi-level security, super stability, attractive GUI,\nvirtually driver-less experience and its ability to recognise any Apple\nproducts. Additionally, having a personal assistant in name of Siri does not\nhurt anyone.  \n  \n:::::::::::::::::::::::::::: Negatives ::::::::::::::::::::::::::::  \n  \n1) Screen Resolution -- Air is packed with LED backlit glossy display of\nresolution of 1440 x 900 pixels (HD Ready) with 128ppi. Not owning a laptop\nwith at least a Full HD resolution in 2017 is surely a setback.  \n  \n2) No Dedicated Graphics -- Nowadays, even basic games in the market requires\na dedicated graphics and not having it clearly dismisses playing any game in\nthis beastly device.  \n  \n3) Lower Bass -- Although the device outputs good quality audio, there is a\ncertain lack of bass being felt, which, in my opinion, could have been easily\ntaken care of.  \n  \nAfter going through the pros and cons above, I am of the opinion that the\ndecision making of yours will certainly be more definite. Also, be sure to\nlook out for offers in Amazon as I got this device as low as 45K.  \n  \n:::::::::::::::::::::::::::: A Kind Request ::::::::::::::::::::::::::::  \n  \nMany of you have messaged me on Facebook asking either about the offer or\nabout the device in details.  \n  \nI request anyone requiring any further help to kindly comment below this\nreview or email me (found on my profile bio) as all your messages on facebook\nwere in the 'Message Request' section and I did not get any notification for\nthe same.  \n  \nIf you are not comfortable publicly discussing, at least comment here saying\n'Check your Facebook' or likewise so that I get aware of your willingness to\nreach me.  \n  \nApologies to all who could not get my reply on time; it was unintentional.\n\n", "Delivering smooth performance while comparing the other Operating Systems  \nThe thing is without graphic card is first disappointment  \nThe Laptop working more better after software update to the Mac OS High Sierra\n(It is elevated to work smoother)  \nLittle bit freezes while running the Xcode in the MacBook Air because lack of\ngraphics card and oldest i5-5th generation processor  \nA finest OS in the Lowest price laptop from Apple  \nbetter to use for daily purpose  \nIf you wanna do coding U just goto the latest Mac with graphic card  \nAndroid studio works well in this laptop  \n#Hightlights  \n*8gb RAM with Intel's i5 with 5h gen. processor  \n*Integrated graphics which can be optimised with the ram of the latest Intel 5000 graphics  \n*128gb of Solid State Disk Drive which boots quicker than a Hard Disk Drive (98gb is available for using)  \n*Sound clarity is excellent and Battery back is more than 6 hours standby (Excellent in this case)  \n#Drawabacks  \n*XCode doesn't works faster and hangs sometimes  \n*Doesnt have the graphic card  \n*Less storage space (only 98gb is available)  \n*Doesn't have the internal HDD(Worst in this case)\n\n", "I bought this laptop after wondering if it's justified enough for me to\npurchase a MacBook Pro 13\" in India which costed nearly 122k with just 8 GB\nRAM and 256 GB SSD, now having purchased a base config MacBook Air, I am very\nhappy, mainly because I was able to buy it for under 45k by exchanging my\nolder Lenovo laptop which was giving me a severe headache.  \n  \nI'm a software engineer and I have a company issued MacBook Pro 15\" late 2016,\nI wanted a MacBook which I could use for my personal tasks so I began looking\nfor one, after looking at various models at different Apple stores I came to a\nconclusion that it's not worth buying a 2017 MacBook Pro as theres no\nsignificant advantages or reasons to buy one over lets say a 2015 MacBook Pro,\nthe differences are very minor and unnoticeable in your day to day tasks. Even\nthe screens are not revolutionary, they are not 4K yet and they do not fully\nsupport 4K and 5K video playback, my iPhone 7 and iPad Pro 10.5\" are way\nfaster when compared to these newer Macs if you look at just the benchmarking\nscores, I hope this explains why I think that they are not worth their money.  \n  \nNow let's talk about MacBook Air, I don't understand why it gets so much bad\nrap,I get that the screen is not very good, but it's still very good, it's\nbetter than any other Windows laptop you could buy at this price.  \n  \nConfiguration:  \nIt has 8 GB RAM and 128 GB SSD and has a i5 5350U processor which is an\nexcellent configuration.  \n  \nStorage:  \nOut of the box I got about 102 GB to work with, after the software update and\ninstalling Java, Android Studio, XCode, IntelliJ and some apps from Mac Store,\nI was left with about 90 GB, this is very very good.  \n  \nPerformance:  \nThe performance is a breeze, I had about 20 tabs open in Chrome and Safari and\nstill had over 5 GB RAM to work with, Android Studio and X Code run like a\nbreeze, startup time is excellent and I was able to launch simulators on both\neditors in an instant and due to abundant RAM using both code editors at the\nsame time is possible. Geekbench 4 score was about 3500 for single core and\n6800 for multi core.  \n  \nBattery Life:  \nBattery Life is phenomenal, I am able to consistently pull off 13-14 hours\nevery day, I am very happy with this.  \n  \nKeyboard and Trackpad:  \nKeyboard and Trackpad are in the league of their own, they are springy and\nvery very responsive, Mac OS has these track pad shortcuts that work very well\nand save you time if you know where to use them.  \n  \nPorts:  \n2 USB 3.0 ports, 1 Thunderbolt Display port, a headphone jack and a Mag safe\ncharger port so yeah you won't have to carry those adapters around.  \n  \nBuild:  \nVery lightweight, durable and portable  \n  \nScreen:  \nNot the best in the world but its very much manageable, it's noticeable if you\nuse a retina MacBook Pro like me at office, but for me this is a non issue\nsince I hook it up to an external monitor.  \n  \nVerdict:  \nThis is the best bang for buck laptop you can buy, Mac OS is the best OS out\nthere, the hardware is the best you can buy and performance is very very good,\nit's not at all as bad as the reviewers write, it has an i5 processor for gods\nsake. In short if you want a laptop that can last for half a decade or more\nbuy this, you won't regret.\n\n", "Please don't purchase it online. Especially from the vendor IT sales. I don't\nunderstand what to do with this bin. Its been only a year and a half.\nInitially I started facing issues with power. It just keeps on shutting down\nin between the work. Then then it finally stopped working. I have shown it to\nthe premium service store of apple. They found out that there was a issue with\nthe motherboard and needs to be replaced by paying 45k. Wtf. Please if you are\nplanning to spend huge amount of money on something like this. Do it wisely.\n\n", "I don't know why people are giving single star. Yeah it doesn't have USB C. It\nhas two USB 3.0. The difference between 2015 and 2017 model is that this has a\nprocessor with clock speed 1.8GHz and turbo boost up to 2.9GHz.\n\n", "I wish I could give Amazon o stars. No wonder mac is awesome product but\nbuying it on heavy discount on amazon made me regret big time. This is only\nsecond month to my purchase and it started showing up problems when taken to\napple centre they say mother board has to be replaced. Not sure if amazon\nsells defects tie products on heavy discounts. I am a frequent and loyal buyer\nfrom amazon but I have simply lost trust in them as my almost 55k product has\ngone for a troll. You are a shame! Mac has also let me down as they were\nsuppose to provide best in class products now what they have in justification\nis that it shouldn't happen but we will replace the part coz it is in\nwarranty. Imagine had it not been in warranty period, my hard earned money\ninvested on this effing product would have gone into trash. Big thumbs down\nfor amazon India and mac who make fools out of customer and not giving them\nfull satisfaction. Even the executive seated at service centres give least\nexplanation as to how a new product can show such defect. Useless people\n\n", "Eagerly waiting for the prices to drop back to ~₹45000\n\n", "Apple always design with perfection. No doubt, this macbook Air stands first\nin this prize range (50k).  \n  \nFirst about the delivery, got this product delivered within 2 days and amazon\ntransportation service was really very awesome. With required air bags and\ndual protection.  \n  \nAbout the product.  \n  \nDesign : 9/10  \nAluminum body carved with perfection, sleek and very elegant look. The apple\nlogo that glows adds cherry. Backlight keyboard is perfect for working in\ndark. Gesture controls in trackpad are awesome. There are about 10 geasture\ncontrols that help you work with just your fingers. The design only lacks in\nair ventillation. The alluminium body gets heated up when i render video edits\non premier pro. For normal work, it works fine.  \n  \nPerformance: 10/10  \nAlthough its a 5th generation i5 processor, but this works far better than the\n7th gen i5 processors in windows laptop. Compared intensive rendering task and\nthis mackbook air is upto the expected mark. Thanks to the optimization, that\napple always do. 8GB ram, intel HD6000 graphics is just perfect for regular\nwork and even works fine for small scale coding and professional video editing\ntasks. This mackbook air boots up in around 3 seconds and sleeps in around\n2sec.  \n  \nBattery: 10/10  \nThe best battry life i had ever experienced in any laptop. Works for around 13\nhours in a single charge (continious internet surfing and online videos).\nBattry do gets exhausted when using professional software (adobe premier\npro)(cpu intensive task).  \n  \nMacOS Sierra is definitely all you need. Preinstalled apps helps you to do all\nyour school, college or office works in one place. No need to download or buy\nMS office. iMovies is just perfect to edit small scale videos.  \n  \nStorage: 9/10  \nSSD 128 gb is superfast and really makes your work lightning fast, but you\nneed to buy an additional external hard disk to store files and other stuffs.  \n  \nMagsafe2 charger is just awesome, no damage to the charging port and pin as it\ngets plugged in through magnetic force. No wear and tear around charging port.\nAlso prevents accidental damage.  \n  \nThunderbolt 2 post perfectly works fine with add on connector (aroung 500Rs)\nfor HDMI streaming. 2 USB 3.0 Ports are good but it could have one one USB\npost.  \n  \nAll around, This laptop is perfect for everyday use and small scale\nprofessional use\n\n", "At. 44990/ Rs it's a worth buy.&with low cost emi option i brought this for\n43,208/-rs pure luck i wud say. better dan buying from the stores eagerly\nwaiting for it to come. Features r awesome a virus free laptop. Easy to hadle,\nlight weight n wen u get siri as an assistant in this laptop to read things\nout for u definitely amazing. Worth a buy\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 July 2017", "on 28 September 2017", "on 23 December 2017", "on 12 August 2017", "on 27 August 2017", "on 11 July 2017", "on 24 January 2018", "on 23 September 2017", "on 1 November 2017", "on 21 September 2017"], "reviewer": ["Ajith Memana", "iShahrukh", "Chaithanya V", "anad", "Amazon Customer", "Devanand Gowda", "Joe", "MANOJ KUMAR B", "Tanmay Bose", "G2"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Amazing product but purchased from paytm 😊", "Loved it. Can't get any better.", "Who should and should NOT buy it!!!!!!", "Electric shocks!", "An honest review.", "Worst", "I Like the prduct but i brought it for 54000 and ...", "The MacBook Air is \"old\" but is it \"gold\"?", "don’t buy", "Amazing Apple !"], "review": ["Its an amazing machine. Although after researching a lot on different sites I\npurchased from paytm in diwali sale. Earlier I was worried that should I trust\npaytm for this costly product but after enquiring  \nwith friends and some research in google I took this bold step. U won't\nbelieve I got an amazing deal, Original price was 58000 there and 14000 was\ncash back so it cost me around 44000 only on top of that I got 1500 cash back\nof icici bank so the total purchase price was 42500 only.  \nI searched the \"brand trusted vendor\" in paytm and ordered from there. Got\ndelivery in 5 days. It was very well packed and I made a video while unpacking\nit. I am happy it's as genuine as we purchase from store.  \nChecked guarantee online by putting order no on apple site it was all good ,\none year from purchase date.so all genuine at very reasonble price.  \n  \nWorking on Mac air is different experience it's very slim and very fast for\nany task. Speakers are amazing.Go for it👍  \n  \nSorry for the long post😊\n\n", "This is one of the finest and the most streamlined and consistent product in\nthe 50k price bracket. Bought this one for 60k from Amazon and grabbed another\none from paytm mall at 45k. Having used it for 3 months I'm just impressed\nmore than ever. I initially thought it would be unable to game as it's a\nMACBOOK, but to my surprise this laptop is no slouch when it comes to\nperformance. It can easily handle games build around 2k13 at medium setting\nwith decent framerates(bootcamp off course) The battery backup is out of this\nworld. The design is as good as it gets. The display is fairly decent but not\nsomething 4k'ish. And it's thinner than anything in competition. In my opinion\nit is one of the best laptop you could buy at a price of around 50k. Look out\nfor that price drop as it's frequently available here and there.\n\n", "Hello, First of all, I am not a frequent reviewer but I had to write this\nafter buying a 50k machine which I always wanted to own.  \nThis review is all about who should buy it and who shouldn't.  \nWho Should:  \nI believe MBA's and management people and anybody who is looking for a\npowerful machine to browse websites all day, make presentations and docs on\nthe go, would absolutely love the fluidity, power and its battery backup. You\nwould absolutely adore the gestures on its super-duper amazing trackpad.\nInstall a MS-Word system and you would thank me if you buy the system after\nreading this review. ;)  \nWho Should NOT:  \nEngineers apart from specific ones (the ios devs). I bought the machine for\nthe coding and daily RnD's and, let me tell you, to install any software is a\ntask in its own. I am an engineer working on data science projects and love to\nexplore any thing that comes out in tech just like every other passionate\nengineer, but, after 2 months, I feel like I invested my money in the wrong\nmachine. Every day something new comes up and I find myself googling stuffs\nlike 'install libraries FOR MAC', 'access root FOR MAC' or even, 'how to cut\npaste IN MAC' (believe me you would do this too!). It lacks GPU and you would\nfeel it after running a heavy duty code. You would need to install softwares\nfor basic stuff like connecting an android device (oh yes! feel terrible\nalready?), connecting your hard-disks formatted in NTPC and etc etc. I can be\nwrong here for people working on specific tools and libraries but when it\ncomes to generalise, I would be right. Mac is an amazing piece when it comes\nto basic stuff. Trackpad, the keys and the classy lightweight body are the\nfeatures NOT ALL companies provide but IT LACKS BASICS for software\ndevelopment and RnD. I hope it saves someone's hard earned money! Peace!\n\n", "Electric vibrations/mild shocks when its charging and i touch its body. Please\nhelp me find out how to solve it :(  \n  \nIts screen blinks as well. Im worried\n\n", "Packing quality.  \nProduct delivered before time, kudos to amazon for that, packaging was good,\napple box was completely sealed.  \nStorage-  \nI got the 128Gb ssd model, after updating to High serria(latest OS), and\ninstalling java sdk 8, Android studio with 3 Sdks, anaconda(python), brackets\nand xcode 9, i am left with 79.27 gb of space.  \nIn the box  \nCharger with extra 3 pin powercord.  \nIt is magsafe, so you dont have to worry if someone yanks your cord.  \nApple Macbook Air  \n2 apple logo stickers.  \nBuild quality  \nSuperior, feels very premium and high class, also the apple logo glows.  \nDisplay  \nMany people are comparing the display of air to the pro model, which is wrong\nin my opinion, if you are comig from a mid range display 1366 x 768, this\ndisplay will simply blow you away with its brightness and clarity, if you have\nused a full hd display, you might not feel much of a difference.  \nBattery life.  \nYet to test it, but initial impression is great.  \nMac OS  \nComing from windows, boot up time is fast, but that can be attributed to\n128ssd as well.  \nBut the OS simply seems smooth and has no lag.  \nProcessor  \n5th gen i5 processor with 8gb ram Android studio loads in approx 10 seconds,\ngradle completes in 6 secs.  \nWarranty  \nActivated for 1 year, genuine product, but you can login with your apple ID to\nsupport and see your warranty.\n\n", "Worst laptop ever not for student use I repeat not\n\n", "I Like the prduct but i brought it for 54000 and after i buy it they are\ngiving it for just 41k\n\n", "Hey guys, if you are thinking of purchasing the MacBook Air, chances are that\nyou already know it's best for you but if you wanna know some extra stuff,\nit's here. Just pay a look and you'll be glad you did.  \nLet's get on with it.  \n  \n=====PROS=====  \n-Excellent battery life.  \n-Fast storage.  \n-Great Keyboard.  \n  \n=====CONS=====  \n-Dated design.  \n-Display.  \n-Speakers.  \n  \nTwo years and three processor generations later, Apple is selling what is\nessentially the 2015 MacBook Air with ever-so-slightly closer to 2017\ncomponents inside.  \nThe 12-inch MacBook, as well as the 13- and 15-inch MacBook Pros were all\nrefreshed earlier this year, complete with more up-to-date Intel Kaby Lake\nprocessors, yet notably the MacBook Air only received a minor processor clock\nboost. It certainly makes you wonder whether Apple cares about the MacBook\nAir, but nevertheless it’s a fine, long-lasting laptop for general use.  \nThe MacBook Air also has the advantage of legacy ports, which Apple has sadly\ndiscarded from its modern-day lineup. Whereas the 12-inch MacBook and MacBook\nPro have gone all-in on USB Type-C and Thunderbolt 3, respectively, the\nMacBook Air retains the ‘regular’ USB 3.0 ports and SD card slots of the past.  \n  \n=====DESIGN=====  \nBy and large, the MacBook Air generally looks the same as it has since 2010,\nand there don’t appear to be any changes in tow, either. That’s a shame,\nparticularly because we’re now seeing virtually bezel-less laptops with\nsmaller footprints and high resolution screens that dismally put the MacBook\nAir in its place.  \nForget the Dell XPS 13's physics-defying InfinityEdge display, which is\nlightyears ahead – even Apple's 13-inch MacBook Pro with Retina, once seen as\nslightly tubby compared to the Air, has a smaller footprint and takes up\nslightly less space on your lap.  \nYet, the old ‘if it ain't broke’ mantra applies – at least to a point. The\nMacBook Air's aluminum unibody design, which supports the main enclosure and\nthe display, is as durable as ever. Its lid can be easily raised with a single\nhand and doesn't droop in any position, and you have to press really hard to\ndetect flex on the machine's base or lid.  \nIt's also easy to clean with a damp cloth. If there's one drawback, it's that\nthe aluminum body can scratch easily to leave permanent black marks, so you\nshould consider buying a sleeve if you're going to sling it into a bag for\ntransportation.  \nThe 13-inch MacBook Air is more interesting than the 11-inch model due to\nhousing flash storage twice as fast as its predecessor – or so Apple claims.  \n  \n=====SPEC SHEET=====  \nCPU: 1.6GHz dual-core Intel Core i5 (Turbo Boost up to 2.7GHz) with 3MB shared\nL3 cache  \nGraphics: Intel HD Graphics 6000  \nRAM: 8GB 1600MHz DDR3  \nScreen: 13.3-inch, LED-backlit glossy widescreen display (1440 x 900)  \nStorage: 256GB PCIe-based flash storage (configurable to 512GB flash storage)  \nOptical Drive: Not included  \nPorts: Two USB 3.0 ports (up to 5Gbps); Thunderbolt 2 port (up to 20Gbps);\nMagSafe 2 power port; SDXC card slot  \nConnectivity: 802.11ac Wi-Fi networking; IEEE 802.11a/b/g/n compatible;\nBluetooth 4.0 wireless technology  \nCamera: 720p FaceTime HD camera  \nWeight: 1.35kg  \nSize: 32.5 x 22.7 x 1.7 cm (W x D x H)  \n  \nOne advantage of the MacBook Air versus the 12-inch MacBook is its wider\nselection of ports. On the left-hand side is a MagSafe 2 connector for power,\none USB 3.0 port and a headphone jack. On the right is a Thunderbolt 2 port,\nanother USB 3.0 port and a full-sized SDcard slot. The 13-inch Retina MacBook\nPro doubles the number of Thunderbolt ports compared to the Air, and adds\nHDMI.  \nmacOS Sierra is the version currently shipping with Apple's 13-inch MacBook\nAir. It doesn’t divert too much from the visual style of its predecessor, OS X\n10.11 El Capitan, but it does introduce a range of new features such as Siri,\nContinuity between your Mac and iOS devices and Apple Pay for expediting\nonline purchases.  \nSierra has since been succeeded by macOS 10.13 High Sierra, though it doesn’t\ncome with it out of the box – you have to download and install it yourself,\nfor free. There aren’t many significant improvements by way of macOS High\nSierra, save for better security, VR support down the road and refinements to\nthe Photos app.  \nThat said, given that you don’t have to pay for it, macOS High Sierra is\nprobably worth the 4.8GB hit to your data cap for the also-new Apple File\nSystem (APFS) alone. The new 64-bit file system brings native encryption and\nfaster metadata operations to the table, making the MacBook Air quicker to use\nas a result.  \n  \n=====BUNDLED SOFTWARE=====  \nFor now, macOS Sierra ships with Apple's own iWork and iLife apps, including a\nmodernized look for Garageband.  \nThese include:  \n-iMovie  \n-Garageband  \n-Pages  \n-Numbers  \n-Keynote  \n-Safari  \n-Mail  \n-Messages  \n-FaceTime  \n  \nIn addition to:  \n-Calendar  \n-Contacts  \n-Notes  \n-App Store  \n-iTunes  \n-iBooks  \n-Maps  \n-Photo Booth  \n-Time Machine  \n-Spotlight  \n  \n=====PERFORMANCE=====  \nManufactured on the 14nm fabrication process, the 13-inch MacBook Air's\nBroadwell CPU is a die shrink of Intel's 22nm Haswell chip. It means better\nbattery life versus last year's MacBook Air models, although the gains aren't\non the same scale as the switch from Ivy Bridge to Haswell. Still, battery\nlife was staggering, clocking up more than 13 hours when looping a 1080p video\nover Wi-Fi.  \n  \n=====BENCHMARKS=====  \n-Cinebench R15 Single Core: 103cb cb; Multi Core: 255 cb  \n-Cinebench R15 OpenGL: 24.91fps  \n-Geek bench 3 Single Core: 2,873; Multi Core: 5,768  \n-Xbench (CPU and disk): 469.55  \n-NovaBench (Overall): 634; Graphics: 42  \n-Unigine Heaven 4.0 (Medium); FPS: 14.4; Overall: 438  \n-Blackmagic Disk Speed test: Write average: 612.4 Mbps; Read average: 1302.4 Mbps  \n-Battery, streaming 1080p video via Wi-Fi: 13 hours and 24 minutes  \n  \nBroadwell brings performance gains too, even if they're nothing to shout\nabout. The MacBook Air scored 5,768 on Geekbench 3's Multi Core CPU test,\nrepresenting a 9% gain over the 13-inch Air from 2014. However, it proved 20%\nslower than the 2.7GHz Core i5 chip in the 13-inch MacBook Pro with Retina,\nwhich is to be expected considering that machine's faster clock speed.  \nApple's claim that the 2015 Air's storage is twice as fast as the 2014 version\nstands up. The MacBook averaged write speeds of 612.4 Mbps, and average read\nspeeds of 1,243 Mbps, which gives the MacBook Air MacBook Pro-level storage\nspeeds for the first time.  \nThe MacBook Pro with Retina's Iris Graphics 6100 proved 38% faster than the\nMacBook Air's HD Graphics 6000 in Unigine Heaven 4.0's benchmark. That said,\nIntel's decision to allocate die space to graphics on the CPU has been paying\noff for some time, and the MacBook Air is capable of playing a wide selection\nof games on low-medium settings with the resolution dialled down - especially\nwhen installed on a Windows partition using Boot Camp.  \nThe MacBook Air cranked out a smooth 60FPS played at 1440 x 900 with the\ngraphics on medium, while Skyrim managed the high 50s played at the same res\nwith the graphics on low. If your intention is to play games, you'll want to\ninvest in a decent headset as the MacBook Air's speakers are tinny and\nunsatisfying. Apple managed to squeeze an impressive amount of low and mid-\nrange tones into the 12-inch MacBook's speakers, but it's yet to use the same\ntechnology in the Air.  \nIf the MacBook Air's consistency of design can grow stale over time, this\nreviewer is happy for the keyboard to remain unchanged. Its slightly convex\nkeys are the best I've used yet on a computer, and that includes the new\nMacBook, Lenovo's ThinkPad notebooks and Logitech's well-regarded Mac\nkeyboards. Even the MacBook Pro with Retina's keys, which are hardly\nuncomfortable, feel stiff in comparison. The keyboard is also backlit and easy\nto clean.  \nThe MacBook Air's trackpad is just as impressive, providing a smooth gliding\naction that makes executing OS X's trackpad commands a breeze. It's just a\nshame that Apple didn't carry over the 13-inch MacBook Pro with Retina's Force\nTouch Trackpad – it's once again regular two-button clicking action for owners\nof Apple's slimmer machine.  \nApple's decision to put a 480p camera in the 12-inch MacBook was a poor one,\nand thankfully it hasn't followed suited with the MacBook Air. At 720p it's up\nto the task of Skype and Google Hangout sessions, producing sufficiently clear\nand defined images.  \n  \n=====VERDICT=====  \nLike a pair of old trainers, Apple's 2015 MacBook Air is boring, familiar,\nreliable and more than up to the task. If you don't need tons of screen real-\nestate (or a half-decent screen for that matter), or prefer to hook your\nlaptop up to an external monitor, it remains the most solid all-rounder out\nthere today, whether you're desk-bound or frequently travelling.  \nThe MacBook Air's stellar battery life remains best-in-class for a 13-inch\nlaptop, and its keyboard is the best in the business. The addition of\nThunderbolt 2 will go a long way if you own compatible peripherals. Its\nstorage speeds hold up to Apple's \"twice as fast\" claims and will prove a boon\nfor those who regularly copy information to their Mac's storage drive.  \nNew machine, same chassis. Apple's reluctance to give the MacBook Air a Retina\ndisplay is wearing thin, and it's causing buyers to look at alternatives –\neven defecting to Windows in some cases. Its lack of personality is compounded\nby poor speakers, an unsightly bezel and large footprint. Simply put, the\nMacBook Air just isn't that cool anymore.  \nMuch faster storage and a better performing processor/graphics combo make this\nyear's 13-inch MacBook Air a technically better machine than its predecessor,\nbut unless you really need those gains it's not worth the upgrade. That's\nparticularly so in the absence of any new features – such as the Retina\nMacBook Pro's Force Touch Trackpad.  \nElsewhere, it's business as usual: while the MacBook Pro with Retina is a\nfaster than the Air and packs more features, Apple's lighter machine is no\nslouch. And while the Retina model is chunkier than the Air, it's not a great\ndeal heavier and has a smaller footprint. With both machines residing in the\nsame price bracket, the deciding factor is more likely to be how prepared you\nare to put up with the MacBook Air's outdated display.  \n  \nIf this review was helpful, please consider clicking on the helpful tab.\nThanks!  \nHappy purchasing!\n\n", "please don’t buy this product just after one year the product does not start\nand they said about 35k amount is needed to repair this and also said this\ncomplaint is common for this product  \nso don’t buy allah ki kasam!\n\n", "Bought this wonderful laptop during the Amazon sale on 21st September for\nRS.44,990 with exchange of my old laptop for Rs.5,000, cash back of Rs.1,500\non HDFC card with pay next year 6 months no cost EMI. What else do you need\nmore than this with 8GB ram and 1.8 GHz dual core Intel core i5 ? Well built\nsilver colour weightless sleek apple with backlit keyboard. Never have a\nsecond thought to buy this. Just go ahead....\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 November 2017", "on 31 January 2018", "on 20 January 2018", "on 17 October 2017", "on 18 October 2017", "on 5 October 2017", "on 16 January 2018", "on 7 December 2017", "on 21 September 2017", "on 26 September 2017"], "reviewer": ["Amazon Customer", "Mayank Patel", "abhimanyu", "Kartik Bhardwaj", "Mark", "Vipul", "manoj", "TechSpace", "Amazon Customer", "Dr.Natesh"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Below quality product", "OOPS! The keyboard malfunctions!", "There is no control over price, within 10 days ...", "It Is Legend.........By 2017 Model..........Apple Salute You............Portable Like Nothing Else......Suggest Buy Accessories", "Never switching back to Windows", "not better than window platform", "BEST LAPTOP FOREVER", "If you are smart then read Cons", "Great job Amazon"], "review": ["wonderful buy\n\n", "Pathetic product. Below standard quality.\n\n", "Bought it based on Amazon.in reviews and YouTube posts on mac book air. Would\nadvise any potential buyer to check out 'unboxing mac book air 2017' and other\nreviews on You Tube, before the parcel arrives.  \nI wasted a few days getting familiar with the mac, downloading apps and\ndocuments, before I noticed the right half of the keyboard was malfunctioning.\nThere are articles on google where users complain of the same problem.  \nA buyer needs to get the product running as soon as possible to discover kinks\nin the machine.  \nThe Mac book air is a superb machine.... simply love it, ......tho my heart is\nin my mouth over the return and replacement ..... and worry that the\nreplacement may have other kinks to be sorted.  \nI would still recommend buying it.\n\n", "There is no control over price , within 10 days of my purchase , price has\ndropped by 6k ,\n\n", "Hi..........I Previous used Dell core i3 5050(30K) & Lenovo Z51(70K) core\ni7..........Both are good windows phone.....  \n  \n-But MacBook Air 2017..........................Astonishing.......Outstanding.......Amazing........Brilliance........No Words  \nPros:  \nDisplay Is Excellent......Much Better Than Windows Laptop........I Was Very\nNervous About The Same  \nSound Quality By Speaker Is Excellent & Headphone (Audio Techanica M50X) Is\nOutstanding......Keep Volume Lever To Full, By Default It Is Less  \nConnectivity Superb............2 USB(It Read NTFS But Write Only At ExFAT)/\nWifi Exceptional Even Work On 2 G(No Words)/Bluetooth/Thunderbolt (IDK What It\nIs Use For)  \nApplication............Brilliant In App Store  \nBrowsing...............Extraordinary In Safari/You Can Activate Internet\nexplorer Pages By Setting/Chrome Much Faster Than Windows  \nMusic/Video...........Use 5K Player From Google....It Is Free......Exception\nQuality & Sound  \nProductivity............As a Chartered Accountant By Profession.............It\nIs The Weapon For Great Practice Due To Demanding Condition....Apple Thank\nYou...............Download M S Office At Free For First Month & Then 360/460\nPer Month  \nConverter...............Download Handbreak & Suggestion AVS Converter For\nWindows(Not For Mac OS)  \nBattery Life......................I Don't Say Lol.........It Is Around 10-16\nHour After Heavy Usage............Charger Can Come in Your Pocket  \nEvery USB Device Connect So Perfectly In MacBook\nAir...Printer/Scanner/Jockey............There Is No Word As a Past Window User  \n  \nCons :  \nGaming It Is Good But Not Windows Level At The Price\nRange..............Suggestion Install Windows on Air & Use Emulator To Play\nAny Game Of Playstation.  \nDVD player..........No............Buy Separate DVD player Of Transcend It Come\nAt 1800.............Problrm Fixed  \n  \nMust Have :  \nIf You Are Multimedia Guy..........Buy Separate HardDisk & Format It With Ex\nFAT Before Start Using It In Air  \n  \nOther Devices I Am Using Exceptional :  \nI Phones 5S With IOS 10............Even In 2017 It Is Butter  \nFiio X1........................................Music Player Exceptional  \nPSP Portable..............................Amazing  \nUSB Jockey For Gaming Any USB Can Connect  \n  \nFinal Verdict............MRP Is 81000..........You Can Get From\n55K(PayTm)........62K Amazon.............But The Device Is a Legend.........It\nNeed Learning & Then You Will Live Your Life..................Apple God Bless\nYou\n\n", "Best buy I've made till date.. Perfect for blogging and 1080p video editing.\nMac OS for me like crazy.. It's integrated in such a way that you can do\nanything with amazing fluidity.. I'm damn sure ; My next laptop is going to be\nan Apple product.\n\n", "Compatible issue for Microsoft office files, not better than window platform.\nJust for listening music, watching movies and chatting, don't waste your money\nin mac. It is just for show off, don't buy this.\n\n", "THIS LAPTOP IS GREAT. FIRST OF ALL ITS GREAT FOR ITS MACOS ,THEN GREAT FOR ITS\nBATTERY LIFE .I GET ALMOST 17 HOURS OF BATTERY LIFE IN MY TEST.THIS LAPTOP IS\nGREAT FOR ITS KEYBOARD,REALLY TYPE ON A MAC BOOK AIR IS FAR MORE BETTER THAN\nANY OTHER LAPTOP IHAVE EVER SEEN.THIS HAVE A GORGEOUS TRACKPAD.REALLY\nINCREDIBLE.USE IT ONCE JUST ONCE.I AM SURE YOU MUST FALL IN LOVE.THIS IS A\nBEAUTIFUL AND POWERFUL INCREDIBLE MACHINE.I'M USING THIS SINCE 2015 .NO ISSUE\nAT ALL.NOT EVEN A SINGLE TIME IT SLOW DOWN OR GET VIRUSES. NEVER NEVER\nNEVER.NO NEED TO GET ANTI VIRUSES .MAC IS GREAT FOR.GREAT .ONE MORE THING.I\nLOVE THIS MAGSAFE CONNECTOR.I DARE YOU LOVE THIS TOO\n\n", "Compare to other laptops in this price range  \n  \nProns  \n1) if you are blind mac lover then go for this laptop.  \n2) laptop is very slim easy to carry.  \n  \nCons  \n1) Display is not good. Compare to my old dell laptop display looks dim and\nweak.  \n2) outdated processor. It comes with dual core i5. You will feel laptop is\nworking smooth but after 2 years laptop will lag.  \n3) 8 Gb ram is not sufficient for programming Purpose. You can not use this\nlaptop for gaming.  \nWhy should you buy MacBook just to watch movie.  \n4) only 128 gb ssd. You have to carry external hard drive everywhere with this\nmac.  \n5) lack of port. You have to purchase and carry adapter inorder to connect\nHDMI or VGA\n\n", "Awesome job by Amazon. Bought from cloudtail india. The product warranty is\ncounted the date it is turned on for first time. It will get you a lot of\nattention everywhere because of that glowing logo. Go ahead without any doubt.\nIt will last twice a Windows laptop. And after all it's a MACBOOK. Game Over\nWindows.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 October 2017", "on 20 October 2017", "on 23 September 2017", "on 3 August 2017", "on 3 August 2017", "on 28 December 2017", "on 15 November 2017", "on 5 September 2017", "on 22 January 2018", "on 12 October 2017"], "reviewer": ["sanjeev", "Brijesh", "Tony Rebello", "shobhit", "Anand Choudhary", "Jigyansu", "Suresh Kumar", "Saswata satapathy", "Shreya M.", "Shiraz Hasan Khan"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["One Star", "Nicely packed and well before time delivery", "Five Stars", "apple macbook air price is 50k really its price is ...", "Awesome Product, super fast delivery from amazon", "Four Stars", "One Star", "Mac Air review", "DON'T GET IT IF YOU WANT TO CODE", "Need support"], "review": ["Battery issue with the laptop. Doesn't give backup as expected . Really upset\nwith the product.\n\n", "As expected what else you need other than the feel of Apple product on your\nhand.  \n  \nSleek and elegant. Nicely packed and well before time delivery. Thanks to\nAmazon. A very effective battery with excellent backup of atleast 8-10 hours\nwhile you play movies and will be much more when used for office purposes.\nHeat sink is mind blowing. As a whole it feels like a feather on your hand.  \n  \nMagnetic charger make it look unique. In 1.5 hours it gets fully charged.\n\n", "perfect! Do check warranty of the product,if it's already started contact\napple they will reset it. really i bought it for 55.5k and after few day price\ndropped to 45k .\n\n", "apple macbook air price is 50k really its price is low than the original\nprice? anything wrong ? i cant believe this , because apple has its brand and\neven its cost will also be high , please help me? i want to purchase this one\n, is this new one with no errors? please help me.\n\n", "Got Superb Deal at Rs. 44 k, Awesome Product, super fast delivery from\namazon...\n\n", "I didn’t like the laptop is not working well it is looking like used\n\n", "GST no. and Company Name Not mentioned on Invoice.\n\n", "I have received the MacBook on yesterday morning. This is my first mac and I\nhave been waiting for it since the day of placing the order.  \nCloudtail seller:  \nI have availed the limited time offer of around 10k amazon pay balance cash\nback and the whopping price around 55k. So ultimately the price came around to\n45k.  \nPros:  \n1\\. It’s Apple and as all of you are aware of Apple products build quality,\nit’s too compact and well designed with high quality aluminium body.  \n2\\. SSD replaced the old shit HDD. Dude, it’s damn too fast.  \n3\\. Great for beginner level coding. If you plan to start pro level coding or\nif you’re a full time coder, go for Pro. Otherwise it’s perfect for the\nstarting time.  \n4\\. If you have an iPhone and your iPhone is connected to wifi, you can\nreceive your call on mac itself. Great isn’t it?  \n5\\. The trackpad is more than awesome. If you haven’t used a mac before, you\nwill be mesmerized.  \n  \nCons:  \nThe storage is 128 gigs. Out of 128, you can use 100 gigs only, the rest is\nused by the OS and preinstalled softwares.- to overcome this shortage don’t\nupgrade to 256 or 512 gigs, you’ll bankrupt yourself unless you’re the owner\nof RBI(pun intended). Just install software’s in macintosh drive and use SD\ncard or iCloud for the additional videos or images or docs.  \n  \nOverall it’s a great laptop in this range.  \nHope it helps.\n\n", "Definitely not for a geek , too closed source and restricted to an extent a\nprogrammer won't like , even though the terminal is powerful enough as a Linux\none , it lacks a certain feel , something that a user would use not a creator\n\n", "Initially it worked well for two months , after upgrade of os it started\ngiving problem of reboot . A very frequent reboot cant work now need to go to\nsupport process since it shows the memory problem\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 October 2017", "on 16 October 2017", "on 10 August 2017", "on 16 October 2017", "on 14 October 2017", "on 12 October 2017", "on 28 October 2017", "on 18 November 2017", "on 13 November 2017", "on 19 March 2018"], "reviewer": ["simranjeet singh", "Vigneswaran", "Amazon Customer", "divya", "Ankit", "Hashem hasanzada", "A S Bhati", "Picklu Debnath", "Madhav Khosla", "sai"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Simply Amazing! I definitely recommend this product to others!", "SO PACK YOUR GEARS AND ENJOY IT.", "An Honest Opinion", "A thing of beauty is a joy forever", "1.8GHz dual-core Intel Core i5, Turbo Boost up to 2.9GHz, with 3MB shared L3 cache", "# Slim and light weight for daily travel # 10-11 hours battery backup on normal usage # Apple touch pads are awesome, smooth and responsive compared to any premium laptop ...", "Worst experience", "Bad Service After 1 month it doesn't start without any ...", "Super delivery, super product !", "Go with Lenova"], "review": ["I have had my eyes on a Macbook for the longest time now but that pricing at\nBest Buy (no different than the Apple Store) was just too much for a 13\" & on\ntop of that, there's the tax! I hadn't even thought about buying it online but\nit hit me one day to look on Amazon and I am SO glad that I did. The pricing\nfor the exact same product here in store (and without tax!) is CHEAPER. I\nsaved SO much money buying this Macbook here on Amazon and I do NOT regret\nthis purchase one bit! I DID think about it a lot and read every last review\nand looked at all the product pictures (which were all good) and I'm glad to\nsay that I also got a BRAND NEW PACKAGED BY APPLE MACBOOK AIR 13.3 INCH\nLAPTOP! It was sealed shut in the original Apple packaging brand new!\nEverything is running smoothly, no problems whatsoever (though I am VERY\nnervous of leaving a scratch or something on it so I bought a rubberized case\n& carrying case to keep it safe & looking new!)  \n  \nNOW, though the product title DOES say that it comes preinstalled with the\nSIERRA update. It had Sierra Version 10.12.3 and in the app store, you can\nupdate it (FOR FREE) with the May 2017 recent Sierra 10.12.5 update! IF yours\ncomes in with EL CAPTAIN, you can update it FOR FREE to the 2017 Sierra update\n- do not worry! Lol.  \n  \nNow I don't see any big CONS to this laptop (for ME anyway) but here are my\nPROS:  \n  \n\\- Editing is smooth  \n-Battery life is AMAZING. It also charges fast!  \n\\- Love the simplicity off this laptop!  \n-Everything runs smooth and is simple to access (unless you're coming from windows,etc)  \n\\- The design  \n\\- The back light on the keyboard & apple on back  \n\\- The screen (which a lot of people complain about but there's nothing wrong\nwith it? Pst picky people!)  \n\\- Loading screens are quick  \n\\- Love how it connects to my phone and i can facetime and imessage  \n\\- Size is perfect  \n\\- Love how slim and thin it is though I'm sometimes afraid I might drop it\nlol  \n\\- Usb ports/sd card slot (This laptop will forever be Apples BEST laptop. Why\ndid they take basically ALL of the ports off of the Pro's?)  \n\\- Light gaming runs VERY well (for hours) with no problems or restarting &\nresolution is perfect (I play Sims 4)  \n\\- There's enough space  \n\\- Continues to get the latest updates  \n\\- Magnetic charger (also love how the charger light indicates if it's charged\nor not)  \n  \nCons  \nI will say it can be a bit cumbersome to use the pad. I like a traditional\nmouse better, but this is easily resolved by attaching a wireless mouse (which\nI have for this computer - thank you USB port!)  \nIt doesn't have a CD drive (bummer for watching dvds/playing cds)  \n  \nAnyways, there's A LOT that I love about this laptop. I recommend this laptop\nto anyone who is looking for one! Thanks Apple!\n\n", "HEY GUYS.THIS IS THE DETAILED REVIEW OFAPPLE MACBOOK AIR MQD32HN/A ULTRABOOK\n(CORE I5 5TH GEN/8 GB/128 GB SSD/MACOS SIERRA) (IN DEPTH).SO PACK YOUR GEARS\nAND ENJOY IT.....!!!!  \n  \nApple MacBook Air MQD32HN/A Ultrabook (Core i5 5th Gen/8 GB/128 GB SSD/macOS\nSierra) laptop has a display for your daily needs. This laptop is powered by\nprocessor, coupled with 8 GB GB of RAM and has 128 GB SSD storage at this\nprice point. As far as the graphics card is concerned this notebook has\ngraphics card to manage the graphical functions. To keep it alive, it has a\nbattery and weighs .  \nIn June 2017 Apple updated the processor on its 13in MacBook Air from 1.6GHz\nto 1.8GHz - not a massive improvement as the processor is the same generation\nas the MacBook Air used when it was last significantly updated in 2015 - but\nthe MacBook Air remains a great choice for an entry-level Mac laptop.  \n  \nThe MacBook Air is the laptop you see in coffee shops, libraries, offices, and\nstudent digs all over the world. Apple might have forgotten it in favour of\nthe sharper-screened 13in and 15in MacBook Pro and dinkier 12in MacBook, but\nthe masses still love the lightweight, entry-level Air.  \n  \nApple isn’t calling its most recent MacBook Air update a “new” model, but to\ndistinguish it from its otherwise very similar Early-2015 MacBook Air we’ll\ncall it the Mid-2017 MacBook Air.  \n  \nApple hasn’t changed the Air much at all since it wowed the laptop world in\n2010 with its sharp, wedge-shaped case – which still looks great, in our\nopinion. There were some minor processor and port changes in 2015, but since\nthen the only real updates have been upticks on the processor speed and a\nwelcome doubling of the default memory (from 4GB to 8GB).  \n  \nIt’s still available in just the one silvery colour, unlike the 12in MacBook\n(Silver, Space Grey, Gold, or Rose Gold) or 13in or 15in MacBook Pro (Silver\nor Space Grey).  \nMacBook Air 2017: processor, graphics and RAM  \n2017’s changes are limited to the slightly faster processor. Everything else\nremains the same from the most recent 2015 model, which used the same Intel\n“Broadwell” processor as the 2017 Air.  \n  \nMacBook Pro models have used later “Skylake” and most up-to-date “Kaby Lake”\nprocessors, so if you need the fastest speeds from a Mac laptop you should\nlook to the Pro range (from 2.3GHz to 3.6GHz chip speeds).  \n  \nThat said, for most of us, with our browsing, streaming, social and office\nneeds the MacBook Air should be fast enough.  \n  \nThe 2017 model’s Intel Core i5 processor gets a small speed bump from 1.6GHz\nto 1.8GHz. When we’ve speed tested the new Air we’ll let you know what that\ndoes to performance, but we can say for sure that it wouldn’t be worth\nupgrading from the 2015 model to the 2017 Air.  \n  \nIf your Air is older than the 2015 model - and you still love the form factor\n- then an upgrade might be worthwhile. You’ll also get faster graphics (the\n2017 Air uses the same Intel HD Graphics 6000 chip, which replaced the 2014\nAir’s HD Graphics 5000), and 8GB RAM as standard.  \n  \nWhen buying the new Air you can upgrade to a 2.2GHz Intel Core i7 processor.  \n  \nApple also offers a feature called Turbo Boost. In technical terms this over-\nclocks the processor to push to greater speeds. If enough power is available\nand the temperature is at a safe level Turbo Boost will 'over-clock' the core\nand enable it to work faster. The standard 1.8GHz i5 processor can be pushed\nto 2.9GHz. The custom option 2.2GHz i7 processor can reach 3.2GHz via Turbo\nBoost.  \n  \nBasically, you should go for the fastest processor if you want, and if\npossible Turbo Boost will push it as far as it can. But remember that if speed\nis really vital to you, you should look to the MacBook Pro range.  \nMacBook Air 2017: storage  \nThe only difference between the two MacBook Airs you can buy in 2017 is the\nstorage capacity. In the old days we’d have called this the “hard disk” but\nthe Air has always boasted much-faster “solid-state” SDD drives.  \n  \nThe choice you get (as standard) is either 128GB or 256GB, but you can also\ndouble the maximum on-board storage to 512GB for £150 ($200).  \n  \nWe’d recommend you go for as much storage as you can afford if you plan on\nstoring music, images or video. But if your laptop is used mainly for browsing\nand light document work the 128GB should suffice.  \nMacBook Air 2017: ports and slots  \nThe new Air features the same side ports as the 2015 model. You get:  \n  \nTwo USB 3 ports (up to 5Gbps) for the usual peripherals.  \nOne Thunderbolt 2 port (up to 20Gbps) for adding a larger display or faster\nexternal hard drive.  \nMagSafe 2 power port – still the best in our opinion, and much missed on the\nnewer 12in MacBook, which uses its single USB-C (Thunderbolt 3) port for power\nand peripherals, and so requires a £69 ($69) Multiport Adapter if you need\nmore than one at a time.  \nSDXC camera card slot  \n5mm headphone jack  \nIf you have lots of standard USB peripherals then the Air supports these out\nof the box. The MacBook and MacBook Pro models require newer USB-C accessories\nor £19 ($19) adapters.  \n  \nIt boasts the same great 802.11ac Wi-Fi standards (IEEE 802.11a/b/g/n\ncompatible) as the top-of-the-range MacBook Pro.  \nMacBook Air 2017: screen  \nThe MacBook Air’s screen is a 13.3in (diagonal) LED-backlit glossy widescreen\ndisplay with a resolution of 1,440-x-900 pixels and a pixel density of roughly\n128ppi (pixels per inch).  \n  \nIt’s not as crisp and smooth as the Retina screen you’ll find on the MacBook\nor Pro models. http://www.macworld.co.uk/feature/apple/what-retina-hd-display-\nare-they-worth-money-apple-3466732/  \n  \nIn comparison, the 13in Retina MacBook Pro has a 2,560-x-1,600 native\nresolution at 227ppi.  \n  \nThe Air’s display isn’t a bad screen, but Pro users might find it a little\nfuzzy in comparison to the Retina. The Air screen does use less power, though,\nand contributes to the lower overall cost.  \nMacBook Air 2017: price  \nThe MacBook Air is the cheapest new Mac laptop you can buy, starting at\n£949/US$949 for the 128GB model. The 256GB Air is priced at £1,099/$1,199 – so\nyou pay an extra £150/$200 for the larger capacity. Add a further £150/$200\nand you get 512GB of storage in the custom build option.  \n  \nThe 8GB of RAM isn’t upgradeable, but the processor is, as explained above:\npay £135/$150 more for the 2.2GHz i7 processor  \nMacBook Air 2017: installed software and apps  \nYou get a ton of great Apple apps, including the likes of FaceTime for free\nvideo calls with other Apple devices, and the office apps (Numbers\nspreadsheet, Pages page layout, and Keynote presentations), plus photo\narchiving, movie making and music making and listening apps.  \n  \nPhotos; iMovie; GarageBand; Pages; Numbers; Keynote; Siri, Safari; Mail;\nFaceTime; Messages; Maps; Notes; Calendar; Contacts; Reminders; Photo Booth;\nPreview; iTunes; iBooks; App Store; and Time Machine (backup).  \n  \nMacBook Air 2017: specs  \n8GHz dual-core Intel Core i5 processor with 3MB shared L3 cache (Turbo Boost\nup to 2.9GHz); with custom option of 2.2GHz Intel Core i7 processor (Turbo\nBoost up to 3.2GHz).  \n8GB of 1,600MHz LPDDR3 RAM  \n128GB, 256GB or 512GB PCIe-based flash storage  \n3in, 1,440-x-900-pixel display  \nIntel HD Graphics 6000  \n11ac Wi-Fi (IEEE 802.11a/b/g/n compatible); Bluetooth 4.0  \nPorts: 2 x USB 3; 1 x Thunderbolt 2; 1 x SDXC card slot; 1 x 3.5mm headphone\njack  \nStereo speakers  \nDual microphones  \n720p FaceTime HD camera  \nFull-size backlit keyboard with Ambient light sensor, and Multi-Touch trackpad  \n54-watt-hour battery: Up to 12 hours wireless web browsing (claimed)  \nDimensions:  \n  \nHeight: 0.3-1.7cm (0.11-0.68in)  \nWidth: 32.5cm (12.8in)  \nDepth: 22.7cm (8.94in)  \nHeight: 1.35kg (2.96lb)  \nFor buying advice related to the current Apple laptop range, read our Best\nMacBook buying guide and Best cheap MacBook deals articles. You can also see\nour one-stop guide to the best place to buy any Mac.  \n  \nOUR VERDICT  \nThe 13-inch MacBook Air is Apple’s entry-level laptop, starting at £949\n(US$999). It might lack the super-sharp Retina screen of the Macbook and\nMacBook Pro models but its display and performance is fine for most everyday\nuses. It boasts enough USB ports and other slots to make it more useful out of\nthe box than the more limited, USB-C-only 12-inch MacBook or Pro. And its Wi-\nFi is the same high standard as even the top-of-the-range MacBook Pro. If you\nneed raw power go for the Pro. If you need the smallest Mac laptop there is,\nlook at the 12-inch MacBook. But, all in all, despite it not changing much\nyear after year we still love the MacBook Air for its design, price, size and\nfeatures.  \n  \nTHANKS FOR READING THIS FULL ARTICLE FOR FURTHER INFORMATION YOU CAN VISIT ON\nOUR CHANNEL \"TECH HARSH TALKS\" THANKS (ONCE AGAIN).\n\n", "Not exactly the best features within this price range and not the best display\nin today's generation of FHD. But still believe it's worth it when it comes to\nquality, build and responsiveness. And not to forget Apple products last very\nlong and remain new even after years of use. Battery actually lasts about 9\nhours with video streaming, screen brightness is great and keyboard is well\nlit with automatic sensors. Keys are sturdy and the touch pad is as smooth as\n16 year old whiskey. Definitely a good choice for the apple experience at a\npower budget.\n\n", "After drooling over it for last 2 years (and saving for it) I bought it last\nweek. Finally laid my hands on it yesterday when it arrived in stipulated time\nin the immaculate apple packing and superimposed Amazon packing in brand new\nmint condition.  \n  \nFirst thing that struck me- how utterly beautiful it is. Lightweight. Compact\n.  \n  \nGod ! It looks more wonderful in reality than it looks in the pictures. It is\na thing of beauty with a par excellence design - well spaced backlit keys.\nSetting it up was a breeze - took less than 10 minutes and I was ready to go.\nI watched a 5 minute trailer of a Hollywood film and the display quality felt\ndivine (after years and years with my office IBM, Dell, Lenovo etc). Video was\nsuper sharp and colors straight from the rainbow.  \n  \nSound quality was good too. Took some 30 minutes to figure out and get my\noutlook, yahoo and gmail going.  \nOnly con I have noticed so far is the lag. There is a definite time lag in\nopening of apps and execution of commands.  \n  \nI will share more after I spend some more time with it. For now - Ciao.\n\n", "Buy Buy MacBook Air  \nMacBook Air 128GB MacBook Air 256GB  \nPrice ₹ 77,200 MRP ₹ 92,500 MRP  \nDisplay  \n13.3-inch (diagonal) LED-backlit glossy widescreen display with support for\nmillions of colours  \nSupported resolutions: 1440x900 (native), 1280x800, 1152x720 and 1024x640\npixels at 16:10 aspect ratio, and 1024x768 and 800x600 pixels at 4:3 aspect\nratio  \nStorage1  \n128GB PCIe-based SSD  \n256GB PCIe-based SSD  \nProcessor  \n1.8GHz dual-core Intel Core i5, Turbo Boost up to 2.9GHz, with 3MB shared L3\ncache  \nMemory 8GB of 1600MHz LPDDR3 onboard memory  \nBattery and Power2  \nUp to 12 hours wireless web  \nUp to 12 hours iTunes movie playback  \nUp to 30 days standby time  \nBuilt-in 54-watt-hour lithium-polymer battery  \n45W MagSafe 2 Power Adapter with cable management; MagSafe 2 power port  \nSize and Weight  \nHeight: 0.3–1.7 cm (0.11–0.68 inches)  \nWidth: 32.5 cm (12.8 inches)  \nDepth: 22.7 cm (8.94 inches)  \nWeight: 1.35 kg (2.96 pounds)3  \n32.5cm1.7cm  \nGraphics and Video Support  \nIntel HD Graphics 6000  \nDual display and video mirroring: Simultaneously supports full native\nresolution on the built-in display and up to 3840x2160 resolution at 60Hz on\nan external display, both at millions of colours.  \nThunderbolt digital video output  \nNative Mini DisplayPort output  \nDVI output using Mini DisplayPort to DVI Adapter (sold separately)  \nVGA output using Mini DisplayPort to VGA Adapter (sold separately)  \nDual-link DVI output using Mini DisplayPort to Dual-Link DVI Adapter (sold\nseparately)  \nHDMI audio and video output using third-party Mini DisplayPort to HDMI Adapter\n(sold separately)  \nCamera  \n720p FaceTime HD camera  \nConnections and Expansion  \nMagSafe 2USB 3HeadphoneDual mics  \nSDXC cardUSB 3Thunderbolt 2  \nTwo USB 3 ports (up to 5 Gbps)  \nThunderbolt 2 port (up to 20 Gbps)  \nMagSafe 2 power port  \nSDXC card slot  \n3.5mm headphone jack  \nWireless  \n802.11ac Wi-Fi wireless networking; IEEE 802.11a/b/g/n compatible  \nBluetooth 4.0 wireless technology  \nAudio  \nStereo speakers  \nDual microphones  \n3.5mm headphone jack  \nKeyboard and Trackpad  \nFull-sized backlit keyboard with:  \n78 (US) or 79 (ISO) keys, including 12 function keys and four arrow keys\n(inverted “T” arrangement)  \nAmbient light sensor\n\n", "I have been a Macbook pro user for last 2 years. I came across the new Macbook\nair and got a chance to put hands on it. So here is a brief review on my first\nimpressions. Basically i will be comparing this with a regular laptop of\nsimilar price range and Macbook PRO  \n  \nAir benefits compared to Non Apple laptop:  \n# Slim and light weight for daily travel  \n# 10-11 hours battery backup on normal usage  \n# Apple touch pads are awesome, smooth and responsive compared to any premium\nlaptop  \n# Audio quality on speakers is good, but not as loud as my Macbook Pro 13  \n# Apple front camera works the best in low light, best for low light skype\ncalls  \n# SSD - Apps launch very fast despite the low power processor  \n# Metal body construction  \n# Mag safe charger- If you are really careless this helps very much.  \n# Ambient light sensor that adjusts brightness automatically ( Many people are\nnot aware of this feature)  \n# Keep your Air closed or leave somewhere idle and check back after 2 or 3\ndays, you will see battery has dropped less than 3 or 4 %  \n# The best part - Mac OS, contains all that you need, a neat calendar, Todos\napp, notes, Quicktime, Mail app etc. Hassle free OS  \n  \nAir demerits compared to Non Apple laptop:  \n# Performance is on lower side  \n# Good for basic usage only, internet, movies, video calls, spreadsheets, mail  \n# You will get better display(Full HD) if you buy a 999$ Ultrabook from US (In\nIndia they come at premium)  \n  \nShould you consider Macbook PRO? - PRO advantages  \nI know a lot of people might be confused whether to go with PRO for some\nadditional bucks. So listing benefits of pro from my experience  \n  \n# Force touch - More comfortable touch pad, less finger pain compared to\nbuttons on Air, Adjustable pressure  \n# Retina display - More pixels, Better viewing angle. Air is 1440x900 while\nPRO is 2560x1600 pixels  \n# Better performance - Pro CPU is actually about 50% faster than AIR, but in\nreal world tests, apps launch at similar speed in both PRO and Air. The\ndifference is notable only when you run CPU intensive tasks like Programming,\nVideo encoding, Photo editing, Raw conversion etc. Those who are not into this\ncan go with Air and save some money.  \n# Newer CPU - Macbook air has not evolved much compared to PRO. The 2017 Air\nuses the same fifth generation CPU as the previous version (2015). But with a\nlittle upgrade in CPU speed. ie 1.6 GHz to 1.8 GHz. The newer PROs come with\n7th generation Intel processors. The difference is mainly with the energy\nconsumption.  \n# HDMI port - You don't need display port adaptor  \n# New keyboard - The 2016 PRO has the same keyboard as the \"Macbook\". Keys are\nless deeper and more wider. This makes it little more comfortable to type. Air\ncomes with the same old keyboard as 2015 PRO  \n# Wider touch pad - Not a big deal. But if someone loves that, its a bonus  \n# Color options - Yes, Air is only available in Silver, PRO comes in 3 color\noptions  \n  \nIf you think, all the above justifies the price difference between the PRO and\nAir, go for the PRO. The only benefit that Air offers is battery life. PRO\noffers 8-9 hours only, while Air offers, 11-12 hours battery.  \n  \nWhom Air is for?  \nMacbook air is not a gaming machine or for hard core users. Its for people who\nlove to watch lot of movies, work on documents, browse and some basic\nprogramming. When i say programming, Xcode works fine on Macbook air. But\nSoftware like Android studio, Photoshop seems to struggle a little on Air. But\nif you are once in a while user of intensive apps, you can ignore this.  \n  \nI will update my review with more details after a few weeks of hands on\ntesting and usage. If you have any queries leave a comment below. I will try\nto answer in a day or two.\n\n", "Dont buy it . Lots of issues\n\n", "Bad Service  \nAfter 1 month it doesn't start without any problem and then i have to change\nmain power IC.That become very costly.\n\n", "Awareness helps ! The 3 Rs of a seller - Ratings (here 98% positive), Reviews\n(here almost all positive) and Research (continue reading)...  \nAppario Retail Private Limited is a joint venture between Amazon and Patni\nfounders. Not that this should be blindly enough , but enough to mean that if\nAmazon itself is a stakeowner then you can rest assured to get the best in\nclass service and product both in terms of delivery and quality. Further ,\nwith a capital of approx USD $42 million already raised , you’re sure the\nseller isn’t going away in just an year since it’s inception in 2017  \n  \nDelivery and Seller experience - Super delivery by Amazon (Prime). Ordered on\n24th Jan at 4pm and got it the next day at 1pm , thats less than 24 hrs.  \nProduct was well protected and packaged. The actual package was seated atop\nlife jackets type air pockets sleeves all around and under it.  \nBill has the GSTIN number well printed and legible and the serial number is\nsame on the bill and the Mac book and is legit, as Apple’s product\nregistration portal confirmed it.  \n  \nProduct - it’s a MacBook, period. Been just a day but so far its running all\ngood.  \n  \nLikely problem , or maybe not , will have to wait and see -  \n  \n1) The machine was half charged at 53% which is fine , but in less than an\nhours use , it drained 5% . I guess it’s because it was setting itself up and\nsettings up things etc. and maybe after a full drain followed by a full charge\nit’ll begin to hold up better, let’s see.  \n  \n2) Apple portal shows warranty to be valid until 6 Dec 2018, that’s straight 2\nmonths short of the standard 12 month warranty , which would give me until\n23rd Jan 2019 at least !!! I’ll write to Amazon about this.  \n  \nOther than that , a perfect machine ! Thanks Amazon !\n\n", "Same configuration is with Lenovo value of 34k.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 August 2017", "on 16 October 2017", "on 11 October 2017", "on 21 February 2018", "on 11 July 2017", "on 29 August 2017", "on 14 October 2017", "on 14 August 2017", "on 26 January 2018", "on 22 September 2017"], "reviewer": ["SwordFish", "HARSH SHARMA", "sriram", "Vishal Agrawal", "ATUL MAURYA", "Arnav maini", "Amazon Customer", "kiranben", "Gaurav Sharma", "Asim Khan"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["One Star", "Reason To Buy MacAir", "Awesome Lightning Deal...!", "First apple!", "Great Product for Office purpose , Browsing and multimedia viewing.Not for Gamers , Heavy duty programmers", "Amazing ultrabook laptop in the segment", "Happy to have a premium and sophisticated product from Apple", "Thin, Light, and Battery last forever.", "Got STONES instead of LAPTOP please be careful while buying ...", "The booting time is super fast since it works on SSD 5"], "review": ["Trackpad is not good at all\n\n", "Mac air (2017) is decent. No doubt, works very smoothly. If you are going to\nbuy Mac just for uninterrupted day to day work then it would be better to buy\na HP or DELL laptop having similar budget and then installing UBUNTU OS in it\nwith Windows 10 . Ubuntu OS runs pretty smoothly. Also, it would be a better\nchoice than Mac air as they (hp and dell) provide much nicer graphics and\nhigher ROM . Don't just buy because it is an Apple product.\n\n", "Quite Commendable MacBook in 40000/- Only I ordered it on 2am and it was\ndelivered on 3pm Haha..!Prime Customers Seriously A great lightning deal\nThankyou amazon for this..!the device is amazing😘\n\n", "Got MacBook air though costed me little expensive but I feel its worth it.\nPackaging was good\n\n", "It has been almost a year since I purchased it in 2016 . Some of the great\nfeatures that make this Macbook Air the most unique laptop in the world.  \nPros.  \n1\\. Lightweight. well I guess when this Macbook Air was in circulation in 2015\n, there was not a single one as light as this one. Light weight makes it so\neasy to carry even between rooms.  \n  \n2\\. Battery backup . Could easily go for 12 hours if used like a office user (\nDocument processing , we browsing and minimal multimedia usage .  \nCharging takes not more than 1 hour.  \n  \n3\\. Backlit Keyboard , Decent audio on speakers for a laptop of this size and\nweight , excellent audio on headphone.  \n  \n4.Great Trackpad ( One of the most comfortable trackpads normally found in\nMacbooks but not even in expensive Windows laptops )  \n5\\. Boot Time - 5 to 6 secs , Same for Windows installed in Bootcamp\npartition.  \n  \nCons.  \n1\\. I would say expensive especially when it was first released it was about\nRs 80000/- . I bought it for 60000/- . Now available for 45000/-.  \n2\\. Screen not very good . This is more of a problem of Mac OS compatability\nwith a non Retina Screen. I actually has installed Windows 10 with Bootcamp\nand Windows looked great .  \n3\\. Minimal Ports . Although this is like a personal browsing machine a little\nmore sophisticated gadget than a Ipad .  \n  \nThat being said . I think this is a great machine for busy executives who\nwants machine to be active for 14- 15 hours , Wake up time from sleep not more\nthan 1 sec , Boot time not more than 5 secs and very easy and light weight to\ncarry .But this is not a powerhouse not by 2017 standards. Now we have much\nbetter alternatives Like Dell XPS 13 , Asus Zenbook3 , Hp Xpectre 360 and even\nthe 2017 models of Macbook pro - all with i7 processors , 16 GB ram , maybe\nsporting a separate graphics card , All the required ports , Touch screen etc.  \nBut if you already have , this is a great digital companion to have.\n\n", "I've been a strong apple product user since 2011, I've been using a Macbook\nPro since then and I don't need to give a review of the same, as it is worth\nthe money and lives up to its reputation. Till date it is working and is very\ndurable, even after very rough usage.  \n  \nAlbeit, I was looking for an upgrade of RAM and processor, and I was awed by\nthe new macbook pro 2017, with all its magic and tricks, somethings which kept\nme away from a impulse buy was that it lacked USB ports, Magsafe adapter, SD\ncard slot.  \n  \nThese 3 things were available on Macbook Air, and hence I was wavering between\nMBP & MBA, untill the Amazon sale happened, I was a bit late by the time I\nordered the MBA, the actual deal price was at 44,999. But When I ordered it\nwas at 49,999. I still thought it was a decent price, as comparing its $820\npricing in US market. So I am a happy customer.  \n  \nNow about the product:  \nMBA is a super fast, light weight, spec wise awesome laptop, but it is\nstructurally thin and gives a flimsy feeling that I've never felt with other\napple products. Apart from that it works like a charm, you can't game on it.\nBut can almost do everything else on it. The battery backup is a boon.  \n  \nIf you're thinking between MBP and MBA, I would recommend go for MBP, although\nit is expensive and has a few setback. Mainly because of the build. And by no\nmeans does this mean, MBA is cheap or having bad quality, I mean it is\nstructurally not as good as MBP.  \n  \nPros:  \n\\+ Battery  \n\\+ Light weight  \n\\+ Comparatively cheaper  \n\\+ Its Apple, MacOS....etc, etc..  \n  \nCons:  \n\\- Non Retina  \n\\- Flimsy  \n\\- Low storage (128GB - Usable 100 GB only, it gets filled damn fast)  \n\\- Comparatively lower processing power\n\n", "Owning an Apple product is a proud feeling. I was mesmerized after seeing this\nproduct. Highly impressed by its fit and finish.  \nI feel MacbookAir is a perfect device for personal use. Now a days, we use\npersonal laptops majorly for browsing and streaming online contents and\nsometimes documentation of personal stuff. MacbookAir serves this purpose\nbrilliantly. Its core i5 processor is faster and crispier enough to deliver\nthat ultra-fast performance. Sound quality is crystal clear with stereo\neffect. Battery backup is sufficient for a longer sitting.  \nIts light weight and sleek design makes it easy to maneuver anywhere anytime.  \n  \nTotally a value for money product for me.  \nThis trustworthy combo of Apple and Amazon made this purchase (verified on\napple india website) an authentic one.  \n  \nThanks for your patience. Hope this helps.\n\n", "Macbook Air 2017 Specs:  \n  \n* 13.2-inch, 1,440-x-900-pixel display.  \n* 8GHz dual-core Intel Core i5 processor with 3MB shared L3 cache (Turbo Boost up to 2.9GHz).  \n* 8GB of 1,600MHz LPDDR3 RAM, 128GB PCIe-based flash storage.  \n* Intel HD Graphics 6000.  \n* 720p FaceTime HD camera.  \n* Full-size backlit keyboard with Ambient light sensor, and Multi-Touch trackpad.  \n* 54-watt-hour battery.  \n* Stereo speakers, Dual microphones.  \n* Ports: 2 x USB 3; 1 x Thunderbolt 2; 1 x SDXC card slot; 1 x 3.5mm headphone jack.  \n* Weight : 1.35kg.  \n* Operating System : MacOS Sierra.  \n* Connectivity : 802.11ac Wi-Fi networking; IEEE 802.11a/b/g/n compatible; Bluetooth 4.0 wireless technology  \n  \nVerdict:  \n  \n* The design has not changed for the past five years, which is a shame. The MacBook Air's aluminium unibody design, which supports the main enclosure and the display, is as durable as ever and still really light and really well-constructed.  \n* The 2017 model’s Intel Core i5 processor gets a small speed bump from 1.6GHz to 1.8GHz (which can be pushed to 2.9GHz). And uses the same Intel HD Graphics 6000 chip.  \n* We get a Standard 128GB Solid State hard drive which is a good thing, and 8GB LPDDR3 RAM.  \n* The MacBook Air’s screen is a 13.3-inch (diagonal) LED-backlit glossy widescreen display with a resolution of 1,440-x-900 pixels and a pixel density of roughly 128ppi.  \n* Software pre-installed on the Laptop: Photos; iMovie; GarageBand; Pages; Numbers; Keynote; Siri, Safari; Mail; FaceTime; Messages; Maps; Notes; Calendar; Contacts; Reminders; Photo Booth; Preview; iTunes; iBooks; App Store; and Time Machine (backup).  \n* And Finally the best part of MacBook Air 2017 is its battery life, is as good as the previous model or it last longer than the previous ones.  \n  \nIf you are looking for a different OS like this one is from Apple which\noperating system is MacOS Sierra and moving on from Windows operating system\nyou definitely should get this lowest price from Apple. But, if you are coming\nfrom your Old Macbook air (Previous Model) and thinking of upgrading, you\nshould stick with your Old Macbook. Because nothing much changed from the last\nyear model.  \n  \nWhat I really love about this laptop is, it is still the best MacBook Air for\nits design, price, size, and features.\n\n", "Got STONES instead of LAPTOP  \nplease be careful while buying.  \nkindly check the product at the time of delivery itself.\n\n", "Almost all laptops with an 8gb ram is above 45K adding another 10k to buy\nMacBook Air makes absolute sense if you compare the  \n1\\. physical size of the other laptops  \n2\\. If you are in search for a laptop don't skip air before actually going to\nan Apple Store and checking it physically  \n3\\. You can install windows in MacBook Air, from 2016 apple is officially\nsupporting installation of windows in Mac OS via Bootcamp software it comes\npreinstalled and all you have to do is point out the path of windows OS and\ndual boot. And the installation is absolute cakewalk no tech exp needed.  \n4\\. The booting time is super fast since it works on SSD  \n5\\. The resolution is std 1440x900 but the output is crisp and you won't feel\nmuch of a difference until you are familiar with Retina display.  \n6\\. The apple logo on the lid is still a headturner  \n7\\. The keyboard is best in class and is much better than the MacBook Pro, it\nalso have backlit keys which makes better experience during odd working hours.  \n8\\. browsing and reading websites are much better than the windows anyday.  \n9\\. You won't find the need to have a mouse with the multi touch recon keypad.  \n10.YOu will adapt to macOS in less than 15 mins.  \n11\\. The inbuilt speaker is awesome, you will wonder how can this thin device\ncan deliver loud and crisp sound.  \n12\\. Impressed with the charger cable of MacBook its called MagSafe connector,\nit completely avoids the damage to laptop by tripping onto charger cable.  \n  \nCons:  \n128GB storage only, but since I have a 1TB connector and don't store movies\nand songs can use it smoothly with adequate softwares.  \nNo much colours to choose from the only color is silver but the looks are\nclassy\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 September 2017", "on 24 October 2017", "on 22 September 2017", "on 25 September 2017", "on 15 October 2017", "on 25 September 2017", "on 23 September 2017", "on 2 August 2017", "on 29 January 2018", "on 8 October 2017"], "reviewer": ["Satya jit", "Pratik Jeware", "Amazon Customer", "ravi", "sanukindle", "KK", "Hemant", "Toshi Aley", "Amazon Customer", "Roby"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["MAC OS is just awesome, nothing can beat this", "Before jumping on the MacBook Air bandwagon be sure you ...", "The product is awesome. I’m really glad about this purchase", "FAKE FAKE FAKE FAKE FAKE FAKE FAKE FAKE", "Lucky Deal got at INR 44990/-", "Quality Product. Worthy buy!", "It's not so difficult as I thought it'd be", "It's not a laptop but a work of art", "The packaging was excellent, well protected", "just good for daily tasks..not for serious users"], "review": ["I was also in the same catagory who thinks Apple products are costly and\npeople buy for the brand name, trust me my perceptions changed after using\nthis \"solid weapon\", after a long wait and many research I bought this laptop.  \nyou get most slim and stylish laptop in just 50k, MAC OS is just awesome,\nnothing can beat this, performance and style is unmatchable with any other\nlaptop in this price range, most light weight and fastest processor ever I\nused.  \n-If we talk about RAM 4GB is pretty enough for normal official use if you aren't looking for kids job of gaming and all.  \n-Apple i5 processors are even better than being used in any other brands like DELL, HP, LENOVO and others.  \n-Privacy protection makes Apple as one sided winner in this race.  \n-128GB is sufficient if you are looking for professional work or personal use(keep storing movies aside), can easily get 1TB hard disk in just 1-3k for t that there is no sense to buy 256GB version or above  \n-It looks much better than other apple laptops  \n-web camera is better than apple's Retina display variant  \n-2017 model is much improved and advanced  \n-9 hours battery back up that is unbelievable for its competitors, no doubt why apple is the biggest brand and king of this industry  \n-Finally a person who is looking to get a laptop within 60k, undoubtedly go for it if your purpose is browsing and other basic official stuffs\n\n", "Before jumping on the MacBook Air bandwagon be sure you know what you are\ngetting.  \n  \nTrue, the MacBook Air is the sleekest, lightest, and newest laptop available\nfrom Apple but there are considerations to make before buying one. Below are\nsome pros and cons that have surfaced about the MacBook Air:  \n  \nPros:  \n  \nLightweight and extremely thin design 3 lbs  \nLarge 13.3\" LCD  \nFull size keyboard  \nShips with maximum 2gb memory  \nLong battery life 4.5 - 5 hours under \"normal\" conditions  \nInnovative technology allows you to \"share\" DVD drive from networked computers\n(Windows or Mac)  \nPossible Cons:  \n  \nNo built-in Ethernet port  \nWireless only  \nno wired Ethernet for Facilities backups  \nNo removable battery  \nmust be changed by Apple Certified Technician  \nNo built-in DVD drive  \nThin case does not allow for a larger internal hard drive 80gb maximum  \nLack of common ports and connectors  \nOnly 3 connectors available  \nUSB port  \nHeadphone jack  \nmini DVI port for connecting external display  \nRequires use of external devices for additional connections\n\n", "Shipping and delivery were prompt. The product is awesome. I’m really glad\nabout this purchase.\n\n", "Definitely duplicate it stopped working and they said mother board all fake\ninside and old model selling don't buy you will regret for sure\n\n", "Firstly, I got my mac for INR 44990/- from amazon. I got this delivered the\nvery next day I placed my order on amazon prime.  \nFeatures are good and eye catching and the accessories they have provided is\nvery much effective and have a very good look.\n\n", "Good Product. Delivered in 2 days. Light weight, slim, easy to carry. I've\nreplaced my Inspiron with Macbook and it is quite good decision. Since it has\n8GB Ram that is enough for home user and 128 ssd drive might be drawback for\nyou but you can buy external hd accordingly in case of need.\n\n", "I thought it would be so difficult moving from a Windows OS to a Mac OS\nlaptop. I always had in mind I should get a MacBook someday considering how my\nuncles and cousins keep raving about it but somehow never took the plunge. But\nwhen Amazon had an amazing offer on the MacBook Air that too the latest model,\nfor a USD equivalent of 700, I didn't have a reason anymore to not take the\nplunge.  \nContrary to what I thought, it was quite easy to get going. It was so much\nfaster to setup the MacBook than any Windows laptop that I have ever bought. A\nquick search on google and Quora about how to get started on a Mac for a\nforever Windows user and some keyboard shortcuts and cheat sheets for Mac\nbeginners, I was up and running like a pro within a couple of days.  \nNow I'm so used to the speed at which I can browse websites, switch apps,\nforget about ever shutting down the system (I just close the lid), that when I\ngo back to using my windows laptop, I feel it is so primitively slow. Overall\nan excellent buy, just go for it with eyes closed if you are ever on the edge\nof whether to take the plunge.\n\n", "The product is elegant, amazing, durable and light weight. It has i5\nprocessor, 8 GB RAM and 128 GB SSD. It's great for small projects or if any\ntechie is using it as a back up laptop. The battery life is 10+ hours and\naluminum body makes you love it. When people say Apple is overrated , it's\nunderrated. I got it on exchange and even got a 7.5k cashback\n\n", "Got my Macbook Air. The packaging was excellent, well protected. The product\nwas awesome. Everything is fine and I am very much satisfied. :)\n\n", "This macbook is good for daily use like watching movies listening to music or\ninternet surfing. It will not handle heavy task like video editing etc.\noperating system is stable but you will not find application range like\nwindows. Battery is good for first 4 5 days after it is giving me maximum 4\nhours battery for internet surfing and 3 hours on netflix. Buy it if you want\nto use apple product or want introduction to mac. but you can buy better\nwindows laptop at same price.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 January 2018", "on 27 July 2017", "on 2 March 2018", "on 15 October 2017", "on 22 September 2017", "on 21 August 2017", "on 10 October 2017", "on 19 January 2018", "on 7 December 2017", "on 26 October 2017"], "reviewer": ["Shiv", "Pros and cons reviewer", "Amazon Customer", "Shopify", "Dr.kashyap", "Abhishek Sankhla", "Deepakchan", "Amazon Customer", "AMRIT", "vivek patil"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best deal at Rs.39399", "My machine was in excellent condition and only left the house a handful of ...", "Totally Worth It!", "Best laptop for students and office related work.", "Great Product. Full Review.", "Read this to clear any and every doubt regarding macs. Coming from a Windows user!(Updated 02 November 2017)", "Read if you really want to buy MacBook Air 2017", "Bought for 54 k and i am happy", "Worth Every Penny !", "Awesome product, great packing, unbelievable price!!"], "review": ["Got the best price at Rs.39399 . Best deal ever .\n\n", "Don’t buy an Apple MacBook Air (or any Apple product) - don’t believe me, do\nyour own research (I highly encourage it). I bought a brand new Apple MacBook\nAir in March of 2015, fast forward to November 2017 and my MacBook has died.\nMy machine was in excellent condition and only left the house a handful of\ntimes - never dropped it, never spilt anything on it (Guiness Bar confirmed I\ndid nothing wrong as far as they can tell). I’m extremely upset and\ndisappointed with Apple and I’ll be making it known to everyone in my circle.\nHow does such a major hardware component fail in such a short time? How does\nApple not stand behind their products? They want half the price of a brand new\nMBA to fix their faulty product. When I question the quality of their product\nand asked if I had a dud, the response is we never know when this kind of\nstuff will happen or why - based on all the Apple threads, I think that’s a\nlie. They obviously know their products’ logic boards don’t work.  \n  \nWhat’s even more unbelieving, I only bought such an expensive machine because\nan Apple laptop was supposed to be high quality and last for years - what a\njoke! Don’t waste your hard earned money on such a joke of a company.\nObviously, no tech company, Apple included, can figure out how to make a\nquality machine. Even Apple’s cell phones can’t last more than 2 years without\nfailing - I can’t believe people keep giving them so much money. I WAS\nconverting all my technology to Apple products but you better believe that\nisn’t happening anymore - NEVER BUYING AN APPLE PRODUCT AGAIN!!\n\n", "Bought the new MacBook Air 2017 model (released in mid 2017) from Cloutail\nIndia. Fast delivery and amazing packaging. It's my first mac. It's amazing\nand fast! Battery life is superb, but hasn't lived up to its 14 hour claim yet\nso I think mine might be faulty. Charging time isn't amazingly short. Very\neasy to set up and get used to. Beautiful. Worth the money.\n\n", "Excellent laptop and I got this laptop for 45,000. Except screen quality\nbecause Apple is still using 2012 model screen. Every thing in this laptop is\nperfect for a student or office related works. I m giving 5 star for this\nlaptop. Battery backup coming upto 10 hours with one charger.\n\n", "In short, This laptop is really good for Rs. 55,000. First things first, this\nlaptop isn't for gaming (as expected from MacOS). I didn't buy from Amazon but\nyou'll get exact same model and you'll get exact same experience as me. So\nthis review is still useful.  \n  \nIf you want something premium, this is it. It's really light. Every inch of\nthis laptop feels premium. The build quality is just what you would expect\nfrom Apple and that is 'The Best'. The keyboard is also awesome. You really\ncan't find better keyboard and trackpad on any laptop in this price range. For\ncharging, it uses Magsafe which is Apple's magnetic charger which is really\ngood.  \n  \nThat's for the build quality. The software experience is also just great. It\ncomes with macOS Sierra preinstalled. However, you can update it to High\nSierra. If you are coming from Windows, this will be a little difficult to use\nbut once you get the hang of it, you would probably love it. It's just so much\nfluent. And it only get's better with the trackpad gestures. The gestures are\nreally useful like 3 finger swipe to change desktops, 2 fingers to scroll, 3\nfinger and a thumb pinch for Launchpad (Launchpad is like Windows' Start\nMenu), etc.  \n  \nBattery life is just amazing. I was able to get upto 5 hours of coding, 2\nhours of YouTube video playback, and 2 hours of browsing all with a single\ncharge and got still 30% left. It also charges really fast. So that means that\nyou'll have no problem with Battery.  \nThe only thing that's bad is the display. It's a TN panel which means the\nviewing angles are not at all good. If you tilt it a little bit, you will\nstart noticing colour shift. However, the screen is better than lot of other\nlaptops at this price point. Also, this laptop was first announced in 2015, so\nit has old 5th generation i5 but then too, there is no performance issues\nwhatsoever. It will be supported for like more 5 years so you'll be good to\ngo.  \n  \nOne complaint I had that not many of you would have is that it doesn't ship\nwith a thunderbolt to HDMI cable. What that cable does is that it allows you\nto connect your laptop to another display or TV that has a HDMI port and view\nyour display on it. This laptop has that functionality but it doesn't ship\nwith the cable so that's kind of a problem. But anyways, you might not be\ninterested in it. And it is not at all a big thing.\n\n", "NOTE: If the full review is not visible, then click on the review title to\nopen the full review in a new tab.  \n  \nThis is to address all the doubts and misconceptions amongst the windows\n‘POWER USERS’ who are skeptical about shifting to mac. Read this review once\nand I bet you would end up with a deep urge to own this beast.  \n  \nfor the note - I am a computer science engineering student, making visual\neffects and graphic designs is my hobby and I may have used almost any\npower/resource hogging application you can ever think of.  \n  \nNOW TO THE POINT-  \n  \nMISCONCEPTIONS -  \n1\\. Macs are overpriced.  \nWRONG.  \nMacs are not overpriced. You get what you pay for  \n(bear with the uncalled analogy here) if you go and buy a Ferrari, then you\npay the hefty amount for the cost of expensive parts that make up the car, and\na bit for brand name. MACS ARE THE FERRARIS OF THE LAPTOP WORLD.  \nJust pick one up in any apple store and you will agree to agree.  \nIt is not difficult to say that no company today is able to produce what apple\ndoes. They just follow up.  \n  \n2\\. Macs and windows are different/ you cannot use macs if your company uses\nwindows.  \nWRONG.  \nThere are softwares like crossover which run most of the famous windows\nsoftware in Macs without the need to install windows separately.  \nFor those who want to install windows separately, there is a pre installed\napplication called bootcamp, which helps you dual boot the laptop with windows\nand mac. So you can run both mac and windows(one at a time) and the computer\nwill be able to utilise all the resources in running the OS used at that time.\nVirtual machines are also an option but they do not use full resources of the\nlaptop.  \nApple is a hardware AND software company. And just the hardware is enough to\nmesmerise you.  \nand here hardware refers to the RETINA screen, slim and super sturdy build,\nbest battery life and an out of the world trackpad, whose gestures can be\ncontrolled in any way you want using a software called better touch tool. So\nmuch possibilities, sky is the limit. And trust me, unless absolutely\nnecessary, you yourself will not want to go back to windows after using OS X.  \n  \n3\\. Macs cannot run games.  \nFirst of all, you never buy a mac to play games. But if you play occasionally,\nthen it is possible.  \nInbuilt iris graphics(1.5gb) are enough to play any games a casual gamer can\nthink of(that does not mean that you can crank watchdogs at ultra), here\ncasual means casual. Say all ps2 games. I'm rocking Tekken 5 through PCSX2 at\n60 fps.  \n  \n4\\. Macs have wifi problems  \nWRONG.  \nI have only experienced connection drops when my router was bad, and it was\nexperienced in all devices I own, nothing special about macs. And there is\nnothing as WIFI COMPATIBILITY. wifi is wifi. any devices which can catch wifi\nsignals can use wifi as efficiently as others. Also, it catches signals from\nrouters far off from my house, which my nexus 7 can’t catch. So another thumbs\nup.  \n  \n5\\. OS X user interface stutters  \nWRONG.  \nYosemite(which comes pre installed into these devices now) is still in early\nstages of development and Apple rolls out new updates to fix any bugs that may\ncome in the way of the users after installing new os. Just keep your os\nupdated and it will run silky smooth. So any stutter/lag/anomaly you may\nexperience will be due to software which is constantly evolving, there is no\nhardware problem or impotent CPU. Also, if you notice lag only on some\nspecific(and less famous) websites this is because they are not(yet) optimised\nfor retina display and this will only get better in future as apple is\nshifting all of it's devices to retina display.  \n  \n6\\. Macs are less powerful for what they cost  \nWRONG.  \nYou want an example of power? My current cpu usage is 8% and 92% of it is\nsitting idle while I am writing this review in pages(an application like MS\nword for OS X, and it is pre installed, and it is better than word, and it is\nfree) with 3 tabs open in safari and two background applications running(f.lux\nand better touch tool). Windows, beat that!!  \n  \nenough of misconceptions, now some DOUBT CLEARING FOR WINDOWS POWER USERS.  \n  \nDOUBTS -  \n  \n1\\. Are macs good for programming?  \nans- They are the best. Because mac os is based on unix, programming in them\nis just like/even better than programming on a linux machine. Linux is also\nunix based. You can write applications for OS X, IOS, Windows and android in a\nmac, but only for the latter two in windows.  \n  \n2\\. Are macs good for education?  \nans- They are the best. Because there are pre installed applications for\nalmost all the utilities a student would need. The ones I love are\nibooks,itunes U(where you can join courses, specifically for undergraduates),\nilife suite, ability to use 16 different desktops at a time and sliding\nthrough them like a breeze. There is an inbuilt dictionary, when you want to\nlook for the meaning of any word anywhere, just do a three finger tap on the\nword and the meaning in dictionary, in thesaurus, in wikipedia pop up in a\nbox. There is also an application called grapher, which plots 2D and/or 3D\ngraphs of any equation you type in the box provided. There is Magsafe 2 port\nwhich detaches itself from the laptop if a sudden force is applied on the\nwire, but strongly sticks there if you try to pull gently. And trust me on\nthis, you will step on your charging wire. Magsafe comes in handy for that.  \n  \n3\\. Do macs last long?  \nans- If the one you received did not show any signs of manufacturing defect\ninitially, then rest assured that they are going to last as long as the\nhardware becomes obsolete in the long run, only unless you are an unlucky chap\nwith a bad logic board. Treat them well and they will serve you a very very\nlong time. Just buy apple care in the first year and that makes the warranty\nfrom one year to three years(it does not cover battery though)  \n  \nTIPS TO TAKE CARE OF YOUR MAC -  \n  \n1\\. Do not cover the ports and spaces made for fans and keyboard too(if\npossible). These are the places from where heat is dissipated and/or fresh air\nis drawn for cooling. And any hardware which overheats does not last long.\nThat does not mean you cannot cover it, just do not cover the places stated\nabove, that is, do not cover any hole you see.  \n  \n2\\. Clean the dust off the keyboard and ports of fans frequently. That does\nnot mean after every five minutes, but at least thrice a week. It does not\ntake long, but assures longer life for your device.(I do it everyday before\ngoing to bed LOL)  \n  \n3\\. Use a screen protector!! I know retina screens are gorgeous but they are\nultimately going to get scratched(accidentally). Any and every screen\nprotector WILL degrade the screen quality a bit. But it’s something I can live\nwith, decide for yourself.If screen protector is not your thing, then do not\ntouch or let anybody touch or press the screen and clean it regularly.  \n  \n4\\. Silicon keyboard covers while using are a big no no. Apple exec told me\nthis.  \n  \n5\\. Charge the laptop for short durations. Do not drain the battery all the\nway down to 0 from 100. This is bad for your battery. Even though Apple execs\ndo not agree with this, but this is a general rule of thumb for Lithium Ion\nbatteries. Batteries have to die ultimately, but you can slow down the process\nby treating them right.Charge in small splurges and try to keep it above 50%\nwhen possible. Do not think that using the laptop while running on ac supply\nwith full battery will reduce your charge cycles and postpone the battery\ndeath. You are preponing it by doing so. Just like exercise is important for\nhumans, it is for your battery too.  \n  \n6\\. Do not use google chrome, it consumes more battery(see in activity\nmonitor)  \nUse safari instead, it runs better.  \n  \nAnd after spending more than an hour writing this review and recollecting\neverything I think is helpful for new comers to the Apple family, I just want\nto say that take my word for it, YOU CANNOT GO WRONG WITH A MAC. And this\nprice is too tempting. Just pick one up and if you do not like it you can\nreturn it before 10 days of delivery are up. As they say - \u2028ONCE YOU GO MAC,\nYOU NEVER GO BACK  \n  \nUPDATE 14/03/15  \nAbout the screen protector - After using screen protector for a month, I\ndecided to remove it because it added extra glare to the screen which\nsignificantly decreased the screen quality. First it felt like a trade off\nbetween safety and clarity, but then it didn't take long to realize that with\na screen protector you are not enjoying what you paid big bucks for. So rather\nthan protecting it, enjoy it to the fullest.  \n  \nAlso, initially, the retina display appeared to be straining my eyes a bit,\nbut after a few weeks, the eyes adjusted to it and now it feels like reading\non paper, without any strain.  \n  \nUPDATE 02/11/17  \nIt has been almost 2.5 years and I am very happy with my purchase. Also, all\nthe points listed above still hold true today. Hope this helped you guys!\n\n", "I purchased MacBook Air for Rs 44400/- (got 12100+1500 cash back paytm and\nicici at amount of 58000rs) from Paytm. Placed order on 5th of oct 2017 got in\nthree 3 days. Brand new with one year warranty. If you really want to buy\napple, this is a good choice at just 44k.  \n  \nShort Story:-  \nLike most user if you want to have a machine for student life or office work(\ndocumentation, spreadsheets etc), or for surfing net ( fb, Instagram,\nwikipedia, youtube, blogs etc) or watching videos etc or coding Xcode ,\nandroid thing, js crap, python, than this machine is really powerful to handle\nall these stuff. Plus point - if you are a traveller or don’t spent most of\ntime at one place than you have to carry only this machine, no other adapter\nor any other usb hub. It has great build, truly great battery life and all the\nessential ports (not even 2lac MacBook has this level of battery life and it\nentangles you in the web of adapters and adapters and adapters & hubs too)  \n  \nLong story:-  \n  \nAbout Myself: I am 28 years old at the time of writing. I am a windows user\n(and some time linux user) for the past 18 years. It was a really long time\nwith Mr Microsoft. I am a developer (java, android, c++ and other rubbish\nstuff) as well as a pc gamer (Battlefield series, NFS series, GTA series,\nCrysis series and other great stuff).  \n  \nWhat I own right now : I have a really good win lappy. Its from Hp. 15inch, 4\ncore i5 processor, 8gb ram, 2gb GDDR5 nvidia card 512gb ssd, decent battery\nlife on moderate use(around 3-4 hours as of now) cost me some 80-90k INR. It\nis somewhat 3 years old machine and I really love it. I am a proud owner of\nit. I use it for coding, net surfing, gaming , watching movies, checking\nemails etc. And I believe it will continue to be my partner for another 3-4\nyears.  \n  \nWhy I want to buy apple : The time has come when I want to expand my horizon\nin the world of coding and if I want to develop some thing for apple than the\ntool(laptop, desktop etc) has to be, has to be apple.  \n  \nWhy MacBook Air 2017 model : 3 major reasons behind this:- 1. I want to have a\nlappy for coding Xcode etc and surfing net (mostly reading articles, youtube,\nfb) 2. I want to flaunt (people really get impressed if you own an apple\nthing). 3. The lappy must have a glowing apple logo.(ohh That light of\nperfection !) 4. It has to cheap (I don’t earn lots and lots of money).  \n  \nMacBook is a really great laptop. Read all other review to know about its\ngreatness, solid build quality, very thin, very light, truly great battery\nlife. The only 2017 laptop which still has a glowing apple logo( I am kind of\nobsessed about it).  \n  \nSome people complain about its display, but I didn’t felt it bad. It is not\nfantastic but it is still good. Some made noise regarding 128gb ssd but it is\nstill enough to keep all your personal and important things. For movies or\nsongs collection you can but external storage device.  \n  \nRemember : This is not a gaming machine or for video editing and other similar\nworks.\n\n", "Awsome delivery and screen quality i mostly do work on adobe dreamweaver all\nworks superb  \n  \nVideo quality is good\n\n", "Update After 3 weeks of usage :  \nIt is worth every penny. After charging battery fully once, it starts giving\nbackup of 10-11 hours. Do remember to charge it full for few times in the\nbeginning. Boot time is like 5-8 seconds. I am a programmer and I am able to\nrun multiple IDEs at once and it runs without a glitch. Go for it. I tried\nmany windows laptop but this is way ahead than my 1 lakh Dell Latitude Laptop.  \n  \nOld Review  \nI really bought it for better battery life and a handy laptop. But it looks\nlike the battery is little bit of problem here. In my last few days of usage,\nI always have to keep it up on charging and after fully charging it it works\nonly for few hours not 10-11 which is being promised everywhere. I did every\ntest I could and it passed all the test but the battery is draining very fast.\nShall I ask for a replacement?\n\n", "Received the product in 2 days without prime membership. So kudos to Amazon\nfor delivering this product in such short span of time. The packing was neatly\ndone and there was a lot of cushion in the box to keep the laptop safe.  \n  \nThe product itself is great. Checked Apple's website and I had exact warranty\ndates i.e 1 years from the date of purchase.  \n  \nThe only thing I did not like or I would say liked a little lesser about the\nlaptop is it's keyboard. It's plastic keys. Since I have worked on ones with\naluminum this definitely feels a bit off. Though at this price I couldn't\nreally expect for more.  \nThe available space on the 128 GB hard drive is about 100 GB (Usable). I will\nprobably have to buy an external drive for the storage. Although I do think\nthat once I install xcode and the other software i need on this machine there\nwill be hardly much space left on the internal drive.  \nThe OS version is up to date on this machine.  \n  \nThanks a lot Amazon I got this for 43500.!!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 September 2017", "on 19 November 2017", "on 30 August 2017", "on 21 January 2018", "on 19 November 2017", "on 2 November 2017", "on 10 October 2017", "on 6 November 2017", "on 12 November 2017", "on 23 September 2017"], "reviewer": ["Asif Ekbal", "A. Talley", "Shauree G.", "sunil", "Yogesh.m", "Amy", "abhay", "Amandeep Singh", "Sanjay Kumar", "Prashant Kumar"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["APPLE MACBOOK AIR -A Deal-Beaker and the best ever in 43500", "SSD replacement cost 45000/-", "Worth the price", ">> Best Budget PREMIUM Laptop <<", "Really worth the price for the quality.", "The BEAST For Programming and Editing, Super Value, Lightweight, Best Laptop, Definitely Recommended, Love It!", "Very bad", "DONT BUY APPLE PRODUCTS", "Thanks Amazon for delivering in time. The laptop booted ...", "Bought and upgraded to OS high sierra and used for ..."], "review": ["Special thanks to Amazon for making this highly creative innovation of Apple\navailable to us at a very reasonable price. I got this macbook at Rs.\n43500(inclusive of all the discounts) only. Ordered at 12 am on the first day\nsale and get this the next day in the afternoon with no extra cost, thanks to\nits courier and prime service.This is really a deal breaker for all the\nlaptops in this segment . The machine has got everything which a window pc or\nlaptop can do. The condition and packaging of the laptop was very well at the\ntime of delivery.The build quality along with the sleekness is most\nappreciated . It is the most portable laptop I have ever seen so light that\nyou can put it on your lap for hours ,hang it on your shoulders in the bag\nwithout any strain. The display quality is too best in this price segment.The\nkeyboard too suits the best for typing . The functionality and performance is\nat par with any other laptop with the same configuration and is well\noptimised. You can do heavy multi-tasking without any lag. Last but not the\nleast is the battery backup which I GUARANTEE NONE OF THE LAPTOPS EVER HAVE IN\nTHIS SEGMENT could compete with it .It can stand upto 24 hours after moderate\nusage and upto 12 hours after heavy usage.Finally, laptop stands best on all\nthe aspects, only thing that bother me is low storage (128 GB) but that is not\nthe issue considering all the other features and its price point.You can get a\nExternal Hard disk at a nominal cost and use it that will fix this. Being a\nfirst time mac user , I shall not revert to windows anymore and I assure no\none too after using this machine. Also get the Mac OS High Sierra update\ntoday, which adds more joy of having it.This laptop is a best buy and is\nrecommended to all the professionals and student as well . You will not regret\nafter having this purchase . Once again ,I am grateful to amazon along with\napple and all the associated partners for getting this available to me and all\nothers requiring laptop in this time . You people deserved full appreciation\nand that's I gave time to write this review. Hope this help all others who\nwill think of getting the laptop wait for the next sale .......Special request\nto all those who have bought this laptop in the sale , could you please tell\nme in the comment if the keys of the laptop are loose , do they produce the\ntyping sound so that I can get assured with mine.one more how many of you have\nget any flaw for which you have initiated the return of it.\n\n", "Please be cautious, the SSD in the machines in India are giving up too early.\nMine got spoiled in 18 months usage. Replace for new SSD cost is around\n45000/- in Indian service centres. Used SSDs are available for 20k. My\ncolleague's machine lasted for 20 moths. Decide for yourself.  \nCurse me if I discouraged you. Bless me if it serves as wisdom. You may be\nlucky.\n\n", "For amazon- I have been really concerned in the sale if the price would come\ndown, but it didn’t , and suddenly now the price, after sale is lower by 5k.\nIt’s good that amazon wants to retain a huge customer back up, but the\nbenefits of sale should be given correctly.  \n  \nI have been a windows user since the past 12 years and I was very skeptic\nabout moving to Mac OS, though I’m an iPad and an iPhone user, and I know how\ngood products apple gives.  \nThe specs, after all it’s 5th gen and the low storage was the concern and a\ncomplete change of dynamic in the OS as well.  \nBut as I’m writing today, I would want to say that I’m more than happy in\nusing Mac.  \nThough only 5th gen, but the hardware software compatibility that apple\nprovides, undoubtedly is the best, and is visible in every sense. All of my\ndevices are now integrated in a complete manner and the Mac OS is so snappy,\nthat there’s not even a blink of doubt if I made the correct decision or not .  \nYes, they do not provide MS office, but you can look through YouTube and find\nmany links who would give you MS office 2016 for free.  \n  \nPros:  \n\\- Exceptionally light weight  \n\\- No noise at all, because of ssd  \n\\- Ssd one of the major advantages as the boot time is only 2-3 seconds.  \n\\- Exceptional battery  \n\\- Ambient light sensors  \n\\- The best track pad among any of the premium laptops in smoothness as well\nas the tonnes of gestures provided by the OS  \n\\- MagSafe charger allowing it to charge in less than 2 hours, and a great\nstandby battery  \n  \nCons:  \n  \n\\- For people who are really interested in watching movies and storing them,\nan issue, box of the limited SSD storage.  \n\\- screen not full hd, maybe an issue to people who really care about the same  \n\\- price, but when offers are there, definitely go for it\n\n", "I buy this one on this Diwali at a discount price of 50k. The RetailNet was\nthe seller and their packaging and delivery were good. After using this one\nfor almost one month I decided to write a Review of this product.  \n  \nLets Talk about its Pros & Cons:  \n  \nPros:  \n  \n1) The best battery life I ever saw on a laptop. I am a software developer and\nthis laptop clearly gives me 8-9 hours of battery life on continuous web\nsurfing in chrome and programming. Really impressed and I only need to charge\nit at morning and it last all day. The charging time was also good 1.5 hours\nfrom 20-100%.  \n  \n2) The beautiful Smooth Aluminum premium built quality. The laptop is very\nthin and lightweight. No Heating at all.  \n  \n3) The best track pad and gestures. The 3 finger to drag and drop was a hidden\nfeature but it is definitely recommended to turn on. The Keyboard was also\ngood.  \n  \n4) Very fast booting ie 10 seconds. The application opening time was also fast\nfor example after boot when I click chrome it open in split seconds.\nPreviously when I am using windows laptop with SSHD it takes at least 5\nseconds to open the applications after boot. I am impressed with the\nperformance of SSD.  \n  \n5) The front Camera quality is really good for video calling.  \n  \nCons:  \n  \n1) No direct support for NTFS formatted external hard disk. The free solution\nis Mounty.  \n  \n2) The os is not as user-friendly as windows. Please note that it is my\npersonal opinion. In Windows, we can minimize and maximize application by\nclicking on icons in Taskbar. The file manager is also more user-friendly in\nwindows ie enter to open files and back key to move back etc. The cut copy and\npaste shortcuts also different. Remember these are not big deals and you will\nget used to it in a week.  \n  \nFinal Verdict  \n  \nAnyway, in my opinion, it is the best laptop you can buy for this price range.\nThe performance and battery life were awesome and the display was not bad as\nothers say. The display was good and bright and colour production is also good\nbut it's clarity loss on side angles. This product is shipped with Mac Os\nSierra and you can easily upgrade to High Sierra. It is a 6 gb download and\nwill take 1 hour to install. But there will not be any crashing or problems\nduring installation.\n\n", "Awesome laptop. Super slim. Great battery. Great screen. Working for hours\ndoes not harm the eyes, for some reason the low resolution screen seems very\nbeneficial for eyes and long hours of work. Reading text and viewing\nmovies/pictures both seem good and comfortable. I bought it during the sale\nfor 44K. Ordered at 6 AM in the morning. Got it delivered by 7 PM in the\nevening. Same day delivery. Flawless service. Best laptop that I have seen and\nused since last 25 years. I like Windows. So immediately I installed Windows\nalso in a separate partition. I have now both MacOS and Windows running on\nMacBook Air. MacOS is best for non-techie people. Amazing multi-touch\ntrackpad. Keyboard with adjustable backlight is great. 128GB SSD memory makes\nboth Windows and MacOS run very fast. I have also installed Visual Studio, SQL\nServer on Windows side. Performs very well. No issues at all even for coding\nwork and resource hungry Visual Studio. Apple is great after all.\n\n", "\n\n I am always a Windows guy since 2002. Playing games, doing programming,\nwatching movies, downloading stuff, etc. etc... all was done in Windows. Since\n2014, when I moved from business to programming skill I decided to go with the\nApple Laptop, but I always stand by because of the high Apple prices.  \n  \nMy friend has MacBook pro because he used to do editing stuff, but my purpose\nof buying MacBook Air is for programming only.  \n  \nMy HP Laptop which I had bought in the year 2010 now finally sold in OLX in\nright price and at that amount I have purchased MacBook Air 2018 Edition 💻 in\nOCT 2017, my Diwali presents 🙂 at a huge discounted price.  \n  \nTo be honest, I moved from Hackintosh To Macintosh 😁 . I have written some PRO\nTIPS.  \n  \n========================  \n❤️ Description: ❤️  \n  \nApple switched the 1.6GHz in 2017 model to 1.8GHz in 2018 model is the\nBroadwell processor from 2014-2015. Apple also updated the RAM from 4GB to 8GB\nas standard, and this is what Apple has updated on 2018 model. I got the\nlaptop on Brand new sealed packaged by Apple MacBook Air 13.3\" with the lovely\nbox inside which contains laptop along with power adapter, Apple stickers, and\nmanual guides.  \nApple preinstalled the Sierra OS after then you should update to the latest\nversion from the app store for free.  \n  \n========================  \n💎💎💎 PRO TIPS: 💎💎💎  \n  \n💡 BATTERY💡 - PLEASE PAY ATTENTION HERE – This is one of the best technology I\nfound Lithium battery. Likewise, in Windows Laptop, we required unplugging the\npower immediately when it reached to 100% due to overcharged it started to\nreduce your battery life, BUT in MacBook, due to Lithium polymer batteries,\nthere is no need to calibrate your MacBook battery providing it is post-2009\nas they come pre-calibrated. This means you do not need to drain your battery\nand charge it back up again. In fact, it will hurt your battery more.  \nSecond of all, plug your MacBook whenever possible. The lower the battery\ncycles – the better. Try not to let your battery % down to below 30%.it will\ndo more harm than good… Long story short, just plug it in whenever you can!\nThere is the lots of debate regarding this, but you can search more on Google.  \n  \n💡 SCROLLING SPEED💡 - Sierra does not have a smooth scrolling like in Yosemite,\nthis is one disappointed point, to get smooth scrolling you can download the\napp \"Smooze Mac,\" price is also very low at Rs324 only.  \n  \n💡 HIGH SIERRA💡 - Please don't update your OS to high sierra, it is not yet\nstable and having some issues. Better to stay on default OS \"Sierra.\"  \n  \n========================  \n🎉🎉🎉 Pros: 🎉🎉🎉  \n  \n👍 KEYBOARD - Smooth chiclet keys with Backlit. Backlit can be control through\nfunction keys and our lovely bright Apple logo on the backside of the screen.  \n  \n👍 TRACKPAD - Awesome trackpad with multi-touch gestures, entirely different\nstyle than Windows laptop.  \n  \n👍 KEYS => Total 12 function keys including Brightness, backlit, multimedia.  \n  \n👍 BATTERY => Everyone saying battery life is 12 hours but only when you leave\nthe laptop in idle mode or writing documents in the word which doesn't consume\nmemory, I worked with 3-4 chrome tabs, programming apps which consume memory\nand then complete battery backup I got is 7-8 hours only. It takes just 45-60\nmin for fully charged.  \n  \n👍 SSD => The name itself said it all. I came from Windows laptop which had a\nnormal HDD to SSD Apple laptop, and the speed is awesome, Boot takes only 5-10\nseconds, unbelievable. Only 128GB data but you get 98GB because the rest of\nthe OS and other preinstalled apps installed.  \n  \n👍 SCREEN - I have seen lots of HIGH TECH people complain about screen quality\nand pixels issue, but I haven't seen anything so far, however, if they are\ncomparing to retina display with this one then I can't say anything more.  \n  \n👍 PROTECTION - It doesn't get hot or overheat, you can keep it without\nrequired cooling stand, this is what I want. Fan is entirely silent, and you\ncan't even think this laptop has any fan inside :D  \n  \n👍 ADAPTER - It has a MagSafe magnetic power connector, I like the sound \"tuck\"\nwhen I connect to the laptop. The most advantage I found on this if you\naccidentally pull out the wire forcefully the adapter smoothly removed it from\nthe laptop without dropping the laptop like in Windows laptop. It also comes\nwith both 2 and 3 pin power plug, good for traveling.  \n  \n👍 COMPONENTS - It has two USB 3.0 ports, Thunderbolt 2, Headphone, SD card\nslot and dual mics support.  \n  \n👍 WEIGHT - It is so lightweight, and only 2kg compare to my previous 5.5kg\nlaptop. It is so slim. I am always scared of dropping it lol...  \n  \n👍 ANTIVIRUS - Mac is a Unix based OS, as a UNIX-based OS macOS is sandboxed,\nit doesn't really get viruses, it is robust way to find the entrance of the\nvirus until you do something very suspicious,  \nso no expenses on Antivirus but if you are still worried you can go for free\nantiviruses like Avast, Malwarebytes, ClaimXav, and Sophos.  \n  \n👍 EDITING - I tried Photoshop and Lightroom for editing and it goes very\nsmooth, so it will also work on After Effects and FCP.  \n  \n👍 PROGRAMMING - My background is computer science, so I bought this laptop for\nprogramming. I am using Android Studio, Xcode, Visual Studio, it is still a\nfast especially Android studio, unbelievable output, I always give A+ for\nediting and programming.  \n  \n👍 SPEAKERS – It is crispy, clear and loud.  \n  \n👍 CAMERA – It has a 720p FaceTime HD camera, I do not use such feature so I\ncannot say much about the in-depth details.  \n  \n👍 BLUETOOTH – It connects my Logitech K380 and Logitech M235 both Bluetooth\ndevice instantly without installing any driver. I also tried Bluetooth\nheadphone, and it connects as well.  \n  \n👍 EXTERNAL – I connected AOC monitor from Thunderbolt to VGA adapter to extend\nthe display, suitable for my job.  \n  \n👍 SUPPORT – It comes with one-year international warranty including online\nsupport and one year Apple protection plan.  \n  \n👍 GAMING - Sorry, I don't play games on Mac, I have a monster desktop to\nfulfill my requirement lol. I have seen most of the modern games run smoothly\non MAC but to be noted. MacBook is not for gaming purpose.  \n  \n👍 BUY ONLINE – Showroom price is 15k more than online pricing, and they\nstarted arguing about the duplicate/counterfeit parts, but this is not true,\nAmazon price is very low, and you save more bucks with warranty.  \n  \n========================  \n😞😞😞 Cons: 😞😞😞  \n  \n👎 Only 128GB SSD is not enough, and I need to attach external HDD to store\ndata.  \n👎 No CD drive so have to use the pen drive.  \n👎 No HDMI port, have to use Thunderbolt to HDMI adapter  \n👎 No Internet on-off function key, have to use default OS.  \n👎 The first word is \"i\" so every accessory for it is expensive, better is to\nfind third-party accessories to save bucks.  \n👎 Apple Protection Plan is along cost Rs15000-18000k for two years for MacBook\nAir.  \n  \nHave any questions regarding the MacBook Air, ask me. 👍\n\n", "My product is not working, what do I do ? I have paid everything! This is very\nvery bad .\n\n", "Don't buy products online. It stopped working within a year and the great\n\"APPLE\" says we don't cover the issue in warranty. Prefer buying other laptops\nas anyways the customer service in India for Apple products is pathetic.\n\n", "Update: Amazon/Cloudtail replaced the faulty Mac with new laptop and it is\nworking fine. Thanks for great customer service by Amazon.  \n  \nThanks Amazon for delivering in time. The laptop booted well in the first\ntime, then onward (same day), it stopped working (not booting to the OS). I\ncalled Apple's customer care and after countless hours with Apple's service\nagent over phone, they concluded that the hardware is faulty. I immediately\nrequested Amazon for the replacement. Now waiting for the replacement.\nInterestingly, Apple claimed that Amazon is not official partner of Apple to\nsale MacBook or iPad. They also claimed that there might be internal hardware\ndamage due to mishandling at Amazon's warehouse. I am really baffled with\nApple's response.\n\n", "Bought and upgraded to OS high sierra and used for 2 days and yesterday\nupdated the software through apple store, immediately OS got corrupted and\nlater contacted apple support chat and it was of no use. Have left in the\nservice centre today. Don't know what will be the fate. OS high sierra is not\nreliable.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 September 2017", "on 16 October 2017", "on 9 October 2017", "on 15 January 2018", "on 26 September 2017", "on 14 July 2017", "on 11 March 2018", "on 2 September 2017", "on 21 October 2017", "on 8 October 2017"], "reviewer": ["Abu Alam", "Sandy's Studio", "Amazon Customer", "Priyankar Dz", "Gokul", "🌟🌟🌟  Chandra K Bakshi 🌟🌟🌟", "Amazon Customer", "Surbhi", "Archan Paul", "Ganeshram"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Awesome its with a new upgraded processor of latest gen ...", "The Best Laptop in below 50k budget in India", "Screen lid seems loose.  Can anyone confirm the same.", "Good Product | Missing Price Protection", "Delivery was excellent. I was using Dell laptop before this", "MacBook Air is awesome", "Excellent Product | Worth Every Single Penny.", "Best for business purposes.", "It's a deal of the year! It doesn't get better than this", "A nice MacBook with great performance."], "review": ["Awesome its with a new upgraded processor of latest gen as shown on apple\nwebsite all the specs match. Got it for very less here on great indian sale.\nWonderful seller ! cheers ! Absolutely worth it !\n\n", "Apple Macbook Air 2017 has been one of the hottest selling item on The Great\nIndian Amazon sale this year.  \nAwesome system configuration at a price of Rs.44990 with extra 1500 off on\nyour HDFC bank credit card.  \nBest deal, ultimate customer service, reliability and good price.\n\n", "Product is great. But hinge(screen lid) on my macbook air seems loose, if i\npick up my MBA too quickly the lid will also flip wide open. Otherwise it\nstays where it is. Can anyone confirm this thing.\n\n", "Good product. Sweet and simple looks, performance as expected. No issues with\nthe product.  \n  \nDisappointed to see the price has been slashed down from ₹55,400/- to\n₹44,990/- within few days and loyal customers don't get any sort of protection\nfor these drastic changes!\n\n", "Delivery was excellent. I was using Dell laptop before this, being a lawyer I\nwas extensively using M.S word and excel, after purchase for about few days it\nwas not easy to understand the pages and numbers with the hectic work which we\nneed to handle, however as the day progressed it was ease and helpful since I\nhad invested in the apple eco-system. But still word and excel are widely used\nand I need to convert before sending it to my clients. Though their is a\nexport option but still the exported docs file are not compatible fully with\nwidows laptop, for instance if you are using the track change option the\ndeleted sentence/mark up does to appear in the exported docs and still there\nare few other issues like this. Printers we use will not be compatible with\nthe apple software and their updates in the beginning and we need to run\naround to print documents till the printer release the update. But there are\nmany advantages of MacBook which includes battery back up + you can easily\ncarry multi task + advantage if you have invested in apple eco system + light\nweight + easy to move + premium look + till now I haven't seen any slow or\nvirus issue (used for 3 months) + apps advantage + advantage of iCloud (if you\nare using it) + good for eyes (but I need to keep 13 inch much closure\ncompared to my earlier 15 inch dell laptop). I continue to enjoy this new\nproduct of mine.... hope this review helps you in understanding more about the\nproduct, ignore spell and grammar\n\n", "I like this ###  \nI like to use apple products so i picked MacBook Air and used. The  \nMacBook Air is last up to 12 hours between charges , you can work unplugged.\nThe ssd storage in MacBook Air is up to 7x faster than a 5400 rpm in notebook\nhard drive.  \nSo from your morning coffee to your evening commute, you can work unplugged.\nWhen it’s time to kick back and relax, you can get up to 12 hours of iTunes\nmovie playback. And with up to 30 days of standby time, you can go away for\nweeks and pick up where you left off.Whatever the task, fifth-generation Intel\nCore i5 and i7 processors with Intel HD Graphics 6000 are up to it. From\nediting photos to browsing the web, everything happens ultra-fast. And all\nthat power is encased in an incredibly thin 1.7-centimetre unibody design that\nweighs only 1.35 kilos.Instantly connect to an 802.11ac base station —\nincluding AirPort Extreme or AirPort Time Capsule — and experience wireless\nperformance up to three times faster than the previous Wi-Fi generation.\n802.11ac also delivers expanded range, so you can work more freely than\never.macOS is the operating system that powers everything you do on a Mac.\nmacOS High Sierra brings new forward‑looking technologies and enhanced\nfeatures to your Mac. It’s macOS at its highest level yet.  \nFeatures & details:  \nAll new 2017 Apple MacBook Air  \n1.8GHz Intel Core i5 processor  \n8GB LPDDR3 RAM, 128GB Solid State hard drive  \n13.3-inch screen, Intel HD Graphics 6000  \nMacOS Sierra operating system  \n1.35kg laptop  \n1440x900 pixels per inch with support for millions of colors, 720p FaceTime HD\ncamera  \n1 year warranty from manufacturer from date of purchase\n\n", "What a brilliant Build Quality.This is my first Mac Laptop and I am in love\nwith this product.  \nPackaging was great and safe.Delivered on the second day of the order.  \n  \nLet's Talk about product.  \nPros  \n\\- Excellent Build Quality  \n\\- Very good speed for normal use.  \n\\- Very Light weight but premium look  \n\\- 10-12 Hours of battery life.  \n\\- Portability  \n\\- Display quality is Excellent  \n\\- Backlit keyboard  \n  \nCons  \n\\- viewing angles are not good.  \n  \nOtherwise product is excellent and worth every single penny.\n\n", "Pros  \nmost affordable apple laptop.  \nlight weight.  \nNo heating issues.  \nSeemless multitasking.  \nSmooth Rendering.  \nCharges up really fast.  \nbest battery that I've seen on a laptop this thin. It gives minimum of 10\nhours of average usage.  \n  \nCons  \ndisplay isn't retina.  \ncpu is i5(5th gen) not a kaby lake(7th gen) as of 2017  \nviewing angles are bad(not that bad)  \nstorage is less 128gigs. you definitely need an external hard drive.  \n  \nP.S  \nFor some people macOs is might be unusual, as most users have windows Os by\ndefault, but I dont feel this as a con.\n\n", "Wow!! It was a deal breaker getting a MacBook Air for 45k where in it starts\nfor at 999$ in USA.  \n  \nThe MacBook Air runs mostly cool and silent. The aluminium-body design is very\nattractive.  \n  \nIt has pretty neat hardware. It uses a fast Core i5 processor and has 8GB RAM.\nThe SSD in it makes all the difference in the speed, even though storage is\nlimited to 128GB in the entry-level variant. The 13-inch screen is big enough\nand although it is not \"retina display\", it is still one of the best in its\nclass.\n\n", "Apple MacBook Air MQD32HN/A Ultrabook, the laptop is a true amalgamation of\noutstanding features and stylish look. It offers a user-friendly platform,\ngreat performance capabilities and wide range of other latest specifications\nthat make this laptop a good choice to purchase.  \n  \n>> Good Battery backup  \n  \n>> Slim and lightweight  \n  \n>> Great performance  \n  \n>> It comes Stereo Speakers. The laptop harbors 128GB SSD storage, that's up\nto 17 times faster than standard 5400rpm standard HDD storage, this along with\nits powerful configuration makes this device much faster. On the connectivity\nfront, the options present in this MacBook includes Wi-Fi 802.11 a/b/g/n/ac,\nBluetooth 4.1, an SD card reader, two USB 3.0 slots, a microphone jack and a\nheadphone jack.  \n  \n>> The MacBook packs a FaceTime HD webcam of 480p resolution, that allows it\nto showcase you in a much better way during video calls and also take good\nphotos. The laptop contains a Standard Notebook Keyboard and a touchpad. The\nlaptop is powered by a Li-Po battery that can keep this laptop running for as\nlong as 12 hours.  \n  \n>> This laptop features a 13.3-inch LED-backlit glossy widescreen display\nhaving a resolution of 1,440 x 900 pixels. It comes in a silver coloured body\nthat weighs 1.3kgs. The MacBook sails on macOS Sierra of 64-bit architecture\noperating system. At the heart, the laptop is fitted with a 1.8Ghz Intel Core\ni5-6200U 5th generation processor along with 8GB LPDDR3 RAM, which ensures\nthat the laptop delivers amazingly fast and smooth performance. It also houses\nIntel HD 6000 graphics processor that ensures lag free performance while doing\nsome tough graphics related tasks or playing high-resolution games.  \n  \nOverall Great product, everything is just awesome…………\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 October 2017", "on 22 September 2017", "on 1 October 2017", "on 21 September 2017", "on 5 December 2017", "on 6 March 2018", "on 12 November 2017", "on 6 October 2017", "on 24 September 2017", "on 23 January 2018"], "reviewer": ["Chandan.M.Jain", "TheMGuy", "Amazon Customer", "ARINDAM C.", "Hemanth", "Yuvraj Singh Gill", "ROHIT BHATIA", "Patrick P.", "Satyajeet Bayaram", "Shefali Sharma"]}
]