[
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Always awesome that's Apple(Quality).", "Five Stars", "The machine is fantastic, meeting all the requirements of a pro", "Awesome!! You can not compare Apple with any ...", "Five Stars", "upgradable ssd and nice keyboard. Works really smooth", "Paisa Wasool", "charger heat issues", "Product is awesome.", "Three Stars"], "review": ["Excellent deal from Amazon, As usual excellent quality from Apple (Brand)..\n\n", "affordable at this price... can never imagine getting apple products for such\ndeal offers at any apple stores\n\n", "The machine is fantastic, meeting all the requirements of a pro. The seller\nshould be more transparent while forwarding the GST invoice.\n\n", "Awesome !! You can not compare Apple with any other laptop in quality.\n\n", "greatest\n\n", "Latest MacBook with Card reader, standard usb ports, upgradable ssd and nice\nkeyboard. Works really smooth. Nice battery life. Awesome OS.\n\n", "The Beast of all laptops. Only suggestion to all buyer, please only buy from\n\"Cloudtail India Pvt Ltd seller for genuine product.\n\n", "Faced charger heat issues\n\n", "Product is awesome and worth the price , though will get back with more\ndetailed review later.\n\n", "good\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 January 2018", "on 14 December 2017", "on 16 November 2017", "on 14 December 2017", "on 4 February 2018", "on 19 October 2017", "on 14 October 2017", "on 4 December 2017", "on 2 October 2017", "on 23 November 2017"], "reviewer": ["Arun", "Thara", "K N Singh", "Sandeep Mahajan", "Sumit", "Atul S.", "Amazon Customer", "Bhauraj", "pravindodia", "thulasi"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Five Stars", "Five Stars", "No worth at all, after using your products we ...", "Good", "Mac is the best laptop work.", "Everything you'd expect from a MacBook Pro.", "Its just Apple!", "Awesome Mac book pro ...", "Worth the trust"], "review": ["I sold my soul to Satan and now I can macbook pro.. Thanks apple\n\n", "Excellent macbook, best buy :)\n\n", "Wonderfull\n\n", "No worth at all, after using your products we do not even get the replacement\nparts and my investment of Rs.1,46,000/- is completely wasted\n\n", "Good\n\n", "After a month of heavy usage there is no question the Mac is the champion\nproduct in laptops. To those who would want to argue I have spent enough\namount of time barely getting windows/linux to work 10% of the productivity\nthat I get from my Mac. The price is well worth the gains.\n\n", "It's an absolute workhorse and can handle quite a bit (I run three browsers +\nSketch/Illustrator + Spotify/iTunes all at once – don't ask why).\n\n", "Please stop comparing MacBooks to Windows laptops. Its not that they are bad,\nthere are good Win Laptops, its just that they are not consistent. Apple is\ngreat because of its consistency and its ecosystem.  \nAlso stop saying its expensive, you get what you pay for. And don't buy a Mac\nto play games.\n\n", "Simply go for it , cost is little too high n hard disk is just 256 gb , other\nthan that this is very good . Love it ...\n\n", "Loved it. Great service. Great prices. MacBook is MacBook after all.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 October 2017", "on 1 April 2017", "on 30 November 2017", "on 4 August 2017", "on 24 November 2017", "on 26 July 2016", "on 1 December 2016", "on 1 July 2016", "on 11 October 2016", "on 1 December 2016"], "reviewer": ["navin ghodeswwr", "chetan", "Chandan Kumar Singha Roy", "Shrinidhi Maru", "Guru Prasad", "Your Average Customer", "SB", "Sakthi Subramaniam", "Amazon Customer", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Read this to clear any and every doubt regarding macs. Coming from a Windows user!(Updated 02 November 2017)", "Powerful, Perfect, and Beautiful. Just get this Macbook Pro!", "Review After 1.2yr of use", "MY EXPERIENCE", "GREAT DEVICE , THIS IS MADE OF ALL ,DEVICE ...READ THIS REVIEW BEFORE PURCHASING", "Masterpiece by Apple", "Costly affair, but worth every penny spent!!", "Best MacBook Ever till now", "Better value than the latest model!", "PLEASE DO NOT BUY - DONT GAMBLE THIS HUGE AMOUNT"], "review": ["Read this to clear any and every doubt regarding macs. Coming from a Windows\nuser!(Updated 02 November 2017)\n\n", "I recently purchased this MacBook Pro to replace a 2011 year model and oh wow,\nwhat a difference! The screen is certainly the best reason to upgrade in case\nyou are contemplating on doing this. With my old Macbook Pro I had to have the\nscreen at a particular angle to see the picture properly or to see colors\nproperly. Not so with this model. No matter how you have your screen angled,\nyou will see the picture accurately and it looks awesome.  \n  \nI am a web designer and programmer by profession and it's very important to me\nto have a really good screen. The 15.4 inch size is wonderful and large enough\nto do my job right. Any smaller and I would feel cramped probably. I do my\nmain work on my 27\" iMac when it comes to doing graphic design work or\ndevelopment but just for doing maintenance and upgrades on websites, using\nWordpress for example, I enjoy sitting on my couch with this laptop instead of\nat my desk.  \n  \nThe trackpad is simply awesome as well. Yesterday I had to fix something on my\nneighbor's laptop, a Dell, and I got so frustrated because I'm so used to the\nMacbook's trackpad. On this PC laptop you couldn't click anywhere on the\ntrackpad, only on the very bottom. Nor could I scroll up and down easily with\nthat thing. With the Macbook trackpad you can use multiple finger gestures,\nfor example just use two fingers simultaneously to scroll up or down. That is\nso much more intuitive than that PC's trackpad. For that reason alone I would\nswitch from PC to a Mac. Not even mentioning working with Windows 10 versus OS\nEl Capitan. Who are these Windows developers anyway that can't make anything\nstraight forward?  \n  \nNow, I was very pleased that my new laptop already came with 16GB RAM. Most\nlaptops still come with only 8GB of RAM. I have 32GB on my iMac but I can't\nsay it's any faster than my new MacBook Pro.  \n  \nI have no negative comments on my Macbook Pro. Maybe it would have been nice\nto have a touch screen as well, but I'm okay without that because I own the\niPad Pro 12.9\" as well. You may wonder why I also got the MacBook Pro if I\nalready own the big iPad. The answer is: there are still many things that I\ndo, especially with my work, that are done easier on a real computer, but not\nnecessarily by having to sit in my office.  \n  \nBTW if you are comparing or debating between a Windows touch screen laptop\nwith a Macbook Pro without a touch screen. I will still recommend the Macbook\nPro hands down!!! If quality and ease of use is important to you, there is no\nother choice.  \n  \nI use the iMac for creating and developing. I use my Macbook for personal\nthings and for simple updates and maintenance on websites. I use my iPad Pro\nfor entertainment, playing games, browsing amazon, traveling and much more. I\nlove having exactly the right type of device when and where I need it.  \n  \nI know this Macbook Pro doesn't come cheap. But think of it as making a good\ninvestment. Macbook laptops last longer, hold better resale value, are of\nextremely good quality, and will never let you down. Using the OS operating\nsystem is a breeze.  \n  \nA quick story to end my review. A month ago a friend of mine who owned a\nLenovo laptop asked me to erase data from her laptop. I thought, no big deal\nbecause how hard can it be? Well, it took me all day, just about. Of course\nnot being used to Windows 10 didn't help, but in order to perform certain\nactions, I had to go all over the place on the computer to do them and often\nthe screen would freeze on me (something that never happens on my iMac or\nMacbook). Nothing was straight forward. I kept having to ask Google how to do\nthe simplest of tasks and the answers were always complicated. You'd think the\ncontrol panel could handle all my requests but no, the Windows control panel\nis nothing like Settings or Preferences on an Apple device. About the quality\nof that Lenovo laptop itself. The screen wasn't half bad, I admit, but the\nkeyboard was AWFUL!!!!!! Each time I pressed on a key, the entire keyboard\nmoved down with it... it had a very plasticky and cheap feel.  \n  \nGet a Macbook Pro if you're in the market for a laptop. Even if you're coming\nfrom a Windows device. The transition isn't all that bad. If you own an older\nmodel of the Macbook Pro, I highly recommend upgrading because the screen will\nblow you away and the speed of this laptop is unsurpassed.  \n  \nTip: it's a really good idea to get a case for this beautiful laptop. I did\nand it's fantastic. It was very easy to put on and it looks really cool!  \n  \nSo what are you waiting for? Take it from a professional. Just get this\nMacbook Pro!\n\n", "First I should say its GREAT laptop.  \n  \nI was a windows user for 15years (from windows 98) for some who dont have\nbudget then windows is ok to have i dont blame windows is not good, For 30K\nyou get good usable laptop.  \n  \nI dont wanted to invest 1.5lac on just laptop it seems crazy to me and some\npeople around me. Some one asked \" You get Royal Enfield with this budget\" As\na UI designer this is \"Royal Enfield\" for me. I sit 14hr-15hr/day in front of\nmy Laptop so it should be very good and it should make thighs are very easy\nand fast.  \n  \nI Took 4 months to decide to get this laptop and I will keep this minimum 5yrs  \n  \nGOOD  \n\\+ Mast (very good) OS  \n\\+ No hang, crash,(not even single time in 14months) as fast as new.  \n\\+ Fast boot  \n\\+ Excellent sleep mode: with 100% battery if you turn of the lid and open\nafter 10-12hr its will awake in 2sec. with 98% battery (I restart or shutdown\nmy Mac once in a month otherwise it will be always in sleep mode)  \n\\+ Fast application load time  \n\\+ No virus issue (I have not installed any antivirus app)  \n\\+ Good other feature if you have any other Apple products  \n\\+ Sooper Display and Sound  \n\\+ Very good battery backup / Fast charging  \n\\+ Good keyboard + Touch Pad (my use is less) ( have external keyboard and\nmouse )  \n\\+ Fast copy and move the files  \n\\+ Lightweight  \n  \n\\+ lots of other small things  \n  \nNOT GOOD  \n\\- Definitely a Price  \n\\- Only 2 USB  \n\\- Accessories are very costly  \n\\- Difficult to understand the OS initially as I was windows user for 15years\n(I took 1month understand)  \n  \nIf you are developer, Designer , Motion graphic design or 3D Animator then you\nshould have this with \"No Regret\".  \nThere is another updated version with Touch bar which is very similar in terms\nof speed.  \n  \nFinally word Very good machine to have value for money. Hard earned money will\nnot be wasted.  \n  \nI bought it for Rs.1,46,500 + wired Keyboard Rs.3,500\n\n", "I have been a Macbook pro user for last 2 years. I came across the new Macbook\nair and got a chance to put hands on it. So here is a brief review on my first\nimpressions. Basically i will be comparing this with a regular laptop of\nsimilar price range and Macbook PRO  \n  \nAir benefits compared to Non Apple laptop:  \n# Slim and light weight for daily travel  \n# 10-11 hours battery backup on normal usage  \n# Apple touch pads are awesome, smooth and responsive compared to any premium\nlaptop  \n# Audio quality on speakers is good, but not as loud as my Macbook Pro 13  \n# Apple front camera works the best in low light, best for low light skype\ncalls  \n# SSD - Apps launch very fast despite the low power processor  \n# Metal body construction  \n# Mag safe charger- If you are really careless this helps very much.  \n# Ambient light sensor that adjusts brightness automatically ( Many people are\nnot aware of this feature)  \n# Keep your Air closed or leave somewhere idle and check back after 2 or 3\ndays, you will see battery has dropped less than 3 or 4 %  \n# The best part - Mac OS, contains all that you need, a neat calendar, Todos\napp, notes, Quicktime, Mail app etc. Hassle free OS  \n  \nAir demerits compared to Non Apple laptop:  \n# Performance is on lower side  \n# Good for basic usage only, internet, movies, video calls, spreadsheets, mail  \n# You will get better display(Full HD) if you buy a 999$ Ultrabook from US (In\nIndia they come at premium)  \n  \nShould you consider Macbook PRO? - PRO advantages  \nI know a lot of people might be confused whether to go with PRO for some\nadditional bucks. So listing benefits of pro from my experience  \n  \n# Force touch - More comfortable touch pad, less finger pain compared to\nbuttons on Air, Adjustable pressure  \n# Retina display - More pixels, Better viewing angle. Air is 1440x900 while\nPRO is 2560x1600 pixels  \n# Better performance - Pro CPU is actually about 50% faster than AIR, but in\nreal world tests, apps launch at similar speed in both PRO and Air. The\ndifference is notable only when you run CPU intensive tasks like Programming,\nVideo encoding, Photo editing, Raw conversion etc. Those who are not into this\ncan go with Air and save some money.  \n# Newer CPU - Macbook air has not evolved much compared to PRO. The 2017 Air\nuses the same fifth generation CPU as the previous version (2015). But with a\nlittle upgrade in CPU speed. ie 1.6 GHz to 1.8 GHz. The newer PROs come with\n7th generation Intel processors. The difference is mainly with the energy\nconsumption.  \n# HDMI port - You don't need display port adaptor  \n# New keyboard - The 2016 PRO has the same keyboard as the \"Macbook\". Keys are\nless deeper and more wider. This makes it little more comfortable to type. Air\ncomes with the same old keyboard as 2015 PRO  \n# Wider touch pad - Not a big deal. But if someone loves that, its a bonus  \n# Color options - Yes, Air is only available in Silver, PRO comes in 3 color\noptions  \n  \nIf you think, all the above justifies the price difference between the PRO and\nAir, go for the PRO. The only benefit that Air offers is battery life. PRO\noffers 8-9 hours only, while Air offers, 11-12 hours battery.  \n  \nWhom Air is for?  \nMacbook air is not a gaming machine or for hard core users. Its for people who\nlove to watch lot of movies, work on documents, browse and some basic\nprogramming. When i say programming, Xcode works fine on Macbook air. But\nSoftware like Android studio, Photoshop seems to struggle a little on Air. But\nif you are once in a while user of intensive apps, you can ignore this.  \n  \nI will update my review with more details after a few weeks of hands on\ntesting and usage. If you have any queries leave a comment below. I will try\nto answer in a day or two.  \n  \n[...]! Thank you :)\n\n", "I bought this laptop one month ago and absolutely love it.  \n  \nThis is my first Apple laptop, I have always been using Windows computers but\ndecided to take the plunge as it was recommended for a graphic design course I\nam doing.  \n  \nAlso please don't forget to buy from a fulfilled seller Copy and paste this\nlink in your browser <<\\--here are all the recommended sellers .Else I can't\nguarantee about the genuineness. Because there is too much fake apple products\nonline  \n  \nWhere to start?  \n  \n1\\. Design  \nVery sleek and modern. Seems to be made from high quality material. It had the\nnew force touch pad, which is quite nice.  \n  \nThe best thing about it, in my opinion, is the Retina screen, which is\nabsolutely superb. It really makes life more beautiful.  \n  \nThe sound quality is great and so is battery life. I can work on it for an\nentire day without needing to charge it.  \n  \n2\\. Functionality  \nVery fast and comes pre loaded with a lot of apps, including the Apple\nequivalent of the Microsoft Office Suite.  \nIt takes a while to get used to it if you are switching from Windows but in my\nexperience it's quite an easy transition. Everything is intuitive and I didn't\nhave to check any manual or google anything once.  \n  \nIn terms of performance, there's no lag and it operates very fast. I plan to\ninstall the Adobe Suite, which I haven't yet. This is the reason why I bought\nthe 15 inch model over the 13 inch, as this one has a larger screen and a quad\ncore processor.  \n  \n3\\. Price  \nWell... ouch. It's much more expensive than any high end Windows laptop, but\nin my opinion it is worth it. It delivers a unique experience and it screams\nquality and attractive design.  \n  \nI will keep on using it and imagine that the more I learn the more informed an\nopinion I will be able to have, but hope this helps you to begin with.\n\n", "Superb masterpiece product by apple!  \n  \nDon't get fooled seeing the limited RAM or processor speed! This device is as\nfast as any other gaming laptop found on the market.  \nIf your primary focus area is programming,video editing, don't look back. This\nis a gem.  \nHowever if you are into high end video editing, you may want to consider the\nvariant with the graphic card.  \nThe flash storage of 256 GB SSD is lightning fast. I have to open many apps at\nonce and I thought maybe 16GB RAM was a little less considering I used iMac\nwith 32 GB RAM.  \nHowever it uses your SSD as RAM which is just as fast or maybe faster :P.  \nAvailable storage is 230 GB.  \nI would advise buying it from an official Apple Reseller where you can get a\ngood student discount also.\n\n", "I am writing this review after using this extensively for last 10 days. I was\na Windows user and here are my initial feelings about this machine.  \n  \nPlease note that I am a professional photographer, who uses Photo Shop and\nLight Room extensively.  \n  \n1\\. The display is just amazing. Coming from a Dell machine, the difference is\njust awesome. My own photos look new and refreshing to me.  \n  \n2\\. The laptop is an engineering marvel, the lid and base are crafted with\nsuch precision and attention to detail that the lid can be opened without\nlifting up the laptop in the process. Try doing that with any other Windows\nlaptop.  \n  \n3\\. Keyboard is quite good. Not over the top, but is very comfortable.  \n  \n4\\. The Force Touch mouse pad is just awesome. You won't need and external\nmouse at all, even while doing photo editing. While I just cannot work without\na mouse in Windows, I have found that with MacBook you wouldn't miss an\nexternal mouse at all.  \n  \n5\\. The laptop does heat up quite fast.  \n  \n6\\. Battery lasts up to 6 hours with normal usage, along with some amount of\nLight Room or Photoshop. It definitely will not last for 10 hours as it is\nbeing advertised.  \n  \n7\\. It is very light and just the right size to carry around in your bag. At 2\nkilos there is not much weight difference between Dell and MacBook  \n  \n8\\. I got this older model so that I get all the ports including the SDHC port\nfor my camera cards, without which it would be quite useless.  \n  \nI am finding this machine up to my liking, but wish the battery could last\nlonger for heavy users like me.\n\n", "This is the Best Macbook ever. You can't find any other macbook more than\nthese spec (expect 500 GB HDD model of same), i bought it in Feb 2016 still no\nlag at all, It take hardly to 3-5 Sec start and you can instantly using any of\nApp within sec after that.  \nIf you are looking for a Gaming laptop then AlienWare is best in same Price\n[but I am sure you will face windows corrupt problems at all] or If you don't\nwant to waste your single sec on hang or crash during your work then Go Buy\nIt.\n\n", "This is my 3rd Macbook PRO since 2007. I found this the best value for money\nthan the 2016 model or any model I've used before.  \n  \nBefore this I was using the 2011 model which used to heat up a bit too much\nunder heavy app usage. With this model, all my complains are gone! Even when\nthe charger is plugged-in and I'm running many apps there is no heating\nproblem.  \n  \nAs for the battery, what can I say - I thought it was just a marketing ploy\nwhen they said it lasts 9 hours of use, but the legend true! I'm genuinely\nsurprised that the battery lasts almost 9 hours every single time!  \n  \nOverall a great purchase, highly recommended.\n\n", "Five stars have been given just to keep the review on top  \nThe laptop you received is not brand new it is repacked, the laptop I bought\nsmelt like burnt plastic, it froze on light usage to the point where I had to\nforce restart it.  \nI have returned the laptop, it's been 21days since I have been calling amazon\ncustomer service to refund my money  \nRs. 1.4 lakhs is a very huge amount  \n  \nMY REQUEST BE WISE AND LEARN FROM MY MISTAKE AND BUY LAPTOP FROM YOUR NEARBY\nOFFICIAL APPLE RETAILER OR ELSE YOU WILL CUT A SORRY FIGURE  \n  \nPS: the discount available is attractive but on a closer look it's a ripoff\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 January 2018", "on 15 August 2017", "on 10 May 2017", "on 3 September 2017", "on 30 July 2016", "on 24 July 2015", "on 6 April 2017", "on 22 May 2016", "on 1 June 2017", "on 5 June 2017"], "reviewer": ["Amy", "SwordFish", "Rajeev Bhat", "Pisces 💖💖💖", "Ghost rider", "Deven Kalra", "Padmanabhan", "Rizwan", "Prakash B", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Five Stars", "Awesome performance", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "Five Stars"], "review": ["just loved it\n\n", "masaalla\n\n", "I'm using MacBook Pro 15 for 6 months still it's is as it's best as when I got\nthis it's takes only 7 sec to boot up and it can handle any task\n\n", "Received on date. Works really well. A genuine product\n\n", "Student discount\n\n", "Bought the same from local distributor for 1.42lakhs.. absolutely loving it!!\n\n", "Great product\n\n", "awesome\n\n", "This computer is a beast!\n\n", "Amazing speed, Mac is always different\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 December 2016", "on 28 July 2017", "on 19 February 2017", "on 19 October 2016", "on 13 July 2017", "on 28 May 2017", "on 26 October 2016", "on 20 June 2017", "on 24 September 2016", "on 25 August 2016"], "reviewer": ["Amazon Customer", "Amazon Customer", "Suyash K.", "Cheenu", "Amazon Customer", "Jose Philip Raja", "Ashok", "Amazon Customer", "Namrata", "Ravi"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Nice laptop", "Good value for money", "Amazing Experience", "Amazing things that you can do with it", "Five Stars", "got brilliant deal & This machine needs no comments", "Love it!", "hopeless product.... remove it from market ...", "Five Stars"], "review": ["This is good stuff and on time delivery. I was earlier apprehensive but good\nproduct and extremely satisfied\n\n", "Nice\n\n", "Product is top notch.. no questions asked. Delivery was prompt by Raptor It.\n\n", "Really, Great Performance. My First Mac I loved it. It works best for blogging\n+ development.\n\n", "My first Mac and I am loving it. Amazing things that you can do with it.\n\n", "One word - Classic.\n\n", "got brilliant deal & This machine needs no comments !!  \nfor a Photographer,Retina Display is very helpful for Post work & i am loving\nthe colors :)\n\n", "I love the laptop. It is excellent in terms of speed, performance, display.\n\n", "hopeless product....remove it from market.\n\n", "This laptop is good I had to sell my both kidneys writing this from heaven\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 April 2017", "on 18 February 2018", "on 14 April 2017", "on 28 March 2017", "on 11 March 2017", "on 3 May 2017", "on 11 January 2017", "on 14 March 2017", "on 9 December 2017", "on 8 October 2017"], "reviewer": ["Pradeep Kumar", "Ramana", "Amazon Customer", "svigneshwaran", "Virendra", "RD", "Amit Somvanshi", "Amazon Customer", "jeherul hoque", "Bkavita"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Five Stars", "Awesome", "Four Stars", "Great buy", "Five Stars", "Best for Graphic Designing", "Five Stars", "Five Stars", "Five Stars", "Amazing Apple Laptop"], "review": ["GOt laptop in 2 day and I am <3 it\n\n", "Amazing\n\n", "Very good machine\n\n", "Excellent performance.\n\n", "Top class powerful beast!\n\n", "I bought it from istore. I found it more useful as compared to other laptops..\nosx is better than windows... as there are no problems of os crashing.. i use\nit for my graphic designing.. i use softwares like adobe(photoshop, indesign,\nillustrator, after effects , dreamweaver, light room) etc ... and all of them\nrun so fluently... its sleek slim and moreover good looking and ultrq fast...\ni would recommnd it if you are opting graphic designing or photography...\n\n", "Amazing piece. excellent performance. Smooth and prompt delivery\n\n", "Super duper awesome.... love my Mac book😁😁😁\n\n", "its really amazing. Best laptop.\n\n", "The 15-inch display is very bright with high resolution.  \nIntel Core i7 Processor runs blazingly fast.  \n256 GB of the Hard disk has ample space for data storage.  \n16 GB of RAM handles multiple applications easily.  \nMac OS is the best operating system so far.  \nHD 720p Cam is amazing. Go for it.  \nUse a coupon code to get a discount. go to  \nbit.do/ my-coupon\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 August 2016", "on 13 September 2016", "on 8 August 2016", "on 3 August 2016", "on 28 June 2016", "on 23 January 2016", "on 31 March 2016", "on 4 August 2016", "on 15 April 2016", "on 17 October 2017"], "reviewer": ["Amazon Customer", "niraj", "sunil", "Lovenish Goel", "Amazon Customer", "Dollar Gill", "PMU", "Amazon Customer", "Amazon Customer", "rabia"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Amazing", "Smooth performance", "Wow!", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "It's a Mac!", "Five Stars"], "review": ["Amazing as expected !!\n\n", "Excellent device. One of the last with the magsafe and sd slots.\n\n", "Wow! I love this MacBook!!!  \n  \nThis MacBook Pro meets all my needs.  \nLight weight  \nQuick response  \nGood battery life  \nGreat sound  \nAwesome graphics  \n  \nAll in all it's awesome and everything is as per the specs mentioned on the\nlink.\n\n", "Beast Machine!!\n\n", "Awesome !!!! To say the least... great delivery great product great packaging\n☺️\n\n", "I'm loving it. Though the touch id is not of much use to me.\n\n", "One of the best product I've ever bought on Amazon. Exceptionally great!!\n\n", "What is the graphics card in this MacBook pro\n\n", "Genuine product. Got it at a decent price. Love it.\n\n", "Go for it!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 October 2017", "on 29 August 2017", "on 1 April 2017", "on 28 September 2017", "on 5 August 2017", "on 9 March 2018", "on 18 July 2017", "on 14 March 2018", "on 12 July 2017", "on 18 July 2017"], "reviewer": ["Akhilesh Kumar Gupta", "BST", "Perry guleria", "Amazon Customer", "A Buyer", "Pallavi", "Akbar Sha Ebrahim", "bikram", "Rejish Radhakrishnan", "Adwait Savargaonkar"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Just an outstanding system.", "I could easily verify that the product is new and genuine", "The apple product quality is not like before.", "ONLY FOR PROFESSIONALS", "The Computer is as usual to be vry good at all the work ( experience for 14 long ...", "Can It Be Worth Buying It??", "Five Stars", "Five Stars", "Excellent..", "... using one month I can say this is very good."], "review": ["I was very skeptical to buy such an expensive laptop that too Mac online on\nAmazon. But the experience has been just awesome. Just love this laptop. It is\nworth every penny invested on it. Its super fast, superb battery backup, no\nheating issues, no lag, amazing display and outstanding sound quality for the\nlaptop speakers. In fact I got with latest OS EL-CAPITAN. I was expecting the\nolder version as mentioned in the specs on this product. It was a very\npleasant surprise to receive the latest OS.\n\n", "Before buying online I contacted the authorised dealer who frightened me that\nonline product might be refurbished. As refurbished products get a different\nserial number, I could easily verify that the product is new and genuine.  \nAs expected with the apple products, you get the value for what you have paid.\nLaptop is extremely good, particularly for a developer.\n\n", "Got issue with laptop MLB sensor the next week after the expiry of warranty\nwith normal use. Apple Service centre is saying to replace the Logic Board\nwhich is going to cost 60K INR. It is not about the seller. It is about the\napple product. The apple product quality is not like before.\n\n", "This is a joke of a laptop. Unless you are a professional sound recording\nartist or a designer who wants to render heavy designs or a video editor..\nthis laptop is not for you. You can get an Awsome Gaming laptop for the same\nprice and you also get to play latest games while this will struggle to play\ngames as it doesn't has dedicated graphics.  \n  \nSo unless you are one of the above mentioned people, do not get it. No you can\nnot play games on it. Well technically you can but that needs windows to be\ninstalled and still you won't get good FPS  \n  \nYet the price is really high given that you can't upgrade your memory in\nfuture as it's soldered to the motherboard.\n\n", "The Computer is as usual to be vry good at all the work ( experience for 14\nlong yrs of apple laptops and phones )....smooth on the UI and in application\nopening and closing....though u should be roaming with 1 lakh in ur wallet\nbecause if ur Logic Unit gets faulty first u hv to deposit 2800 for just a\nsimple \"check\".....that's amazing way to earn while the Logic unit itself\ncosts a staggering 42000.....yes forty two thousand......if u hv money to\nspend go ahead if not stay away because jst a check for any problem if ur\nnutbolts r missing its 2800 and each bolt is 400 its made out of gold surely\napple......\n\n", "Apple MacBook Pro laptop has a display for your daily needs. This laptop is\npowered by processor, coupled with 16 GB GB of RAM and has 256 GB SSD storage\nat this price point. As far as the graphics card is concerned this notebook\nhas graphics card to manage the graphical functions. To keep it alive, it has\na battery and weighs.  \n.  \nFor My opinion If you want to buy this laptop juz don't buy bcoz u can get\nmany more featured laptops at this price but this laptop is a piece of art\nwhich should be able to give you evey work satisfaction.\n\n", "Very cheap and affordable\n\n", "Screen is beautiful, but is very susceptible to developing something called\n'LCD mura'. Check that out before buying.\n\n", "Excellent.....Excellent......Excellent. That much only I can tell about this\nsystem. This is my first Macbook. What a difference between windows based (I\nwas using windows based systems for the last 20 years, right from windows 95\nonwards) PC and a macbook. Of course it is expensive, may be about 3 times\nthan a windows based laptop. But you are getting for which you have paid for.\nAbsolutely no heating issues and the laptop remains cool even after using\ncontinuously for hours and hours. Retina display is simply marvelous and once\nyou are habituated you won't feel like looking on other screens. Very smooth\nand a great battery life of over 9 hrs.\n\n", "After using one month I can say this is very good.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 July 2016", "on 26 October 2016", "on 17 January 2018", "on 29 August 2017", "on 10 October 2017", "on 12 November 2017", "on 9 August 2017", "on 24 February 2018", "on 9 October 2016", "on 20 January 2018"], "reviewer": ["Chandan P.", "siva kiran dhulipala", "shivakumar mutyala", "Aditya", "Amazon Customer", "Ankur Mundhra", "fahim m.", "Pawanjeet Singh Judge", "JKV", "Arabind Das"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Amazing machine", "As expected faster delivery and yes just started it and ...", "Got it today and its breathtaking. First of all ...", "highly unacceptable service and after sal", "not satisfied also no touch bar", "and I loved it to the core", "One of the best laptop for professional and heavy usage", "Overrated and disappointing product", "Awesome Performance!!!!!", "Good but expansive"], "review": ["Only one word to describe this masterpiece is \"Amazing\".  \nThis the best in series coz it has usb ports, in newer models than this if you\nwant to connect a usb then you have to buy a connector also. But it has\ninbuilt ports, great finish, its made for heavy usage. Thank you Apple and\nAmazon.\n\n", "As expected faster delivery and yes just started it and installed the basic\nfunctions, but it took 2 much time to install the updates 2.5 gb took almost\nmore than 3 hours to get update, need to check this there is some technical\nhitch. Will check this out as soon as i get it into this.  \n  \nWait for my second review now.\n\n", "Got it today and its breathtaking.  \nFirst of all it does not include the new ATI Radeon graphics card but for me\nit doesnt matter any way not much into gaming and stuff.  \nThe only problem I have faced in 4 hours of usage is it gets hot after normal\nusage thats most probably because of the i7 intel processor and the fact that\nI was using flash , I have uninstalled flash and will update this post after\nfew days of using my mac.  \n  \nUpdate (29/11/2016):  \n  \nI am updating this after using this gorgeous piece of tech for more than a\nyear and in my experience this is the best laptop I could ever own. From the\nprice point of view lets just be honest it costs way too much for a laptop but\nagain you get what you pay for, I know its a clichè but its true.  \n  \nAbout the heating problem that I mentioned earlier as soon as I uninstalled\nflash it was no longer an issue. I never ran into a problem where it got stuck\nor I had to restart it because of some issue never have I had to take any such\nsteps which were frequent on my windows based dell laptop. Its the seemless\nintegration of Hardware and Software which makes this product a piece of art.\nAs Steve Jobs quoted during the first iPhone launch, \"People who are serious\nabout software should make there own hardware\" and this Macbook is the perfect\nexample.\n\n", "\n\n purchased 3 months back , still in warranty and With no damage from my side ,\nstarted having these horizontal lines fluctuating on the display . Took it to\nthe apple store got diagnosed Pressure damage with a Rs.65000 bill for\nreplacement of the whole display panel , even when the whole screen is intact\nand display is not cracked , also that it would not be covered under warranty.\nMind explaining Amazon ?\n\n", "very heavy and bulky .. causing shoulder pains !!  \nfor the price should be lighter.  \n  \nnot satisfied  \nalso no touch bar .. any reason ?\n\n", "I've been using it for over a month, and I loved it to the core. It's my first\nMac, and I've been skeptical about buying it because I was strictly a Windows\nguy earlier. A little research later, I found myself willing to give it a try\nand purchased it.  \n  \nI went for the 16gb version as I have some pretty intensive apps to run. Once\nthe memory clocked 14.9gb, but the performance was very very smooth. I found\nno lag whatsoever, the usage is always quick and breezy.  \n  \nSometimes my old Windows habits kick in, but I think it'll take some time to\nadjust to the OS and work in tandem with it.  \n  \nThe only disappointment I had was that there is no NVDIA graphic card. That,\ngiven the price, would have made this product a truly incredible purchase.\nAlso I can't comment about the performance of games, as I rarely play games on\nmy PC.  \n  \nOthers have done a great job describing the specs, so I don't want to go there\nagain.  \n  \nIn all, go for it if you are a looking for a good platform to experiment\naround, and your budget allows for it. I personally can see myself using it\nfor quite a long time.\n\n", "First of all this is truly a beast of a laptop as suggested by other\nreviewers, but cannot be said the same when it comes to gaming.  \nI bought it and I don't have any regrets, just that I bought it from Paytm.\nThey also have sellers selling it for the same price as Amazon but the\nadvantage over there is that Paytm is offering good cash back amount, so\noverall it should cost somewhere between 1.2lakh to 1.25lakh as of now, just\nmake sure that they are Brand Authorized Sellers.  \n  \nPros:  \n1\\. Have Usb ports, which are missing from 2016 models  \n2\\. The performance is remarkable  \n3\\. Battery backup is up to the mark  \n4\\. One of the best when it comes for using applications that needs processing\nand memory  \n5\\. It's slim and sleek as compared to other laptops (except MacBook pro 2016\nand MacBook air ;) )  \n  \nCons  \n1\\. Slightly Heavy  \n2\\. Can't be expected to perform in the same way as the other dedicated gaming\nlaptops.\n\n", "The device is good, performs well but it's highly overrated. Here are some\nthings that disappointed me  \n  \n1\\. Within 2 months the display has horizontal lines on them and it's\nincreasing every day. I've contacted the customer support and dropped it to a\nservice center and they say it's a hardware issue.  \n2\\. The animations stutter sometimes it might be a El Capitan issue but I\nnoticed it on Yosemite too right out of the box.  \n3\\. El capitan has a lot of bugs, widgets disappear. some apps kinda freeze\nand needs restart.  \n  \nFor a device that cost 140k this is really disappointing.\n\n", "Awesome Performance!!!!!  \nAre the only words coming out of my mouth when i m discussing about my mac\nwith others.Awesome Performance, Excellent Heat Management, Awesome Look, Very\nlight to carry(Comparing with same config lappy in the market), Great Screen\nColours...etc. I m a programmer, it is the best lappy for the programmers in\nthe planet it is taking around 2seconds to start with the development or any\nprocesses in the system after staring the mac. Im using Android Studio,Android\nEmulator,Xcode ,Iphone Emulator, VMware(Windows 7), Photoshop CC, Eclipse,\nNetbeans at a time to test its ability but there is no lag in the performance.\n\n", "[1] This is an older model compared to the existing mac. But its still great.\nAlthough the specs don't seem too great for the price, its very efficient\n(which means that it can do the same thing using lesser RAM).  \n[2] It's not great for gaming. Platforms like battle.net and Steam have come\nup with mac versions of their same games, but its not as good as the windows\nversions, but very manageable.  \n[3] It excellent for coding and presentations. It compiles code and runs heavy\ntasks without any issue.  \n[4] It looks amazing and has a nice screen size. It comes with charger. I\nbought a case separately.  \nOverall I highly recommend it.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 January 2018", "on 4 October 2017", "on 11 October 2015", "on 20 March 2018", "on 23 October 2017", "on 29 June 2017", "on 25 October 2017", "on 6 September 2016", "on 9 September 2016", "on 5 November 2017"], "reviewer": ["Amazon Customer", "Perfect reviews given", "UD", "Sarthak thakur", "Percipient", "Srikar Mutnuri", "Yash Benjamin Das", "Shrey", "Amaresh", "Chetan Vashisht"]}
]