[
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Poor after sale", "Worst mistake!!! TCL IS A HORRIBLE CHINESE CRAP", "non of smart feature and app is not working", "tv is great and all apps are working for me surprisingly i ...", "Great TV Screen let down a bit by half baked software.", "Good design, but not good software, not a smart TV and stupid pre installed apps cant uninstall them.", "Great tv at great price", "Sir we were purchase tcl tv 43 inch on 7 ...", "Not a soothing experience.", "One Star"], "review": ["No effort to contact for installation from TCL even afterAmazon delivery\nmessage on 22nd and my registering request to TCL on 23rd .I doubt they will\nattend complaints in future.  \nI tried TCL product first time. I m thinking to return the product if not\ninstalled as per TCL commitment.\n\n", "Worst product ever. I did not believe the feedback I had read before buying\nthis crap but trust me this brand is worse than a Chinese typical. The product\nis horribly designed with many flaws and Their customer care is goon-run\ncompany which doesn't care about professionalism or respect. Horrible is the\nword. Crap all the way.\n\n", "its been almost 3 month ,non of smart feature and app is not working .No one\nhave responded back from customer care .  \nI made a complaint (# 4461501),but they can not fix the issue .If you can not\nfix .Please provide replacement .  \n  \nVery poor customer service .Dont buy TCL if you are expecting customer service\n\n", "tv is great and all apps are working for me surprisingly i have downloaded\nplay store from tcl app store, google paly store make this a lot better i have\nloaded es explorer using this and sided loaded what ever app i want please\ndont go for any bad review on apps not working\n\n", "It has been a week since I received the television.I would like to note\nfollowing things about the same.  \nOverall rating : (4.5/5)  \n  \nPros :  \nScreen ( 5/5 ) : Extremely nice as far as I can tell. The mileage may vary for\nmore technically inclined folks .Some lip sync issues to of start with.\nFiddled with picture settings by turning dynamic HDR off, game mode ON etc.\nNow it is fine though will have to check how it has affected 4K content\ndisplay. As of now, everything looks good (including 4K content)  \nDelivery & Installation (5/5) : On time and very well done. One weird thing is\nthat there is no screen protector plastic on the display.  \n  \nCons:  \nSoftware (1/5) : Seems half baked and geared for Middle east/North African\nmarket. It has TCL app store with few apps and extremely restricted google\nplay store. Apps installed from google play store may or may not show in the\nApps section on tv. For good smart tv experience, you will definitely need\nfire stick/chromecast/Apple TV. TCL nscreen/Tcast apps do not work well and\nkeep dropping connection. No such problem with youtube or any other app or\nmirroring on fire stick.  \n  \nDear TCL team, request you to update the TV software so that we can have\nsimilar software as TCL 139.7 cm (55 inches) L55P2MUS Android M 4K UHD LED\nSmart TV (Gold) This will go long way in making the experience smoother and\nbetter for us. Would love to hear from you on the same.\n\n", "Good design. Bad software. Not a smart TV. Stupid pre installed applications\nnot allowed to uninstall. One of the application called nScreen keeps popping\nan error message saying \"Unfortunately, nScreen application stopped working.\"\nI don't even use it.\n\n", "It is the best tv at this price, and i got a huge discount upto 8000 from\namazon which is so cool.....thank you Amazon!  \nAnd about the tv itself  \nIt has a great display and the pic clarity is very good .and the remote it\nself is slim and handy i love its feel. Sound is very nice overal the best and\ncheap 4k smart tv under the price of 40k go for it without any hesitation\n\n", "Sir we were purchase tcl tv 43 inch on 7 oct 2017  \nBut still not install wall mount.  \nMany time call of tcl support center but not install wall mount .pl help for\nthis.\n\n", "Tcl overall experience is just crappy.  \n  \nScreen is good n Picture quality is good  \nBuilt is just ok  \nSound is just way below expectations... bad  \nTCL after sales is terrible. 10 days already and still no technician call for\nwall mounting installation or demo.\n\n", "We have not received table stand with this product\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 October 2017", "on 8 September 2017", "on 22 August 2017", "on 16 August 2017", "on 1 February 2018", "on 8 October 2017", "on 7 May 2017", "on 11 October 2017", "on 21 August 2017", "on 11 January 2018"], "reviewer": ["Amazon Customer", "Nipun Mittal", "Alaganandan K.", "danush", "Amazon Customer", "suneel", "Balaji", "Pawan Kumar mishra", "pravesh", "VENKATESHWARLU"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Pic quality is good. although not shown in specs on Amazon its ...", "TCL TV is Bad don’t buy it. Right from day one the problems started", "Best tv in this price range", "About TCL Smart LED", "No HDR support over HDMI 2.0 interface, wonder if it will be supported over USB", "Good TV ,Full Value for money", "Wrong product sent", "Price point of view is highest ever in Amazon and i suggest please don't buy", "Thank you Amazon for being a part of my students future", "Best and most affordable tv in this price range"], "review": ["I bought in July at 30K from Amazon  \ndelivery was quick in 3 days  \nAmazon forgot to place request for installation, i waited 2 days and then i\nmyself called TCL helpline, installed in 3 days. that reasonable.  \nPros  \n1.Pic quality is good. although not shown in specs on Amazon its a IPS panel\n.i found after installation.  \n2.Bazel and overall finish is looks good,  \n3.It has Kodi player this is plus  \n4.It has inbuilt stabilizer although i installed a V Guard also for safety.  \n5.wall mount is free  \n6.>1 yr warranty  \n7.processor 1.5 Gz processor seems sufficient but ROM 8 GB is less  \n  \nCons  \n1.not able to install apps from PlayStore due to some UPDATE error. the only\nmain disappontment. but some friend says it can be done. i am looking for\nresponse from other guys. Please inform all if it can be done.  \n2.OS is not latest 5.1 i guess  \n3.OS is not up gradable  \n4.not sure apps can be side loaded from USB.  \n5\\. not sure there is provision for extra warranted  \n6\\. 8 GB ROM space is less for installing apps.if at all possible  \n  \nOverall rating of 4 out of 5 in Value for Money category  \n  \nSmart Features are extra as it was not advertised as SMART TV ( Play store app\ncannot be installed as yet) although some friends are cribbing about missing\nsmart TV features.\n\n", "I have purchased TCL TV P2 L55. Right from first day the problem stared. The\ntechnician says he can’t fix the problem. Asked Delhi office to replace it.\nBut after 20 days their is reply. Fed up of calling customer service but no\nuse. Still no replacement has done. I am suggesting you guys that don’t ever\nbuy this TV. Not worth even FREE.\n\n", "Can watch netflix, cast YouTube from mobile, watch almost all formats of\nmovies in external hard drive through mx player.. playstore can be installed\nusing the default appstore in tv..amazonprime video app is showing error while\nplaying.. think i should install old version.. no problem with Netflix...apps\ncan be installed from pendrive/hdd using esfile explorer app which u should\ninstall from playstore app.. no need of Chromecast or amazon firestick for\nthis tv....i ve attached ps4 and i love playing games in this tv..i noticed\nthat there is minor differences when compared to other branded tvs which\nalmost costs double or triple..go for it..u will not regret..\n\n", "Never buy TCL products.  \nTotally worst service  \nI buyed 1 LED on 5th Oct n second on 6 th Oct  \nBut till now no installation.  \nNot only product quality but also service is also most important.  \nOnly answering that \"wait till tomorrow\"  \nBut on which tomorrow??  \nNo one knows.\n\n", "No HDR support over HDMI, wonder if it really supports over USB?  \n  \nIPS panel so has good viewing angles against VA panel on MUS model and TVs\nfrom Samsung and most of Sony lineup  \nBetter Black levels than LG IPS panels, VA panels generally has better black\nlevels and hence the contrast though  \n  \nNo 10 point while balance or 4k supported apps like in MUS (Netflix and\nYoutube)\n\n", "Purchased this TV as part of Prime Day sale for about 28K after getting\ncashback from HDFC bank. The delivery was done with 4 days on weekend and\nwithin one hour installation was already done.So full mark to Amazon for\ndelivery and triggering installation.  \nComing to the product, the TV is absolute great, youtube work seamlessly,\nhowever there is one draw back that it cannot direclty play youtube videos in\n4K mode, 1080p is maximum it allow. They have changes the remote also and\nearlier remote which was little hard has been replaced with better remote.I\nhave connected by 2TB ,1 Tb hard disk and it has worked well and it has played\nevery single format be it mp4,mkw or any other.  \nPlayed 4 K videos on TV via pen-drive and it worked fine. However my 4K movie\ndidn't find audio drivers and sound was not coming so have to check if higher\nsize file has audio issues but songs and other video has no issues.  \nAudio search is also not working which is a issue ,searching is an issue due\nto that, however TCL has provided the nScreen which make mobile as remote and\nis relatively helpful to type.  \nAs of now satisfied with the product and thanks again to Amazon so delivery\nand installation as committed.\n\n", "It's worth 26,990 and not even an 4k ultra hd. Cheated.\n\n", "Picture Qualitywise this is good compare to branded at this price much better\nproduct but price seems high almost branded TVs, if we step ahead and have to\nbut a branded. Serviceswise too worest product so please think before buy this\nbut if they reduce @15th August offer mostly 28k wisely you can take it off.\nFinally I suggest you to but a branded.  \n  \nBe wise while spending your money on a product\n\n", "It was my dream that I shall teach my student using audio visual and they will\nlearn very well Amazon has given me the opportunity to buy a product very good\nin very low price thank you Amazon thank you TCL my students are happy now\nthey can learn very well I think in future I will buy anything from Amazon for\nmy students and I shall teach them in a good way they can understand what is\nhighs and my dream will be completely complete thank you Amazon thank you TCL\n\n", "Television works well..4k videos and hd channels are providing the best\nviewing experience..Before ordering this tv I compared the 4k models of lg,\nsamsung and Sony they are good too but twice or thrice times the price of this\ntv..Believe their is no difference between TCL 4k and any other branded 4k\ntv..It's best and most affordable tv in this price range..I am fully satisfied\nwith this product.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 July 2017", "on 17 November 2017", "on 28 February 2018", "on 25 October 2017", "on 26 September 2017", "on 20 July 2017", "on 31 August 2017", "on 6 August 2017", "on 19 February 2018", "on 22 August 2017"], "reviewer": ["atak", "Amazon Customer", "Manoj G", "ANNASAHEB KHILARI", "Prankey", "Aseem Sharma", "Nishant Nanda", "Kishore", "Aslam mondal", "Amazon Customer"]},
{"rating": ["1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Installation is not given to me till date. I have purchased the same 5 days back. I am feeling helpless..", "Picture quality is good on 4K videos but when we play videos from ...", "Damaged", "Chines Brand", "Dont buy", "Worst product and customer service from amazon and TCL too", "TCL L43uPUS Honest Review.", "TCL customer care is horrible. After 10 days service engineer came to premises ...", "Some hits and few misses!!!", "TCL TV's are a SCAM - no Netflix!"], "review": ["Installation is not given to me till date. I have purchased the same 5 days\nback. I am feeling helpless..\n\n", "It has been 2 months since my purchase, installation was quick but demo is\nstill pending. My review till now:  \n  \n1\\. Most of the apps are either not working or have of no use.  \n2\\. We can't install mostly popular apps on this TV is the biggest drawback.  \n3\\. Picture quality is good on 4K videos but when we play videos from external\ndrive, sound is very low.  \n4\\. Headphones are not getting connected.  \n5\\. On TV remote, there is one NETFLIX button but Netflix is not installed and\nwe can not install it on this TV.  \n6\\. Without demo, most of the functions are still of no use to me.\n\n", "Got damaged but i don't need refund ....i need new one\n\n", "Pathetic display stop working in 6 month and tcl deny to replaced panel don't\nbuy trully chinies brand.\n\n", "Worst picture quality\n\n", "First thing TV got delivered on time. Worst experience is with TCL technician,\nwe need to be flexable on their timing. They know only how to hang the TV on\nthe wall. Zero knowledge on TV demo. They will demo you how to switch off and\nswitch on the TV. On top of that if you call amazon call center for help it is\nanother waste of time. Hope amazon call center have appointmented IVR machines\nto interact with human. Finally decide to return the TV. Please do not buy any\nexpensive things from Amazon, you life will go for the task you won't get any\nsupport from amazon\n\n", "Definately a good Ultrahd led smart tv with good specs and that too in a\naffordable price bracket  \nPros: Sleek and stylish design it stands out with its light golden framed\nbezel,good specs,sound quality is good you will not need external speakers for\nsure.  \n  \nCons: Colours are not that much bright specially it seems that yellow colour\nis not correctly calibrated it looks dull yellow due to which your whole\npicture quality suffers so 1 star less for that..i wish 1 more usb port would\nhave an added advantage.and and and customer support no one called me for\ninstallation even till writing of this review....so best luck guys you have to\ndo the installation yourselves.\n\n", "TCL customer care is horrible. After 10 days service engineer came to premises\nafter escalating Amazon 10 times. TV does not support WIFI and picture quality\nis not good.  \n  \nI suggest if you want wifi feature , please dont buy this TV and if you will\nface any problem then god will help you\n\n", "Display: 8/10  \nSound: 8/10  \nAesthetics: 7/10 (1 point deducted coz the tc wall mount is bit more\nprotruding)  \nSmart Features: 5/10 (Most of the apps not working)  \nSupport: 4/10  \nValue for Money: 9/10  \nI will begin with the Pros first -  \nThe tv has nice display and sound quality. The build quality is also good. The\nTV is also quite thin comparable to best brands.  \nBefore this tv I was using 40\" Samsung Series 5 LED Smart tv. Compared to that\nthis TCL TV is better in every department- display, sound and aesthetics. My\nonly rue is that the tv protrudes from the wall a little bit more!!!  \nThe TV GUI is nice and lag free. The remote works like a charm.  \nThe TV seamlessly connects to WIFI and wireless keyboard.  \nAbout service I must commend TCL, I received the call withing 2 hrs of TV\nreceipt and the installation was done within few hours. Also, the installation\nguy was very good mannered and he even offered to cleanup the place after\ndrilling which I humbly refused.  \n  \nNow the cons- The things if improved can make the TV really awesome  \nThe SMART TV apps don't work - Amazon Prime videos doesn't work.  \nAlso, HOTSTAR cannot be installed. I called up customer support but the person\ncould only tell me that the tv doesn't support these apps. I don't understand\none thing, why this tv launched only few months back can't support some\nandroid apps???  \nThe other thing is that there is absolutely no manual. The user manual\nsupplied with the product is good for nothing. Hey 'TCL People' nowadays\ndocumentation is a must for any good product. There is not even any\ndownloadable manual on there website.  \nTill date I am unable to understand all the functions of keys of the remote\ncontrol. Only way to find out is try and error.  \nAnother biggest miss their lack of attention. The remote comes with a\ndedicated 'NETFLIX' button but there is no NETFLIX app installed.  \n  \nVerdict: Its a value for money tv.  \nBut it could have been a terrific product had they paid little bit more\nattention.  \nUpdate: It's been more than two months since I purchased this TV. I am totally\nsatisfied with the product. Yes few of the apps don't work properly. But the\nbest idea is to pair it up with Amazon firestick!!! and I have done it.\n\n", "I bought this product with great expectations of a smart TV at a great price.\nThe problem is that while this TV works fine normally it isn't very smart, the\nbasic thing you want to do on a smart TV is use Netflix and Hotstar but those\ndon't work on this TV. There is no Netflix app and you can't even download one\nfrom their app store which only has useless apps. Even if you put Netflix on\nyour phone and cast it to the TV it doesn't work. You can't use Chromecast or\nAmazon Firestick either, both of which are incompatible with this TV. Just to\nmake sure I wasn't doing anything wrong I called TCL and sure enough they told\nme that Netflix does not work on their \"smart\" TV and Chromecast etc also\nwon't work. The amazing thing is that they have put a dedicated \"Netflix\"\nbutton on their remote, see photo. That button does absolutely nothing. This\nis an absolute scam because there is absolutely no way to watch Netflix on\nthis TV. Neither Hotstar or any other video streaming services. You can watch\nYouTube, that's it. So while this TV connects to the internet it's pretty much\nuseless as you can't watch your favorite online shows on it. A better option\nis to buy a non smart TV where you can at least use Chromecast or Firestick.  \nSo please do not get taken in by TCL claims...this TV sucks!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 May 2017", "on 2 October 2017", "on 10 February 2018", "on 28 December 2017", "on 17 February 2018", "on 18 August 2017", "on 10 July 2017", "on 6 February 2018", "on 1 July 2017", "on 5 August 2017"], "reviewer": ["Mahendra Alornekar", "Navneet Juneja", "ravo", "Amazon Customer", "avinash5515", "Senthil Kumar P R S", "Ashish_Raj5000", "Basanti Panda", "Sandeep Kumar", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["What else you'r looking for if your budget is 30000 INR", "AS expected, Not bad not great", "Miracast and Amazon Pricing Scam", "Two Stars", "Worst service providing by tcl", "Maybe my luck was bad and I didn't get the chance to use it", "Bad Product Description", "TCL TV - decent bet, however not fully certified by GOOGLE (Android features)", "Add another 5-10k and get a good trusted brand for quality purpose.dont get fooled by the pricing its a total waste of money.", "Wow"], "review": ["Picture quality - It's better than realistic. Very vibrant and crispy. I\nplayed 4k videos it produces real colours but can't match with Sony and\nSamsung. With 33k price this can ignored.  \n  \nSound - Could have been better. It's loud and clear. Can't feel the bass and\nthunderous sound.  \n  \nSmart Features - Well, it's a an Android TV. UI seems be simple and user-\nfriendly. Bluetooth, T cast, and Apps works smoothly. No lags. I tried\nWhatsApp web but I can't see the hyperlink, I have used chrome browser to\naccess the WhatsApp web.  \n  \nDelivery - ordered on 30June, expected delivery was 4th July but being GST in\neffect they delayed the dispatch and got it on 6th.  \n  \nInstallation : If you know which ports are meant for what, then you don't have\nto wait for your installation guy as they will need 2 days after delivery. Do\nit yourself, However raise request to CC to get free Wall mount kit.  \n  \nVerdict - If your budget is 30k and looking for a smart TV then it's for you.\nOrder it.  \nHit thumbs up if this helps you out.  \n  \nThanks you.\n\n", "Here is my review for the TCL 43 Inch UHD TV. bought in oct 2017  \nThe delivery was good and it was delivered in 3 days in busy diwali season.\nThe packaging was ok.  \nThe box contains following, A power cable, Table stand and its screws, Remote\nBattery. It has 3 HDMI and 2 USB ports. Support bluetooth for audio and has a\nheadphone jack as well.  \nBuilt quality is good and very thing bezels.  \nWhen you power it on and TCL logo appears you can notice some back light\nbleeding from edges of Television which is not good. However it can be ignored\nas its only visible when there is nothing on display.  \nThe remote is quite responsive and connects using Bluetooth, NO need to plug\nin any dongles as remote gets detected automatically.  \nTyping using Remote is very difficult and i will recommend connecting a\nwireless keyboard if you type a lot. I have connected a USB mouse which works\nfine.  \n  \nRemote doesn't have a voice search option so youtube, google play store always\ngive error massage when you click on search box as they are looking for a\nvoice input.  \nIf you are buying this TV to stream youtube forget it as preinstalled youtube\napp only streams 1080p on youtube. Also there is no option for changing\nyoutube quality. If you install youtube app from play store it freezes a lot\nand makes TV to restart.  \nIt has a RAM of 1.5GB and internal storage of 8GB, which is certainlt not\nenough for playing games.  \n4k files stores on flash drive and external hard drive work smoothly.  \n  \nAudio is good for a small 10x 15 room, but you have large room and you may\nhave to connect a sound bar, for my small bedroom it was enough.  \n  \nSmart TV functions are below average and we can not except better as its a low\ncost 4k TV. So I would recommend buying an Android TV box or Amazon fire stick\nalong with it if you are looking for a better smart TV experience.  \nPicture quality if great and you will love watching movies on it. It support\nExternal Hard drive and USB flash drives connectivity and you will be able to\nrun movies off it, a word of advice though don't use built in USB player as it\nlacks features. Install MX player from app store and it will detect and play\nany videos from External hard drives and can play any format of video.  \nThe Smart remote app provided by TCL is use less so waste your time with it,\nIt wont work when you will need it.  \nApp run slow and some times it crashes, pressing power button on remote wont\nhelp and you may have to turn off power from wall.  \n  \nFinal verdict: Please make a note that you are buying this TV as you wanted a\ntrusted brand and a low cost 4K TV, atleast I was.  \nSo I had my expectations within line and I was not dissapointed, I have screen\nwhich has a top notch resolution, great audio and some below average smart TV\nfeatures.  \nI need better smart TV features and instead of buying a rs. 1 lankh TV from\nsamsung or LG I will buy a Smart TV box from Xiomi or get a roku player.  \nI am giving it a 4 Star for its low cost, warranty and below average smart TV\nfeatures.\n\n", "TV is ok for the price but doesn't have much features for being a smart TV.\nThe app store in it has very less apps..no chrome and I had a lot of issues\nconnecting my phones to the TV using the built in cast and also tried the WiFi\ncast..the WiFi cast works but freezes everytime after a few minutes when\nyou're trying to view videos through your phone and the nscreen doesn't\nwork..the built quality of the product is good and the pixels for it being a\n4k is average but not great. But decent for the price.Needs a lot of software\nupdates for the tv..one should probably buy a chrome stick for the tv of you\nwant to share files from your mobile devices to the TV. It has decent audio\ntoo not too loud though one should buy external speakers for good audio\nexperience. Last but not the least Amazon does this trick of fooling the\ncustomers by increasing and decreasing the price. When I added the product to\nthe cart and was thinking of purchasing it in a day or two. The Initial price\nwas ₹30999 and post two days when I checked the cart it shooted up to₹ 31999.\nI had liked the TV by then and I thought the prices increased and I purchased\nit with the hiked price. The very moment after my purchase the TV's price\ndropped to ₹30999. It was rip off for me though ₹1000 doesn't seem huge. Sad\nand not happy with Amazon with that.\n\n", "Product was installation & support was too bad still no one attended for demo\nand mounting installation\n\n", "TCL is providing the worst service I have ever seen, my wall mount is not done\nyet, once you raised the required for wall mount the wait time is 48 hours and\nafter the wait time aswell the TCL service center asking to wait for another\nday, reason wall mount is not available or the tech is not available, they\ndon't have even manners how to treat a customer even did the conference call\nwith the TCL and Thomson services whose tech was going to come these guys\ndon't have manners how to treat a customer and provide the service, I think\nbefore buying the product please call the TCL to check the Availability of the\nwall mount and tech, it's seems as per the Availability of tech we have to buy\nthe product now..\n\n", "The TV had a weird mark at the right bottom of the screen which I initially\nthought was a part of the menu graphics, but it remained on the screen even\nwithout the menu and in YouTube videos. Maybe my luck was bad and I didn't get\nthe chance to use it, but I am returning it because I am not sure if I want to\ntake the chance.\n\n", "Product description is very bad. There is no proper response from TCL. I asked\nTCL that difference between this model (L55P2US) and L55P1US. So far no\nresponse. We have to buy this product by closing our eyes without knowing the\nproper details.\n\n", "TCL : Buyers - Mind it, its a Chinese Company. Considering the price (31k) its\na good bet  \n  \nPros :  \n1\\. 43\" TV - with Android Smart features ( ** Not a fully Android Smart TV,\nTCL Customized Android)  \n2\\. TCast application works flawless (Cast from mobile or Tab)  \n3\\. Prompt Delivery and TCL Helpline is good ( though a very minimal\nknowledge, its a new product am sure they will get experience)  \n4\\. TV look and feel (Interface) i would give 5* for this - Looks decent,\ninfact very Good  \n5\\. TCL Browser is good enough, can watch online movies  \n6\\. Good Sound - don't expect Dolby Digital but will give good results if you\nconnect to your Home Theatre  \n  \nCons :  \n1\\. OK Picture Quality (Definitely not a Full HD or 4k TV) - I cannot wave\nthis off, because the TV is marketed by publishing as 4k version  \n2\\. Patchy inbuilt Youtube ( Inappropriate search with remote) but when\nconnecting with Mobile, this works good enough  \n3\\. Not fully certified from Google, hence NO Google Play Services and you\ncannot download all the apps from Google Play Store (TCL customized Android).\nYou cannot update Chrome and any Google Services  \n4\\. No Netflix ( Cannot install the Netflix App )\n\n", "Very poor quality panel. Light bleading on the edges.worst colour\nreproduction. No HDR support. Forget smart..most apps don't even work on this\ntv. Even youtube crashes most of the time.\n\n", "Got product @25k great picture and sound quality,Have a lot of function it\nwill take time to enjoy all the function\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 July 2017", "on 19 October 2017", "on 15 January 2018", "on 3 August 2017", "on 27 September 2017", "on 3 October 2017", "on 16 August 2017", "on 21 August 2017", "on 7 January 2018", "on 11 May 2017"], "reviewer": ["Shridhar Talukar", "Mannytech", "Praveen  Lal", "Amazon Customer", "sachin", "Irfan Haider", "Amazon Customer", "Srikiran Betha", "Nikhil", "RAJEEV AWASTHI"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Very slim design and looks beautiful in golden color", "*********Before you purchase the TCL TV please read my experience today as you are going to spend money from your pocket*****", "Great for the price but few technical flaws!", "Terrbile TCL customer service", "Worth buying for its features", "Value for money", "In-depth review of TCL 43\" 4k Smart TV", "Never trust TCL service!", "Bang For The Buck!!!! Just Go For It !!!!!!", "Although The Smart Features Are Total Crap I Still Find This TV ..."], "review": ["Wwwooowwww. Got this TV 3 days back around 24800 INR. Very slim design and\nlooks beautiful in golden color. The picture quality is amazing. I strongly\nrecommend to buy this product.\n\n", "*********Before you purchase the TCL TV please read my experience today as you\nare going to spend money from your pocket*****  \nHello Everyone,  \nI'm from Pune. I was planning to purchase a big screen LED just like most of\nyou.  \nLooking for affordable TV, I was checking with TCL as an option.  \nBut when I checked the reviews on the product from other I doubted for the\nservice from TCL.  \n  \nThat's why before purchasing the product I contacted TCL support where my call\nwas never been answered and call dropped more than 10 time while in the queue.  \nLater I just googled if there are any service centers in Pune from TCL where\nthe picture was more clear to me.  \nIf you check the official site for TCL India , you will not find any accurate\ninformation on the service centers.  \nWhich directly indicated me that I'm not going to get a quick service in Pune\natleast.  \n  \nLater I found some results for TCL service centers on the google search, where\nfew of the numbers appeared.Check the pictures attached.  \nI called every number that has been listed, and that's where it was a HORRIBLE\nEXPERIENCE.  \nI asked if I'm speaking to the authorized service center from TCL? The person\nreplied YES  \nLater the receptionist/support person asked me a question: Is your TV under\nwarranty? To which I replied YES just to cross check  \nThen she told me that they only repair TV which is NOT under warranty and is\nprivately charged.  \n  \nSo this was my experience with looking for TCL support today. From this\nindications were very clear to me  \nIf I had purchased the TCL and for any reason I had any issues, there was no\ndirect support  \n  \nFrom other reviews where they say : you get for what you are paying  \nI understand comparing to others TCL is more affordable and to some extent we\nare already compromising on the quality that we are getting  \nBut as a customer what was missing for me : is a service and assurance of\nhelping you in something goes wrong  \n  \nSo before you purchase this TV , please cross check if you will get service\nfrom TCl at your location and then come to a decision.  \n  \nAfter spending an entire day looking for trust for TCL I ended up finding\nnothig.  \nHope this helps you and also my words reach TCL management.  \n  \nThanks.\n\n", "Bought the TCL 43 inch L43P2US during the recent Amazon sale around 15th\nAugust , 2017. Received the product in perfect time and no hassles with\nDelivery. Used the TV for 3 days but was forced to return it as it fell short\nof my expectations which I have listed below.  \nPROS:  \n\\+ Screen is extremely crisp specially when playing 4K content.  \nTCL 109.3 cm (43 inches) L43P2US 4K UHD LED TV (Golden)  \n\\+ Sound quality is good but the TV has down firing speakers and I would have\npreferred front firing speakers as the sound travels better (this seem to be\nthe norm with all LED TV's nowadays).  \n  \n\\+ Connectivity options are very good with 3 HDMI ports , 2 USB ports , 1\nNetwork port along with all the other standard connections.  \n  \n\\+ The Bronze / Gold colour of the bezel is a good change from the regular\nblack colour as it gives a premium look to the TV.  \n  \nCONS:  \n\\- The standby light is white colour and is quite bright. It is disturbing\nwhile sleeping specially if you are sensitive to light. There should be an\noption in the menu to either turn off this standby light or make it dimmer. By\ntrying to make the TV look fancy , I see this as a design flaw by the TCL\ndesign team. I must point out that this is in all latest TCL LED , even the\n32inch model.  \n\\- Even though the TV has 3 HDMI ports , not a single port is with HDMI-CEC or\nARC. For those who are not aware , this feature is a industry standard for the\npast 4-5 years. It is used to control the TV volume , power Off / On from a\nsingle remote of a third party Media box like the Apple TV or ROKU Streaming\nBOX through the connected HDMI port. This was the biggest factor for me as\nusing two remotes is inconvenient.  \n  \n\\- The screen is crisp and clear but you can see SLIGHT bleeding on the\ncorners near the bezel if you watch it in a dark room and there is a dark\nscene (Not very noticeable though).  \n  \n\\- The remote control is quite thin but its too long and not the most\ncomfortable to hold and operate specially in a Dark room where you can't see\nthe buttons. Also, the IR could have been better as it has to be pointed\ndirectly at the TV to work.  \n  \n\\- Incase of electricity failure , the screen does not turn back on\nautomatically and goes into standby mode. You need to use the remote to power\nit on again. This can be quite annoying if you live in a city where\nelectricity goes often and specially while watching a movie when the remote is\nnot right next to you.  \n  \nOverall this product is value for money if it's purchased below Rs 32,000 - Rs\n33,000 and if you don't care about the technical flaws which I have mentioned\nabove. I would rate it 3 out of 5 stars.\n\n", "Was expecting delivery on 22nd September but delivered on Oct 4th. Had\nproblems from the day one (1) Does not support Amazon prime. (2) Majority of\nthe Android apps neither work nor compatible (3) Randomly powering off (4)\nlosing network connection frequently. Note that router is 6ft away in the same\nroom (5) TCL technician diagnosed defective MCP Board  \n  \nTCL customer service is worst. When I called, typical answer is someone from\ntechnical team will call you back. After four attempts, as Amazon customer\nservice reprentative mentioned insisted for a Service Request Number.\nSurprisingly, TCL agent does not have any earlier calls noted. I had to argue\nto get one. Amazon wanted to worksheet from TCL technician but they do not\ngive you a copy. I had call their supervisor to get a photo of the work sheet.  \n  \nAll in all, terrible experience from TCL and Amazon did not live up to the\nBrand promise too.\n\n", "Bought Tv for 31090. It was delivered on the second day from the order day.\nBut the technician came to the house after two weeks upon multiple calls and\nescalations with the customer care. Though standard wall mount bracket is\nfree, i opted for movable wall mount with the technician and bought for 1200.\nI hav got the free bracket as well.  \nIts been a month since i started using it. I use sun direct to watch the\nchannels. Builtin WiFi used to connect to my home router to watch YouTube\nvideos. The quality of videos is excellent and ultra HD makes it best. There\nare few default apps that can't be uninstalled. Default app store has veryless\napps to install. Hence i installed play store from that app store and\ninstalled few apps like dolphin browser, antimalware, mx player, etc. But many\napps are not compatible such as chrome, firefox and amazon prime app kills\nitself when i tried to play video. When I tried to play it using dolphin or\nother browsers it didn't work as it works in latest chrome. Online streaming\nin browser and YouTube worked perfectly well. I used Tcast default app to open\nimages, videos directly from mobile to see in TV and it was great. I used HDMI\nport to forcast laptop screen in TV and no issues with it. The sound quality\nis not so loud but decent. I used to connect my F&D home theatre using Aux AV\nout in TV and experienced better sound.\n\n", "\n\n Writing my second review after 8 days usage.  \n  \n1) Delivery:  \nBooked 27th june. Expected delivery mentioned as 3rd july. But package\ndelivered on 30th june. Awsome amazon.  \n  \n2) TCL TV:  \n  \nPros:  \n🔘 picture clarity and colour reproduction is first class. Hollywood HD movies\nsync best in this TV display.  \n🔘I watched a real 4k video and oh my god such an awsome clarity like seeing a\nhigh resolution digital photo. Worth a lot for this price tag.  \n🔘sound reproduction was good. Note that you have to manually change sound\nsettings to get that good volume.  \n  \nInternet and smart features:  \n🔘My area has poor internet connection. So i used my mobile's wifi hotspot and\nconnected tv to internet.  \nNote that, signal strength will be good in a particular spot inside my house.\nSo i kept my mobile there. Distance from mobile to TV is almost 10 mtrs. 4G\nsignal so speed was around 3-5mbps.  \nNow I watched Baahubali full hd video song via YouTube. Buffering perfectly\nwithout any lag. This shows tv's wireless signal capturing strength was\nawsome.  \n🔘youtube videos also gave same superb resolution.  \n🔘almost some important apps are available in app store. If not there then we\ncan get google play store from tcl app store. Then via google play store we\ncan get all android apps.  \n  \nCons:  \n🔘 eyes are irritating Watching continuously. Does it was default for all led\ntv's?  \n🔘TV is Earthing on the right side back. I felt very minor current. Did my\ncurrnt line was fault or TV I don't know.  \n🔘some video formats are not playing by default. But after installing mxplayer\nit got resolved. So not a big problem.  \n🔘TV's outer materials not looking that durable. Still ok. Anyways what shall\nwe expect for 30k price tag?  \n🔘No alphabet keys in remote. So searching option is a hectic one.  \n  \n3) Service:  \nI saw many people complaining service. I guess that depends on the location\nyou are. I am from chennai. Within 1hr from the product got delivered, I\nrecieved call from TCL service centre for installation on the same day. This\nshows that service center is well responsive in my Chennai location.  \n  \nNote:  \n▫️Consider your room size before buying 43inch TV. My room size was medium and\nTV looks very big so watching pictures from distance also looks very near. I\nbelieve that is the reason eyes are irritating.  \n▫️I use tata sky and its hd channels are syncing perfectly with tcl 4k\ndisplay.  \n  \nOverall, for a price tag of 32k, this TV means a lot comparing to others in\nmarket. In that aspect, we can say it is worth buying.\n\n", "It is a true 4k smart TV with android 5.1.1 installed, 6gb internal memory,\nwith Wifi and Bluetooth.  \nPicture and sound quality is excellent.  \nEasy to use, all types of connectivity support such as USB 2.0, USB 3.0, HDMI\n1.4, HDMI 2.0, RGB, 3.5 mm audio input, VGA, Ethernet etc.  \nSupports T-cast mobile app to connect your smart phone to use it as a remote\nor to cast content from your mobile. Mobile touch screen can be used as a\nmouse pointer for this TV.  \nI was able to connect my dualshock 4 controller to it via Bluetooth to be used\nas a remote control for the TV and the games in it. I ran real racing 3 on it\nusing Dualshock 4 and it was a great experience.  \nIt also connects to your PC via VGA or HDMI 2.0 cable (for 4k @60fps). As a\nhardcore gamer myself I tested many games on it such as GTA 5, Nier Automata,\nRocket league, Batman Arkham Knight, Street fighter V, Mortal Kombat XL, Dead\nor alive 5 last round and it functions almost identical to a 4k monitor at\n60fps. The 6ms input lag is very forgivable for a TV in terms of gaming,\nactually better than most TVs I've seen before.  \nMy final verdict is, this TV is a true masterpiece for it's price. I bought it\nfor Rs. 25k on sale but it's an​ absolute value for money even for Rs. 32k.  \nThanks to TCL and Amazon for this amazing product. I'm am truly satisfied with\nit.  \nPeace... 😃✌\n\n", "If you are looking for the quality of the TV, honestly I don't know  \nI waited for installation for 12 days and finally returned the TV unopened. If\nthey can't install a TV in 12 days after multiple promises, how can I trust\nthem to commit to the warranty service provided by them? All other brands are\nperforming next day installations while TCL is just toying with customers\neveryday saying \"It will be done today\". Mind you, this was after multiple\nfollow up calls and escalations from amazon and myself.  \n  \nExtremely bad service from TCL!  \n  \nEdit:  \nLook at the comment by TCL on this review: \"As per our telephonic discussion\nwe will arrange technical visit today to resolve the issue\" This comment comes\nunder a clear review stating I returned the TV. They called me after 3 more\ndays of returning the TV(15 days since buying), saying installation will be\ndone today. I was surprised and told them I returned the TV. Then I realized\nthat they did the call only to be able to write this comment under this\nreview. They just want to negate the effect of negative reviews on amazon by\nwriting comments like these.  \n  \nTCL, please learn from Amazon what customer service means! It doesnot mean\ngiving robotic responses to phone calls and giving commitments to customers\nwhich you don't care to deliver.. It doesnot mean writing comments under a\nreview..  \nCustomer satisfaction only comes with delivering on promises.\n\n", "FIRST OF ALL ACCORDING TO THE PRICE POINT THIS TV IS DAMN AWESOME!!!!!!  \nIT REALLY SMOOTHENS THE VIDEO AS WE SEE IN SONY TVS.  \nTHE COLORS ARE REALLY GREAT AND NOT THE OVERSATURATED ONES.  \nJUST GO FOR IT . FIRST OF ALL IT MAY BE A BIT DIFFICULT TO UNDERSTAND BUT\nAFTER THAT .....THIS TV IS A GEM AT THE PRICE . I CONNECTED MY LAPTOP WITH\nHDMI AND WHOA THE LAPTOP GAVE A 4K RESOLUTION OUTPUT AND TV SUPPORTED IT\nEASILY.  \nTHERE IS NO PLAYSTORE BUT AN APPSTORE SO, DOWNLOAD PLAYSTORE FROM THERE AND\nREST WILL BE SOLVED.\n\n", "Although The Smart Features Are Total Crap I Still Find This TV Way Better\nThen Buying Branded TV's .  \n  \nI'm Getting The 4K Display....And I Can Easily Make Up For The Smart Features\nOf The TV By Adding Airtel TV....Makes The TV A Whole Lot Better And Trust Me\nWhen It Comes To Basic Features It Stands Out.....  \nThe Only Issue I Faced Till Now Was That The Picture Settings Take Time To\nSettle Down While Using PS4.  \n  \nAll In All A Very Nice TV For The Price Bracket. I Got It For 49,999 ....The\n55 Inch Model .  \n  \nDon't Buy It If You Are Only All About Using Smart Features Cause It Has Quite\nA Crappy Software.  \n  \nBtw Only x265 HEVC File Formats Are Supported In 4K.  \n  \nAudio Goes Blank In x264 HEVC Files.  \n  \nAfter Using It For 15 Days....  \nI Can Say That Its The Best Purchase Ever....  \nPlaying HRD Videos On This Panel is Gorgeous.  \nEveryone Can Download HDR movies from torrent Websites....i've already watched\nquite alot of HDR Movies....  \nIf You want To show off that 4K display just download Planet Earth 2 From\n1337x ....Its Probably The best torrent site.  \n  \nAgain....buy it only for The 4K panel and not for the smart features....  \nIts worth it.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 May 2017", "on 21 November 2017", "on 25 August 2017", "on 20 October 2017", "on 1 August 2017", "on 1 July 2017", "on 18 May 2017", "on 2 June 2017", "on 3 July 2017", "on 1 September 2017"], "reviewer": ["Prem", "Prathamesh", "Dank", "Ramakumar S.", "Amazon Customer", "ANTSTAN", "Aman S.", "Sandeep Surya", "manzur ahmed", "Shivam Singh Rajput"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Be smart while using smart tv", "TV is good. But suddenly when I switch off", "One Star", "Amazing video quality", "4K with Smartness.....", "Poor after sales service by TCL..", "TV installation pending since 5 days.", "Two Stars", "Amazing product", "Budget 4K TV"], "review": ["Hi guys  \nI am writing this review after using it for a month. I am going to explain you\nthe whole experience  \nAndroid is worst because most of its inbuild game apps do not work but you can\ninstall shareit and you can install as many apps on your TV you want but you\nneed to check if that app is working or not because I have tried downlaoding\nsome games and music apps and it's working fine so try to be innovative while\nusing smart tv and it will give you all you want from smart tv and please use\nair mouse and keyboard highly recommended for smart tv. If have any doubt just\nlet me know and I will reply to your question\n\n", "TV is good. But suddenly when I switch off, stand by light is taking time.\nAlso it is not ultra HD display...\n\n", "West clarity\n\n", "After using the product these are my views:  \n  \nPros:  \n1\\. Amazing video quality. If u take any 4k video it looks as good as QLED TV\nof Sony.  \n2\\. Sound - Better than Micromax smart TVs. In par with Sony and LG TVs.  \n3\\. Easy installation of WiFi  \n4\\. Awesome Remote light weight and works in around 25-50m range  \n5\\. Very light weight and good build.  \n  \nCons:  \n1\\. It's not Smart Enough. We have to use the apps of TCL like nScreen. It's a\nSmart TV and not Android TV. So you have to happy with Apps what TCL gives u.\nYouTube is there but you need to a lot of browsing to get your fav video and\nit's not easy. Google store is there. But it will not install our Indian's fav\napp's like Hotstar, Amazon Prime video and TVF.  \n2\\. Rose color frame is slightly not looking classy. May be becoz I love Black\nframes.  \n3\\. Absolutely no Service and Support. After Amazon delivery you have to fix\nand install the TV. None will come to do the same from TCL service centre. You\nneed to find one service personnel and wait for him.  \n  \nOverall if u are looking for a 4K Smart TV without hitting your Budget this is\nit.\n\n", "Great product with all necessary things you want it and above all its 4K in\nsuch price. Nobody means Nobody in market is giving so much good product that\nbeats all the BIG SHARKS of market who are ready to get big bite to your\nPOCKET by saying at all it is our brand name (THEY BEG). FULLY SATISFIED with\nthe TV its settings are no rocket science that you will be confused how and\nwhat to do. Got the product before prior delivery date, safe packing and\ndelivery done by AMAZON. But the pain starts henceforth when the issue comes\nof installation TCL guys just have no care for their day by day growing\nconsumer numbers. I got the TV on 11th October 2017 but the installation (Wall\nMount) was done on 17th November 2017. So this the space that TCL and their\nguys have to fulfill very rapidly otherwise they will be next LeEco for\nmarket, I used to read about its reviews of previous consumers who had\npurchased the product they always said TCL service is like this and that but\nthis thing when actually happened to me then i came to know why it was\nwritten.  \n  \nI would like to say TCL product is nice but the service by their technicians\nor by their service providers must be improved. As in for AMAZON they deliver\nA to Z with a smile.\n\n", "Worst after sales service, got TV on Tuesday 16th may nobody turned up for\ninstallation in Bangalore. TV review will be done after installing, god only\nhelp us if anything goes wrong with TV...\n\n", "Lame service.Still TV installation is pending since 5 days.\n\n", "Absolutely fine deal, but installation is too delayed and no anyone answer u\nwhen u payment done\n\n", "This is my initial impression review.  \n1.Tv is very beautiful.  \n2\\. Great image production  \n3\\. Slim and sleek design with great gold metal  \nframe on side  \n4\\. Sound quality was awesome  \n5\\. All the necessary apps are installed  \n6\\. 5.8GB inbuilt memory available to install apps  \n7\\. Screen mirror done using Tcast app and was  \nquick and response with minimal lag while  \nplaying video on YouTube  \n8\\. Remote is slim and sleek and responsive  \n9\\. Very easy to use and we can connect mouse  \nand use it.  \n10\\. Best product at affordable price\n\n", "Very good TV at this price. Picture quality was super and sound is Crystal\nclear. Bang for bucks. Go for it. I got it for 25K\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 November 2017", "on 6 August 2017", "on 20 October 2017", "on 13 February 2018", "on 17 November 2017", "on 20 May 2017", "on 8 July 2017", "on 25 July 2017", "on 13 May 2017", "on 15 May 2017"], "reviewer": ["Vivekdixit", "Ravindra K.", "Kishor", "Amazon Customer", "shishir singh", "Johnny", "Prashant Acharya", "Raj R.", "Vishal", "Sravan"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Worst service", "Excellent TV, great Diwali shopping", "TCL ..looks superb with gold colour frame .", "Based on price, its good. Not otherwise!", "Tcl great...but problem create local dealership", "look really nice with great new experience ....strongly recommend to all my confused friends", "Waste of money", "Upset with the performance...", "I am using this smart tv since 8 months and hd picture clarity is ...", "When checked with the TCL customer service center they said its like that and it will not support as its older ..."], "review": ["Worst tcl service\n\n", "Excellent choice at affordable price, amazing picture quality for HD channels,\nyou tube videos run easily and smoothly with good connection, would highly\nrecommend this TV for those who are looking for high quality picture and smart\nTV features at comparatively lower price....Excellent product delivery and\nservice installation timing as per choice by Amazon 👍\n\n", "Wahhh after opening the package the first impression was awesome it's\nlike.thick Black marble(screen) covered with gold sheet....good product with\nless cost..in my opinion comparison with high brands is useless .. because at\nthis cost screen size it's best ..overall we are satisfied . Received 3 days\nbefore the expected date .\n\n", "Color reproduction is poor. Yellow is dark, contrast is not good, saturation\nis very bright. Despite that 3 stars due to the price-point and VFM.  \n  \nI am using 0% of its smart features, as I've hooked up my PC, PS4, Apple TV &\nFire stick.\n\n", "Tcl picture quality is best but unfortunately I received defect pease from\nlocal dealer by Amazon.....\n\n", "Great product with reasonable price with 1.5 years warranty  \ngolden edge look different and beautiful  \neasy to operate  \nmy first smart tv experience  \ninternational brand and same modal  \nI leaving in DOHA QATAR i saw this tv with same modal in qatar .in qatar also\nthis is a popular brand TCL\n\n", "Low grade chinese material used.  \nNot upto the mark.  \nNot at all durable.  \n  \nAnd on top of it the worst customer service support will make your decision\neven more miserable.\n\n", "Not able to play 4k videos, while I tried through USB pen drive it was\ncrashing in one word 4k content is not able to play and the YouTube videos are\nupto maximum 1080p there is no option available for 4k resolution.and display\nof the picture is more whitish ,apps are the worst keep on crashing go for LG\nor Samsung.\n\n", "I am using this smart tv since 8 months and hd picture clarity is very good,\nsound quality is also nice..Only observed some drawbacks in inbuild apps .. 1.\nN screen app is always showing error message when I start tv..2.Youtube\ninbuild app also showing progress bar as per 10-15sec of interval..tcl need to\nfocus on software which they are using..Tv is bit slower..Color scheme is not\nthat much higher that I was expecting.\n\n", "It does not support the external speakers with inbuilt youtube. When checked\nwith the TCL customer service center they said its like that and it will not\nsupport as its older version. However it supports the external speaker for all\nother functions. Could not download and add any other app and unable to delete\nthe waste inbuilt apps in the TV\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 August 2017", "on 15 October 2017", "on 25 October 2017", "on 8 August 2017", "on 2 March 2018", "on 29 September 2017", "on 24 August 2017", "on 25 February 2018", "on 26 December 2017", "on 23 February 2018"], "reviewer": ["devender manga", "Prasen", "P.VAMSI KRISHNA YADAV", "Daljit Singh", "Raval Nilesh", "azhar", "Urjasvi Dave", "Amazon Customer", "Sandeep Chaudhary", "Muneerullah Baig"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Bad picture quality.", "t like this colour display &", "Need TCL Technician to install wall mount", "Pros 1) Picture quality is very good, comparing it with my high end SONY Bravia ...", "Great TV", "Product is not good, due to following reasons", "Worth semi Android TV at reasonable cost..", "One Star", "Worst product service by TCL", "Poor customer service .most the app is not working ."], "review": ["It does not worth even 20k.  \nJust ask yourself why you want to purchase led tv, my answer is good picture\nquality experience.  \nThis tv is displaying blue colour as green, yellow as golden and similarly\nmessing other colours no matter how much tuning you are doing in color\ncombination and use different mode. Just because it is inexpensive and people\nbought in 25k and it is 43 inch tv the rating is high.\n\n", "I don,t like this colour display & sound\n\n", "The TCL technician has not come even today for the wall mount. I got this TV\nmonths back and it feels very disappointing to see no commitment.\n\n", "I bought this TV a month ago @ Rs 31999, I am writing this review after using\nit for a month.  \n  \nPros  \n  \n1) Picture quality is very good, comparing it with my high end SONY Bravia 3D\nsmart TV, albeit its not equivalent to SONY but its certainly on par with LG\nand Samsung. The 4K quality is really good.  \n  \n2) Design: Slim design which is very pleasing to eyes.  \n  \n3) Apps: I did not have a high hopes on its price features and I did not\nexpect it as well from a 32K TV, specially after reading negative reviews on\nits smart features but I am able to run Netflix, Youtube, Hotstar. These apps\nare not on app store, you have to download and install the apk on your own.\nHaving said that Amazon Prime Video APK and Voot is not working on this TV.  \n  \nCons  \n  \n1) Poor Configuration: Hardware configuration is very poor, processor and ram\nis not enough to power the software its running on. If you are playing video\non youtube app and you are changing volume at the same time, from TV remote,\nyou may see a lag in the TV's response. Sometimes video and audio are not in\nsync which is again a result of overloading of processor.  \n  \n2) Remote: remote doesn't have airmouse or voice feature.  \n  \n3) Android Version: Android version is old and somehow I am not able to update\ngoogle play service due to which many apps are not running. Voot and many\nother apps run on latest google play service and they display an error message\n\"Please update google play service\" but when you update google play service it\nshow error 504.  \n  \nIn the end I would say its a good buy, I usually watch netflix and hotstar and\nI am not feeling a need to buy mi box or amazon firestick however all these\ncons can be overcome by buying amazon fire stick in just 3-4K.\n\n", "Awesome, Good picture quality & sound. Thanks to Amazon.\n\n", "Product is not good, due to following reasons, 1. WiFi worked for T-Cast\n(mobile to Tv Screen) worked only for 3 days. 2. None of the smart TV features\nare easily accessible / or they are not working (so we can say they are all\neye wash) 3. Price mentioned on the MRP on box is 32,990/- where as they are\nshowing that they are giving great discount is all Lie by Amazon (pls check\nthe MRP on the box its Rs.32,990/-) so there is no discount given as shown in\nthe Amazon. 4. With all this i fine they are dumping Chinese products by\ngiving misleading adds and once you buy you can never return/refund your\nproduct.  \n  \nSo beware before you buy. There is no Onsite warranty also, which means you\ncannot carry the heavy tv to their customer care nor you could get it repaired\neasily.\n\n", "It seems to be perfect at this cost although it is not pure Android experience\nbut anyways it has good picture quality,it plays crisp videos even from your\nUSB pen drive & Hard disks.The stock applications are unuseful and unnecessary\n& we can not delete them.As it is not stock android we can not access latest\nupdates and applications which are available to Android TV as the Google Play\nis locked by TCL to certain extent where user feels limitations and\nhopeless,however you can install the apps which are installed on your\nsmartphone to this TV via an very useful app ES Explorer available on Google\nPlay Store which you can install first on your smartphone and then to your TCL\nTV and remotely install any App you wanted to be install on your TV easily\nover WiFi.Overall good experience on such a budgetary cost for 4K Version and\nsomething is better than nothing you still have some hopes on experiencing\nsome Android apps easily in this TV as it is running on Android 5.1.You can\nalso make it pure android by purchasing the Android Box separately & your TCL\nwill be your pure Android TV..So chill as it costs around 7000INR and can save\nyou money by few thousands rather than purchasing a Android TV which is\ncurrently in few lacs of rupees..The MI android Box is good enough as it\nprovides magic remote and voice command set..so go get it..Anyways it runs You\nTube seamlessly thats it...\n\n", "Not all items are given along with package\n\n", "Worst service by TCL. Product got delivered 6 days back and installation is\nnot done till now. Daily TCL people are saying today our technician will come\nand will install. Amazon also is not taking responsibility and saying contact\nTCL only.\n\n", "It's more than a month I haven't got demo from tcl..most of the app is not\nworking..  \n  \nI have called many times .but haven't got any response.. worst customer\nservice.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 May 2017", "on 11 January 2018", "on 17 October 2017", "on 10 September 2017", "on 15 May 2017", "on 25 August 2017", "on 1 December 2017", "on 18 October 2017", "on 18 July 2017", "on 21 July 2017"], "reviewer": ["Amazon Customer", "RAJESWARI U.", "AR", "Amazon Customer", "Sujit G.", "Consumer", "Shrikant T", "steevan Fernandes", "Manoj", "Alaganandan K."]},
{"rating": ["1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Damage", "Good Sound. Value for money", "Help yourself by not buying.", "Pathetic After sell service, TV was Good", "What a beauty!!!", "Good product", "Complete value for money", "One Star", "Unfortunately, nScreen has stopped error", "This tv will get the job done, don't expect wonders."], "review": ["Screen is damage\n\n", "Unexpected Results on 4K. Good Sound. Value for money. Thanks TCL, Cloudtail &\nAmazon. Nowhere you get 43Inches 4K TV at this price of 25K & with energy\nefficient only 75Wh Power Consumption.  \n  \nAfter one week of delivery tv having screen issue. Sos return ung the same to\namazing. Good pocket up support from amazing.\n\n", "Hello Guys,  \nI purchased this product on 2/10/2016 and it's a pathetic product with worst\ncustomer service.  \nThe TV has got panel issues and u ll c noticeable change in colour and pixel\ndisplay.My TV has a different colour in half and lighter version on other half\nof TV.  \nHas been chasing over a month for panel change but no visit by engineer.Its\nlike buying Tata cars to Maruti.Well u can have a monster TV but smart\nfeatures are of no use.Product will fade in a year.Its a genuine review after\n10 months and deeply disappointed.Hope it gives sense to all to buy a\ndifferent product from other brands.\n\n", "Yeah TV was too good till the time it was working fine (6 months from purchase\nAhmedabad). now there is a major issue of Display Panel not working at all.\nRegistered complaint on 9th Oct the guy came on 13th Oct and he requested for\ndisplay panel. I am given 4 different people with their number to talk with\nand to know the status of our complaint and now there is NO display panel\navailable to them at all and they give us two possibilities refund or\nReplacement they will let us know in 5-6 days(9th Nov). And today(18th Nov)\nwhen I called the guy is not picking up my call tried 6-7 No answer so I'm\nposting this.  \n  \nNo complaints abt TV just the sound used to come first and movements in\ndisplay a little late but can be adjusted in settings.  \n  \n>Buy it only if you're sure that you will never call their customer service<\n\n", "First of all i want to correct all for the color the TV BEZEL is not black its\nof golden colour, and i tell you what it is the beauty of the TV nobody can\ndefine this TV,even amazon doesn't know about this tv, its images, its\ndescription, only one word : it is a master piece by tcl, yes man it is a\ngolden beast , one of the greatest purchase of mine and i request Amazon,\nrequested several times that please describe the product correctly, it is of\ngolden colour and it is the latest model by TCL, i.e p43 us\n\n", "Nice product, it's a true 4k, bought it in INR24812, so please keep in my\nbefore buying it in 31999 (price in great Indian sale 11-14 may 2017). It's\nreally a must buy item.\n\n", "Bought this TV from amazon on 31st may. TV got delivered on 5th June . Today\nis 3rd day ... so here are the pro's and cons ...  \n1\\. Picture quality is good . colors are not as saturated as Samsung TV's ,\nbut its good .  \n2.Overall viewing experience is good .  \n3\\. Sound is good , currently it is table top , can comment more only after\nwall mount is done !  \n4\\. Watched full hd movie from my 1TB external HDD without any issue .  \n5\\. Downloaded a 4k video in mi note 4 , (1:13 min. video , size 1GB !!) . Not\nable to play it on mobile , but this tv played id seamlessly  \n6\\. In build youtube app , I was not able to change the video quality . So I\ndownloaded youtube app from it's app store and it is working great . We can\nonly watch 1080p video in youtube app .  \n7\\. Connected laptop via hdmi , watched UHD video from pc to the tv ..worked\nfine .  \n8\\. MI 3s , MI note 4 ... casting was buttery smooth ..but I could not cast my\nsamsung galaxy note 2  \n9\\. MEMC works fine , movie watching is great in this tv  \n10\\. SD channels looks very ordinary , but HD channels are fantastic to watch  \nCons :  \n1\\. Colours could have been bit more vivid and sharp . Crispness of\nSamsung/sony uhd tv is missing  \n2\\. could have given other live tv options/Netflix subscription  \n3\\. Only piece missing is an air remote .. this remote is killing a fair bit\nof fun .\n\n", "Facing a technical issue\n\n", "Every time the TV is switched on I get an error \"Unfortunately, nScreen has\nstopped\" at least 3-4 times and I have to press OK from the remote every time\nto continue using the TV. More importantly it only started happening after the\nreturn window was closed so now I have to raise a support case with TCL for\nthe newly purchased television.  \n  \nUpdate on 21st Dec:  \nI found that even Bluetooth is not working on the TV so in a nutshell most of\nthe Smart features are not working on this so called Smart TV. I called TCL\nhelpline at 1800 419 0622 on December 6 but the response was pathetic and I\nwas not provided any request number but I was only told that someone will call\nme next day but till now I have not received any call. I have today sent an\nemail to indiasupport@tcl.com and hope to get the required support from TCL.\n\n", "The TV build is good but there's flexing at some places. The interface is\ngreat as long as you don't use the inbuilt apps. The ports section is rock\nsolid. While the display is borderline good, the apps suck. The image clarity\ndepends on the content being offered. If the content is shot in full HD expect\nthe output to be in full HD or else your tv won't do much. Something to\nconsider right. Actually no point buying a 4K tv right now when most of the\ncontent is offered in 420p to 1080p. TV channels are disappointing to watch.\nThe pictures are so grainy. HD channels disappoint but a little less though.\nEven with a high bandwidth internet connection the apps don't load at all. So\nwhat's the point of them being there on the tv. The speakers sound very basic\nbut very natural and very clear. My impressions about this t v are mixed but\nthey tend to be more on the negative side. Will wait for a few more days and\ndo a little more tweaking and then edit this review just in case I find\nsomething more positive to write about. I have purchased this tv. Even though\nI don't regret buying it I now know why some brands sell their TVs at such\nhigh prices.  \n  \nIf you already have already downloaded 1080p videos they do get scaled to 4K.\nThis is only for true 1080p videos not for those converted videos with crap\nsoftware which simply give you an output with a bigger file size and no real\nquality. The reason HD channels look okay and not great is because they are in\n720p is what I'm guessing.  \n  \nNow I find there's uneven back lighting on the screen. There's a shadowy\neffect on a few areas on the screen and then there left side of the screen is\nbrighter than the rest of the panel. At an angle if you check you can make out\nthat the screen isn't fixed properly in place. Have ordered a replacement.\nLet's see how it goes.  \nLet me tell you the apps on this tv are a pain to navigate with the remote. It\nis better to download the tcast app and then try. It gets better but not all\nthe way.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 November 2017", "on 25 May 2017", "on 26 August 2017", "on 18 November 2017", "on 2 May 2017", "on 13 May 2017", "on 8 June 2017", "on 14 January 2018", "on 16 November 2017", "on 7 May 2017"], "reviewer": ["U NAGA RAJU", "atulkumar bambharoliya", "Amazon Customer", "Viraj Vidhani", "Rahul Verma", "Amazon Customer", "Amazon Customer", "K v Naga raju", "Pooja N.", "Ruku"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["The display is amazing! If you're thinking you can play 4k video ...", "Best 4k cheap TV like samsung ans sony in India", "WORST TV EXPERIENCE EVER!", "Honest Review After 2 Weeks", "Not Sony Not Samsung but is a Super TV for small bucks", "Oredered with hope ....to get a feature packed 4k led at cheapest market rate.", "Amazing TV experience can't ask more at this price range...", "It is a really good tv.", "TCL : Zero smartness below average product", "SLOW DILIVERY"], "review": ["If you're looking for a budget TV this is the one. I wanted a screen to play\ngame on my ps4 and I don't regret a bit. The display is amazing!  \nIf you're thinking you can play 4k video from YouTube you can't!. You can\nconnect to your pc or laptop and play 4k videos.\n\n", "Pron:  \n1) Best picture quality like Sony and Samsung  \n2) Sound is best  \n3) Build quality is ok  \n4) Over all TV is best  \n5) Colors are vivid  \n6) Youtube video are best seen even in 360 dip settings. looks like HD\nchannel.  \n7) Its smart 4K tv with wifi/Bluetooth/LAN available  \n8) Slim remote control which is easy fit in hands. Easy to use.  \n9) Subtitle option on remote control to change the language of the movie  \n  \nCons:  \n1) Vertical blue and black lines coming on the screen, I have replaced the TV\nlets see how new replaced TV is.  \n2) No netflix pre-installed  \n3) No netflix available on google play as well as TCL play store.  \n4) Customer service is very slow, they have not came to install the wall mount\nyet.  \n5) By default Video lips synchronization with the audio is missing, However\nthere is audio setting where we can sync the audio with the picture.  \n6) Eyes are irritating if we see TV for log duration? Does this same issue\nwith all other brand TV ?  \nI would like to give 5 out of 5 for this TV but due to poor customer service I\nam giving 4 rating. I would recommended to people to buy this instead of\nLG/Samsung/SONY TV which are costly and having same picture quality like TLC\ntv.\n\n", "The TV works on it's own will. It will let you connect via screen mirroring\ntoday, but tomorrow it might not! Now it has problems playing any format of\nvideo which it played earlier with ease. Most of the features are for name\nsake. Waste of money!\n\n", "Overall a good 4K led smart tv with good specs at an attractive price.  \nHave been using it since 2 weeks, Here's my honest opinion  \nPro's- 1) Premium design (slim) looks stylish in golden color, Remote is sleek\nwith decent buttons, fast startup time (4 secs from standby mode)  \n2) Sound quality is good, adequate for most needs (External speakers not\nrequired)  \n3) Screen mirroring, Bluetooth etc work fine without lag (tested with oneplus\n3), good connectivity(3 hdmi, 2 usb ports, Optical audio, Wifi)  \n  \nCon's-1) Colors are not very bright and as pointed out by some users even I\nspecifically noticed that the yellow color is not properly calibrated (looks\nblackish yellow) this hinders the Overall picture quality hence rated 4\nstars,This apart everything else is fine (lets hope there's a fix for this\nproblem) 2) I noticed that the Display panel sometimes gets too dull when you\nchange channels (I think its a software/Adaptive Backlight dimming issue)  \n  \nDelivery & Installation - Delivered on time with decent packaging, Wall Mount\nInstallation was done the same day by TCL team (Faced No Delays).\n\n", "I don't know why there is so much negative been spread by the people for this\nTV. I bought this TV on 8th October, it was delivered to me by 10th and the\ninstallation guy came by 12th and in half an hour mounted the TV on my tv\nunit. Bought a 4k uhd set top box of Airtel internet tv with it and they took\n7499/- yearly subscription for all hd channels. Now I am having a very good\npicture quality with superb clarity and I feel that my decision of buying this\nTV was correct. If you will buy a third grade dth connection with normal set\ntop box, you will see grains and will have bad viewing experience for sure.  \nAgar haathi liya hai to khilana to padega hi, hence buy the best quality hd\nconnection with the same, you won't regret. As far as service is concerned the\nguy who came to install the tv installed it and has given me his personal\nnumber for any issue with the tv. This service I have got when I am living in\nMysore.  \nI have bought this TV after seeing it for 3 years at my sister's place.  \nSound is good for a hall size of 12x10, if you have a bigger place buy a Sony\nd100.  \nHave a speedy internet connection for hassle free app experience, if you are\nhaving problem in app installation download it from apk mirror, take help of\ntechie people.  \nIf you want 4k experience, YouTube is the only option, but soon dth operators\nare going to bring the 4k channels at your doorstep, my set top box has the\noption for 4k but currently it is running in 2160p.  \nFor any other issues you can write to me, I will be there to help. Hope this\nhelps you in making a decision.\n\n", "I think i odered this 4k tv on 28/04/2017 due to its lucrative price of 24812,\nit is the best feature tv at this price on paper. Let's hope the product\narrive with the same promise what company is telling. Hoping for the best and\nwish that it will not disappoint me.\n\n", "Hi  \nI just wanted to get myself a TV for purely TV watching experience & for me\nsmart TV was a secondary option.  \nAfter doing some some brief online research I narrowed down to TCl 48 inches\ncurve full HD & 43 inches 4k.  \nOn 15th night I placed order for 43 inches 4k (rs 25108/-) maybe I was lucky\nenough to get the discount offer.  \nNow coming to TV  \nPros  \n1\\. Amazing picture quality  \n2\\. Very premium  \n3\\. Very slim with brushed metal bezels  \n4\\. Featured packed connectivity options  \n5\\. Slim remote  \n6\\. Watching online content is smooth & very fluid  \n  \nCons  \nAs such I found nothing....  \n  \nJust go for it & enjoy pure viewing experience it's a complete family\nentertainment unit.  \n  \nThanks Amazon for awesome deal & prompt delivery.\n\n", "It is a really good tv... i was very much confused before buying because of\nthe mixed reviews so after buying I decided to make a realistic review it is\nnot divided in pros and cons but you will get an idea of whether to buy it or\nnot by reading it  \n  \nfirst of all its a budget 4k smart tv... so you have to compromise in certain\nareas... keep ur expectations realistic with it.. secondly the 4k display is\nnot at all comparable with any high end products out there... its great but\nnot perfect...  \nthe smart features are good... and to all those people complaning about apps\nnot working ill say its a android based tv, so you need to do some youtubeing\nto sort your problems... again its not android tv.. but an android based tv...\ntcl's own app store has many use full apps and also has google play store in\nit which u can download... play store has all the apps which are supported by\na tv...  \nAnd if u dont find any app you need.. u can install it by using ES FILE\nEXPLORER ( search youtube for how) i installed showbox through this method and\nit works really good... youtube provided is not good.. u can install it from\ngoogle play store... u will get the latest version.. which works really good.  \nFor casting it has nscreen and tcast... a never opened nscreen because i read\nabout the annoying msg that always pop up.. i am using tcast and my samsung's\nsmart view... it works really good... it works with any casting app...  \n  \nAudio output is not good not bad... can be better...  \nScreen is really good... hd videos are absolutely perfect but the 4K videos\nhave a decent quality...  \n  \nAgain if u are not satisfied with its smart features u can always buy fire tv\nstick or an android box later... u get 3 hdmi ports... so thats not a\nproblem...  \n  \nFor show box i was not comfortable using it with the TV remote so I attached a\nwireless mouse and now it works very good  \n  \nInstallation service was provided by Amazon service and it was really great\nand for free and they didn't charge for the Wall mount for that's great  \n  \nWill update as i further use it...\n\n", "Pathetic Service by both the CS rep of Amazon & TCL, they made by shopping\nexperience hell,never returning to Amazon for sure, To get a basic support\nlike installation is pain from both amazon & TCL. The way Reps spoke to me was\nquite humiliating & insulting as a customer.  \nTCL TV : Average but you will not be satisfied for sure, An amazon exclusive\nproduct is incapable of install/playing amazon prime video. Rest all apps are\n\"Bakwass\". YouTube the only useful app acts weird all the time, the search\nwill not pull any result \"Load result fail\". last step to get it work is\nfactory re-set, i had to do it 3-4 times a day. Rest all apps have Chinese\ncontent, Not sure I'm living in China or India or may be amazon is selling it\nonly for Chinese customer in India. TV remote is a pain to\nhandle/type.Display/Sound is average but the TV is marketed as Smart, i wish\nTCL understand was smart TV is? rather going for this TV buy any FHD TV from\nLG/SONY. for smartness add in another Amazon Fire TV stick much reasonable.I\nwish i had done that instead wasting my Money & Time in this product.  \nThe way i got treated by amazon & TCL, i have no stamina left to again go for\nreturn/refund. have to stick to this.By the way anyone thing to Return the\nitem, be prepared its not a easy task. Job sheet from TCL/Calling TCL to visit\nthen pleading amazon.Its hell. then there will be few reps in CS team who will\nlet you know the real value of amazon customer.\n\n", "I buy this TCL LED TV dilivery is slow but i think product is best\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 July 2017", "on 5 July 2017", "on 21 October 2017", "on 12 July 2017", "on 14 October 2017", "on 30 April 2017", "on 24 May 2017", "on 10 October 2017", "on 24 October 2017", "on 4 May 2017"], "reviewer": ["Amazon Customer", "Nitinkumar", "Jaydeep M.", "Saif Ali", "Amazon Customer", "brain train", "Amazon Customer", "Mihir", "Amazon Customer", "nikhil k."]}
]