[
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Performance and price at it's best!", "... about 20 days could say that I made a good decision. 2 major problems I had with my ...", "Its a great mobile", "May the force be with you", "Great phone. Superfast and amazing experience", "Extended Warranty for 3 months on your Oneplus 5T", "5T... More than an incremental upgrade.", "For a user like me who jumped from j7 prime to 5T", "Best Battery efficient phone", "Great delivery and exchange experience!"], "review": ["Simply the best!  \nUsing this phone for the past one month now. It is undoubtedly the best phone\nin this price range. One plus has done it right, combined the best hardware\nwith the smooth silk and user friendly software.  \nPros:  \n1)Beast in performance with snapdragon835 processor and 6/8gb RAM.  \n2) Almost feels like unlimited storage with 128gb variant.  \n3) Dash charging- 0-full charging in 1hour 10 minutes.  \n4)full 1 day battery life with heavy use. 1.5 days with light to moderate use.  \n5) Highly customizable software- gestures and navigation button functions have\nmade power button obsolete.  \n6) Blazing fast face unlock and the fastest finger print scanner in the\nmarket.  \n7) A very good camera for the price range.  \nCons:  \n1) Audio and speaker quality could have been better.  \n2) Low light photography needs improvement.  \n3) No portrait mode in front camera.  \n  \nApart form all these, this phone just destroys all competition in this price\nrange. A must buy for someone with a range between 30-40k.\n\n", "Switched from iPhone 6s to OnePlus 5T and having used this beauty for about 20\ndays could say that I made a good decision.  \n2 major problems I had with my iPhone was camera and memory(was using the 16\nGB version), 5T has an amazing camera that ckicks sharp and crisp pictures\ncomparable if not better than Note8 and iPhonex. Also Memory is not an issue\nanymore.  \nHave saved 17k over my last purchase and I still get a better Phone, what more\ncould I ask for :)\n\n", "Simply awesome.. Best in the market. Only one request.. Should have included a\nbetter cover/case and an earphone. It will be a nice gesture.  \nMobile is a beast no doubt about that.\n\n", "One of the best phones I have used till date.  \nComing from iPhone 6s to this was a very nice move as I am getting the best\nfeatures at low price.  \nDisplay,camera,software,sound - all A+  \nFront camera doesn't have portrait mode  \nI have the star wars limited edition - the force is strong here!! Guys and\ngirls, if you want the best features Inna phone but don't want to shell out\nmuch on iPhone 8/X then this is where your search ends.  \nThank you Amazon for a speedy delivery\n\n", "Great phone. Superfast and amazing experience.  \nVery good camera quality: back as well as front. Also, it has nice depth\neffect feature.  \nVery good configuration.  \nPerformance is good. No lag at all.  \nSound quality is decent enough.  \nBest phone in this price range.  \n  \nDrawback:  \nCould have provided SD card expandable memory.  \nDesign could have been something unique.\n\n", "I am sharing these two codes with the community so that you can get free\nextended warranty for 3 months.  \n  \nThe coupon code is only for the purchase of One plus 5T midnight colour\nvariant  \n  \nHere is the code for this :  \n  \nCoupon code for use on purchase of OnePlus 5T (Midnight Black 6GB RAM + 64GB\nmemory): removed by Moderator  \n  \nCoupon code for use on purchase of OnePlus 5T (Midnight Black 8GB RAM + 128GB\nmemory): removed by Moderator  \n  \nThe person will have to purchase the device from Amazon India only. Valid from\nFebruary7 to February20 2018 ).  \n  \nYou will receive the confirmation e-mail confirming the activation of the\nextended warranty as applicable by March 31, 2018  \n  \nWhen you add this product to your cart you will be asked below for the\npromocode, you have to apply this code over there.\n\n", "I'm definitely pleased with my 5T. I held myself from posting a review for\nalmost a month to test and see if it's consistent. And yes. It definitely is\nconsistent. This is the best purchase for the price and for the performance.\nThe battery life is enough to get thru a day with some left over if you aren't\na power user. The camera is good. The build is solid. The screen is darn good.\nAnd the UI is smooth and close to stock Android. Definitely worth it!\n\n", "Service :  \nEver heard of fastest service? Yes! That's Amazon. I had to pay Rs. 150 extra\nfor immediate delivery... And it reached me before 11 hours...  \n  \nAbout the phone :  \n  \nThis phone's a killer...  \n  \nFor a user like me who jumped from j7 prime to 5T, this phone has a lot of\nfeatures that are surely gonna surpass your expectations...  \n  \nCamera :  \nBest at low light photography...  \nI guess they have to work on fixing the stability issues on 4k video mode.  \nDual camera takes a lil while to focus the image...  \n  \nFastest unlock with face lock even in the darkest room, it actually utilises\nthe screen's brightness to capture.  \n  \nBattery life and charging are excellent!\n\n", "Got Yesterday, still running at my first Charge(24% right now) with 8+ hours\nof screen time. Everyone knows OP 5T is Flagship phone in specs and\nperformance, thing you don't know is more than Flagship level in Battery\nperformance. I'll give my full review after 3months of usage.  \n  \nP.S: don't need to charge for 8hours at first charge. I unplugged after 100%.\nThis is lithium battery don't need that old style 8hours charge. Google for\nmore.\n\n", "Recieved the product within 18 hours, and exchange was hassle free. Have only\nbeen using the phone for a couple of days now but so far so good! Have only\ncharged the phone for 20 mins in the past 2 days, and the battery is going\nstrong, which is a huge change from the earlier phone!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 February 2018", "on 15 December 2017", "on 16 January 2018", "on 25 December 2017", "on 9 December 2017", "on 7 February 2018", "on 29 December 2017", "on 11 February 2018", "on 9 January 2018", "on 23 January 2018"], "reviewer": ["Amazon Customer", "Amazon Customer", "Sreevisakh S", "Abhijit", "Amazon Customer", "Rahul", "Christas Mony", "Surdeep Devanathan", "Murali Manohar", "rekha rane"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["The right choice", "A New View", "Facing problem with USB", "Value for money #topnotchof2017", "Awesome Phone in this price range. True flagship killer. Go for it !!", "Let me put it this way - \"Its a Beast..!!\"", "AWESOME PURCHASE❤️", "Never Settle One Plus", "Oneplus 5T nailed it!!!!!😀😍", "superb phn with really fast dilivery !!!!"], "review": ["This one is the best phone that you can get right now and is worth every\npenny.  \n  \nI have been an Iphone 6 plus user and then switched to the OnePlus 5t after\nthe IOS 11 update which made the phone very very slow and caused lagging even\nwhen you play casual games.Its confirmed that apple slows down old iPhones\nintentionally so that the users will buy a new iPhone but I bought the OnePlus\n5t and Iam very happy with the purchase  \nThe phone was delievered within 72 hours and I was pleased to see they have\nalso added a silicone case with it.  \n  \nPHYSICAL OVERVIEW  \nStarting with the build quaility..This phone feels very premium and its very\ncomfortable to hold and the alert slider is an added benefit that is inspired\nfrom apple.Oneplus has improvised it and have added a Do not disturb mode in\nit.  \n  \nSOFTWARE  \nThe phone comes with nougat which is a let down as many other companies have\nstarted to roll Oreo but Oreo is guaranteed within 1st week of January by\nOneplus.Apart from that the software is super smooth and very user friendly\nwith a lot of tweak's from oneplus and also there are many feautures that you\ncan customize like the gestures,shortcuts in buttons etc,Thanks a lot to the\noxygen os for this.The phone works with every game that you throw at it and\nruns it smoothly so overall I feel that the software on OnePlus is the best\nthat you can get if you are not so much interested in the pure stock android\nversion of the pixel 2  \n  \nCAMERA  \nThe cameras on the OnePlus or I should say the cameras on the phone offers\nvery good picture quaility and also you can shoot good video footage with\nit.The selfie camera catches a lot of detail and the portrait mode is\namazing.It is byfar the best camera in the under 50k segment  \n  \nBATTERY  \nThe phone is having a very good backup and you can get easily 6 hours of\nscreen on time with a moderate use and 5 hours under heavy use.But remember\nthat this is the fastest charging phone on the market and you can have a day's\npower in half an hour.Thanks to the dash charge  \n  \nCONS  \nNo phone is perfect and OP5t has got cons too.But it's actually not a big deal\nfor everyone like no wireless charging no waterproofing,no Oreo out of the box\nand the only con that concerns me is that they don't provide earphones in the\nbox apart from that this phone is perfect  \n  \nVERDICT  \nGet this one 😘\n\n", "Masterpiece phone with great stability, rigid performance and sturdy built.  \n  \nPROS:  \n-8GB RAM  \n-Latest 835 snapdragon processor.  \n-Both Camera rocks in daylight and struggles little bit in night due to no OIS  \n-Amazing 18:9 vivid display and brightness is also good.  \n-Headphone as well as loudspeakers are quite good. However loudspeakers must have be dual speaker for this range. But its good.  \n-Fastest Face unlock ever  \n-Almost stock OS (oxygen os) and  \n-Lightning fast charging speed. In 1hr 30mins it charge from 0 to 100%  \n  \nCONS:  \n-No OIS (Optical Image Stabilization)  \n-Front camera don't have flash.  \n-No Hybrid or Expandable slot. (we can use OTG)  \n-No dual speaker  \n-Coming from Cynogen Os customization in oxygen os is very limited.  \n-No water proof rating (Samsung A8 plus and LG offers ip68 rating for waterproofing)  \n-Biggest con NO ALWAYS ON Display option, don't know why oneplus are using this option. LG V30 has much more option to use in always on display.  \nOneplus also have this feature but it only display incase of any notification.\n\n", "Dear Team,  \n  \nThank you for quick delivery.  \nSince delivery of one plus 5T ...I'm facing problem of charging...I have heard\nDASH charging, which happens instant...but in my phone I checked with other\nUSB....So it get charged as per feature...  \nRequest you team ...if you please get me new original USB....as I'm facing\nproblem..  \n  \nRegards,  \nDeviprasad Kannojiya  \n9920222533\n\n", "Writing this review after 2 weeks of usage..  \nBattery - last easily upto a day and more (moderate usage)  \nPerformance - butter smooth  \nCamera- very crisp and clear even in low light (zooming reduces somehow\nquality but not an serious issue)  \nBuilt- slim and handling is easy on hand  \nWas very confused to select mobile as dis is d first one plus company mobile\nfor me .But I did the right choice over Samsung ..Any 1 planning to buy it\nwith having budget 33k go for it without hassle free.\n\n", "Mind blowing Phone. Truly flagship killer. Go for it !! It's close to 15 days\nnow since I am using it and I loved the phone so far. Sharing my overall\nexperience here.  \n  \n1\\. DELIVERY - Thanks Amazon for On time delivery 👍.  \n  \n2\\. LOOK & FEEL - One word - SMART 😎😍. Extra care to be taken though while\nputting the phone on to the surface as rear cameras are bit seeing outside\nfrom the body. Can overcome this by using some decent back. One transparent\nBack cover is provided in the box along with screen guard applied on the phone\nscreen.  \n  \n3\\. PERFORMANCE - Incredible so far. No lag. Played multiple Heavy games like\nAsphalt extreme, Taken, 3D tennis etc and OP5T welcomes and handles them\npretty smooth with no phone heatup observation so far. Oxegen UI - Simplicity\nis the best. I am on Android - 8.0.1; Oxegen OS - 5.0.4.  \n  \n4\\. BATTERY - Awesome so far 😎. I usually charge in alternate days with avg 5\nhrs screen on time. Dash charging is gr8. Takes approx. 1 Hour to charge from\n2 to 100% (Screen-shot attached).  \n  \n5\\. CAMERA - Great Camera. Not much settings to tweek. But having multiple\nmodes (Pro, photo, slow-mo, selfie, portrait - for Bokeh feature to shoot DSLR\nlike photo which works pretty well). Decent low light photos. Selfie camera is\ndecent. However, couldn't find Bokeh feature in front camera so far. Take a\nlook on the shoots attached.  \n  \n6\\. OTHER FEATURES -  \n\\- Loudspeaker and headphone sound quality is decent.  \n\\- In built call recording feature is good.  \n\\- Extra features are pretty smart  \n\\-- 3 fingers screenshot.  \n\\-- 3 diff display modes (Normal, Night & Reading which make the display B&W\nand can be enabled app wise.)  \n\\-- Multi-tasking while making one app minimise on bottom side of screen just\nlike YouTube videos and look something else on phone.  \n\\-- Game-do not disturb mode.  \n\\-- Face unlock and finger print scanner are super fast.  \n\\-- Taking selfies from finger print point.  \n  \n6\\. OP COMMUNITY APP - Keeps the users up-to-date with the phones updates etc.\nGet instant response from OP team.  \n  \nCONCLUSION - Overall it's worth buying phone indeed comparable to it's other\ncompetitors available in market in this price range !!\n\n", "I just can't find a flaw in this phone, This is literally the phone I was\nlooking for.  \n  \nPros:  \n1) Performance is on par with any flagship phones out there.  \n2) Great AMOLED screen, that has deep blacks and great color reproduction and\nbright enough for usage in direct sunlight.  \n3) 8 GB Ram and 128 GB internal storage is more then enough for making this\nphone a future proof investment. Games like Asphalt Xtreme runs buttery\nsmooth. Running multiple apps hardly pose any challenge to this phone.  \n4) Stock Android with no bloatware is great.  \n5) Battery life is awesome which lasts whole one day with gaming, browsing,\ncalls, chats and streaming videos. Dash charge is extremely fast I got about\n60% within 30 mins.  \n5) Price is just right, bit expensive for this star wars edition but I am cool\nwith it.  \n  \nCons:  \n1) No Oreo update till now.\n\n", "Display of the device is very good battery backup is good as well. performance\nwise phone lag a little bit but due to 6gb ram it's don't catch easily\nspeakers of the phone is loud enough it and what camera one of the assit of\nthe phone portrait mode is aweosme oneplus should give live photo option in\ncamera settings overall i have updated the photo to oreo 8.0 now I'm seeing\nbattery performance of the phone... If u thinking to buy a premium smartphone\ngive it a try... I have gifted this photo to my nephew and he is very happy.\nOverall the device is good.  \n....must buy😎\n\n", "My first one plus device. I got it on first primw day sale and review after 2\nday of usage.  \nBattery 9/10  \nScreen 10/10  \nSound 9/10 (I'm big fan of Dolby atmos sound missing it)  \nAwsome gaming experience.  \nNo heating problem.  \nVarious LEDs.  \nFast performance.  \nI'm in love with it.  \nBuy it if your budget is 30-40k  \nYou won't regret.\n\n", "Fantastic device.... I have been using it for 10 days now as my daily driver\nand experience so far have been fabulous...  \nbefore ordering 5T i had few concerns regarding the screen resolution and\nsecond one being battery life..  \nAnd happy to help all those out there who are having this same doubt... The\nscreen on oneplus is a superb experience to use yes resolution is less if you\ncompare with some other flagship but i never felt any difference as such the\ncolor pop up as it is amoled display..  \nBattery life is also superb when you compare it with all other devices with\nsnapdragon 835... I get about 5:30 or about 6 hours of screen on time .. nd\nthat dash charger nothing to beat that so far in the market..  \nCamera is good if you keep price in mind and think about the total package of\ncourse some other beat the camera of one plus but they fall in very expensive\nprice bracket...  \nOverall i had good experiences. And so far haven't had any previous experience\nwith oneplus service hopefully that will be good tooo.....  \nGoodluck for those who are buying Oneplus 5T you will love this...\n\n", "the delivery was quite fast the phn is over all very good  \nfeels great in hand  \nthe face id is insanely fast !!!  \ndont forgort to to buy the free accidental and damage protection plan from\nkotak 811 the details are givien in the special offer option !! it works\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 December 2017", "on 24 January 2018", "on 19 March 2018", "on 17 December 2017", "on 11 March 2018", "on 15 January 2018", "on 15 March 2018", "on 24 November 2017", "on 6 December 2017", "on 13 December 2017"], "reviewer": ["Amazon Customer", "rAj", "Dev kannojiya", "Vaibhav Bailur", "Harsh Dutt Sharma", "Amazon Customer", "Rupesh rathore", "ashish kumar", "Suraj Pillai", "Yash"]},
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Phone is hanging", "This is an amazing phone with no bloatware unlike others", "Best Android Flagship Phone", "How to describe it", "Flagship Killer", "Amazing Job by oneplus.", "One of the best phone ever.......", "Best for the price.", "Superb quality product at a very reasonable price. Must buy...", "Witness the raw power and speed"], "review": ["Iam having problems with the phone..it has begun to hang..in last 1 week it\nhas hanged 3 times. And today it hanged for a long duration. I want a return\nor exchange ASAP. Iam giving 2 star coz its a new phn nd its is hanging\n\n", "Have been a Samsung user throughout before switching to one plus. This is an\namazing phone with no bloatware unlike others. I am happy and amazed with the\nphone with regards to the battery, design and almost everything. One plus has\na dedicated team who hears community and work on creating a phone that user\nwants unlike big brands who works to make more money. Would definitely\nrecommend this phone without a second thought.\n\n", "I am writing this review after using Oneplus 5T(8gb+128gb) variant for 20days.  \nPROS:  \n1\\. Look and feel - 10/10. The feel and look of the phone is premium. The grip\nis also good. 6.01inch optic super amoled display is superb. Viewing angles\nare amazing from any angle it seems same.  \n2\\. Ram - 10/10. 8gb Ram is very fast  \n3\\. Battery - 9/10. Fast charging. Lasts 10-15 hrs with medium usage!  \n4\\. Storage - 9/10. U get 111gb.There shd have an expandable slot!  \n5\\. Processor - 10/10. Totally awesome. No lags even when multitasking.\nSwitches to the apps very quickly.  \n6\\. Touch - 10/10. The response is very good. Even a light tap does the job.  \n7\\. Camera - 9/10. Ultra fast focus. Crisp clear pics. Takes clear photos in\ndaylight and a decent one in low light without flash. Has a pro mode too which\nis extremely useful in low light photography. Bokeh effect in portrait mode is\nawesome. Clicks perfect selfies.  \n8\\. Network - 10/10. No network issues.  \n9\\. Charging - 10/10. Extremely quick charging. Full charge within 40 mins.  \n10\\. Speaker - 10/10. It's loud and clear. Good output for music too.  \n11\\. Security - 10/10. Facial recognition is very fast and accurate even in\nlow light. Now with recent update of virtual light, facial unlock in dark is\nalso not a problem anymore. Fingerprint scanner is very fast and convenient.  \n12\\. UI - 10/10. User friendly and easy to use. Feels like stock android.  \n  \nCONS:  \n1\\. No portrait mode for selfies.  \n2\\. No expandable storage.111gb is sufficient.. But the kind of pics this\nphone generates, it shd have 1.  \n  \nUsing a Nillkin black backcover which gives it a premium look.\n\n", "Everyone knows features and performance by seeing videos and reading different\narticles. for me it's as per seen in YouTube unboxing and article I read\nbefore purchasing. I will give five star\n\n", "Best bang for buck phone in the market today. Looks and feels great in hand.\nSlick and smooth user experience and surprisingly good headphone jack audio,\nbeast of a phone in performance & portrait mode works well too, rear & selfie\ncameras are good enough in low light, you'll not feel shortchanged at all.\nBattery life is good too and lasts for a day easily. Auto brightness\ncalibration could be better.\n\n", "This one from oneplus is just amazing, the build quality is top notch, just\nholding it feels premium and the overall UI experience is fluid and coming to\nthe camera though he had provided with same sensors having same focal length\nit manages to take good portrait images even in low light than that of oneplus\n5. Coming to accessories the addition of a silicon case with the smartphone is\ngood Add-on from oneplus. So to include with the review I would say you won't\nregret once buying it and using it, so it's a big yes from me for people who\nare looking for perfect budget smartphone which is capable to compete with the\nhigh end ones easily.\n\n", "Great display I liked the 18:9 aspect  \nSuper fast performance (installing apps in seconds, that's crazy)  \nDouble satisfied with the camera, including front camera  \nLong lasting battery and insane Dash charger fill the battery less than hr.  \nBut somehow I don't like the music listing experience in 1+ (poor bass)....\nhope an upcoming update will fix it.....\n\n", "Bought this after exchanging the OP3. I think the display is what makes this\nphone absolutely magnificent. The battery life is insane! You get minimum 4hrs\nSOT.  \nIt's light, premium and feels good.  \nThe camera is average. Yes it is average in low light. To he totally honest,\nit's bad in low light. Even the portrait is meh. Software updates may improve\nthat.\n\n", "Excellent product. Value for money, super fast and smooth operations. Camera\nquality superb. Face unlock feature is a beauty, battery lasts more than a day\neven with heavy usage. At this price point, other smart phones are way behind.\nI have used One Plus One, One Plus x, One Plus 3 and now this 5T, all are\nsimply superb.\n\n", "This phone comes with the flagship hardware from all the aspects excluding the\ndisplay resolution (which is far better many other smarties in this price\nrange). OnePlus has yet again proved their capability to deliver a beast\nwithout hitting the price bars high. And they have already established a very\nstrong fan base in India as well as the international market. I gotta talk\nabout the camera here. Whoaaaa... Not the best one for those who use it in\nAuto mode. But once u step into the Pro mode, you will definitely feel the\neffort OnePlus has put into this phone. Just amazing with the freakin fast\nSD835 chip powered by the-jaw-dropping 8GB RAM. Some people are so worried\nabout the SD card slot. We have 128 GB storage which for me would take my\nentire life to get filled :P. #LaveRed: the new color invented by OnePlus :P.\nI suggest them to better obtain patent rights for this color. For a rufous\nperson like me, this phone is damn sexy. Forgot to mention the screen\nbrightness and the vividness. It is one of the best in its class.  \nFinal word: Yet another victory for the #TeamOP #Kudos.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 February 2018", "on 15 December 2017", "on 3 February 2018", "on 12 December 2017", "on 30 January 2018", "on 1 December 2017", "on 8 December 2017", "on 23 December 2017", "on 9 February 2018", "on 20 February 2018"], "reviewer": ["Amazon Customer", "Amazon Customer", "Chinmay Kumar Pradhan", "Akshat Sharma", "anmolsahota", "YSN.KISHORE", "Joseph Charles", "Amazon Customer", "Amazon Customer", "Rajadeepan S"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Oneplus 5T 128GB", "Must buy phone under 35K", "Amazing Product with all the specifications at this price", "Amazing buy.", "Awesome phone. My previous phone was MI Max", "Value for money.", "The best phone in 2017 for the 33k you spend", "It's software is smooth and fast and best hardware. camera is better but rather than nature ...", "Excellent mobile for now and next year", "Camera quality is too good in both front and back"], "review": ["Awesome screen  \nBattery life is splendid,getting 10 hours of screen on time though no game\nplay.  \nCamera is ok comparing the price of the phone  \nPerformance is smooth, no hiccups experienced.  \nFace id works 70% of times and accurate ,fast but don't work wen light get\ndim.  \nOverall thumbs up go for it guys\n\n", "First of all, so glad that I didn't get a soap bar in my phone box :D just\nopened the package and the phone... Damn such beauty, everything seems to be\nawesome and have to mention, the courier delivery uncle was such a nice\nperson. If the Amazon team gonna read this then please give him some upward\nrating or incentive. His no. As per delivery text received (9868016846)\n\n", "Amazing Product with all the specifications at this price.. no other mobile\ncomes with snapdragons 835 processor at this price. Face unlock is very secure\nand is very fast.. How ever there are also some deficiencies in the product\nlike  \n1\\. No front flash for night time selfies  \n2\\. Phone is not water resistant  \n3\\. Camera quality not as great as expected  \n4\\. Battery capacity should have been more\n\n", "Amazing buy... The phone is just too fast and the Amoled display just lights\nup the phone.  \nCamera is too amazing. The portrait mode provides such great depth to photos\nthat you can't stop clicking them.  \nVideo Slo-Mo is great too.  \n  \nThe Snapdragon processor 835 is inarguably the best. No heating issues and in\nfact everything works so smooth.  \n  \nSleek design makes it look so elegant in your hands. Its a MUST BUY.\n\n", "Posting this review after all most 1 month use. I bought it early prime sale.\nAwesome phone. My previous phone was MI Max. That was quite big phone.. but I\nlove 5T, user friendly easy to handle. I can feel the change. Only problem\nwhich I'm facing sudden app close, I don't no whether it is hardware problem\nor apps. Becoz of this I'm giving 4 starts. Cameras are awesome, front facing\ncamera is amazingly clear.\n\n", "The first thing I love in this the screen.  \nI think this the best value for your 33k.  \nEveryone review channel mentioning wireless charging in this device but I\nthink we don't need that charging because my device charge it full in one hour\nand around.  \nThe best thing about 5t is rear camera set up. But about disappointment from\nfront camera because it won't capture in wide angle.  \nBut overall it's an amazing devise till now experience.\n\n", "Moved from Nexus 6 to One Plus 5T and using this for the last two months. It\nis the best bang for the bucks in the price range. The total 33k it is worth\nin all aspects. People mentioning no IP 67 rating and all should be told that\nit is just the numbers and I recently used it during a speed boat ride where\nit was splashed with waves quite so many times and still it runs damn smooth\nwithout any issues. Those who pick up this device will be very well aware of\nthe specs and that need not be told. Only thing, please buy a good phone case\n(even though it ships with one) as the device is slippery and you dont want to\nsee a cracked 18:9 screen soon after you start enjoying those movies on this\ndevice.\n\n", "This phone has unbelievable speed of charging. It's software is smooth and\nfast and best hardware.  \ncamera is better but rather than nature photo it processes the image and make\nit look beautiful.  \nPhysical appeaance of mobile is way average compared to what we see in\npictures and battery is 3400mah which is one and only drawback of this\nflagship phone.  \nOverall it is best phone to buy but i think it is over priced by around 5k.  \nYou can definitely go for it even if this negative sounding review.\n\n", "I have been using mobile over a month now. As of now per inoovation available\nin market, this has perfect hardware spec and performance. Particularly camera\n3d effect. Amazing! As if DSLR is in hand, love to take pics now. Mobile is\nvery fast may due to optimised hardware and 6gb ram. 6in screen with 5.5 inch\ntraditional mobile size, very handy.. finally it's thin and low weight..great\nmobile to own for next 3 yrs, provided Oreo and Android 9 updates are\navailable..\n\n", "Overall performance is awasome. Some lagging in face detection features for\nthat dev team providing the patches in future may be it will resolved.  \n  \nCamera quality is too good in both front and back. Works well in low light as\nwell. The best phone I ever bought till now. Recommend to buy this.  \n  \nLooks of phone is slik and attractive in all aspects worth buying in this\nprice.  \n  \n6GB ram is good option given...as now a days market is more on to the software\napplication and need more memory. Looks this performance of phone will long\nlast till many years...and not like other phone hope for the best.  \n  \nThe DEV team OP5 is good for development and reported issues.  \n  \nAmazon is also a good in there delivery and all.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 November 2017", "on 29 November 2017", "on 31 January 2018", "on 28 November 2017", "on 15 December 2017", "on 25 January 2018", "on 4 February 2018", "on 5 March 2018", "on 21 December 2017", "on 21 December 2017"], "reviewer": ["Rajeev S Nair", "Ankit Jain", "Amit B.", "Amazon Customer", "Amazon Customer", "praneeth", "Vimal Viswanath", "Akash Amin", "Amazon Customer", "nitin"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Perfection all the way", "Best of best", "This phone is worth every penny you will spend.", "Awesome phone", "Amazing device. The Display quality is excellent and its ...", "The Best Phone I have ever purchased", "Amazing Phone & True Flagship Killer!!!!!", "Liked it but would have loved it in 28-29k price bracket", "Many plusses for OP5T", "The underdog of 2017"], "review": ["This is the most perfect android device out there which can compete with an\niPhone (switching from apple, as am not happy with iOS11).  \nEverything about the device is awesome except for the low light camera\nperformance, which is also not bad compared to other phones at this range. but\nsince they claimed it to have it improved so much with that secondary camera i\nhad high expectations and it was a bit let down.  \n  \nApart from that I am glad i waited a while for this one. definitely\nrecommended as an happy customer.\n\n", "There is no comparison with any other mobiles.  \nIts simply best mobile i have ever used in my life.  \nBest thing is charger its really damn fast, saved my lot of time.  \nBattery backup is pretty good.  \nI am not a game lover so didn't checked game performances,  \nCamera is good, but not best.  \nSpeedy performance,  \nThanks oneplus for giving me best experience.  \nOverall 5 🌟\n\n", "This phone is really awesome.  \n1- It's incredibly fast.  \nIt's so fast that you will not see any app taking time to load. It sometimes\nmakes you believe that the Face lock is not working but the truth is that your\nphone will be unlocked before your eyes even notice it.  \n2- Reading mode.  \nReading mode is the best feature a phone can give for book lovers or late\nnight WhatsApp users. It's really very useful. Your eyes will not strain that\nmuch. Although you can't compare it with kindle. It's still good.  \n3-Camera  \nI will say it's not like Google Pixel 2 but it still performs pretty good.  \n4- Fast Charging  \nI charge my phone before going to office. I plug in the charger at the time of\ngetting up and the moment i come out after taking bath, the phone fully\ncharges. It charges very fast. In 30 min my phone goes from 50% to 100%.\n\n", "Awesome phone....  \nI felt battery back up also good. Dash charging gives a feel like you never\nkept the phone for charging it's just quick enough.  \nPerformance is awesome.  \nWorks really really fast  \nIt has a great value for the money you pay.  \n  \ncon- If you move the phone while charging it looses dash connection. This s\nthe common issue i read on t forum and personally experiencing this prob. dono\nif it can be rectified under warranty....\n\n", "Amazing device. The Display quality is excellent and its Light weighted as\ncompared to Galaxy note 8. The camera is also improved in Low light.  \nCase and pre-applied scratch guard provided with Phone is very good though.  \nOver all very good experience with amazon delivery and Oneplus 5T Device\n\n", "Best phone for this price range. Magnificent build, Blazing Performance\n(thanks to the futuristic hardware), Dedicated Support from OnePlus (they\nlisten to you), Regular updates etc etc. I mean in this price what do other\ncompanies give you? Just a phone right? Oneplus gives you a commitment. A\ncommitment to bring satisfaction. Its been close to a month I purchased this\nphone and I havent faced any issues apart from minor ringtone volume bug (for\nwhich oneplus released the 5.0.4 update by the way, thats listening to\ncustomers, apple samsung motorola lenovo take notes please). The pictures are\nawesome. Night photography is simply out of the world. With decreased shutter\nspeed and its brilliant algorithm for low light, it produces day like images\nin the night, even under just celestial lighting. Try it to believe it. I am\nattaching few pictures which were taken at 1AM in absolute lack of lighting.\nOverall 10 out of 10. Go for it.\n\n", "I am writing this review after using this phone for 15 days. In one line this\nphone is value for money in true sense.  \n  \nPros  \n1\\. Processor is super fast & not observed a single lag in 15 days. Even\nrunning faster than my Galaxy S8+ (may be due to clean UI as compared to\nSamsung).  \n2\\. Display is Excellent in this price range. (Should not be compared with\nHigh range phone like Pixel, Galaxy S8 etc.)  \n3\\. Dash Charging is mind boggling Fast. Used so many phone with Fast charging\ncapacity but this one is best.  \n4\\. Battery Back up is decent can run for 1.5 days on single charge with\nmedium usage.  \n5\\. No heating issue even after heavy usage.  \n6\\. Amoled Display notification is cool & look nice.  \n7\\. Rear Camera is superb in daylight condition.  \n8\\. Fingerprint Sensor is fast & surprisingly Face unlock is also super fast.\n(wasn't expected that much accuracy for Face Unlock before buying)  \n9\\. One of the best advantage is OP team listen to their customer for any BUG\nor Feature improvement & provide update frequently.  \n  \nCons.  \n1\\. Potrait mode not available in front camera.  \n2\\. Speaker could have been better in this price.  \n3\\. It should have at least IP67 rating.  \n4\\. One Basic in built music player should be added in Oxygen OS.  \n  \nOverall in this price range my rating for this phone is 9.6 out of 10.  \nThose who are willing to buy a mid range phone which have all the quality of\nFlagship Phone go for it without any 2nd Thought, you will not regret.  \nIf your main priority is Camera & can spend some extra buck should try for\nPixel or Galaxy S8. In this price range you will not get better camera than\nthis in any other phone.\n\n", "Great display, best battery utilization optimization with a very very fast\ncharging..... operating system could be improved a little  \nGood processor, a very good low light back camera, performs good in normal\nlighting as well obviously. Front camera could have been improved and more\nfunctions could have been given in stock camera app though I like use of\nscreen as flash while taking selfies in low light  \nOverall a good phone.  \nGiving 4 stars as I feel the price is a bit on higher side given the chinese\ncompetition in market like Huawei and xiaomi but hey one plus don't reduce\ntheir price over time like them which is a plus in a way\n\n", "Terrific phone. Haven't found anything to grumble in 2 weeks of usage. Battery\nlife is better than peers. heavy usage lasts full day, moderate usage lasts\nalmost 2 days. Dash charge is amazing.\n\n", "After a month of usage i feel oneplus is a real competitor to apple , samsung\nand other conpanies.  \n  \nThe major advantages are -  \n1\\. BATTERY  \nThe one plus 5t has a great battery life. It has dash charge which is i feel\nthe fastest available on market. Within 5 minutes it has around 10 - 15\npercent charge. It also holds up good for games such as asphalt 8 and modern\ncombat 5  \n  \n2\\. CAMERA  \nThe camera is amazing. It can take great portrait pictures . A professional\nphotographer will truly love this phone. Even in darkness the camera works\njust fine  \n  \n3\\. PERFORMANCE  \nThis phone can do amazing multitasking. It can smoothly run 5 - 10 apps\nwithout any lag. This is especially useful if someone uses this phone\ncontinuously for hours.  \n  \n4\\. SECURITY  \nThe fingerprint sensor is the fastest I've seen. And the face unlock too is\nvery fast and during emergencies , time will not be wasted on trying to unlock\nthe phone  \n  \n5.DISPLAY  \nAnother mind blowing feature is the display. It is bezel-less and the display\nis truly amazing. The colour contrast is very good  \n  \n6.COST  \nI believe this is the best phone below 50 k and while it may be cheap for what\nit holds, it rivals the power of the galaxy series , the apple phones at half\nthe cost  \n  \nThat being said , no phone is without any disadvantage. However these vary\nfrom person to person . Some which i found with this phone are -  \n1\\. Due to the phones size the fingerprint sensor is a bit hard to reach  \n  \n2.the feel of the phone is a bit different and so adjusting will take a week's\ntime  \n  \nThis phones scores in all areas and i feel this could really change the tide\nin mobile phones in the near future\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 December 2017", "on 12 March 2018", "on 10 February 2018", "on 26 January 2018", "on 28 November 2017", "on 2 March 2018", "on 7 March 2018", "on 22 February 2018", "on 7 December 2017", "on 25 February 2018"], "reviewer": ["Kumar R", "Anand Jaiswal", "Anmol Rastogi", "Karthik", "Pankaj Gupta", "Oru Adaar Love Song", "Pritam Jana", "Ankur Gupta", "Anshuman Mohapatra", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Impressive.. Value for money... You can Buy this.....", "Blazing fast fone jus go for it...", "BEST FLAGSHIP PHONE", "Just one word 5T is awesome whether its camera or its performance", "Excellent phone for a great price!", "Brilliant Phone", "Great Phone in all areas except :", "Wow simply awesome", "Finally feel upgraded !", "Review after first day"], "review": ["Amazing Amazon service and product. Using from last 3 days and find below\nfanatics points,  \n• Impression Camera quality. Captured some amazing Portrait and low light pics\nwhich was much impressive.  \n• Handy for use even though having 6 inch mobile display. Well designed!!!!  \n• Battery life is too good.  \n• Dash board charging is also good. Tested full phone got charged within 1\nhrs.  \n• Good sound quality and material.  \n• Impressive Face ID detection and Finger print sensor.  \n  \nCompany may provide headphone in box.\n\n", "Nice super fast fone, good for gaming, every one better buy 128 gb version, no\nheating whatsoever, camera better than previous one plus, doze mode has been\nimplemented well just like iPhones, almost no idle battery drain, I miss the\nfront fingerprint sensor of my OP3.\n\n", "Fantastic phone , its really a flagship killer . The phone is extremely fast ,\nand the camera is just awesome including the portrait mode and slow motion\nvideo recording.  \nIts really a compiditor to Samsung flagship products and iPhone.  \nBut only one cons of this phone is that the portrait mode is not that much\nefficient in low light conditions , however its not a major factor . Its\nreally a fantastic phone special the built quality and the processor , its\njust fav.  \nI love this phone💓\n\n", "my Previous phone was oneplus 3t phone and i was impressed by it and hence\ndecision to buy 5t - Again very impressed by it  \nOnly Glitch is my 3T was updated to Android 8.0 Oreo and 5t is still on Nougat\n- weird !  \nI am so spoiled by dash charge of 3T that i couldnt go to any other fast\ncharging phone...Just one word 5T is awesome whether its camera or its\nperformance.  \nBut at price of 33k, they must atleast provide slot to expand memory - thats\nthe only CON i see in this phone...Still five stars to it\n\n", "I have been using this phone for a little over a month now, and it has been\ngreat. Having previously used the note series and the iPhone 6, I am very\nimpressed with the speed and smooth performance of this device. The superb\ntechnical specs do translate to a great user experience.  \nWhile the camera might not be on par with the pixel 2 or the iPhone X, it\ncertainly is a good camera and since a side by side comparison is unlikely for\nmost users, this makes for a great value for money proposition.\n\n", "Brilliant all round phone... Excellent performance, display is superb and a\ngood camera for the price point.. Face unlock works surprisingly awesome\n\n", "The phone is the best I have ever come to use.  \nThis has a great camera and everything is just so perfect and smooth, the\ndesire to use this phone is uncontrollable.  \nThe phone has 3500 Mah battery, which due to the large screen size, struggles\nto pass through the day and gives a screen ON time of about 6 hours at low\nbrightness. But, the dash charge compensates for that high speed reduction of\nbattery.  \nWish that this phone had a bit more bigger battery.  \nRest! This phone is the best!\n\n", "The best phone so far ... Samsung and Apple plz stop making those high end\nphones with high price tags...this is the phone which can solve all ur\nrequirements,. Just wow,used Samsung,apple but this phone is simply superb in\nall requirements\n\n", "Timely delivered.  \nThe phone comes with super clear large display. Sleek body and the design will\nkeep you amazed.  \nGood battery life and high quality picture clarity.  \nSpeakers are way better than my previous phones.  \nOverall the experience is very good and I feel contented with my purchase.\n\n", "Delivery: obviously fast and accurate.. Love you Amazon for that  \n  \nProduct: Awesome in terms of performance and battery life. Means downloaded\n1.6gb update couple of times on 4G, watched videos etc. Still battery on 35%.\nSo no problem about that. Just loved this part.  \n  \nProblems which I've observed are with OxygenOS rom. Alert slider is BS. Many\nof tiles are removed and apparently I cannot turnoff Do No Disturb mode with\nlatest update of Oreo 8.0.0\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 January 2018", "on 2 December 2017", "on 15 January 2018", "on 31 January 2018", "on 6 January 2018", "on 2 December 2017", "on 18 January 2018", "on 25 November 2017", "on 4 January 2018", "on 18 March 2018"], "reviewer": ["Amazon Customer", "Ambar M.", "Siddharth ", "Manas Goswami", "vas", "Vikram Ramesh", "Amazon Customer", "Viveksingh", "ajay prakash", "Deeptroll999"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Awesome :)", "Love you One plus you are amazing", "Amazing phone to buy", "Five Stars", "Nice phone", "Great Value for Money", "my little experience with my new Oneplus 5t", "Tough competitor", "Best phone used till date", "Awesome phone"], "review": ["Such an awesome phone... I haven't tried anything other than Samsung before...\nA new phone this is to me.. and it's nice to use, really!... The camera\nquality is good.. depth effect is good... Speed is great.. there is no lag at\nall.. overall, would recommend to everyone :) This phone is worth your money\nfor sure :) !!\n\n", "Its awesome its been about more than a month nvr faced any issue or lag it's\nmore than my expectations I'm a hardcore user and it stands wid me 24 hours\neveryday and dash charger its something i nvr though of its bravo whoever is\nthinking to buy this just run for it...wish i had more stars to add in this.\n\n", "I decided to buy iPhoneX but suddenly got few feedback from my friends about\nthis phone. I bought this phone and say it is best idea to drop my plan to buy\niPhoneX and got this phone. Amazing phone, design, speed, memory and\nfunctions. A great camera that I was look for found in this phone, specially\nportrait mode.\n\n", "Undoubtedly the best mobile in the market currently.  \n  \nBought this product after researching for months and was 110% satisfied with\nit.  \n  \nJust buy it without even giving it a second thought.  \n  \nYou will be satisfied in every way possible.\n\n", "Overall Nice Device.  \n  \nGood points:  \nExcellant Performance,  \nNice battery backup  \nDisplay is good.  \n  \nBad points:  \nCamera picture on dim light is not very good\n\n", "Excellent display. No lags whatsoever.  \nThe minimalistic bezel is a great plus in n terms of the design. Great value\nfor money.  \nHowever, the camera is a bit disappointing. Photos are not that great as\ncompared to those captured in Google Pixel / iPhone X.\n\n", "I booked this smartphone on 17th March,received on 20th March,Tuesday.so it's\nvery rapid delivery.There is mobile,dash charger,a transparent back cover,SIM\nejector tool & manual in the package.Though I haven't used it much till\nnow,but I am glad to have such a light weight,handy,smooth,powerful mobile.The\noptic amoled ambient display is very nice.The fingerprint scanner,face unlock\nsecurity features are very nice,very fast.camera result is also wonderful from\nboth front & rear camera.We can have 2x & even more zoom,portrait shots,EIS\n,4k on back camera.there is hdr in front but no portrait on front\ncamera.however many of us don't care abt portrait selfies,perhaps.performance\nis just great.As we boot it first time,sooner it will offer you 1.5gb oreo\nupdate.It will add oreo features like you will get options on long press on\nicons.Sound is pretty much loud.I haven't found any weakness in this\nsmartphone till now.No smartphone can beat it at this price segment.\n\n", "No bloatware  \nButter smooth  \nMild heating with heavy gaming  \nDecent battery backup  \nGood camera (portrait mode doesn't work with front cam)  \n**Don't try to zoom and capture pics... It deteriorates the image quality to\nthe highest**  \nShipped with Prefixed screen guard and back cover, no earphones\n\n", "The phone is addictive. Have been a OnePlus Three user, and its 6 GB RAM gave\nme a kick. This phone's 8 GB RAM is noticeably better than its earlier 6 GB\nyounger brother. Infact, I use this phone more than my laptop for web related\nstuff.  \n  \nHighly recommend. Great value for money.\n\n", "Awsome is the word. Good camera, while in low light it clicks some ok photos.\nPlaying games awesome. Face unlock and finger unlock too is the fastest.\nAwesome screen. Thank you Amazon and OnePlus for bringing this mobile.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 December 2017", "on 18 January 2018", "on 9 December 2017", "on 21 December 2017", "on 19 January 2018", "on 24 January 2018", "on 23 March 2018", "on 22 February 2018", "on 21 January 2018", "on 3 December 2017"], "reviewer": ["Amazon Customer", "Shariq", "Vikrant Kumar Singh", "Rudran Vagle", "Abhay Kant", "M", "Ravin", "Maddy", "Girish Somvanshi", "Lohit"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Amazing phone with great features", "but product is very good..", "Oneplus 5t a high end performance phone", "Also is better than iPhone in any sense", "VALUE FOR MONEY AND ITS A TRUE FLAGSHIP", "and i am very satisfied about this phone this is too amazing super fast", "Excellent Phone. Great Specs.... Worth the money", "Best phone in this budget", "One Star", "Never settle"], "review": ["After a lot of discussions, reading online I settled for a OnePlus 5T. I am\nhappy and pleasantly surprised at the features of the phone. At Rs.32,999 the\nphone is totally worth it. Super camera and an amazing battery life. That's\nall was needed.  \n  \nAs promised while placing the order, the phone arrived in 24hrs. It was very\nwell packed and was a sealed box piece.\n\n", "I ordered this phone 2 weeks back...received on time....packaging was\nweek....but product is very good....OnePlus 5t is an amazing phone...just the\nback cover provided with the mobile is not good because it is damaging the\nskin of the mobile ...white spots are appearing on back skin of mobile...\nCover all excellent mobile by one plus....loved it\n\n", "Oneplus 5t is a high end performance phone bundled with great battery life and\nthe dash charging is marvelous.  \n  \nScreen:  \n6 inch bezel less amoled display, watching videos and playing games are\nliterally treat to your eyes, beautiful colour reproduction and view angles.  \n  \nPerformance:  \n8gb RAM and 128Gb space with ufs2.1 technology says all about the performance.\n(I would recommend go with 128gb variant)  \n  \nCamera:  \nComming to the camera, beautiful potrait and great details in picture. Low\nlight photos come out great, at the end if the camera is in right hands gives\ndesired performance, it needs few improvements but does a good job for me.\nEspecially it would be great to make potrait mode a little loss less.  \n  \nPrice:  \nIn this price segment no other phone can beat its specs amd performance.\n\n", "Superb mobile, must buy for any one plus fans.  \nAlso is better than iPhone in any sense. Camera quality is awesome and the\nbattery backup lasts above 18 hours of charge, that's if you're going out\nwithout a power bank and still have a 30/35% of power left, 5T would still be\nalive with you, till you reach home .  \n  \nAmazing touch and is perfect fit for one hand to handle.  \nAssistive touch on the fingerprint scanner is gives you ease to bring down the\ntop menu, without using your other hand to go to the top of the screen and\ndrag the screen down.  \n  \nThe price is just apt for the One plus 5T  \nWorth spending your money on.  \n  \nI did use One Plus X earlier than this, I am happy to have made this choice.\n\n", "AFTER USING FOR 1MONTH  \nPros :- 1. Charging speed is awesome 1hr full charge  \n2\\. 18:9 display with amoled screen  \n3\\. Rear camera is great  \n4\\. Battery performance last whole day with internet usage with battery\nremaining 20-30 percent  \n5\\. Performance and processing speed is best  \n6\\. Face id lock is superfast and also works in night  \n7.single speaker with quite powerful honest I didn't expect this much louder\nsound  \nCons:- 1. Front camera is great but not comparable with iphone x and Samsung\ns8+  \n2\\. Design is good but looks like redmi A1  \n3\\. There is no sd card slot  \n4\\. Small bugs occurs some times\n\n", "Hi Friends,  \nMyself Jeet Panawr from New Delhi India.  \nI have used Samsung, Apple, Lenovo, Moto, and now i have purchased One pulse\n5T, and i am very satisfied about this phone this is too amazing super fast,\nVery good camera quality, Lots of functions and finally Amazon has maintain\nthere commitment I am surprised i have booked this phone on Sunday and I get\non Monday Morning. I love this super fast delivery by amazon.  \n  \nThanks you so much OnePlus Team for giving this new devise as making of\nDigital India.\n\n", "I have been using the phone for a little over 2 weeks now and I am glad to say\nthat I am happy that I have it. The specs are great and worth every single\npenny.  \nGreat specs, good display, excellent battery life and utilization, good size\nand feel to the phone. The materials used for the external body and of good\nquality and the phone definitely does look like a high end phone.  \nThe camera takes brilliant pictures even in low light.  \nAll in all a good phone and totally worth the money\n\n", "Best flagship cellphone in this price range.  \nPros  \nGreat battery  \nComes with free TPU case  \n6 GB RAM makes it a beast wit no lag at all. Handles multiple apps with ease  \nGreat photo quality  \nVideo recording is also great.  \nBattery easily lasts more than a day with medium usage  \n  \nCons  \nHD screen, but I guess this has been done to preserve battery life over a\nsingle charge. Also HD screen detail is not noticeable in this screen size.  \nUsing the inbuilt photo enhancer with the camera seems to alter photos to make\nthem look like posters.\n\n", "Within 3 months it's ringing, vibration & speaker not working. Support from\nOnePlus not proper to resolve issue\n\n", "An amazing phone. Worth all the money spent on it. Sleek, blazing fast, face\nrecognition works beautifully even in low light, cameras are awesome, display\nis really good. Truly a flagship killer I suppose. I'm really enjoying my new\nphone. Would totally recommend this to everyone. It makes no sense to shell\nout more that double of what this costs on so called flagships when you can\nget more of everything than those at this price. It's like they say. Never\nsettle.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 December 2017", "on 24 January 2018", "on 8 January 2018", "on 13 January 2018", "on 10 March 2018", "on 12 March 2018", "on 17 January 2018", "on 7 March 2018", "on 15 March 2018", "on 25 November 2017"], "reviewer": ["Neha", "Yasin khan", "Kundan Singh", "Kanv Sharma", "yash vishwakarma", "Jeet Panwar", "Rahil", "Santosh Pati", "Lalit", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Happy owner for the last two months. Not acceptable delivery practices.", "Adding to the bulk of positive reviews: The new Nexus is here.", "Awesome phone and great service by amazon", "Everything else is fine except call connectivity", "An awesome purchase", "DAAAAYUMMM WHATTA PHONE!!!", "INDEED A FLAGSHIP KILLER", "The Value King!", "Value for Money phone", "Just Amazing!!"], "review": ["With Oneplus's poor show with the OnePlus 2, I was pretty sceptical about\nmaking another purchase fro them. However, having used this device for almost\ntwo months now, I'm quite happy with it. No annoying battery problems. Almost\n4 hrs of screen time with moderate to heavy use, including healthy doses of\nYouTube, some light gaming, and lots of book reading both on Kindle and Play\nbooks. Also, though Dash charge isn't really a day's power in half an hour :P,\nit does charge the phone pretty quickly. 20 to 95 in an hour or so. The camera\nis still grainy and flat out bleak with low lighting. So much for the extra\nlow light lens. Where it does a good job, is with balancing harsh colours\nunder a streetlight or other evening city lights. Audio quality is noticeably\nbetter than the Two. Using an aux cable with good speakers now actually sounds\nlike good audio.  \n  \nThe delivery and purchase experience was not exactly what I'd expect from\nAmazon, though. The couriers they use routinely do not attempt to contact the\ncustomer before a delivery, and I had to constantly call back the numbers that\nwere leaving me missed calls. Also, opting for a delivery window has no\neffect, as the delivery will be made as per the courier's convenience. Too bad\nif you have office and would like a delivery at home. :(  \n  \nOverall, I'm satisfied with how this device turned out.\n\n", "Adding to the bulk of positive reviews, I would say just this: It is a beast.\nSwitched over from the original OnePlus One, having used the 3T in between for\n2 months before it got stolen, I must admit, the 5T is in a category of its\nown. It never overheats. Never lags. Produces great photographs in almost any\nlight. has the perfect feel in the hand. charges, well, blazing fast. I was\nwondering if I should wait for the OnePlus 6 or not, but apart from Oreo, I\ndon't think this phone misses anything big. IR Blaster? Who uses it. Memory\ncard slot? Yes, but it has OTG which is enough for me. Missing a 2k display\nthat I hope the OP6 has, but I can just use someone else's phone for VR, and I\nhaven't started making VR films yet.  \n  \nP.S. Rooted it after the first boot. A super smooth process as expected,\nwaiting for a more stable Oreo build for now. The developer community seems\ngreat. There are so many great Custom ROMs available, but the stock ROM is so\ngood in itself with so many neat features, that Custom ROMs are literally not\neven needed, especially with Stable Oreo coming out soon. This literally feels\nlike a revival of the Nexus line. Cheers!\n\n", "Awesome phone. Had issues with the first order. Amazon was prompt in replacing\nthe mobile. New phone reached me within 3 days.  \nPros and cons have already been discussed by other customers, but I am totally\nhappy with the product.\n\n", "This review is based on performance of phone after use of 1 month...\nEverything else is fine except call connectivity. From last 3 days the problem\nis increased... Every cal gets disconnected or I can't here a single word of\ncaller without getting muted. My network provider said it's clearly mobile\nsignal reception problem\n\n", "\\- Brilliant battery life - I am a heavy user and I end the day at 20% with\nOP5T. I ahve used Android flagshps in the past - htc one, nexus 6p, oneplus 3\nbut noone came close to this experience.  \n\\- Dash charging is briiliant meaning I just need to charge my phone for 45\nmins everyday and Im set for the entire day  \n\\- Good screen - the thin bezels are really attractive and the lack of qHD is\nnot visible at all  \n\\- Fast! - no lags, just butter-smooth experience.  \n\\- Camera - pretty decent although not as good as pixel2/s8/iphone/v30  \nGo for it!\n\n", "I am beyond happy with this buy. If the thousand+ positive feedback/reviews do\nnot convince you to buy this monster, I don't know what will.  \n  \nYes, the hype is real.  \nYes, the reviews are legit.  \nYes, this phone is badass.\n\n", "I just love it!  \nThe performance is simply awesome. This phone is crazy fast.  \nThe AnTuTu benchmark score is 208809  \nCamera is good and it's better than Iphone. Can't compare it with Sony\nflagship phones even though it has got Sony lens.  \nFastest Face recognition ever  \nBattery life is awesome  \nDash charging is simply great!  \nThis phone never ever slows down on heavy usage and there is no heating issue.  \n  \nCheck out for protection cover in Dbrand India. It's awesome, you can\ncustomize the back cover as you wish.\n\n", "The OnePlus 5T is clearly a winner in all aspects.  \nI've been getting consistent 26-30hr battery performance (Location permanently\nset to high accuracy, switching between 4G and WiFi, medium to heavy usage),\nthe screen looks great and performance is on par with the flagships(if not\nbetter).  \nThe camera could be better but is good enough for everyday shots.  \nIt's a clear, reliable and stylish choice for people looking for high end\nperformance at an affordable price.\n\n", "I have been using this phone since a month. I am personally completely\nsatisfied with the phone in all aspects.  \n  \nEarlier I was using OnePlus 2. With this new phone I feel I got upgraded in\nall respects.  \n  \nMy observations: (will compare with my earlier phone so that we can understand\nthe improvements in this phone)  \n1\\. Face unlock is awesome. (I sweat a lot and so was not able to use\nfingerprint on my OP2. Now that problem is solved. Fingerprint is also better\nthan earlier)  \n2\\. It charges 100% in 1 hour with dash charge. Without dash charge it\ncharges, 1% in 1min. Dash charge is provided with the package. OP2 didn't have\nfast charge.  \n3\\. The phone comes with a screen guard and there is also a bumper case with\nin the box. Except for the headphones, everything is available in the box. OP2\ndidn't have either of them.  \n4\\. Upgradable to Oreo which gave lot of new features like separate work\nprofile to differentiate your personal and office things. Even you can have\ndifferent credentials of fingerprint and face for work profile so that all\nyour personal things you can give access to your family members and can keep\nyour office things private.  \nAndroid is also very close to stock Android and there is no clutter what so\never.  \n5\\. 6GB of RAM, didn't close a single app till now since 20 days.  \n6\\. I personally don't take too much of photos, but camera is very good\ncompared to OP2 especially low light photos.  \n7\\. Battery comes almost for 2 days on single charge. 1 hour of charging and 2\ndays of use. Just awesome. I use my phone almost 3 hours a day.  \n8\\. Screen is bigger now with HD+ screen. They seem to have designed a font\nfor the phone, which is unique. They also have an option on English (India)\nduring phone first setup which I liked. Till now we always have to select\neither English(US) or English (UK).  \n9\\. One more important point everybody has to consider while buying this phone\nis that the price of the phone will not drop whatsoever till the phone goes\nout of stock or a successor is available. Apple, Samsung, Pixel phone prices\ndrop over a period of time.  \n  \nOverall it is a value for money phone if you can afford.  \nClose to stock Android OS with OP2 promise of flagship like performance. You\njust can't beat this phone in value for money category.  \n  \nIt may not be a beast compared to iPhone and Samsung high end phones, but for\na heavy user this is the best phone.  \n  \nFew Drawbacks that some people may consider before buying:  \n1\\. Size of the phone is big, even for my big hands, single hand operation is\ndifficult. (It has 6.01 inch screen)  \n2\\. No memory card expansion slot (I personally don't consider this as a\ndisadvantage).  \n3\\. No waterproofing. Phone is costly, and over a period of all of us are\nusing phones everywhere in several conditions. Waterproofing should have been\nconsidered.  \n4\\. If you put the bumper case provided by OnePlus, you cannot see the OnePlus\nsymbol at all. So, no way people will understand which brand phone is it. Not\na big disadvantage, but a proud user would like to showoff the brand name.\nApple does it best w.r.t symbol legibility to the outside world.  \n  \nAdded camera samples in low light conditions and indoor conditions.\n\n", "Guys, I've been using this phone for almost a month now. Must tell you that\nyou won't find any better phone in this price range atleast. Best part is the\ncamera & dash charging battery. Battery never seems to dry up though it's just\napprox 3300 mAh. No overheating, no hanging & no irritating stuff...if you are\nlooking to buy a phone in this price range, just close your eyes & go for\nit...you won't be disappointed.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 January 2018", "on 26 January 2018", "on 14 January 2018", "on 17 March 2018", "on 15 December 2017", "on 3 January 2018", "on 18 March 2018", "on 1 January 2018", "on 23 March 2018", "on 20 March 2018"], "reviewer": ["Akash K, New Delhi", "harsh doshi", "Mahesh", "Rushikesh", "Karan Kumar", "Jane", "VJ", "Siddhant Sawhney", "Kartik Podugu", "Rohit Sharma"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Flagship Killer", "Speed", "Excellent phone. I'm very happy with it", "Customer service is wrose", "Top Notch", "GREAT PRODUCT 1+5t", "TAKE IT AND GOOO", "It is a very good phone in a Price budget of 35000", "Best Buy For 2017", "Excellent phone no heating at any time while charging and ..."], "review": ["PROS  \n1.Brilliant Display  \n2.Fast and Safe unlocking  \n3.Extremely fast UI  \n4.Big Battery Life with ultra fast charging  \n5.Pure Android and Clean UI  \n  \nCONS  \n1.Too slippery without the cover  \n2.Camera quality not upto the level of pixel/Iphone/s8/note.  \n3.Updates are not on time  \n  \nConclusion: A great smartphone with lots of feature and lag free performance.A\nphone I would recommend to anyone with the budget of 30 to 40k.\n\n", "Awesome phone for this era and value for money. Case provided is great. Go for\nit if better options not available at the time. Clever battery and performance\noptimization thus lightning fast charging and processing. Nice ester egg.\n\n", "Excellent phone. I'm very happy with it. Best bang for your bucks. The in-hand\nfeel is spectacular. Devices felt very well balanced & the weight distribution\nis almost spot on - this is something which Apple has executed well in the\npast. Glad to see OnePlus paying attention to these details. The screen is\nbright, clear & unless you pixel-peep with a magnifying glass, you won't\nnotice any pixelation. Battery life is also acceptable, lasts for a day &\ntopping it up with the dash-charger is easy-peasy.  \nPhoto quality is mostly great under normal conditions and unacceptable in\ndarker situations. But that's okay with me. I didn't pay a small fortune like\nI would have for getting an ivy-league iphone or a Pixel. Overall, great phone\n& I don't see myself upgrading or changing anytime soon. This phone offers all\nthe phone I would need for the time being.\n\n", "After using for 3 months i have seen there is paint chipping issue from the\nback cover they have provided in the box and faced by many users. They are\ndenying to replace it under warranty by saying that this is due to usage. I\nhave never seen an flagship having this kind of paint chipping issues.\n\n", "Perfect Smartphone with Highest Specifications and smoothest Android Software\nExperience.  \nLoudspeaker Volume is very high, just Quality of sound is not as good as Pixel\nPhone(Only Con is No Stereo Speakers.)  \nExtremely happy.  \nDash Charger......best best bestest ever.\n\n", "Blazing Fast  \nBoth Delivery was done in less than 24hours of order  \nMay b advantage of being PRIME customer....  \nProduct is really good impressive I feel somewhat is 5t bit taller may b t for\ntall ..but is absolutely stunning display...  \nGreat work by OnePlus Hope u improve the camera performance bit better  \nAssistive lighting face unlock is totally blazing Fast...now can unlock in\nfull dark area...Kudos again..\n\n", "BEAST !  \nHuge jump for me after using my OnePlus One for 3 years.  \n  \nOnePlus has produced a beauty of a smartphone with the new 5T.  \nWill take time to adjust, having a huge display. But this beast doesn't\ndisappoint.  \n  \nPro's:  \nFace ID (Ultra Fast)  \nFingerprint sensor (Ultra Fast)  \nHeadphone Jack is still there !  \n  \nCon's :  \nCould have used stereo speakers\n\n", "It is a very good phone in a Price budget of 35000. As one plus is giving\neverything that a smart phone of 2018 should have. Camera quality is superb\nand bokeh effect is good too. Performance wise it don't lag and battery\nperformance is also decent.  \nThe users who like to play a lot of games then it is a good phone for them as\nit didn't heated much and didn't lag even on games like Nova.  \n  \nSo far it is a very good phone to buy in a Price budget of 35000\n\n", "Took a while to get used to such a good phone. Blazingly fast, simply refined,\nbrilliant camera... Lots to like. You have to use it to know just how well it\nperforms, like a charm. Order via Prime sale, came in under 24 hrs and since\nnever been set aside. Check out more reviews of it. And don't believe the hype\nthat it's not good enough. The others are way too expensive to compare and\nstill this trumps them.  \nBlindly do go and pick this. You'll regret you thought of anything else.\n\n", "Using since a month, Excellent phone no heating at any time while charging and\nCharing and talking.  \nCan choose which application should use the mobile data network , as in\niPhone. I left iPhone due to double sim requirement.  \nMobile cover + Screen guard is supplied, but NO HEAD FONE\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 January 2018", "on 20 January 2018", "on 16 February 2018", "on 20 December 2017", "on 29 December 2017", "on 30 December 2017", "on 6 December 2017", "on 18 January 2018", "on 15 December 2017", "on 25 January 2018"], "reviewer": ["Amazon Customer", "Saurabh Singh", "Raju  P", "Vivek", "Shoaib Patel", "Lekhraj S.", "Jaydeep Dhar", "Amazon Customer", "Michael Vivian", "Shopper A"]}
]