[
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Just written to cash-in on popularity of movie franchise", "Great prologue for Bahubali series", "Great book", "It's a nice read. looking forward to read other parts as ...", "It thrills you and makes you sit on the edge .. But", "Four Stars", "Must read for Bahubali lovers", "For all Bahubali Fans", "Mesmerizing", "Awsm!"], "review": ["The book is a huge let down when compared to the movie's story line.  \nThe book felt like the script of a B-grade hindi flick. It seems that the book\nwas written just to cash in on the popularity of movie franchise.\n\n", "Page turner. Detailed and imaginative.  \nGreat prologue for Bahubali series, leaves us wanting for next book.\n\n", "A great book.Got it @(88+50).  \nI have not completed it but yet the more i read the more i wanna know and I\nkeep digging s  \ndepper.!\n\n", "Gripping story line ..... The author has done his ground work well and didn't\nmix up the time n historical era. It's a nice read.looking forward to read\nother parts as well.\n\n", "It's simply awesome! Well all we do is look for the connection between\nbahubali and this book.. The only thing that the readers need to take not is\nthat .. It is just Book 1 and there is another part or sequel to this book\n\n", "very good in reading and quality of paper is also very niice  \n  \naffordable for price\n\n", "Above 18 but truly amazing and the description of each character is mind\nblowing. The chapters are quite distorted but it rather excites you more to go\nand read and. And also good to improve your dictionary.\n\n", "Interesting Read. Many Characters, politics ,loyalty, revenge. It has every\nelement to keep one guessing how the series will end. Looking forward to next\nin the series.\n\n", "Each chapter made me spellbound...Just can't wait for the next book...Curious\nto know more about the mahishmati secrets...Thank you..Will wait..\n\n", "The book Was really thrilling and Lovable..  \nHad an Amazing Journey through Mahishmati...  \nBut Felt a dagger stabbing me in the last page..  \nWaiting eagerly for the second Book of This series!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 October 2017", "on 20 June 2017", "on 4 March 2018", "on 30 May 2017", "on 13 January 2018", "on 28 May 2017", "on 7 February 2018", "on 30 June 2017", "on 2 June 2017", "on 22 August 2017"], "reviewer": ["Amazon Customer", "Richa Verma", "Yash", "murali", "Samba Kailash", "Amazon Customer", "SHRENIK", "Kaushik", "dr. apoorva arun", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Good Effort", "You must read", "A Sumptous Prequel to Historic Blockbuster", "But the best way to enjoy this book is to forget the ...", "Entertaining Book", "Interesting characterisation & story line", "Anand is the next RK Narayan in the making", "Must read for Bāhubali fans...", "Very intriguing", "Lending authencity to Fantasy"], "review": ["Writing a book based on the characters/plots and settings of a movie series is\nnot as common as a movie based on novel. It's a different kind of challenge\nand that's why I like the idea of writer and the Franchise owners to create a\nprequel series of the Movie. Baahubali is a worldwide phenomena now so\nobviously they had to create something on quite a large scale (somewhat\nsimilar to the movies) with major involvement of few of the on screen famous\ncharacters to cash in their popularity but at the same time it had to be\ninteresting and unique. Well! they succeeded at almost every front except the\none which was most important - \"Uniqueness\". Right from the characters to\nplots or even the writing style, everything is very much inspired from A Song\nof Ice and Fire. Just to give you an idea-  \n  \nShivagami: A fierce young girl Her father was a good man but branded as\ntraitor and executed by king so she swear to destroy the royal family. She\nacted as a lone wolf and tried to overcome all the odds by herself. There were\ntimes when she was trying to hide her fear and was thinking about the lessons\nfrom his uncle/mentor to keep her calm, I can almost read the famous line\n\"Fear cuts deeper than swords\" in those paras. Ring any bells? Yeah! She is\nthe Arya Stark of Mahishmathi.  \n  \nSkandadasa: Probably the only decent man in King's court He became\nMahapradhana (as good as King's Hand) in the later part of the book. He is a\nkindhearted and just person devoted to his country and strictly against the\ncorrupt men and wrong and biased practices and traditions. This is the reason\nfew other politically influential people dislike him. He is clearly the Eddard\nStark of this story with some small revisions.  \n  \nHidumba: A politically powerful dwarf A loudmouth but a man with important\nconnections, always involved in the major events and conspiracies of\nMahishmathi. He is so similar to Tyrion Lannister that I always read his\ndialogue in Peter Dinklage's voice in my head.  \n  \nVaithalikas: A community claims to be the actual owner of Gauriparvat and\nMahishmathi, they are ferocious fighters and have an uncrowned king of their\nown. They are the Targaryens (but without dragons) of this series .  \n  \nBrihannala: A Eunuch(???) S/he is conspiring something big in league with\nVaithalikas. Baahubali's version of Varys  \n  \nPattaraya: A great strategist, his ultimate aim is to overthrow the kingdom\nbut he sets smaller goal to avoid suspicion; and though he don't have the\nultimate controls on brothels but he used them for his plans in similar ways\nas Petyr Baelish did in aSoIaF.  \n  \nSimilarly the kingdom has 2 princes, Elder one Bijjaladev is very cruel and\nspoiled same as Joffrey while the younger one Mahadeva isn't a great warrior,\nkindhearted but gullible at the same time. He certainly reminds you of Tommen.  \n  \nGundu Ramu: A fat coward boy but a loyal friend of one of the main characters.\nHe couldn't be more like Samwell.  \n  \nAchi Nagamma: The one who's independent of any banner and fighting for poor,\nhelpless and needy villagers. She is leading the all women vigilante army and\nmore like a female version of Beric Dondarrion  \n  \nApart from the above mentioned characters and plot similarities the writing\nstyle is also similar to aSoIaF and though it is interesting to have chapters\nfrom different characters' point-of-view but its not as effective as it was in\naSoIaF series. The main reason is sheer plot vastness of aSoIaF, \"George RR\nMartin\" has a much bigger universe than \"Anand Neelakantan\" so his each\ncharacter's story POV take you to almost entirely different part of the seven\nkingdoms while in this novel even with so many different characters almost the\nentire story is set in Mahismathi it self. GRRM never mixed 2 POVs in single\nchapter but that had happened quite a few times here. Also almost half of the\nchapters (barring the climax and few others in between) don't have that many\npages so as soon as the momentum is building up the chapter ends. Plus there's\na lot of sexual content but it's not as justified as it was in GRRM's\ncreation.  \n  \nBut all these things doesn't mean that this book is not interesting. For me it\nis something like Eragon Series \"inspired from few great hits but still worth\nreading\". As I said, with the Baahubali book series they had the luxury of few\nwell known and wildly loved/hated characters in the form of Shivagami,\nKattappa & Bijjaladev and they have utilized them beautifully. Also after\ninitial similarities/inspirations the book takes it's own story forward, which\nis fast paced and full of turns and twists. I specially loved the last few\nchapters related with Mahamakam and the final twists in the last page leave\nyou awestruck. I have read in the acknowledgements that Anand finished this\nbook in 109 days which is quite unbelievable because it never gives you the\nfeeling of a book finished in hurry, even if you consider the inspirations\nfrom other books.  \n  \nOverall it's a good effort and now after initial built-up I expect better and\nmore original content from next 2 books of the series. Looking forward to it\n\n", "What does this book have that the movie Bahubali doesn't?  \n  \nThe very beginning! The past. The life of Sivagami and the way she has become\nthe way she is.  \n  \nAnand Neelakantan weaves a beautiful story of Sivagami in midst of the\ngeographical, social and cultural milieu of Mahishmati empire. Sivagami's\ncircumstances, her traversing through the myriad shades of the Mahishmati\nempire, the political cauldron and the social structure - all seems to\nresonate with the reader as one progresses in reading the book.  \n  \nTo understand the movie much better, do read this book, for it shall complete\nyour understanding of the story of Bahubali.  Sivagami undergoes the whole\nrigmarole of  getting the things set right for herself and in the process of\nher expedition leads to interesting discoveries. Interestingly these\ndiscoveries are known to the reader and not to the various characters in the\nbook.  \n  \nThe narrative flow of the book is good and Anand keeps the reader engaged\nexcept for a certain slowness in the story in between. This lull effect is\ngood in a way since we get to process all the information in the story till\nthat point. (It could be a damper for some)  \n  \nThis is first part of the series on Sivagami and am looking forward to the\nnext book.\n\n", "The author is a best selling author from Kerala state of India. Known for his\nprevious super hits like Asura- The Tale of the Vanquished and Ajaya Series of\nbooks, he ventured into this ambitious prequel to recent historic Indian\nblockbuster movie “Bahubali” directed by SS Rajamouli of Andhra Pradesh. Known\nfor his fiction writing skills, the author remains as the darling of epic\nfiction lovers of the country.  \nStoryline:  \nThe story begins with the woes of the downtrodden in the mighty kingdom of\nMaahishmati, somewhere in the central part of India, near the Mahishi river,\nprotected by their revered sacred mountain called Gauri Parvat. Sivagami, a\nyoung lady in her teens , whose father has been killed by the orders of the\nking for treason and treachery, is admitted into the royal orphanage, by her\nUncle. She under immense pressure and vengeance to destroy the royal lineage\nof Maahishmati patiently waits in the orphanage, only to be unexpectedly be\ncourted by the Prince Mahadeva, younger brother of the aggressive and cruel\ncrown prince Bijjala Deva. The later being an arrogant, tyrant, evil and a\nwomanizer, always treats his subjects as slaves and is highly feared and hated\namongst his peer groups. His slave Kattappa, a die-hard duty bound and loyal\nservant always protects Bijjala Deva from many threats and dangers that the\nlater faces in his day to day life, but is never respected in return.\nMeanwhile, some of the evil noblemen of the kingdom like Pattaraya wants to\nprofit by smuggling the secret Gauri dhooli, a strange powder extracted from\nthe self glowing blue and rare Gauri Kanta stones, mined from the womb of\nGauri Parvat, to the enemy vassal states of Maahishmati. The generations old\nsecret of Maahishmati’s undefeated victory saga in wars is attributed to its\nweapons moulded with mixture of Gauridhooli and metal. Sivagami, the highly\ncommitted and talented girl accidentally saves the life of the king Somadeva\nfrom a sudden coup attempt by the rebel Vaithalikas, on the auspicious\nMahamaakam festival day, just at the time when she attempts to recover the\nsecret book of her father, written in a strange ancient language, from the\nchambers of the Prime Minister, Skandadasa. The story ends here with Sivagami\nrewarded with the title of a Bhoomipathi and her father’s treachery forgiven\nfor her act, surprising her totally and giving her a chance to be in the\ngoverning system and thus plot to destroy the kingdom in the future.  \nPros : The book is cleverly plotted with umpteen number of characters in a\nseries of events right from the beginning till the end. The author’s skill to\nmanoeuvre the reading is well maintained. The way in which lower castes and\npeasants were treated in the ancient kingdoms wherein only the upper castes\nand royal family reaped the benefits while the former always suffered and\nforced to a life full of sheer poverty, slavery, insults, homicide, genocide,\nchild trafficking and forced prostitution is well elicited. The author was\nsuccessful in portraying that such blind dictatorship rule of any country\nwould lead to revolt and coups somewhere or the other. The effect of Bahubali\nmovie on the book seemed to be very high as the reader , if already watched\nthe movie, would correlate each and every character of the book with the real\nmovie characters as long as he/she is reading, in the back of his/her mind.  \nCons: The story started with a bang but somehow there is some loss of lustre\nin the first half with some boredom masking the story but picked up pace after\nthe middle and maintained the tempo till the end. Since it is the Book One of\nthe series, many characters in the story have been left unfinished. I find\nthat there are too many characters introduced but hope that they will find\ntheir life in the next book. Somehow, the actual historic movie Bahubali 1 and\n2 seem to have shielded the overall effect of the book. Slightly felt that the\nbook would have had a greater punch if it was written and released even before\nthe movie. Some negligible print errors are spotted here and there.  \n  \nMy rating of this book is 3.25 out of 5\n\n", "I picked up \"The Rise of Sivagami (Baahubali: Before the Beginning #1)\" by\nAnand Neelakantan, as it was a prequel to the movie Bahubali. But the best way\nto enjoy this book is to forget the movie plot & read the book as a\nstandalone. This will help you connect better to the multiple plots &\ninteresting characters.  \n  \nThe story revolves around love, greed, revolts, revenge, honour, power,\npolitics & prostitution. This book is well paced & keeps you engaged +\nguessing the next plot...  \n  \nIf you want to get a deeper insight into the characters of Bahubali, then it’s\na must read & just like the movie leaves you at the end of the book guessing\nthe next plots... how did Sivagami end up marrying the beast Bijjala? What is\nBrihanala up to? Why was Sivagami's father branded a traitor?  \n  \nBahubali: Before the Beginning #2, I am waiting for you....\n\n", "The Rise of Sivagami: Book 1 of Baahubali - Before the Beginning is an amazing\nbook.  \nThe Rise of Sivagami is an excellent story, The author have canvassed the rise\nof the the queen beautifully. You will definitely enjoy reading the book. A\nmust buy for novel readers. Although the book is not written in English type\nof novels, but definitely it is one of the best novel. If you are in bangalore\nand a regular bus traveler, then it is a nice book to go for it.\n\n", "Book 1  \n~Bahubali Before The Beginning~  \nTHE RISE OF SIVAGAMI BY ANAND NEELAKANTAN  \n  \nThis novel talks about everything that happened before the beginning of\nBahubali. The story is centred around Sivagami, the future queen of\nMahishmathi. It depicts the story when Sivagami was a teenage girl. As in all\nthe Bahubali movies this story also has many characters, which makes it more\ninteresting for the readers.  \n  \nThis story is about how Sivagami became a part of the palace officials. In\nthis story, Sivagami hates Mahishmathi and it's king Maharaj Somdeva since her\nfather was been executed by him for treason. This is about her journey from an\norphanage to becoming a bhoomipathi of Mahishmathi.  \n  \nYou will also read about Kattappa during his teenage life. You will come to\nknow about his family & how he became such a great warrior. The story depicts\nhis suffering & struggle to survive in this master & slave lifestyle. You will\nexperience how he has to take tough decisions in his life.  \n  \nYou will also come across Bijjaladeva & Mahadeva. You will come to know about\nPrince Mahadeva as you have hardly known about him from the movies.  \n  \nThe author has described the orthodox thinking in a brilliant manner, the\nmaster and slave lifestyle, the cast based designation and ill treatment that\nwas followed during the olden days. As you will expect from a Bahubali book,\nit has fighting and war scenes poured down brilliantly in terms of words.  \n  \nThe story is very interesting as Sivagami hates Mahishmathi then how she\nbecame the queen of Mahishmathi. The story ends at very interesting point\nwhere Sivagami is declared as a bhoomipathi which makes you think about will\nshe take her revenge or not, hence you will also be waiting for it's next\nedition.\n\n", "I have been a fan of Anand since the day I read Asura. Here I was, holding a\nbook that challenged everything I had learnt and seen on TV since I was\nlittle. His writing style, the narration and the way he weaved philosophy into\nthe story made the book unquestionably unputdownable.  \n  \nThe same is case with the first installment in the Baahubali series. I was\nreading this book every opportunity I had. Anand had ensured that the reader\nis engaged right from the first page of this book, all the way to the\nAcknowledgments. The characters came to life in my kindle and in my\nimagination, and I could feel the aspiration and tension of the characters in\nthe book.  \n  \nEagerly looking forward to the next 2 installments of this book\n\n", "I apparently saw and bought this book from Amazon because I liked the Bāhubali\nmovie series very much.... this book is tremendously exciting as many new\nfacts get out of envelope and engages you to keep on reading.... but at the\nsame time many sexual contents are there in the book which perhaps make you\nuneasy : (  \n  \nOverall if you want to indulge yourselves in the world of Mahishmati.... you\nshould buy this\n\n", "This undoubtedly is one of the most intriguing book I have ever read. It is a\nkind of book which you want to finish ASAP because you can't stop reading it\nat any point. It is wonderfully written. All the plots, characters, places are\nbeautifully crafted. We you finish this book you keep turning pages to see if\nthere is more as it leaves you on the edge. Can't wait to get my hands on book\n2 of this trilogy.  \nThis is the first book I have read by Mr Anand and I will make sure I read his\nother work soon.\n\n", "Multiple voices can be heard expressing their points of view in this story.\nThis gives the reader a broad overview of life on this fictional universe and\nat the same time tells him the deepest thoughts that motivate characters to do\nwhat they do or plan to do.  \nCharacters, male, female and other, who occupy different strata of the society\nthey live in give us a feeling that this is all real.  \nThere is action and sex, the former well written and the latter not so\ninteresting.  \nThe kingdom of Mahishmathi is the grand centre of power. As we have already\nseen this particular geographic entity and become familiar with the landscape\nin the two movies, a few descriptive passages by the author suffice to help us\nvisualize the background.  \nThe author tries to depict the complex inter play of good and evil in the\nindividual. Groups of men with various co des and morals, clash with one\nanother, sometimes reinstating their principles, and at other times reviewing\nthem.  \nThe main character shivagami is made distinct not only because of what she\nthinks and does but also because of how people look upto her, admire her and\nlove her.  \nThe author may have captured the attention of thousands of readers by writing\na book on a popular movie, but if people read this book from end to end its\nbecause of the authencity of his writing.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 June 2017", "on 14 July 2017", "on 7 July 2017", "on 27 January 2018", "on 15 June 2017", "on 6 October 2017", "on 15 June 2017", "on 8 June 2017", "on 20 June 2017", "on 16 July 2017"], "reviewer": ["Avinash Tiwari", "Kavita Singh", "THREEKAY", "Vasanth Naidu", "aswini", "Sheetal Naik", "VijayMenon", "Amazon Customer", "Ankur Baid", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Rivetting read", "envy and also love, lust nd humanity", "Good read", "Great book for Bahubali fans.", "But very disappointed because the book objectifies women", "Rise of Sivagami - A befitting prequel", "Awesome insight to kingdom of mahishmati", "Disappointing", "Extremely Entertaining", "A decent book"], "review": ["Well written historical thriller. Liked the plot and the drama employed. Fine\npiece of Indian writing in English. Recommend it for all the thriller and\nmystery buffs.\n\n", "The book will take u to the magical world of Mahishmati kingdom .The book\ndepicts much wider aspects of politics and, envy and also love, lust nd\nhumanity.. Overall it is a mixed bag and actually far more xciting dan wat we\nsaw in both the films. So Baahubali fans, its a must read fr all of u. Go n\nget a copy soon.\n\n", "It's a great book!!!! Definitely not one for kids tho, and the author has kept\nthings very realistic! It's not a fairy tale like we would expect, rather the\nhardness, hashness and reality strikes close to heart!! It's the perfect book\nfor a heavy read!! Definitely go for it, a good one in this genre\n\n", "A great book by the author. It meets all the expectations of a Bahubali fan. A\nmust have for a Bahubali lover. This book totally describes the nature,\npersonality, traditions and everything the characters or Mahishmati could ever\npossess. Although it is titled as Rise of Sivagami but it also states\nKattappa's story which is highly interesting and my favourite part of the\nbook. The book is very interesting with full suspense and beautiful art of\nwriting. Love this book.\n\n", "The writing style is very fluid and clear. But very disappointed because the\nbook objectifies women , shows them in a very poor light. This is indeed a\nshocker since the perfect Mahishmati portrayed by Rajamouli is a crumbling\nmenace according to Anand\n\n", "The books initially takes its time to register the characters but as time\nflies the pace picks up. Kattapa and Sivagami were two strong characters in\nthe film so their characterisation is highly relatable. However it's the other\ncharacters like brihanalla, pataraya who create a curiosity as they appeared\nwithout any importance in the film.\n\n", "A very well written book with nice presentation. Takes us through the\nconflicts and interests of the kingdom of Bahubali and Bhallaladeva. A must\nread for all the Bahubali fans. Waiting eagerly for the next book in the\nseries....\n\n", "Convoluted and disappointing in conclusion. The narrative is very complex with\nso many characters and complicated structure where each characters story flows\nindependently and in bits. Too difficult (atleast for me) to hold so many\nstories in mind in parallel. And at the end of it all a dampener (and abrupt)\nof a conclusion.\n\n", "Reading a book after a long time, and am so glad to get my hands on this one.\nIt kept me glued and wanting to know what's coming next in the story. However,\nthe end left me in GREAT suspense. Hence, I would like to know when is part 2\nof this book releasing. Must read book.\n\n", "Overall it is a decent book. Hardly any story related to the core aspect. Too\nmany details which were not even necessary and there was a lot of beating\naround the bush. But whatever story was told was a good one.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 April 2017", "on 1 December 2017", "on 19 November 2017", "on 6 November 2017", "on 31 August 2017", "on 6 July 2017", "on 18 May 2017", "on 27 February 2018", "on 25 July 2017", "on 1 June 2017"], "reviewer": ["A. A", "Udita Sen", "Karnesh Meshram", "Amazon Customer", "Shopaholic", "Giri1820", "Kindle Customer", "OLSaddict", "Priya", "Abhishek Y S S"]},
{"rating": ["4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Epic as only Anand Neelakantan can pen!", "Mediocre", "Good", "One must read it!!", "A Benchmark in Indian Storytelling", "Decent read, the narration and story keep moving", "Gripping yet somewhat incomplete", "It could have been better, maybe the second book will as this one ...", "Waiting eagerly for the next part.", "Liked it"], "review": ["Watching the movies after reading this book gives a completely new perspective\nto the characters. Not too different, but an additional dimension. That to me\nis the hallmark of a great novel. The Mahishmati anthem was on repeat mode in\nmy mind throughout the book, what a wonderful universe I'm seeing unfold!\n\n", "Not upto my expectations. It has its share of intrigues, twists and turns but\nafter you finish reading u wud definitely feel there was something missing.\n\n", "Very interesting book. Eager to read the next book in this series. This book\nis not for under 16 years.\n\n", "Very much awaiting for the other parts too!! Tooo much good and a well\nnarrated story... hope this can be made into a movie too!!!\n\n", "Anand Neelakantan’s narratives of rich mythical worlds need no introduction.\nBut he has outdone his previous books in his depiction of Mahishmathi. He\nmakes the landscapes and architectures come alive.\n\n", "After watching Bahubali the beginning, I was in total awe of the Sivagami\ncharacter and this was what prompted me to read this.  \nHowever since this is a prequel, one need not have watched the movie to read\nthis book. How did so n so become how he was in the movie kind of curiosity\nkeeps you going throughout the book. Would want to read the next 2 parts too.\n\n", "Nicely written book. Keeps you engrossed till the end. However many questions\nremain unanswered. What actually happened to Devaraya? What happened to the\nbook? Prince Mahadeva is in love with Shivgami and she is known to have\nmarried Bijjala.\n\n", "After the Bahubali series, people have set very high bars for anything related\nto it. I feel the book didn't do justice to it. It could have been\nbetter,maybe the second book will as this one has intended for the readers to\nget familiar with the characters and lay ground for greatness to come.Maybe.\n\n", "Well written, but the story has neither a beginning nor a proper end. Anand\nSir, I a am waiting eagerly for the next part of the story.\n\n", "Good story flow...Liked it the characters are depicted well and the story even\nthough not complete is good.. Waiting for the next 2 parts\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 May 2017", "on 9 July 2017", "on 5 April 2017", "on 21 September 2017", "on 16 March 2018", "on 12 September 2017", "on 2 June 2017", "on 27 May 2017", "on 22 July 2017", "on 8 April 2017"], "reviewer": ["Kartheek Peyyeti", "Subhajit Das", "Amazon Customer", "nidhina thammana", "Ravi Jain", "kyatobhi", "priti raut", "Amazon Customer", "Adarsh", "Amazon Customer"]},
{"rating": ["3.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Nice book as a prequel to Bahubali", "Though brilliant in flashes", "Engaging book. Interesting plot", "Good read.", "Full justice to the epic", "It's abt sivagami from start", "Too much detail", "Intresting but too many questions unanswered", "the story is very deep. deeper than the movie ...", "Four Stars"], "review": ["Anand Neelakantan did a great job in building the character of Sivakami.  \nI feel he should have extended the plot a bit more at the end.  \nI felt that a bit of suspense is missing as the book seems to be incompletely\nterminated.  \nOverall it is an excellent book.\n\n", "Too much hype and little substance. Though brilliant in flashes. Pity those\nflashes are not consistent.\n\n", "Engaging writing keeps you glued till the end. Excessive detailing in some\nchapters is a turn off but the plot is worthy. Recommend a read\n\n", "Good read but not for children. Too much violence n explicit content. It's a\nprequel to Bahubali. Sivakami n Kattappa characters are still developing.\n\n", "Gripping story line which never faltered from the original. But talking about\na hell lot of characters who were lurking in the dark without any recognition\nneeds a lot of courage. Who else other than Anand get this brutal task to\nsuccess? No more words, this book is worth a re-read.\n\n", "Still not completed reading once done I write a review  \n  \nIf u want to know know wt sivagami then it's worth buy\n\n", "Very good for people who are looking for the minute details about every scene\nand character. Great picturization of scenes and characters. Have not yet\ncompleted as few chapters got boring with enormous details. Still had a fun\ntime reading it.\n\n", "It was a gripping book but i felt too many questions has been left unanswered.  \nCould have been better considering it is a trilogy and one or two element of\nsuspenses will keep it going but too many like these just somewhere brings\ndown your hope to read the next one.\n\n", "the story is very deep. deeper than the movie to say. sexual content is very\nstrong, could have reduced it, strictly no to children.\n\n", "The rise of Sivagami is good book to read and know in detail!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 September 2017", "on 13 July 2017", "on 4 July 2017", "on 25 June 2017", "on 16 May 2017", "on 14 February 2018", "on 13 July 2017", "on 19 August 2017", "on 26 February 2018", "on 24 January 2018"], "reviewer": ["Dheeraj", "Sifter", "Sangam", "aishwarya", "Pradeep Kumar T", "Kamal KV", "Siddharth", "Nisha", "Amazon Customer", "Harish"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Four Stars", "Great effort", "Captivating and mesmerizing...", "Okay type book... Many questions to be answered in coming books", "Can't wait for next book in the series", "A good read", "Very nicely plotted story.", "Revenge of Sivagami", "Interesting... Engaging... Need to be more... Unpredictable", "Good pace and characters are outlined well"], "review": ["Waiting for part two\n\n", "One of the best books which enthralls the world of baahubali. Though it\ncontains some uncomfortable sequences for some people , it was nothing\ncompared to current going generation of books and series. It has everything a\nkingdom needs.the grandeur, cunning, betrayals, innocence , bravery,\nfoolishness etc.\n\n", "If watching the great film Bahubali makes us live the scenes, reading this\nbook makes us feel a part of the film. So intriguing to know how Shivagami\nbecomes the rajmata.\n\n", "It was kinda okay story of mahishmati and the corrupted politics of\nmahishmati.. Still lots to happen now.. This book also leaves with a question\nto be answered in coming books... 3 stars for the story\n\n", "Their was always so much history to the characters so gloriously portrayed in\nthe movie and the book justifies them all. This book has already given so much\ndimension to the plot twists in the movie. Simply can't wait till the next\none.\n\n", "A page turner. The story takes interesting twists . The book doesn't give way\nto the point where shivagami( in bahubali era began )becomes the rajamata.\nWaiting for book 2.😊\n\n", "I liked the plot of the story. Time wasn't wasted in portraying the characters\nvery deeply, it went with the flow of the story.  \nVery good start for Bahubali plot. Anand Sir have done justice with the\ncharacters of Bijjala, Katappa and Shivgami.\n\n", "I totally agree with the synopsis of the book in the Amazon page-  \n\"A tale of intrigue and power, revenge and betrayal, the revelations in The\nRise of Sivagami will grip the reader and not let go.\"\n\n", "Engaging writing as always... Difficult to compare his previous work on Asura\nand Ajaya.. But still a good read .... Waiting for the next installment\n\n", "Quite dark and intriguing. Good pace and characters are outlined well. A\nsizeable amount of the text may not be suitable for children. In my opinion\nsuitable only for ages 18 and above. The text drags at places but the\nnarrative is quite lucid in most of the book.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 April 2017", "on 19 December 2017", "on 30 August 2017", "on 29 June 2017", "on 28 December 2017", "on 5 August 2017", "on 17 February 2018", "on 13 January 2018", "on 3 October 2017", "on 13 January 2018"], "reviewer": ["Amazon Customer", "Sarat Voleti", "Amazon Customer", "Ussama", "Vaishali Dhaybhai", "KVarun", "Deepak Kumar", "Mike Nach", "lovely suraj gandharapu", "Amazon Customer"]},
{"rating": ["3.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Good plot, but sloppy execution in few parts", "Awaiting the next book", "Not worth your time", "A true treat on bibliography", "Loved the book", "There is not much relation to the plot of the great movie but overall it's an average book", "Waiting for part 2 !", "Good writing style and depiction of the characters.", "The plot is extremely gripping and it does full justice ...", "Four Stars"], "review": ["I expected more after reading the reviews. It was slow in the beginning and\nthe story got really interesting close to the end of the book.\n\n", "This was an amazing read, looking forward to the next book in the series.\nBuilding the characters of sivagami and kattapa it's amazing.\n\n", "Too long & complicated story-line. Didn't find it exciting at all despite\nbeing a huge Baahubali series & mythology fan.\n\n", "The book is amazingly written, the phrases and the people come alive when you\ngo through the words.  \nShivagami being such a powerful character definitely needed to be elaborated.\n\n", "One of the best book that i have ever read. Actually this one is the basic\nstory which builds The Bahubali 1 and 2. A must read one. The author was able\nto point out each and every character accurately and most precisely.\n\n", "The book is suitable for adults. There is not much relation to the plot of the\ngreat movie but overall it's an average book.\n\n", "Just as d title suggests....This is actually the story of RISE of shivagami\n... The book doesn't end where the movie bahubali begins....Waiting for the\nsecond part of the book.....The plot is good\n\n", "This is my first book of Anand Neelakantan and it did not disappoint me. The\nway he built up the characters of key roles like kattappa and sivagami was\nimpressive. The story was a bit dragged on in the middle but the ending was\nvery gripping.  \nWaiting for the 2nd book in the series.\n\n", "The plot is extremely gripping and it does full justice to the Baahubali\nfranchise. It gives a lot more depth to the movie and intrigues us with the\ncharacters. Even if you are slightly inclined towards Baahubali, then this is\na must read. Can't wait to read the next part.\n\n", "Great backstory to the Baahubali movie franchise. Not for kids though. Adult\ncontent.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 May 2017", "on 6 May 2017", "on 4 July 2017", "on 19 September 2017", "on 10 July 2017", "on 30 May 2017", "on 13 July 2017", "on 30 May 2017", "on 14 July 2017", "on 15 October 2017"], "reviewer": ["Dharani Sowndharya", "Vishal Bhalerao", "Jignasa", "Kindle Customer", "Akarsh C Benny", "Amazon Customer", "Praveen k", "Sai Kiriti B", "vamsi krishna", "N_S"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Interesting Read", "Good", "Story line was good but was expecting more as SS Rajamouli had praised ...", "Wriitten with a communist perspective", "Gripping and dark", "go for it if you love books like \"shiva thrilogy \" i am waiting for ...", "Nice", "Great book with few loose areas in the plot but ...", "Nowhere close to standards of bahubali movies", "Powerful and intrguing"], "review": ["Very interestingly written. Author is trying to build the characters of the\nplot. Conflict of thoughts in kattappa was well presented. Interested to know\nhow the roles of Sivagami and Kattappa will grow from here and whether\nMahishmathi kingdom will survive the political challenges\n\n", "Anand neelkantan's pen has flowed butterly to inhale the historic story of\nSivagami.This book contains about Kattapa and his brother Shivappa more than\nprotagonist Sivagami. His description and narrations keeps the readers in\ncuriosity.  \nDo read and wait for second series. 😊\n\n", "Story line was good but was expecting more as SS Rajamouli had praised this.\nDisappointed further as this is only first part of the book. The book\ncover/description doesn't give it easily. Would be better to read once all\nparts of the book are available.\n\n", "Though I loved d story....but 4 d sake of fiction don't try 2 prove that\neverything was wrong in that time.....Don't make someone believe that kingdoms\nwere there only 2 exploit.....It seems yet another effort 2 stigmatize d\ngolden era of India & thus Hindu rulers.....It has been written with a typical\ncommunist agenda......\n\n", "We saw Mahishmati as a great empire built on virtue. But this book has shown\nthat there is too much darkness under the lamp. Ruthlessness and the hatred\nare only seeping from every corner of the book.  \n  \nStill it is said aptly  \nJai Mahishmati.  \nYou are built on ruthlessness and will only survive through it...\n\n", "Actually i am writing this review after reading this book..the book is full of\nsuspence, mysteries..go for it if you love books like \"shiva thrilogy \" i am\nwaiting for the second part of this book\n\n", "Justifies the legend of Shivagi. I look forward to the next edition and\nhopefully the master rajamouli decides to make this alive on the big screen!\n\n", "Great book with few loose areas in the plot but makes up for it overall with\nthe gripping suspense. Nice read for bahubali fans!\n\n", "Too negative, too much of adult stuff (which is surprising because bahubali is\nfamous amongst kids too, so even they may take up this book for reading), not\na single happy page, too much of consipracies. Not at all happy with the book\n\n", "After watching the movie-Baahubali, I couldn't help not buying the book which\nis a highly acclaimed prequel of the movie. The prequel so far isn't as great\nand grand as the movie but I am hoping it will live up to the legacy in the\nnext book.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 July 2017", "on 19 June 2017", "on 5 June 2017", "on 22 June 2017", "on 21 January 2018", "on 6 March 2018", "on 30 April 2017", "on 26 October 2017", "on 9 August 2017", "on 28 June 2017"], "reviewer": ["Amazon Customer", "shraesta", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Manish das", "Sinosh", "Vandana", "Anz", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Bahubali story taken to another level !", "Ah!! Desperate for book 2....", "A 'just good' book", "An epic journey described in a book!", "Good book but not for children less than 12-14 yrs", "Disappointed...", "A wothy prequel to Bahubali", "Gripping page turner", "Too much boring", "Awesome!"], "review": ["This book talks about the story much before Bahubali, it talks about the story\nof Sivagami, Katappa, and a lot of other characters. The author has let his\nimagination loose with the kind of story he has written. I can't wait for the\npart 2 of this book !\n\n", "It's such an amazing book. Thrilling fiction. U dont need to be aware of the\nBahubali serious. Just grab the book. It is about the 17 year old Shivagami\ntaking revenge for her father's murder by Mahismati king Somedev. The author\nwriting style is as good as Amish Tripathi. Goin to order other works of the\nauthor\n\n", "I was really exited to read this book as I really wanted to know the story of\nSivagami. In movie we have seen this woman as such a powerful, influential and\nrespected character.  \nAbout the book, the pace of the story is slow. If you are expecting this book\nto be trully incredible and a kind of book that trully blows your mind, then\ndon't. At some parts the story becomes really boring, where you just feel like\nskipping. But anyways, overall its nice. Good for light reading. Want a book\njust to pass your time? then go for it.\n\n", "The book is a description of the legendary kings of the past. History is\nevident of the fact that there were many epic warriors whose tale is lost in\nthe depths of time.  \nA movie oriented book which takes you a journey worth exploring & experiencing\nfor a lifetime.  \nA must read for readers who like to read war related book.\n\n", "Good book, but please keep your children away reading the book till they\nunderstand Romance, I mean to say for at least 12-14 years.  \nAuthor should have noticed that Sivagami is a very popular character among\nchildren and should have kept them in mind.\n\n", "Often we come across movies based on books and are left disappointed! This is\nquite the opposite. I am a fan of Baahubali movies and bought this book with\nhopes of a high quality narrative. But was left terribly disappointed.  \n  \nPerhaps the author should have focused less on eroticism. The storyline gets\ndiluted while the explicit details gain prominence. Hopefully the sequels\nwould have a course correction...\n\n", "This book is a worthy prequel to the Babhubali universe. The character\nbuilding is intense and you try to predict the dots of how they will connect\nto the Babhubali world. The scale is grand in the layout of the fictional\nworld . Last but not the least you will want to keep reading the next chapter\nto know what will happen and wish the second book is in your hand to know\nmore.\n\n", "For baahubali fans gives an insight into the early life of Sivagami and few\nother plots not mentioned in the movies. Written in the typical anand\nneelakantan style. Gripping and a page turner written in a simple language\nwithout unnecessary fancy words. Eagerly waiting for the next in the series\n\n", "Too much boring.. niether interesting nor thrilling.. and the vocabulary is\ntoo bad. It's a literal translation of telugu words to English.. ex viswasam\nleni kukka is written as thankless dog.. too many characters to remember and\nthe twist in the kahani is still 2 books left in this series.. Huff.. jus a\nwaste of time and money\n\n", "After reading Ajaya and Rise of Kali, and Asura, i couldnt wait to read this\none. Anand has really pulled the job again leaving me waiting for the next in\nthe series. Awesome narration and writing which will evolve into the epic we\nall know.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 July 2017", "on 31 August 2017", "on 9 June 2017", "on 28 January 2018", "on 21 June 2017", "on 25 June 2017", "on 20 September 2017", "on 1 October 2017", "on 13 December 2017", "on 7 December 2017"], "reviewer": ["Bookgeek", "Mansi Mudgil", "Amazon Customer", "Absinthe", "sri harsha", "Sudhir", "Amit Kothare", "Dr. Rajagopal Kunnatur", "Kella", "vm"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["The story of Shivagami has been said so wonderfully that the reader cannot escape the story for a ...", "I won't even donate it.", "Not meeting expectations set by Bahubali", "Fantastics experience", "Plane Reads", "Deja Vu", "Beautiful story telling but a lacklustre unconvincing end", "Worth Reading.....", "Boring read !!", "Must read for every Baahubali and Anand Neelakantan fan"], "review": ["This book takes you away from your world and take you to the ancient world of\nMahishmati. The story of Shivagami has been said so wonderfully that the\nreader cannot escape the story for a moment. The writings and description is\nso nice that the reader can imagine the scene easily. Well done Anand\nNilekentan.\n\n", "This book is very different from Bahubali brand. I could only read about\noppression and revolts and cast rhetorics and much more.  \nMakes you wander in a negative copied world leading to nowhere. Too many\ncharacters who are good for nothing.  \nIts like a bad Bollywood movie where masala is stuffed instead of story. I\nwish Rajamouli had read this book before letting people stamp it with Bahubali\nfranchise.  \nThis happens when a famous sweet shop name is used to sell distasteful sweets,\npackaged in new box.\n\n", "The characters are not at all matching to those set up by the movie. Neither\nof Bijjala or Sivagami match the expectations. Sivagami is yet to rise even at\nthe end of the book. No where has she shown the same trait as in movie.\nBijjala's hand deformity is completely forgotten. I felt the story is abruptly\nended as well. Suspense is continued but not the kind of it which can leave\naudiences talking about it\n\n", "I am not yet finished, but I must say this book is one of the most finest\nwritings by Anand Neelakantan. It keeps you engage throughout the journey and\nI keep waiting for my next rendezvous everyday (I don't have enough free time\nto read it through in just few days, so a little chunk each day). All the\ncharacters are brought to life and I keep visualizing each scenario. Great\nreading\n\n", "Amazon: Hassle free as ever.  \nSeller : Simple book packing. delivered as per expected date.  \nProduct: simple mass market paperback  \nBook: I picked this book because I love prequels and thoroughly enjoyed the\nmovie. The plot of Shivagami has more intrigue than the movie Bahubali itself\n(which I consider as pretty straightforward basic plot line). Waiting for the\nnext book in this series. Also remember to judge the entire series and not one\nbook.  \nAuthor: I generally don't like the writing style of Mr. Anand Neelakantan.\nProbably the only reason why i couldn't finish his book on Ravana.  \nContext: I always have series of books I pick up for reading on a plane or\ntrain or where there are too many distractions. In such instances, I cannot\nlet myself involve in profound material. This one goes in that category.\n\n", "Finished reading the book in 2 days, the sleepless nights and puffed eyes were\nworth it. Must say, it was awesome. The rampant government corruption that is\nvividly described in it in ancient Mahishmathi was very much like the present\nday India and the world. What happened at the prime ministers office at\nMahishmati, could have easily happened at any Gram Panchayat office today. The\nsorry state of government orphanages, the abuse of power, the twisting of\nfacts, paid bards and storytellers akin to todays paid media - deja vu.  \nThe only thing that is different is the slavery, for which we must ever be\ngrateful for our Independence.  \nAnand Neelakantan, Take a bow, Man!!!\n\n", "Mr. Neelakantan has written beautifully about the kingdom, their people, the\nrules, slaves, sivagami, her life and everything. The way he describes\nsituations places people and emotions is very unique and lively. The rise of\nsivagami however has many unanswered questions. I wouldn't want to ask those\nquestions in a public forum but they are significant. Without answers to those\nthe end is unconvincing. Perhaps the author will write another book which\nshows how sivagami becomes the powerful woman we see in the movie. Or perhaps\nthe freedom bestowed on the author by the movie director makes him go the\nextra mile and use creative freedom to make the character sivagami like the\none he has in this book, with not so much continuity with her character in the\nmovie.\n\n", "If your are bahubali lover don't miss this fiction.It depicts the story of\nSivagami and Kattappa before the beginning...The way author written the story\nis outstanding...It really make u sit and read....\n\n", "Bought this book expecting it to be in the same league as bahubali movies..\nbut I find it really dissapointing. Unnecessary raunchy depictions and lengthy\nchapters make this a boring read. Giving 2 stars for the first and d last few\npages alone. Children who are bigger fans of bahubali franchise cannot even\nread this book. Few parts are too dark and depressing, waiting for the second\nbook to be bigger and better in terms of writing and story telling .\n\n", "It is awesome book! Loved very bit especially the climax which leaves you\ncraving for more! The language used by the author is so poetic and almost\nlyrical... very refreshing to read. The characters are very interesting and my\nfavourite is Skandasa definitely  \n  \nOverall the service of amazon was great, received the book on time!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 July 2017", "on 14 October 2017", "on 17 July 2017", "on 18 July 2017", "on 23 March 2018", "on 16 August 2017", "on 31 January 2018", "on 16 May 2017", "on 9 June 2017", "on 30 August 2017"], "reviewer": ["Diptangshu Sarkar", "Sandeep P", "Arvind Yerram", "Amazon Customer", "Sierra", "Shruti Ramjee", "Kindle Customer", "Hafeez Km", "Divya", "Vipashayana Tanwar"]}
]