[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "good best😆☺", "Good cube for price; Colors not as shown.", "For beginners and pro cubers", "Simply awesome", "I received smaller one", "Good place to start for beginners or mid-pros", "Worth its price Nice speed and swift in", "Nice but costly", "It is a very smooth cube, great for beginners"], "review": ["Awesome product at a good price.\n\n", "flexible good cube.i had ever seen.\n\n", "Received one with different lighter colors. Red is close to magenta, orange is\nlike neon orange, yellow is like lime yellow, green is flourescent, and blue\nis a light blue.  \n  \nThe cube is made of good quality plastic and is ok smooth but this is not for\nprofessionals. Good for beginners and amateurs.  \nFor the price, this is a great beginner-intermediate cube.  \n  \nThe cube also makes a wind-chime like sound when rotated.\n\n", "Nice speed cube..... No need of oiling it...Smoother rotation.....\n\n", "An epic cube with ultra buttery moves.  \nWorks like a charm.  \nThanks Amazon for such an amazing product....\n\n", "The product i purchased was for 6.2 d8mensions but i received for even ledd\nthan 5.5 dimensions. But the item is very good and no negatives on it.\n\n", "An excellent cube for a beginner to mid-level pro solver. Has excellent turn\nspeed and smoothness. I have tried many speed cubes and stickerless cubes\nbefore, however, they did seem a bit too large for my taste. This cube is, in\nmy opinion, is at a perfect size to performance ratio. I have fairly large\nsize hands (I'm 6ft high). Although it did take a bit of time to get used to\nthe small cube, coming from years of using large cubes, was fairly easy.  \n  \nPros :  \nSmooth turning  \nPerfect size for any size hands  \nVery little to No maintainance  \n  \nCons :  \nThe logo of the manufacturer is a bit distracting (It's on the centerpiece of\nthe white face)  \n  \nVerdict : Although there is only one major con that I can point out with the\ncube, it is fairly easy to remove the logo with a razor blade and 5 minutes of\nwork. If you are looking to getting into speed solving, or just solving in\ngeneral, this is a very good place to start off.\n\n", "Worth its price  \nNice speed and swift in motion\n\n", "Nice but costly. I bought the exactly same item from local market for Rs 95/-\nonly. Very smooth, tough plastic, high speed and lovely soft colors. I don't\nknow why the seller is selling it with a double price, and delivery cost\nextra.\n\n", "\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 February 2018", "on 14 February 2018", "on 6 May 2017", "on 26 January 2018", "on 18 December 2017", "on 31 October 2017", "on 30 January 2018", "on 12 January 2018", "on 28 February 2018", "on 10 February 2018"], "reviewer": ["Abhishek Pal", "LALSREE.S", "Anurag", "Prof.Surajprasad Shukla", "Anant Verma", "sai pavan", "Manohar Maddineni", "Abhijeet Singh", "Manoj Kumar Sahu", "Amazon Customer"]},
{"rating": ["3.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Three Stars", "If you compramise the quality of material versus its look ?", "MUST BUY FOR BEGINNER'S AT THIS PRICE !", "Best value for money", "got damaged product", "Cheap n best ,vale for money", "Five Stars", "Average", "Four Stars", "Got used item! So many scratches on the Cube! Not Speedy at all!!!!"], "review": ["Speed cube but it can be disassemble easily that's the only con\n\n", "Aah ... Its a nice product. But the quality of material is not as much as i\nwish.\n\n", "After using it for 1 month now , I have found it to be a good quality rubix\ncube for Learner's. Now let's talk about it's pros and cons.  \nPros : Made of high quality and durable plastic which feels good and fast in\nhand.  \nCons : There is nothing really bad about this cube but you might get\nfrustrated while learning to solve it 😂\n\n", "I wanted to a buy 3X3 cube since long since I lost the branded cube that I\nbought one year back. When I checked same piece at a mall, I noticed that it\ncosted more than 330 per piece. That's when I saw this brand listed on amazon\nfor 160 per piece, almost 50% of the mall rate. But then I had a doubt that it\nmight not last. Honestly, this cube is much more easy to use and convenient.  \nTwo things I noticed:  \nIf you zoom in, you will see that pieces around the center piece have rounded\ncorners. This design actually helps in moving pieces faster. This feature I\ndidn't see in the mall bought.  \nAlso the plastic feels durable and still light. Few I have noticed to have\neither thick plastic, which are hard to use or ultra thin, breaking easily.  \n  \nThis is the right cube for a starter. So, go for it. Btw, I bought one more\nafter using one.\n\n", "they gave me a damaged product. the rubiks cube box was old and already opened\nand also it makes weird spring sound while rotating. got it from cloudtail.\n\n", "Excellent quality fully satisfied wit product\n\n", "Too nice and flexible to move\n\n", "Colour is different. Yellow is like light green. Feel like old one\n\n", "best performance cube a good thing such a great price\n\n", "If I could give ratings in minus then I would definitely give -5 (minus five)\nstars! I got used item! The plastic cover was already removed, when I open it\nfor the first time. I found so many scratches on the cube! Plus the cube is\nnot speedy as described! I can bat you would get a better item at the same\nprice! Going to return it.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 October 2017", "on 11 September 2017", "on 26 September 2017", "on 21 December 2017", "on 22 July 2017", "on 24 October 2017", "on 20 October 2017", "on 19 September 2017", "on 26 September 2017", "on 30 January 2017"], "reviewer": ["Amazon Customer", "Vishnu Sadanandan - Purchase Account", "Srijan Sen", "Amazon Customer", "harish", "vikas choudhary", "BALAJI D S", "Shifanath S A", "Prateek Singh Katiyar", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Excellent Product.", "One Star", "Four Stars", "Quality issue", "Five Stars", "Five Stars", "mrp 163!", "Three Stars", "A perfect Rubicks Cube", "Five Stars"], "review": ["Superb quality of plastic material,  \nEasy for speed rotation.\n\n", "\n\n", "\n\n good cube.. And this video is not of mine ,I have got it from youtube .Might\nbe useful\n\n", "Not sure whether it is a good quality as one of the cube has already broken.\nWe bought this only on 9 th August .\n\n", "Best of 3×3×3 cube...\n\n", "Very good quality,  \nSmooth working,  \nWorth for money.\n\n", "Product is good....but the price they r charging is actually higher than\nmrp.....\n\n", "Product is good but MRP on Product is less than Offer price in Amazon\n\n", "A nice and smooth Rubiks cube.  \nMoves around so easily and with so much easy.  \nLoved the cube..task#1 is done  \nNow comes the task#2 solving it😁\n\n", "\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 November 2017", "on 23 December 2017", "on 17 November 2015", "on 30 August 2017", "on 28 November 2017", "on 9 November 2017", "on 15 October 2017", "on 9 October 2017", "on 13 August 2017", "on 27 November 2017"], "reviewer": ["nit v k", "Adarsh", "Sunesh", "logu srinivasan", "Amazon Customer", "Akash", "Amazon Customer", "rashid", "Sarat Chandra Peddini", "Pramod"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Ok Product", "But bad color combination", "One Star", "Go for it", "Well according to me the cube is pretty good for the beginners to start your journey of ...", "Dont buy", "Not a 'RS Negi' product. But quality is good", "Must buy", "Five Stars"], "review": ["Quality is good and it moves smoothly.\n\n", "The cube is fast enough and unlike other cubes the color does not fade. The\nCube I recieved did not have the RS Negi text/logo.\n\n", "It's Defintly not orginal. It's smooth. But bad color combination.\n\n", "This is what you get\n\n", "Very smooth. Feels good. Stickerless. The best you can get at this price.\nBought at ₹164\n\n", "Well according to me the cube is pretty good for the beginners to start your\njourney of this mind-bending mystery of cubes.\n\n", "Bab product... Delivered item is not same the pic...\n\n", "The product I got is not a RS Negi product but a 'made in China', as the\npackage says and rs negi is written no where in the package or on the cube.\nNevertheless quality is good atleast for a beginner like me who want to try\nspeed rubic. turns and twists are smooth and don't get stuck. but I wonder how\nmany days it will last being a 'made in china' product. Its also written on\nthe box that u can make a world record with this cube. Will update again after\nsome serious usage.\n\n", "Best product in this price.  \nAt first... I had some.doubts... but after using it for two\nmonths...everythings fine... Don't waste 1000 on expensive ones...this ones\ngreat for beginners and amateurs. Smooth, glossy, noiseless..  \nGreat experience\n\n", "This is a good product and high speed\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 August 2017", "on 25 May 2017", "on 23 July 2017", "on 16 August 2017", "on 25 June 2017", "on 27 May 2017", "on 16 July 2017", "on 30 July 2016", "on 26 March 2017", "on 18 July 2017"], "reviewer": ["subhodip chakraborty", "Planet", "Beta jk", "Amazon Customer", "Pratap", "Amazon Customer", "Sandeep bhat", "sayantan sen", "Mominun", "Amazon Customer"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Used Product received", "Awesome product dillevered", "Not as expected", "But the colour is not as expected", "OK thats all", "Just ok", "BEST ONE TO BUY", "Smooth, Fast, & Durable", "So smooth", "Speed Cube with perfect movies"], "review": ["All over Scratches.\n\n", "\n\n", "Colors are completly different and the plastic is also not very good. The\nmovement is very smooth and packaging was ok. You can get better cubes at this\nprice in local market\n\n", "Great product 👍\n\n", "I have recently buy this product. it is not like the picture shown in the\npreview. the colours are slightly different and with mat finish too. not like\nglacing as shown. also small spring sounds are hearing inside the cube. apart\nfrom this, the smoothness is good.\n\n", "Very bad colour of this product and price was written 180 and Amazon was\nshowing 299\n\n", "Best Negi Cube\n\n", "RS Negi Speed Cube 3x3x3 - Smooth, Fast, & Durable  \n  \nDate : 6th November 2016  \n  \nBought on June 2015  \nWriting this review after more than 1 year of usage.  \n  \nThe product came covered in a plastic wrap, not in any box as shown in the\npicture.  \nThe cube was pre-lubricated.  \n  \nPROS  \n\\- As the name says its a real speed cube, it turns easy and fast as far as it\nis properly lubricated.  \n\\- Sticker-less, so no worries about color fading.  \n\\- Tile-less, so no worries about tiles getting off the cubes.  \n\\- Colors are so bright & vivid.  \n\\- Easy to dismantle and re-assemble.  \n\\- Easy to clean.  \n\\- Spring tension can be adjusted by taking the cap off the centre cubes,\nthough the caps never got off while cubing.  \n\\- Cubes never or very rarely got off while cubing.  \n\\- Tough & shock resistant, I have dropped it so many times, and still its as\ngood as new.  \n\\- No sharp edges.  \n\\- Good quality plastic used.  \n  \nCONS  \n\\- A bit smaller than the standard Cube, RS Negi is 55x55x55mm while standard\none is 57x57x57mm (though many say that 55 is also a standard size). Even\nthough its just 2mm per side, you can feel that when you hold it.  \n\\- Small catches & lock-ups, but in acceptable range.  \n  \nOVERALL  \n\\- Best for practising ! Best for beginners !  \n\\- Value for money speed cube, I got it for Rs.142  \n\\- I have ordered 7 more cubes for my friends, after using my first RS Negi\nSpeed Cube for around 1 week.  \n  \nIf you find my review helpful, please click YES below, that would encourage me\nto do more reviews :)  \nHappy Shopping !\n\n", "The smoothest cube at the best price\n\n", "According to the price, it's the best cube.  \n1 - Smooth  \n2 - Perfectly shaped  \n3 - no sticker, so no peeling of the colors  \n4 - easy to loose and tight it moves.  \n5 - Build qulity is good\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 January 2018", "on 28 January 2018", "on 15 September 2017", "on 15 January 2018", "on 11 July 2017", "on 16 November 2017", "on 11 January 2018", "on 18 June 2015", "on 21 December 2017", "on 30 July 2017"], "reviewer": ["Rameshwar", "OM PRAKASH MISHRA", "Shubham M.", "Vasu kukadiya", "Amazon Customer", "Ujjwal Kumar", "Amazon Customer", "KJ", "Amazon Customer", "Abhisek Mazumdar"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["RS Negi 3x3 Speed Cube - Speedy, Lightweight and Classy Speed Cube At Really Low Price !", "Bad things and GOOD THINGS about nagis cube", "* Smooth and fast *", "Poor make", "One of the best 3x3 cubes", "Speed & Smooth Cube! Great Gift for Kids", "Very good Cube but you might get a lemon", "Absolutely worth it!🔥", "Substandard Did not match the product shown .", "Worst part of not replacement"], "review": ["Hi guys, right now I'm here with a review of 'RS Negi 3x3 Stickerless Speed\nCube' .  \n  \nFirst of all, I wanna say that this cube is really an amazing one. I'm really\nliking this cube for many features which resemble the famous Chinese DaYan or\nMoYu cubes. I'll mention all those features under Pros. I'm really loving to\nplay and practise with this one.  \nBy the way, at this price, the cube is really a very good and fun stuff.  \n  \nNow, heading to the.....  \n  \n|Product Description| :-  \n  \nThis cube comes in a thin plastic wrapper only with a price and mfg tag on it.\nThis cube is made up of lightweight plastic and is very colourful and shiny.\nIt has a \"Negi's\" logo on the yellow centre piece. Well, it also comes in a\nlittle pre-lubricated condition. Its design exactly resembles the famous\nChinese 'MoYu HuaLong' cubes' stickerless versions. Not only designs, but\nthere are many more interesting features, which will be discussed next under\nPros and Cons.  \n  \nAnyways, lets get into the Pros and Cons.....  \n  \n| Pros | :-  \n  \n1) It is naturally a speed cube. If customized properly and maintained from\ntime to time, it will work at Storm speed.  \n2) The screws of center pieces are adjustable, as well as, easy to adjust.  \n3) Spring tensions of this cube is really good.  \n4) It is completely stickerless. Even no tiles. All pieces are moulded\ncolourful plastics.  \n5) Turning is quiet smooth, even without lubrication.  \n6) Interlocking technology of cubicles is pretty good, which prevents popping\nout of pieces. Also corner twisting is very rare in this cube.  \n7) It is pretty lightweight and doesn't feel like a load on fingers.  \n8) Easy to disassemble.  \n9) The edges of pieces are straight slanted which helps in corner cutting.  \n10) Price is really cheap when these features are considered.  \n  \n| Cons | :-  \n  \n1) Its not very durable. Indeed it is weak as strength of plastic is not that\ngood.  \n2) It doesn't have its original packaging. Only comes in a thin wrapper and\nthat's disappointing !  \n3) The brand logo is painted with a really cheap paint. Wears off and vanishes\nwithin a few days.  \n4) Sometimes it causes serious inaccurate moves, if there's even a little\ndecrease in speed while continuously doing some Algorithms.  \n5) It doesn't come in a good pre-lubricated condition. It is very little\nlubricated, right after unboxing from package.  \n6) This cube gets stuck/jammed sometimes.  \n7) Corner cutting is not as desired of a good speed cube.  \n  \n(#) | Additional Pro Tips | :-  \n  \ni) Apply silicone oil lubricant thoroughly throughout the cube and joints for\nmaintenance and speed. Don't forget to clean the dusts and dirt before\nlubricating.  \nii) Adjust the spring tensions from time to time.  \niii) Avoid rough usage of the cube and hence by doing all the above the\nproblems of this cube can be solved and hence it will have a long life.  \n  \nThank You, for giving your valuable time to read this long review !  \n  \nIf you find it helpful, please let me know ( by hitting the 'Helpful' Button\n), so that I'll feel glad to write other reviews to keep helping customers.\n\n", "\n\n Its really nice and fast you can go for it I HAVE SO MANY CUBES BUT THIS IS\nTHE BEST IN BUDGET nothing is bad its fast,smooth,glossy finished, AND NAGIS\nIS A GOOD AND TRUSABLE BRAND and the main thing that the logo of nagis get\nerased at very first day PLEASE SEE THE VIDEO IN MY REVIEW!!!!!!!***$\n\n", "RS Negi Speed Cube 3x3x3  \n  \n\\- Great Quality ;  \n\\- Sticker-less Cube ;  \n\\- Smooth and lubricated ;  \n\\- Value for money ;  \n\\- Easy to disassemble too , you’d need to turn the top layer at 45 degree and\ntwist one of the edge and take it out – the remaining pieces will come out\neasily. Or you can check instructions for the same on google as well.  \n\\- The colors on this cube are : White x Yellow , Orange x Red , Green x Blue\n;  \n\\- The white center piece has a logo of RS Negi on it ;  \n\\- The lubrication reduces with time and it doesn’t remain as smooth as it\nused to be in the beginning. There are lubricants available in the market ,\nbut they are expensive ;  \n\\- Delivery was quick but it doesn’t come with any instructions/manual nor a\nbox ; just wrapped in a clear plastic cover and a hologram on top.  \n  \nHope this helps . Happy Shopping !!  \n  \n~ The SilverLining Review ~\n\n", "very poor make. A piece came off on unpacking. had to glue it back. There is\nno yellow color, its fluorescent. Transitions are getting a lot of friction\n(not smooth).\n\n", "Honestly this cube is really smooth when you rotate it plus this cude is made\nup of colored plastic that means its beter than the cube which comes with the\nstickers and the colour won’t fade or tear off.  \nI really as a consumer liked this product and would even recommend people to\nbut this product if they are searching or a 3x3 cube.  \nIts a great product at a very low price point .  \nDont miss this product\n\n", "It's Speed & Amazing Cube.  \n  \nPreviously I had purchased one before for my nephew in local shop for about\n50/-. It got broken, So had to opt out for this purchased during Lighting deal\nfor about ~115 Rs. I can assure that it's complete worth the price.  \n  \n# It's fast and cube move around smoth.  \n# No cheap plastic.  \n# No Stickers around. It's stickerless.  \n# Very good for beginners.  \n  \nWord of Wisdom: There are tons of Videos out there on Youtube about How to\nsolve Rubik's cube. My nephew is 6 year old. Even though he is not able solve\nit completely sometime. It's helping me lot. Also you can check out dis-\nassemble & assemble videos. Soon I will add here, If I'm able to do it. So I\nsuggest you give this as gift for Kids. Instead of letting them to Stare TV\nall the time.  \n  \nIt's worth the price hand down, be sure checkout during deals, You might get\nit for below 100 Rs/-. I bought it with Prime account so even though it's\naround 100 Rs/- I got with free shipping.  \n  \nCheers!\n\n", "Excellent cubes..but quality issues. I ordered three. Two were fine and one\nhad two chips missing. So Amazon sent me a replacement which is fully\nscratched which I am guessing was a previous return from some other customer.\nSince it works i am not returning it again. However a bit disappointed by the\nQC checks. But for the price cant compain much. Definitely buy it without\nthinking much. Same cubes under other brand names are being sold at higher\nprices\n\n", "This cube is suitable for mid level cubers. It's very smooth and corner\ncutting is great. The only disadvantage is the distracting 'Negi' logo in the\nyellow side and the spring sound could've been reduced to some extent.(Though\nit isn't much audible)Worth every penny.\n\n", "Though I got a rubix cube but it did not match the picture at all and was a\nsubstandard product this should not happen in a online shopping environment\n\n", "Already m using the same one that good .... But ordered again for 1 friend ...\nThat's too worst already broken also from sides then also no one is ready to\nreplace or reply on this thing ... Worst part of not replacement.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 September 2016", "on 30 January 2018", "on 11 June 2016", "on 23 June 2017", "on 16 February 2018", "on 22 November 2016", "on 30 July 2017", "on 23 March 2018", "on 7 September 2015", "on 9 February 2018"], "reviewer": ["Rudra Ghosh", "Harshdeepsingh", "~ The SilverLining Review ~", "CA Milton Bain", "raghuvanshi shetty", "BekarEngineer", "A. R. N. Prasad", "Ramana Rao PUTTAPAKA ", "Rohit Mehra", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["A must buy cube", "Three Stars", "Quality Product.", "The cube broke in 1 hour of playing.", "Good.... but not as it", "Smooth and elegant.", "Awesome flexible than my older one", "⭐⭐⭐⭐", "Good", "VERY SMOOTH"], "review": ["Very smooth cube\n\n", "good but the color i have revised is different is different from the picture\nshown on amazon website\n\n", "Very smooth\n\n", "The cube broke in 1 hour of playing.\n\n", "Some scrahes are on the cube  \nSoo disappointed it  \nLogo disappear in one day of use  \nThis a really rs negi cube?????  \nDont buy..fake product\n\n", "Best you can get at this price. Completely satisfied.\n\n", "Awesome flexible than my older one ...  \nThanks Negi cubes I love it most...  \nI recommended to Plz buy this speed cube\n\n", "Price is good..  \nSmooth movement.  \nSticker less.  \n  \nI never bought any cube before this online. But this one seems awesome. Loved\nit.\n\n", "Awesome cube\n\n", "PLZZZ GUYS MUST BUY IT ....ITS MY REQUEST...VERY SMOOTH\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 October 2017", "on 10 February 2018", "on 25 September 2017", "on 30 August 2017", "on 3 June 2017", "on 16 August 2017", "on 17 June 2017", "on 11 June 2017", "on 5 September 2017", "on 6 August 2017"], "reviewer": ["PC", "Priya Tiwari", "Amazon Customer", "kunal shingla", "Ajay Singh", "vipul", "Vaibhav C.", "Vaibhav S", "Aditya", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Superb cube..", "Worth buying", "Very good cube for its price it is smooth and it ...", "Worth of money go for it. .......", "I just got it delivered today. The colours of ...", "Nice one...", "this one is pretty good. I had my doubts about this but ...", "Its smooth and average we can say because it starts ...", "Good quality cube", "Do not buy this product"], "review": ["Read the review fully so that u can get a clear cut view of this rubik\ncube...........~~~~....Superb cube at a price point of 165 ,that i got .very\ngood responsive for every fast moves and  \nturns. But the colors that i got in this cube was some what of matt finish\n..rather than the glossy one which the product image is ...Dont know how i got\nthe one with dull matt finish colour ..And finally performance is very good at\nthis price.\n\n", "Best cube in this range. I am not a cuber but I have a cube which is very\nhard. This cube is very smooth I really enjoying it.\n\n", "Very good cube for its price it is smooth and it dos not stuck at edges its a\nvery good cube for beginners\n\n", "As I expected it , colours and quality of this product is good and speed is\ngood,just go for it,worth of money\n\n", "I just got it delivered today. The colours of the cube don't match as shown in\nthe pic. The cube is smooth but seems little fragile. Decent for the price\n\n", "Moves butter smooth.. Price kind of on higher side.. And sticker less which is\ngrt\n\n", "I've had a few cubes but in this price range, this one is pretty good. I had\nmy doubts about this but it turned out to be a pleasant deal. Quite smooth,\ndoesn't have a total plastic box feel, and is quite quick. Spending 150 on a\nRubix cube doesn't get better than this.\n\n", "Its smooth and average we can say because it starts to break after few days\nwhen i try to solve it fast.\n\n", "A smooth cube... Not a fast/speed cube... Got one with some scratches... But\nit's okay... Regarding mrp written on the box itself is 269/- and not 299/-\n(which is shown here on Amazon) ...So,this is called cheating... For the cube,\n4 stars... Sticker less and good quality...\n\n", "Product I received had scratches on it. It is probably used one. Also the\ncolours are not same as on the product page. On top of that the box has a\nprinted price of ₹180, whereas the price mentioned is ₹300 and discount\noffered is 50%. Absolutely disappointed\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 July 2017", "on 15 March 2018", "on 5 June 2017", "on 27 February 2018", "on 5 January 2018", "on 28 February 2018", "on 15 September 2017", "on 20 January 2018", "on 6 October 2017", "on 2 October 2017"], "reviewer": ["Amazon Customer", "SUNIL KUMAR MITTAL", "vijay kumar", "shaik sameena", "Salil Mishra", "Amazon Customer", "moin mubarak", "Aditya Arya", "malav", "biswajeet behera"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Very fast", "Best Cube yet to be used by me..", "Four Stars", "Superb Product", "Five Stars", "Five Stars", "BEST FOR BEGINNER", "It was not a good quality and there were many scratches on it", "Five Stars", "Fun to play with"], "review": ["Cube is really good quality is impressive at this price got it yesterday and\nvery happy with it\n\n", "Very best product at this price point.\n\n", "Awsome product..its too faster than i expected\n\n", "Delivered before time, frictionless, perfect in size. I'm really happy with\nthe product ❤\n\n", "Very good quality please buy it\n\n", "Best cube for this pirce, cube is smooth\n\n", "This cube is perfect for those who want to begin learning the cube.  \n  \nIts really smooth, but once you get fast at solving it, you will realise that\ncube get stuck and hinder the speed.\n\n", "It was not a good quality and there were many scratches on it . it was 2 hand\n. it looked like its used by some one and than send for me because there were\nmany scratches on .. very bad.... i want a new one .. take this old cube back\n\n", "\n\n", "Solid bright color, not stickers.  \nNot a speed cube but good for beginners.  \nSmooth turnings.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 February 2018", "on 25 March 2018", "on 25 March 2018", "on 10 February 2018", "on 27 February 2018", "on 18 February 2018", "on 21 October 2017", "on 10 August 2017", "on 14 March 2018", "on 11 January 2018"], "reviewer": ["Sagar Ss", "Birendra kumar thakur", "abhi kumar", "Varsha", "gopal reddy", "Ketan t.", "Prabhjot S.", "Myron dacosta", "Bhanuj Saharan", "Amir Salim"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Five Stars", "Five Stars", "Best cube for pro", "Bang for the Buck!", "This Cube=AMAZING", "Five Stars", "Defective product don't buy", "Ohh ,,up to five stars only aaah? My rating is 6 str", "Good quality", "Superrrrrrr"], "review": ["Smooth and fast...good\n\n", "Good built and quality  \nNice product\n\n", "This cube can be used in a fluent way,very fast and convinent to use.\n\n", "This cube is definately bang for your bucks.  \n  \nPros:  \n*Stickerless, a big pro!  \n*Not Very fast but very good for beginners  \n*The plastic used is of good quality  \n*Has mechanism which prevents it from breaking even if you pull it with good amount of force!  \nCons:  \n*Colors could have been brighter.  \n*There's a Negi Logo on cube, so be aware of that!  \nSo that's it! Photos attached!\n\n", "The Cube is Butter Smooth...  \nPerfect for me..\n\n", "Very Good!Very Fast! Very Smooth! One of the best midrange Rubik's cube!\n\n", "Good product but defective item.\n\n", "Fantastic product\n\n", "Awesome product high build quality  \nin this range this is the best cube you get..  \ndon't wait just buy it ........\n\n", "\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 January 2018", "on 21 December 2017", "on 13 November 2017", "on 1 April 2017", "on 5 December 2017", "on 17 November 2017", "on 12 December 2017", "on 25 December 2017", "on 1 October 2017", "on 27 December 2017"], "reviewer": ["Gaurav", "Ankur", "Rama naik", "Devansh Agarwal", "HARSH SONI", "Aditya Singh", "SUNIL KUMAR", "Muhunthan", "Sheshnath Maurya", "Manoj naik"]}
]