[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["nice", "Nice cube and extremely smooth though other cubes are soft too but as ...", "Very fast", "this is really very good i have one more from different brand and it ...", "The cube is good as all the blocks remain attach at the centre ...", "Not a quality product.", "Colours are different from picture!", "Great Deal Awsome Product", "I love it!", "Five Stars"], "review": ["nice quality in this price range  \ni ahd tried too many rubix cube but this is very smooth cube\n\n", "Nice cube  \nthough other cubes are soft too  \nbut as its my first cube i liked it  \nits best for new cubers  \n  \nif you are master cubers i think you should check other cube like  \nYJ textlon  \nor  \nDYAN 5 (avalable on Flipkart is best)\n\n", "Cube is really good quality is impressive at this price got it yesterday and\nvery happy with it\n\n", "this is really very good i have one more from different brand and it is more\ncostly than this but this is far better than that one very good product\n\n", "The cube is good as all the blocks remain attach at the centre it does not get\nloosen like other Rubik's cubes, worth buying\n\n", "It was dilevered quite fast but the quality of the cube is bad! It's badly\nscratched, doesn't look new at all, infact worst thn the 2year old that we\nalready have. I think this is the reason why they slashed the price.... but i\nam😔 disappointed.\n\n", "Good quality cube but the colours are different. There's pink in place of red\nand yellow looks like radium colour.\n\n", "I am giving 4 stars to this amazing product...the panelty of 0.5 star is for\nits smaller size from what i expected and 0.5 star for its Center pieces which\nkeep on detaching every now and then, but overall the product is great, classy\nmaterial quality, high speed if you are an expert.\n\n", "Seriously !! I love it !!! i have seen many cubes , but this one is so\neconomical and easy to use .. Go for it !! u won't regret !!\n\n", "Its an awesome cube.....love to solve it .....a nice time pass and a good\nquality product\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 January 2018", "on 30 September 2015", "on 1 February 2018", "on 29 January 2017", "on 15 August 2017", "on 23 January 2017", "on 13 August 2017", "on 1 September 2016", "on 15 March 2016", "on 27 February 2018"], "reviewer": ["Javed Akhtar Ansari", ".", "Sagar Ss", "kunal", "Shabih", "Anu", "Monika Kottha", "Ravin Jangra", "Sunil Kumar K R", "Shabd Jaiswal"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["good item. worth the money spent", "Got used item! So many scratches on the Cube! Not Speedy at all!!!!", "Great toy", "Made with good quality plastic. Go for it!", "Value for money..! would recommend for Beginners...", "Not actually a speed cube...", "Do not buy this product", "One Star", "Five Stars", "I just got it delivered today. The colours of ..."], "review": ["good item. worth the money spent. the cube doesnt break easily. bought this\nfor my elder daughter but the younger baby also plays with it by throwing it\nas it is colourful.\n\n", "If I could give ratings in minus then I would definitely give -5 (minus five)\nstars! I got used item! The plastic cover was already removed, when I open it\nfor the first time. I found so many scratches on the cube! Plus the cube is\nnot speedy as described! I can bat you would get a better item at the same\nprice! Going to return it.\n\n", "My nephew loves it. Easy to use and is not sticky in comparison to earlier\nmodels I bought.\n\n", "I ordered this cube for my team members at office. It is cheap and the blocks\nmove easily. Made with good quality plastic. Go for it!\n\n", "Its a very quite Cube.. Doesn't make the noise like its Funskool version.  \nIts very smooth. The colors really pop out.. After using others ..  \ni feel very fragile in the hands.. but if you put enough force to pull the\ncorners,it might come off.. But has Value for money..!  \nI would recommend for Beginners...\n\n", "It is good at its initial stages...but after few days..it was sort of\n'jammed'..  \nNow It takes a little effort to get moved..  \nAnyway the build quality and finishing is fine with respect to its price...  \nSo if you're a beginner...GO on try it!!\n\n", "Product I received had scratches on it. It is probably used one. Also the\ncolours are not same as on the product page. On top of that the box has a\nprinted price of ₹180, whereas the price mentioned is ₹300 and discount\noffered is 50%. Absolutely disappointed\n\n", "Very bad. It was full of scratches. My kid really got disappointed. Felt it\nwas a old one.\n\n", "very nice and the plastic material is very good.\n\n", "I just got it delivered today. The colours of the cube don't match as shown in\nthe pic. The cube is smooth but seems little fragile. Decent for the price\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 December 2017", "on 30 January 2017", "on 20 August 2017", "on 31 December 2016", "on 16 May 2015", "on 14 December 2017", "on 2 October 2017", "on 9 March 2017", "on 2 March 2017", "on 5 January 2018"], "reviewer": ["Viji", "Amazon Customer", "Vishal sikka", "Vijay Sood", "Anudeep", "P9", "biswajeet behera", "Amazon Customer", "Smarty", "Salil Mishra"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Easy to use", "Great cube,, but the Logo got wiped off within 15 minutes -- still a great buy!", "Very Good Product", "Value for Money", "Good Product!", "... using this Cube for past 10 months and is perfect for a beginner to learn Rubik's cube", "seems like a robust cube", "Happy Cubing :)", "Good cube for beginners. Go for it.", "this one is pretty good. I had my doubts about this but ..."], "review": ["This rubix cube is so smooth to operate & the plastic is good. Best one for a\nbeginner.\n\n", "Very smooth. Use it a lot, as does my son. I am able to clock better speeds in\nsolving the cube. And the absence of the traditional stickers, that peel off,\nmake it look aesthetically great. However, the \"Negi\" logo on the middle\nyellow square got wiped out after about 15 minutes of usage. The absence of\nthe logo doesn't bother me too much, just love this cube!\n\n", "I've ordered 3 of these cubes, arrived as perfect. It is so smooth to handle\nand light weight. It is a good toy for adults and kids.\n\n", "At this price, it is one of best rubic's cube I came across. Very smooth\nmovements and even after few months of extensive usage, it has its smoothness\nthe same when I bought. Highly recommended for any new buyer to practice with\nthis cube. Value for money.\n\n", "It is durable and difficult to break, I have dropped it many times. It had\nlubrication fluid applied to it, but it will wear off eventually. Very\nsatisfied with the cube.\n\n", "I've been using this Cube for past 10 months and is perfect for a beginner to\nlearn Rubik's cube.  \n1\\. Smooth movement. doesn't get stuck when solving.  \n2\\. The colour of the cube hasn't faded a little bit yet even after using it\nso much.  \n3\\. No crack or sign of damage even after it fell many times so a rigid\nproduct.  \nGood to go to buy.\n\n", "I've been using it for a week, seems like a robust cube. Being a decent\nproduct, any beginner can buy it.  \nHowever, If anyone's looking for speed cubing, you may wanna consider another\nproduct. Doing finger tricks becomes hard on this. Not so smooth.\n\n", "Cube is of good quality but may not be suitable for speed cubing. Plastic\nmaterial, color is bit bright than usual cubes.  \n  \nPros:  \n1\\. Flexible Smooth movement.  \n2\\. Permanent Coloring.  \n3\\. Delivery was as expected.  \n  \nCons:  \n1\\. Spring sound could be heard.  \n2\\. Poor packing  \n  \nOver all: Satisfactory product. Worth the Money :)\n\n", "I would totally recommend it for the beginners like me. The quality of the\nplastic is superb and it works fabulously. It just doesn't cut corners like a\nspeed cube, it does cut corners really good, but not as good as a speed cube.\nOverall it is a very nice product.\n\n", "I've had a few cubes but in this price range, this one is pretty good. I had\nmy doubts about this but it turned out to be a pleasant deal. Quite smooth,\ndoesn't have a total plastic box feel, and is quite quick. Spending 150 on a\nRubix cube doesn't get better than this.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 March 2017", "on 19 September 2016", "on 24 September 2017", "on 22 January 2018", "on 9 May 2017", "on 6 October 2017", "on 13 January 2018", "on 24 September 2017", "on 18 January 2016", "on 15 September 2017"], "reviewer": ["Ssk", "JohnBhai", "SARAVANAN S", "sumit", "Shrenik Mehta", "Shriniket Acharya", "SATYA PRAKASH", "Amazon Customer", "Anmol", "moin mubarak"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Good place to start for beginners or mid-pros", "Smooth and Amazing ! A bit small though...", "Very good Cube but you might get a lemon", "Go for it", "Worst Cube", "Poor quality and not same as picture", "i am satisfied with this.", "Ok Product", "Superb cube..", "Really smooth but.... (bad colours and poor stability)"], "review": ["An excellent cube for a beginner to mid-level pro solver. Has excellent turn\nspeed and smoothness. I have tried many speed cubes and stickerless cubes\nbefore, however, they did seem a bit too large for my taste. This cube is, in\nmy opinion, is at a perfect size to performance ratio. I have fairly large\nsize hands (I'm 6ft high). Although it did take a bit of time to get used to\nthe small cube, coming from years of using large cubes, was fairly easy.  \n  \nPros :  \nSmooth turning  \nPerfect size for any size hands  \nVery little to No maintainance  \n  \nCons :  \nThe logo of the manufacturer is a bit distracting (It's on the centerpiece of\nthe white face)  \n  \nVerdict : Although there is only one major con that I can point out with the\ncube, it is fairly easy to remove the logo with a razor blade and 5 minutes of\nwork. If you are looking to getting into speed solving, or just solving in\ngeneral, this is a very good place to start off.\n\n", "It's very smooth and perfect. The colors are pleasing. The size however is a\nbit small than I thought it would be. But then again, size is always a\npersonal preference. It's stickerless and feels very durable.\n\n", "Excellent cubes..but quality issues. I ordered three. Two were fine and one\nhad two chips missing. So Amazon sent me a replacement which is fully\nscratched which I am guessing was a previous return from some other customer.\nSince it works i am not returning it again. However a bit disappointed by the\nQC checks. But for the price cant compain much. Definitely buy it without\nthinking much. Same cubes under other brand names are being sold at higher\nprices\n\n", "Very smooth. Feels good. Stickerless. The best you can get at this price.\nBought at ₹164\n\n", "Starting from packaging, Amazon page in awesome way. a small box with plastic\npacking. But this cube, at any cost please don't buy this cube. A mere waste\nof money and it is very very loose. Just turn it a bit and lo, it breaks...  \nCan't play Even for 15 minutes. From image it may look awesome, but when you\nexperience after opening, sure to get angry.\n\n", "Poor quality. I bought this after seeing the tag of 'Amazon's Choice', however\nthe cube delivered isn't the same as the picture given. The cube has flashy\ncolors, loosely bound and makes spring sound. The movement is not at all\nsmooth and i really wonder why so many people have given good ratings. The\nlogo got wiped out in a day. I don't suggest anyone to buy this.\n\n", "i loved this cube, speed is very good and finally i am satisfied with this.  \n  \nif you are cube lover so i want to tell you try this out you will get\nfantastic experience.\n\n", "The cube is fast enough and unlike other cubes the color does not fade. The\nCube I recieved did not have the RS Negi text/logo.\n\n", "Read the review fully so that u can get a clear cut view of this rubik\ncube...........~~~~....Superb cube at a price point of 165 ,that i got .very\ngood responsive for every fast moves and  \nturns. But the colors that i got in this cube was some what of matt finish\n..rather than the glossy one which the product image is ...Dont know how i got\nthe one with dull matt finish colour ..And finally performance is very good at\nthis price.\n\n", "Really smooth but it comes at a price.  \nPros  \nSmooth  \nStickerlss  \nCheap(low cost)  \nLight weight  \nCons  \nFluorescent colours used(not as the picture shown)  \nLow stability...  \nIt feels clumsy and everything wiggles\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 January 2018", "on 25 September 2016", "on 30 July 2017", "on 25 June 2017", "on 22 October 2016", "on 18 January 2018", "on 1 January 2018", "on 25 May 2017", "on 30 July 2017", "on 11 October 2017"], "reviewer": ["Manohar Maddineni", "True Reviewer", "A. R. N. Prasad", "Pratap", "Manish Holla", "New Customer.", "@", "Planet", "Amazon Customer", "Abin"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Good product, good services", "Not Too Good", "Love the bright colors and smoothness", "Received a used product!!", "nice product  but small", "defective product received !", "Over a year and still rocking!!!!!!!", "Got used product", "WOW", "Absolutely worth it!🔥"], "review": ["Good product, good services\n\n", "Item is not up to the mark and the description is mere a deception.  \nHave bought far better item than this earlier.  \nIt is too loose and thats why it speeds.  \nI had definitely returned the item but couldn't felt to hassle for Rs. 150\nonly.  \nOver all, bad experience with a not good item.\n\n", "Very speedy, very smooth.  \nJust that I found it little small for my hands.  \nIt has beautiful bright colors and I'm loving it to the core.  \nGo for it.\n\n", "Received it full of scratches though it was in packing box but no lamination.\nSeems to be a used product.\n\n", "Loving the product.fast and flexible.  \n  \nU will think that size is small but may be it is standard size.  \n  \nValue of money  \n  \nImpossible for beginner to make it again as it is packed.  \n  \nQuality is good and colors are descent.\n\n", "the cube i received was very loose ..pieces are poping out ..! cant even play\nwith it !!  \ni purchased this product previously that was awesome, was very smooth..! then\ni decided to buy it again but this time it was a defective piece ..!! and the\nbrand name is also very light. i thinkl it was previously used ! i applied for\na replacement ,,lets see what happen !!  \nnever expected this with amazon !!  \nhope replacement will be as soon as possible !\n\n", "Magnificent piece of art.I have an old original rubik's cube(basic version)\nwhich comes nowhere near to this product..the rubik's cube broke on a single\ndrop while this is still in one piece with very fine scratches.  \ncoming to the speed of the cube.........its a beast,works so well without\nlubricant.  \ndoes not pop even at very high speed.  \nP.S- Use the keyhole method to solve faster.\n\n", "I got used product. But not returned because it will waste the time\n\n", "wow, it is really nice, very smooth, at first it feels slight slow but as you\nplay it is will be very fast. I am using this since 1 month having no problem.\nvery good cube.\n\n", "This cube is suitable for mid level cubers. It's very smooth and corner\ncutting is great. The only disadvantage is the distracting 'Negi' logo in the\nyellow side and the spring sound could've been reduced to some extent.(Though\nit isn't much audible)Worth every penny.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 March 2017", "on 26 August 2016", "on 16 June 2017", "on 10 December 2016", "on 4 September 2016", "on 19 August 2016", "on 21 March 2016", "on 31 July 2017", "on 15 December 2016", "on 23 March 2018"], "reviewer": ["Vijo Thomas", "Amandeep Rana", "Akshaya Verma", "Ashu Sachdeva", "Amazon Customer", "Tejus", "Saumya Ranjan Jena", "Ronit", "Jay", "Ramana Rao PUTTAPAKA "]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Was better before, new ones are of poor build quality.", "Trust me great for one n only beginners", "Sturdy, smooth movement", "Nice and smooth, definitely recommend.", "Quality is best. Very very smooth and very attractive", "Good product", "Good product for quick break and leisure", "Awesome flexible than my older one", "Good job, RS Negi", "One of the Better cubes out there"], "review": ["Original Review: Five stars. Excellent quality!  \n  \nUpdated: 1st April, 2017.  \nThe quality has deteriorated since my original purchase an year back. The new\nones I ordered had all sort of scratches and was of poor build quality, felt\nlike used.\n\n", "Cube quality good but bit cheap plastic. If you are beginner go for it but if\nyou know how to solve and already you can solve less than 90 secs then don't\neven think of it.  \nPros:  \n1)Smooth  \n2)Bright colors  \n3) feels good to rotate because of it's spring quality  \n4)Easy to carry in pocket  \n  \nCONS:  \n1)Pops 1 out of 5 times  \n2)Middle piece is quite loose  \n  \nOverall quite good. Obviously don't expect too much in this low price.\n\n", "Sturdy, smooth movement. Just that the colors are not very distinct. They blur\ninto each other in low light.. Otherwise a good product\n\n", "Very nice product, steady. It's not a speed cube so motion is not fast as\ncompared to a speed cube but cube motion is quite smooth as compared to others\nat this price range\n\n", "Quality is best. Very very smooth and very attractive. I can solve it within 3\nmin (according to my practice). However, it is a very smooth and cost\neffective speed cube. I suggest to buy, because it really have quality. Yes,\nit performs all moves possible that you see in youtube.\n\n", "Feels smooth and comfortable while turning the cubes. And is well finished.\nHope it stays that way over time and doesn't become too loose and wobbly over\ntime.\n\n", "Good product for quick break and leisure. Using it for some months now, I\nthink after 4 - 5 I started to hear the springs crank inside, so put some\nmachine oil in between the cube lines and now it moved more efficiently than\never before\n\n", "Awesome flexible than my older one ...  \nThanks Negi cubes I love it most...  \nI recommended to Plz buy this speed cube\n\n", "My 12 year old loves this. He has been solving the cube for an year and with\nthis, he has got his first taste of speed cubing. Now he can solve in 40\nseconds regularly and he can move his cube faster than my eyes can follow.\nGood job, RS Negi!! And yes, Awesome Price, until I can afford to spend 1000\nRs for the imported speed cubes!\n\n", "One of the better speed cubes I've owned. It does gets loosened up with time.\nHowever, considering the price, I'd definitely give it a huge thumbs up if\nyou're looking for a speed cube to buy.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 June 2016", "on 10 June 2016", "on 1 February 2018", "on 2 March 2017", "on 18 October 2017", "on 3 February 2018", "on 29 December 2017", "on 17 June 2017", "on 16 December 2015", "on 21 August 2016"], "reviewer": ["JK", "Subhajit Ghosh", "AG", "Pankaj Kumar Jha", "Kushagra singh", "Devashis Basu", "Amazon Customer", "Vaibhav C.", "Sameer", "Syed Bilal Ahmar"]},
{"rating": ["3.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Three Stars", "Wrong product", "One of the best 3x3 cubes", "Delayed Delivery for a great product.", "Best and must buy.", "This product is great and also a fast moving cube", "Value for money", "Defective product don't buy", "Good quality cube", "Speed Cube with perfect movies"], "review": ["had few scratches when delivered  \nbut the cube is smooth and very solid\n\n", "The product is not as per image  \nThere color supposed to be orange is seen as brown  \nDoesn't rotate freely  \n  \nFirst time Amazon given me a wrong product... But appreciate the return policy\n\n", "Honestly this cube is really smooth when you rotate it plus this cude is made\nup of colored plastic that means its beter than the cube which comes with the\nstickers and the colour won’t fade or tear off.  \nI really as a consumer liked this product and would even recommend people to\nbut this product if they are searching or a 3x3 cube.  \nIts a great product at a very low price point .  \nDont miss this product\n\n", "My son is happy with this product. Nice. No stickers. I like the quality.\nEnables speedy operation and function.  \n  \nIt took almost 25 days for me to get the product. When I called up Amazon, for\nthe delay. Then the order was pushed towards me. I hated the service. But I\nlike the product quality.  \n  \nGreat product but, very very poor slow delivery.\n\n", "Very nice and quality product. Similar to Rubik's cube and that too at half\nthe price. Highly recommended. If you are thinking to buy a cube , then go for\nthis.\n\n", "Hey everyone! I bought this 3 by 3 a couple of months ago for my daughter who\nis 11. She enjoys cubing a lot. As per as her review about this item she says\nthat this cube is not for cubers. It is suitable for beginners and so that s\nwhy she liked the cube a lot when she was a beginner. Talking about the\nsmoothness the cube is good but it is often frequent to lockups and unwanted\ncorner twists. Also the product as the image above was not delivered to me\n\n", "This is better than the cheap ones you get near the tourist places, that is\nabout it. This cube is good if you like to practice and all. With this cube\nyou can never break into sub 90 second mark. Hope this helps.\n\n", "Good product but defective item.\n\n", "A smooth cube... Not a fast/speed cube... Got one with some scratches... But\nit's okay... Regarding mrp written on the box itself is 269/- and not 299/-\n(which is shown here on Amazon) ...So,this is called cheating... For the cube,\n4 stars... Sticker less and good quality...\n\n", "According to the price, it's the best cube.  \n1 - Smooth  \n2 - Perfectly shaped  \n3 - no sticker, so no peeling of the colors  \n4 - easy to loose and tight it moves.  \n5 - Build qulity is good\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 March 2017", "on 27 April 2017", "on 16 February 2018", "on 17 November 2015", "on 16 November 2017", "on 29 November 2017", "on 15 April 2017", "on 12 December 2017", "on 6 October 2017", "on 30 July 2017"], "reviewer": ["Rohit R.", "Arun Kumar", "raghuvanshi shetty", "Paalvannan", "Atishay Gangwal", "Amazon Customer", "Cnu", "SUNIL KUMAR", "malav", "Abhisek Mazumdar"]},
{"rating": ["3.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["not a good speed cube but okay for beginners", "Not as described but it is smooth", "Quality product", "Good but came in differnt colour....", "Happy Camper!", "One of the best cube you can get in the market", "One Star", "Definitely not worthy", "Quite impressive... But not a SPEED CUBE...", "A well balanced budget speed cube."], "review": ["its okay for its price. however, its core wears out after about a month and\nyou have to supergluew the screws in.not a good speed cube but okay for\nbeginners. DO NOT DISMANTLE!!!!!\n\n", "Product is same as local market product..Not as described ...And it is not rs\nnegi speed cube ...hand pack with cheap plastic wrapper with cellotape...But\nit is smooth ...I solved 4 times and it is moving smoothly...Main con is built\nplastic is cheap and light...Many pre scratches\n\n", "Quality product at reasonable prices, yellow colour is little different than\nyellow, otherwise everything else is fine\n\n", "Feels smooth and is really amazingly flexible....  \nVery good built quality....  \n4 stars bcoz the product did not come in the same color as shown in the\npicture.... it is some what fluroscent colored\n\n", "Very good value for money. Silky smooth movement - for the price of course.\nYou can obviously buy higher quality cubes for a higher price.\n\n", "Never expected the cube would be this amazing. Really smooth. Really bright\ncolors, and since they are non-stickers, no worries that they will come off.\nFell in love with it just after the first use.\n\n", "This is what you get\n\n", "It was a disappointment. Forget about a smooth cube, it looks nothing like the\npicture and is extremely cringe-worthy while rotating any degree. Please\nverify such products before selling.\n\n", "At this price point I think it is the best product which u can get... If u r a\nbeginner then it is more than what u need, but for intermediate & advanced\ncubers such a price of s***... I got it, rapped up with just a plastic,where\nthe product no from the company(Negi)WAS given, was not that one what was\nshowing with the negi lebel, actually that was the previous design\nmanufacturered in 2015, but from 2016 onwards they changed the packaging...  \n  \nOverall u will get nice stickersless lubricated cube with bright colors..\n\n", "Cube is smooth and can be used for speed cubing, rotations and turns are\nsmooth, make some spring like noise while turning but they are not that loud\nso works for me.  \nThe only reason I am giving 3 stars because product has many scratches when I\ngot it, does not give the feeling of brand new piece as if it was used\nalready.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 June 2016", "on 10 May 2017", "on 10 October 2017", "on 9 March 2017", "on 15 May 2017", "on 14 August 2017", "on 16 August 2017", "on 31 October 2017", "on 8 December 2016", "on 3 January 2018"], "reviewer": ["BV", "RITAM", "Ngoisao", "RAJ KUMAR HASRH", "desiviking", "Deepak", "Amazon Customer", "Amazon Customer", "KUNAL MALAKAR", "Sumit Madaan"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best in this price segment !", "A cube with slightly faded colors that seems like a good cube for the price at first glance", "Great price, great product", "Best value for money", "Brought this product many times. This time received different ...", "good quality, joints and plastic. Not flimsy", "Review after 3 years.", "Good, at this price range.", "Really very good product. One can purchase it with no doubt", "Amazing product."], "review": ["The delivery was very late but when the product came I was amazed by it's\nquality !  \nNo doubt it's very fast and moves smoothly don't see the negative comment this\nproduct is good and you won't be disappointed by the cube !  \nGo for it don't stay in doubt !!\n\n", "A cube with slightly faded colors that seems like a good cube for the price at\nfirst glance. It turns smoothly and the color are easy to recognize in low\nlight. However,the pieces pop out very easily and the cube if very fragile.\nDropping it will shatter it. Would not recommend.\n\n", "I've had this for more than a week or two and let me tell you, it's been a\nvery pleasant experience. It's smooth, it buttery, and hardly gets stuck. And\noh, if you're bothered by that Begins logo at the centre of the cube, don't\nworry, it'll fade off in no time. But the colors? Nope, they won't fade at\nall.  \n  \nIt's a really good quality cube and would definitely recommend it to you. I\nalso bought one for my brother. He absolutely loves it.\n\n", "superb. damn cool. previously i got one from road side vendor - compared to\nthat this is superior. My kid likes it and of course, me too :-)  \nThere are superior items (more better that this one) available in market. But\nthat is at premium cost. THis one is super value for money.  \nIf you have plans to buy one and looking at value for money - go for it. Check\nfor any upcoming deals.\n\n", "Brought this product many times. This time received different product, it's\nnot the same magic cube others received and have reviewed with pictures.\nSmooth but colours on the cube ruined it for me this time.\n\n", "good quality of plastic  \ndurable joints (unlike most other cubes which come undone)  \nmuch better than any stickered cube or commonly available models which are\nflimsy and dont last long  \n  \nhope you find this review helpful\n\n", "I'm writing this review after 3 years from purchasing this cube. This is\nsuperb quality cube. Made of good material. I dropped it from first floor but\nit didn't break. 👍👍👍\n\n", "1\\. Colours are not as bright as shown in the picture. The orange and green\nespecially are very light and much similar, making it little difficult to find\nthe cubes.  \n2\\. Corner cutting is great at this price range, cube is smooth and easy to\nrotate.  \n3\\. some minor spring noise occurs very often, but, i think it will go away\nwith some lube.\n\n", "Really very good product. One can purchase it with no doubt. Easy and smooth\nmovement. Only thing is that I feel it could have a better price. I purchased\nat Rs 180/- and I think it is costly.  \n  \nPlease don't forget to mark my comment HELPFULL, if you find so. Otherwise\npeople like me will not find any relevance to spare time to convey the\nfeedback sech a way for nothing.\n\n", "Amazing product...... Provided if Negi's logo is printed on it......  \nIt's the best product in its range... and even much better then other rubic's\ncube.... Thankyou negi\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 August 2017", "on 4 June 2017", "on 4 October 2016", "on 26 January 2018", "on 16 March 2017", "on 23 March 2017", "on 20 December 2017", "on 29 December 2017", "on 11 March 2018", "on 15 August 2017"], "reviewer": ["Anurag", "MEB", "kartabya", "Venkatesh R", "Sachin Patil", "Oldtimer", "Sanjay Uchcharia", "Mayur", "Dipankar Dey", "$@k€£"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Very good cube for its price it is smooth and it ...", "Don't think, just Go for it!", "Mast kadak saman hai miyya", "Good Product.", "Satisfied", "It is becoming better day by day", "Best cube i've had ever played with.....", "Unmatched quality, unbeatable price.", "BEST FOR BEGINNER", "OK"], "review": ["Very good cube for its price it is smooth and it dos not stuck at edges its a\nvery good cube for beginners\n\n", "Best cube at this price. Don't think just go for it. Whole cube have a kind of\nmate finish. Feels smooth. Enjoying this cube a lot. Recommended to every\nbeginners.\n\n", "Mast gotiya ghumti re bawa  \nMe ammi ko diya me  \nMast ghumati rehti o deen bhar  \nBole to saman B mast kadak hai bhai\n\n", "Item is good but the pieces feel very loose. Maybe they did that on purpose to\ngive smooth rotation movement but am not sure. Will know only after it is used\nfor couple of months. Else it does the job for what it is meant for\n\n", "Nice and quality product.  \nThe cube is very good in quality, but if you are looking for speed cubes they\ndont come at this price.  \nYou can speed it up too by loosening the screw.  \nOverall nice product.  \nThe packaging was little broken due to transport but nothing happened to the\ncube.\n\n", "i gave one star because it was not turning well and sometime stucks now after\ncontinues turning it become super smooth and it become a speedcube\n\n", "I had bought this cube last year but I gave it to my elder brother. I've again\nbought this since it is a good cube.The colours are bright and vivid. The size\nis decent and the smoothness of rotation is inexplicible. I've also used cubes\nfrom funskool and other such brands but it is the best in its price range. The\ncolors of both the cubes have not faded since their first usage in last year's\nAugust. All and all, I love this cube.\n\n", "This is cheap and best. Layers moves very quick and smooth. Good for speed\ncubers, I'm just the beginner. Sticker less makes it confident for rough use.\nOnly one con that it feels little small in hands. Other than that it's a great\nbuy.\n\n", "This cube is perfect for those who want to begin learning the cube.  \n  \nIts really smooth, but once you get fast at solving it, you will realise that\ncube get stuck and hinder the speed.\n\n", "got it with some scratches, but too lazy to ask for replacement, quality is\naverage, i don't think this is really for speed cubers though, ok for time\npass\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 June 2017", "on 28 January 2018", "on 28 August 2017", "on 25 October 2016", "on 26 July 2015", "on 11 January 2018", "on 2 April 2016", "on 16 August 2015", "on 21 October 2017", "on 17 April 2017"], "reviewer": ["vijay kumar", "vikas agrawal", "Karan yadav (yadav ji)", "Suresh Rao", "Naresh D Bhadresha", "AJ", "Ankit nishant", "Jitendra Goswami", "Prabhjot S.", "Muzammil"]}
]