[
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["It works", "VALUE FOR MONEY 💰-3 *, Transfer Rate is Slow.", "**THE BEST PENDRIVE YOU CAN GET FOR THIS PRICE**ISSE ACCHI PENDRIVE ITNE PRICE ME NAHI MILEGI, ISLIYE KHARIDLO**2017 REVIEW**", "BEST 16 GB PENDRIVE OFFERED FROM SANDISK...", "\"NOW, YOUR FAVOURITE FILES, IN YOUR POCKET.\"", "Does it's job well!", "Only 14 GB... Product received at time ...", "It's the best pendrive available in market", "SANDISK CRUZER BLADE 16 GB PENDRIVE REVIEW", "You get what you pay for..."], "review": ["THE GOOD: Reliable brand, acceptable read speeds averaging at 32MB/s\n(considering it's USB2), stability check passes with no errors (see attached\nscreenshot), have another 8GB cruzerblade that's been used for like 2 whole\nyears and it still performs as new- hope this will turn out to be as durable.  \n  \nTHE BAD: Slow write speed. The device writes at 4 to 6 MB/s maximum (using a\nWindows 10 laptop with i7 5500U CPU, Nvidia GTX 940M GPU, and 16GB RAM, with\nthe drive plugged in a USB 3 port). The drive tends to heat up during\noperation which my older cruzerblade doesn't. The older 8GB cruzerblade stays\ncool even when used constantly for moving data (hours at a time), but this new\ndrive heats up within 10 minutes of ANY read/write operation using the same\npair of computers. The good news (I guess) is that I have an HP w220v flash\ndrive and that heats up as well- it's been heating up for like 4 years, and it\nstill works- heat will probably not damage the device (unless it's heating\nlike a stove,, which it isn't).  \n  \nTHE UGLY: The seller called me and asked me to cancel the order, claiming his\nwarehouse has burned down and if he cancels the order on his own he will be\n\"fined\" by Amazon for not fulfilling his commitment. This is very weird- I've\nbeen shopping online for years and no seller has ever called me up. I called\nAmazon to check, Amazon customer care asked me not to cancel the order. I did\nnot cancel and the product was eventually delivered (before promised date).\nThis was an unique incident, and the chances of this repeating with your order\nis infinitesimally small.  \n  \nUSABLE CAPACITY: 14.5 GB  \n  \nBOTTOM LINE: At this price, you cannot lose. Even if it goes bad, SanDisk is a\ngenuine brand and it comes with a 5 years warranty- you can always call up\nSanDisk and request assistance. Go for it.\n\n", "Hi Everyone, Today i am gonna review  \nSandisk Cruzer Blade 16gb , Purchased on 10th August,2017 AT 349INR.  \nI TESTED it properly Here is my Full Review.  \n  \nBuild Quality of this product : 2.5 * out of 5. ( Plastic Port is too thin)  \n  \nQuality of the Product : 3* out of 5.  \n  \nTransfer Rate : 3* out of 5. ( 4-5 mb/ps)  \n  \nValue for money : 4* out of 5.(cheapest in 16gb categories)  \n  \nADVANTAGES :  \n  \nI gave 4* for Value for money. Because  \n  \n1- It is around 350 rupees in 16 gb..may be the cheapest.  \n  \n2- 5 years warranty / Garente .  \n  \n3- Light weight. Easy to carry.  \n  \n4- No heating Issues.  \n  \nProblem of this Product / Suggestions if you already brought it :  \n  \n1- Transfer rate is average . Starting with 40 mb/ps to it reduce to 3.5mb/ps.\nAnd the average is 4-5mb/ps. Which is little slow.  \n  \n2- You have to be careful always because the port build quality is very very\nthin. It may break with little force also. use wisely.  \n  \n3- Not suitable For heavy users. Those who always use for heavy transfer ,\nsorry this pendrive is not for you. Especially college guys. Try HP 16gb .  \n  \n4- you have to keep it carefully ,if you will get a crack on this your\nwarranty will not be accepted. Too thin .  \n  \n5- Use Only for minimum purposes .just like for print out a document. Or some\ne books.  \nSo for Office Purpose its okey. Students are heavy users .They always transfer\nGames, Movies etc etc. so Big no for them. Spend a little more and get Hp one,\nyou will get more transfer speed...you will be happy. But for Office use or\nminimum users this product is best at this price.  \n  \nOverall My Rating is 3*. It could have been more good if the transfer rate\nwould be little higher. 4-5 mb/ps speed is not good at all. Just an average.  \n  \nThanks guys for Reading my Reveiw .Have a beautiful day ahead. Jai 🇮🇳.\n\n", "As mentioned in the title, this SanDisk pendrive is the best what you can buy.\nToh Isliye, Agar Sabse Kaam Daam Me Sabse Badiya Chiz Chahiye, Toh Ye Sandiak\nKi Pendrive Lelo.\n\n", "This pendrive just got an amazing ability of transferring the data at a very\nhigh speed. It is the most affordable and also premium pendrive under the\nrange of 400 with 16 gb internal storage out of which you get about 14-15 gb.\nIt gives a haptic feedback to me and also it is offered from SanDisk the most\ntrusted company. It is compatible with Windows 10 also which is an amazing\nthing. It is very small so you can carry it in your short pocket. It also\ncomes with 2 years warranty so you don't have to worry about it. Below is a\nbrief description about it so that you can get it better.  \n  \nDescription :-  \nProduct description The SanDisk 16GB Cruzer Blade USB Flash Drive from SanDisk\nis a compact, portable USB flash drive. It allows you to carry and transfer\nfiles on the go like photos, videos or music files to share with family and\nfriends. Easily share files between computers with this convenient USB flash\ndrive. From the Manufacturer Generous Capacity with Compact and Upscale Design\nSanDisk Cruzer Blade 16GB USB 2.0 flash drive boasts a classy compact design\nfeaturing a large data storage capacity. Now you can conveniently backup,\ntransfer, share and carry your favourite media like movies, music, video clips\nor pictures with you everywhere you go. The pocket-size design of the SanDisk\n16GB pendrive facilitates easy and comfortable portability letting you carry\nyour personal data with you to school or work, while its built-in SanDisk\nSecure Access software keeps any unauthorised access of your personal data at\nbay by enabling you to store your files in a password-protected folder.\nSanDisk Cruzer Blade is an excellent choice for users looking for a storage\noption to carry their important data with them even while on the move. Just\nDrag-and-Drop to Backup Your Data We all love to carry our stuff with us\neverywhere we go. From our favourite music to an important office\npresentation, portability of data is a necessity in today's fast-moving world.\nWith the SanDisk Cruzer Blade Flash Drive, transferring data onto it is a\nbreeze. The SanDisk 16GB flash drive comes with a simple Drag-and-Drop\nfeature, which lets you drag-and-drop files into your drive conveniently after\nplugging it into the USB port of your laptop or desktop. After a quick, one-\ntime driver download, you can easily store, share and transfer your personal\ndata in a flash. Capacity: 16GB Interface: USB v2.0 Security: Password\nprotected folder, 128-bit AES Encryption Warranty: 2 years  \n  \nSo this is my review for this hope this will help you in purchasing it. If it\nhelped please vote this review helpful.\n\n", "≧◉◡◉≦ Hello ≧◉◡◉≦  \n  \n• INTRODUCTION •  \n  \nI purchased this product a week ago. The delivery service and the seller's\nservice do deserve special compliments. This works perfectly and awesomely.\nThis one really is a great product. Especially when having a price tag of\n₹285.00. Through my constant experiments on this “SanDisk Cruzer Blade\nSDCZ50-016G-135 16GB USB 2.0 Pen Drive”, I had came to some inferences. I'm\nsharing that info with you all through this review.  \nI'm expressing my views about this product point-by-point and will try my best\nto shorten it. So that, you could grasp the idea in it simply and easily.  \n“All the views expressed in this review are solely my own.”  \n  \n• PROS •  \n  \n√. Cool, stylish and compact design.  \n√. Very handy.  \n√. Less weight (9 grams).  \n√. Dimension [size] is perfect (5.6 x 3.6 x 1 cm).  \n√. Will fit in your pockets.  \n√. So comfortable to use.  \n√. The Black & Red combination is very cool.  \n√. Back up, sharing and transferring files is now in your hands.  \n√. Now you can carry your essentials, wherever you go.  \n√. Made up of plastic material.  \n√. Shows enough speed as expected (USB v2.0).  \n√. Easy to share files between computers, laptops, etc.  \n√. Also, you are able to share the files with your tablets or smartphones,\nwith the support of an otg adapter.  \n√. Comes up with a built-in SanDisk Secure Access software.  \n√. This product has 5 years manufacturer warranty.  \n√. Worth every penny, you spend to buy it.  \n  \n• CONS •  \n  \nx. No light indicators.  \nx. Continues use of about 10 minutes or more will start to produce heat in it.  \nx. Connector is made up of plastic material (careless use may broke it), not\nmade of metal.  \nx. This only comes with a USB v2.0 interface.  \n  \n• VERDICT •  \n  \nThis product is so cool & comfy to use. The colour combination is the one\nthat, highly attracted me. I really appreciate SanDisk for introducing the\nbuilt-in security application in their pendrive(s). The size, shape, design\namd all such things needs special compliments. All the PROS makes this small\none a big one.  \nNow saying about the CONS; don't expect a 'notification light' feature, for\nthis price tag. The connector part (plastic material) may broke, if it is used\ncarelessly. So, give care to that thing. This product is with USB v2.0\ninterface, which is getting outdated. Technology has gone a long way, and so\nSanDisk too. So, now pendrives with higher interface is available. If you need\nhigh speed, I would probably suggest you to go for higher interfaces (such USB\nv3.0 or USB v3.1). The one that I hated the most, in this item is the 'heating\nproblem' in it. I think, SanDisk might have forgotten to focus on that aspect.\nAnd also, I hope that, SanDisk will fix a ‘band-aid’ to that problem in the\nfuture.  \nExcept the CONS, the product is one big piece of mass. I personally like this\nproduct a lot. This product is just enough, to satisfy your needs to store\nyour essential files.  \n  \n※※※※※※※※※※※※※※※※※※※※※※※※※※※※※  \nPlease review the images for more info  \n※※※※※※※※※※※※※※※※※※※※※※※※※※※※※  \n  \n≧◠◡◠≦ I HOPE YOU FOUND MY REVIEW HELPFUL. IF \"YES\", KINDLY HIT THAT YES BUTTON\n≧◠◡◠≦  \n  \n≧°◡°≦ IF YOU HAVE ANY DOUBTS OR QUESTIONS, PLEASE FEEL FREE TO CONTACT ME (MY\nCONTACT INFORMATIONS ARE GIVEN IN MY PROFILE) ≧°◡°≦  \n  \n≧^◡^≦ HAVE A GREAT DAY ≧^◡^≦\n\n", "SanDisk Cruzer Blade 16 GB USB 2.0 Pen Drive : Does it's job well!  \n  \nWriting this review after 1.5 years of usage. I also have a 8 GB Cruzer Blade\nwhich I have been using since years.  \nData Transfer Speed is as below,  \nRead Speed:20-22 MB/sec  \nWrite Speed:8-9 MB/sec  \n  \nPROS  \n-Reliable, no loss of data so far.  \n-Stylish & ergonomic design, which helps in gripping the pendrive while inserting into or removing from the usb port.  \n-Pocket friendly, weightless & small in size.  \n-Comes with Sandisk Secure Access software inbuilt.  \n-Economical compared to other brands.  \n-No cap, so actually no worries about losing it.  \n-Best suited for using in music systems or TVs.  \n-Full HD videos works flawlessly while using in TV.  \n-All plastic body, doesn't get heated as fast as metal ones.  \n-Hole is provided, so that you can attach your pendrive to the keyring or string.  \n  \nCONS  \n-Data writing speed is too slow.  \n-The end connector is highly prone to break, as its plastic, I have seen many Cruzer Blades broken like that.  \n-Not good for quick file transfers.  \n-Not for rough use, unlike metal ones.  \n-No light for data transfer indication, which is not really important for me though.  \n-Not recommended for making bootable drives.  \n  \nOVERVIEW  \n-If you are not looking for a high performance pendrive, instead a budget one, which is reliable and robust enough, especially for the data storage purpose with only intermittent data transfers, just go for Sandisk.  \n  \nHappy Shopping :)\n\n", "Only 14 GB...  \nProduct received at time.  \nNot for windows 10.\n\n", "I purchase it online. It's the best pendrive available in market.  \n  \nFeature are follows:  \n  \nCapacity 16 GB  \n  \nRead write speed 17MB/sec, 4.4MB /sec.  \n  \nUSB 2.0  \n  \nWeight around 2.5grams.  \n  \nPlastic body.  \n  \nGood read write speed, it's help me tansfering files to other device so fast.  \n  \nIt is very portable while carring from one place to another. Small and compact\nin size.  \n  \nI like this pendrive because it is the value for money.  \n  \nNice other pendrive offers you such features at this cost.  \n  \nAnd the SanDisk brand also one of the know brand in the market. Also warranty\nfor this product.  \n  \nI will rate 5star to this pendrive for features, service, support and easy of\nuse.  \n  \nThank you\n\n", "HEY BEFORE WRITNG THE REVIEW LET ME TELL YOU ALL THAT I GOT THIS PRODUCT\nAROUND A WEEK AGO.SO THIS IS AN HONEST REVIEW.THIS PEN DRIVE SOLD BY CLOUDTAIL\nINDIA IS TOTALLY AMZING.THIS THING HAS A NICE AND SLEAK DESIGN AND YOU CAN USE\nIT FOR AROUND 6HOURS OF COMPLETE WORK.THIS THING IS ALSO AT A N AFFORDABLE\nPRICE,NOT TOO CHEAP NEITHER TOO EXPENSIVE.BUT IF YOU COMPARE IT WITH ALL OTHER\nPENDRIVES THIS ONE IS THE CHEAPEST AND IS BETTER THAN THEM ALL.  \n================================================================================================================IF\nYOU WANT TO BUY THIS PRODUCT I HAVE GIVEN THE LINK SO GO CHECK IT OUT.IF YOU\nARE STILL THINKING OF BUYING THIS PRODUCT OR NOT,THAN YOU ARE COMPLETELY\nWASTING YOUR TIME.GUYS GO FOR IT.IT WILL GIVE YOU A BETTER EXPERIENCE.  \n================================================================================================================ONE\nLAST THING,THIS PENDRIVE IS ALIKE OTHER PENDRIVES THAT GETS HOT AFTER A FEW\nUSE OF HOURS.THIS THING CAN BE USED FOR AROUND 6 HOURS WITHOUT ANY SUCH\nPROBLEMS.  \n================================================================================================================YOUR\nHONEST REVIEWER,  \nJAI\n\n", "The read and write speeds are quite average but we get to use only 14.3 GB of\nthe allotted 16 Gb,  \nThe flash drive is relatively small in size and quite handy to carry around\nbut the Kingston Data Traveler with a ring at one end to club it with a key\nchain makes more sense.  \nSandisk Cruzer Blade out of the box is formatted with FAT32 partition so\nunless you have devices that accept only FAT32, it is better to convert it to\nNTFS to ensure better speeds.  \nSince it is the basic version of SanDisk, it works well within it's price\nrange, but if performance is what you want, go for Ultra or above.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 March 2018", "on 22 August 2017", "on 31 May 2017", "on 23 January 2018", "on 21 August 2016", "on 9 August 2017", "on 15 March 2018", "on 11 February 2018", "on 13 August 2017", "on 17 October 2017"], "reviewer": ["oxymoron", "Genuine Review✔️", "Pavan", "Himanshu K.", "GOVIND", "KJ", "Jennevive", "Reetika Regotra", "jai", "Geo"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Value for money", "Awesome product available at descent price", "Four Stars", "No 1 can Beat !t", "Works Great !! Review after 2 years.", "Three Stars", "PowerPack Pendrive!!!! Daily Companion!!!", "Always Sandisk... :-)", "Good Product", "Very good product"], "review": ["Hi guys ..... I bought this pendrive about a month ago ...got it after just 2\ndays . Of ordering....the packing is good enough to safely shift.it...inside\nyou will get pendrive only(as you all know) it comes with a slim designed body\n...... performance is at its top.... supports it's.... transfer speed is\naround 3-4mb per second...you will get around 14.8gb of free space...overall\nbuild quality is good....with black color I feel.... because of its compact\nsize its really handy.....  \n.  \n.  \n.so it's the best of you can get  \n.  \n. thank you for spending your time on reading my review if you found this\nreview help full please like it  \n..  \n  \nThanks once again\n\n", "Must buy item 16 GB storage fast delivery\n\n", "It's a very good product as usual. I got it right now.....\n\n", "The speed is amazing and best in this class.  \n#Best in Price  \n#Best in Budget  \n#Compatible to all\n\n", "I purchased this 16GB on 21st August 2014 at the price of 370rs. It was the\ncheapest pendrive available at that time. I use this pendrive regularly for\ncopying movies, installing softwares and OS etc. I partitioned the drives for\ninstalling kali linux as live. And recovered the pendrive. So after these\nheavy usage also this works fine. It did't show me an error message till this\nday.  \n  \nSpeed :  \nI tested the speed of the pendrive in my Macbook pro and attached the\nscreenshot. It shows me 8mb/s for writing and 23mb/s for reading the data.\nIt's not bad. You will get 4-10mb/s as write speed.  \n  \nAt this cost this pendrive gives lot of advantages. You can buy without having\na second mind.  \nIf you want more speed than this,then you can go for USB 3.0 drives.\n\n", "Not upto mark\n\n", "Sandisk is a leading company in the Secondary Storage device.  \nI am using this pendrive long time. Now I want to review this product so that\nbuyers can decide.  \nPros:  \n1\\. This is very light weight and small in size that you can carry everywhere.  \n2\\. There is a dedicated gap for key chains so that it can not be lost.  \n3\\. It has a premium Look of Sandisk  \n4\\. You have Sandisk Secure Manager in this pendrive. ( I recommend you to use\nthis as it is most secured I think).  \n5\\. Reading speed is awesome 18.5MB/s  \n6\\. Writing Speed is almost 9.5 MB/s  \n7\\. The Long Warranty Period is awesome.  \n8\\. Easy to format whether in NTFS or in FAT32, I recommend you to use FAT32\nDefault , but while using in Windows Installation you can use the NTFS format.  \n9\\. It is supported in Set Top Box, (I have tested in Government Provided Set\nTop Box to record shows)  \n10\\. The Branding of Sanding makes it awesome.  \n  \nCons:  \n1\\. It has a plastic body, so please use it carefully while plugging in..  \n2\\. One of my Sandisk Pendrive is broken as I have pressured to put it in USB\nDrive, so be carefull.  \n3\\. After using many days, while reading from pendrive or writing from\npendrive you will feel the pendrive little warm, but it is normal I think.  \n4\\. If you have accidentally deleted the Sandisk Secure Manager software, it\nis hard to find it, so please be careful.  \n  \nOtherwise this product is awesome, You can surely Go for it. Thank You, I\nthink this review helped you a lot. Hit the \"HELPFUL\" button if you think that\nit helped you to decide about this product. Thank You for viewing this review.\n\n", "Just great pricing and storage capacity.\n\n", "Good Product\n\n", "Very good product by SanDisk and it has good speed\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 January 2017", "on 14 February 2018", "on 16 January 2018", "on 4 December 2017", "on 26 August 2016", "on 5 February 2018", "on 16 April 2017", "on 19 January 2018", "on 30 January 2018", "on 20 December 2017"], "reviewer": ["NYR", "Sahil", "Anuran Giri", "#pRem...", "Raneesh Ravi", "SURAJIT DAS", "#Rahul Das", "Desmond John", "Santosh Kumar Suthar", "Vksingh"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Sandisk cruzer blade >>> it is still  doing a good job 👏 <<<", "Decent Performing Device with Poor Body Material  -  A Good Buy!", "Pen drive like *Technical Guruji*", "Five Stars", "poor quality material", "Thanks to Amazon's Blockbuster Deals.Kudos!", "Go for it", "So good 4)It's a Sandisk 5)Good Transfer Speed", "its good for the price", "Worst pendrive ever whether it be the speed or the ..."], "review": ["For the deal price of 309 it is a steal. !!  \nI have been using it for the past one year  \n  \n^ ^ ^ ^ ^ ^ PROS ^ ^ ^ ^ ^ ^  \nSuperb option for storage and transfer of important data while on the move  \nTough and portable ; use as keychain  \nHas password protected folder for no compromise in safety and security while\non the go.  \nEasy drag and drop feature for convenience in transferring data  \nThe transfer speed is OK, unless you have a train to catch or a meeting to\nattend , a few seconds here and there hardly matter !  \nThe plastic body will not rust unlike the hp pendrive  \nReasonably priced  \nLimited 5 year guarantee  \n  \nv v v v v v CONS v v v v v v  \n  \nFor the PC / laptop, the 16 GB pendrive offers roughly14 GB free space  \nHeats up  \nSpeed is not that great  \nOverall it is value for money 👍  \nHope this helps\n\n", "SanDisk is one of the best selling USB drives of our times due to its robust\nnature added with the perk of never breaking down in its job. This product too\nupholds the characteristics which made SanDisk one of the most sought brands.  \n  \nFollowing the trend, this device too performs extremely well, has decent speed\nand does not create any nuisance. However, owing to the material used in the\nbody, it is very likely to crack if not taken an extra bit of care.  \n  \nIf you are using it for everyday work with no-so-valuable data, this is a\nsureshot device to target. It is to kept in mind, if you squeeze this product\nin your wallet asking it to play with the coins in it, this device is sure to\nbreak.\n\n", "\n\n", "Dont think jst do it\n\n", "Not long lasting....poor quality material....\n\n", "See the pics that I have uploaded alongwith this review (Sorry I dont have a\nDSLR so picture quality is not that great).  \nDeal price:- Rs. 249/-  \nSeller:- Cloudtail (Amazon's Premier Seller as I call it)  \nPrinted price:- See the picture.  \nWrite speed:- 5.5 MBps (approx.) while copying big files.. (Speed starts from\n20 MBps then comes to 5.5)  \nPros:-  \nSize is small..  \nPlastic built...  \nnice colour..  \nGood write speed considering the price.  \n16GB (8GB costs around Rs.215)  \n  \nCons:-  \n{Nothing considering the price}  \n  \nThanks for this deal in this festive season.. I earlier had a Transcend 4Gb\npendrive which I bought for around 350rs and used it for 5yrs. I lost in\n(unfortunately) and was looking for a new pendrive... This one is perfect for\nme... Hope I helped you... Thank You for reading this...\n\n", "SanDisk has always been my first choice. They have never proved me wrong.\nSanDisk Blade is an indestructible product.\n\n", "I bought this pen drive from amazon and got this within 3 days!!!!! The pen\ndrive was packed compactly,as expected from amazon  \nNow about the pen drive. Here are its pros and cons.  \n  \nPros:  \n1)Small size  \n2)Superb looks  \n3)No cap. If there was one and it is lost, then it will really be a problem.\nBut this one doesn't have one. So good  \n4)It's a Sandisk  \n5)Good Transfer Speed. I get about 19 to 20Mbps. Those who complain about low\ntransfer speed, try formatting the pen drive from FAT32 to NTFS to increase\nthe speed. At FAT32 I only get about 5 to 6Mbps while in NTFS, as I have\nmentioned above about 19 to 20Mbps  \n6) I like the Sandisk Secure Access Software  \n  \nCons:  \n1)Only 14.9 gigs of storage.(But can live with it!)  \n2)Average Build Quality.  \n  \nBut the Cons are outweighed by the benefits of this product.  \nI'm satisfied with this pen drive  \n  \nSo if you are looking for good performance and awesome looks, go for it.\n\n", "nice and it has good speed\n\n", "Worst pendrive ever whether it be the speed or the working and it just stopped\nworking one day with all my data stored in it👿👿👿👿\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 May 2017", "on 8 October 2017", "on 17 November 2017", "on 24 March 2017", "on 14 October 2017", "on 21 October 2015", "on 6 September 2017", "on 26 March 2017", "on 22 October 2017", "on 23 July 2017"], "reviewer": ["Karmic Voice", "iShahrukh", "Amazon Customer", "Srinivas", "Eldwin", "Satya Swaroop", "Sunny Issac", "Abhisek Gupta", "Dave", "Amazon Customer"]},
{"rating": ["3.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Heating issue rest is nothing special", "Awsome product", "Four Stars", "Four Stars", "100%fake", "Not good for bootable purpose", "The Best one can ever get at this price point", "Second purchase after 2 years of trouble-free usage", "Damaged", "It's SanDisk afterall"], "review": ["Bought it during sale but paid pretty much the same amount as i would have\nwithout the sale.  \nNext coming to the product  \n1\\. works no issues there,  \n2\\. read and write speeds are as they should be - Never expect the highest\nspeeds that are written as that depends on may other factors,  \n3\\. the drive itself is extremely tight at this point maybe it will loosen up\nafter constant use. This is not a bad or good thing for me personally its a\nbit of a nuisance to have to pull it with force  \n4\\. the only CON i found was heating - It heats up regardless of the size of\ndata transfer. I transfer a 56kb image it heats up, i transfer 400 mb it heats\nup.  \n  \nDo not know if this is gonna cause issues in the future because this is the\nfirst flash drive that has heating issues that i have used.  \nIf i had an infra red camera i would should you in pictures but i don't have\nthat.\n\n", "Awsome pedrive good for storage light weight and stay cool\n\n", "Its Size 14.5 Gb Not 16 Gb  \n& Its speed Is 4 to 5 mb p/s  \nIt very slow i am very sad to buying this pd\n\n", "\n\n", "Stopped working after a month  \nAnd lost important data\n\n", "If you want to use this pendrive to make a bootable, don't go for it.\n\n", "Lets keep it short and informative, ive bought this for my office purpose,\nwithout any other doubt after researching for over an hald of the day i\ndecided to go ahead with this pend rive, i was scared of getting the duplicate\none but it was not the case as when i received it it was packed and had all\nthe authentication marks on the product itself. Performance of the pen-drive\nis quite average as compared to the latest gen pen-drive the transfer rate is\nslower of this drive but it serve the purpose very well, i really like the\ncompact design of the drive which makes it comfortable when kept in pocket.  \nI would definitely recommend this product to the buyers, Please Note: Whenever\nyou eject this pen-drive from your USB slot make sure that the direction while\npulling out should be straight, orelse you may crack the plastic of the pen-\ndrive.  \n  \nIf you Found this review Helpful please Press Yes Below\n\n", "I have been using a similar drive of 4GB capacity from last 2 years. The drive\nwas purchased for my office and its working absolutely fine with several\nwrites each day. I was using this drive to test the software developed for our\noffice product where I had to write huge amount of machine data every 1 hour.\nThe tests were done for almost 3 months. The drive is still working fine after\nso much of writes.  \n  \nThe plastic quality is bit cheap and the USB socket is prone to break quite\neasily as the corners of the plastic are very slim. All in all, if you use it\nwisely and does not get it crushed beneath heavy objects, it will work\nsuperbly.  \nRead and Write speeds are well for a normal day to day work. Nothing special\nin it, but its build to last electronically quite a few years.  \n  \nBeing a satisfied user of the 4GB version which was for office use, I ordered\na personal one of 16GB just recently because I had to consume the amount in my\nprepaid card.  \n  \nIf you are looking for simple, build to last (functionality wise), for day-to-\nday copy needs, normal size of data transfers, go for it.  \nIf you want metallic finish, robust build quality, or a large data transfer\nevery now and then, look for Kingston Drives. They are tough in structure, but\nR/W speeds are less compared to similarly priced products.\n\n", "This product doesn't show 16 gb.  \nIt's showing 250 my only.  \nWhy this happen.  \nReally cheated to customer.  \nWaste of money.  \nWho will responsible for this.  \nPlease resend my money.\n\n", "Nice product....  \nThnxxxx Amazon\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 August 2017", "on 15 July 2017", "on 27 April 2017", "on 18 August 2017", "on 14 March 2018", "on 4 February 2018", "on 24 March 2018", "on 31 October 2016", "on 13 November 2017", "on 4 July 2017"], "reviewer": ["Avik", "Amazon Customer", "Amazon Customer", "Noushad", "Abhishek narisepalli", "Amazon Customer", "Karan Singh", "Gurpreet Singh", "Sivarjunreddy", "Subhradeep B."]},
{"rating": ["4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Four Stars", "Ok product", "Nice product after use this one i will give more reviews.", "Pen drive not working", "Five Stars", "Good Pen Drive", "I use this 16gp pen drive for recoarding", "Poor man's rolex", "Faoulty Product.", "Good"], "review": ["i m using it.working well.\n\n", "Getting 11.2 Mbps speed.\n\n", "Pandrive was nice.  \nAfter use I will give more response for this👍\n\n", "I want to return this pen drive it stopped working from last 10 days. I have\njust purchased 2 months back.  \n  \nRequest you to replace my pen drive with a new one  \n  \nIf it is not replaced, i will not buy any product from Amazon henceforth\n\n", "\n\n", "Good Pen Drive  \nAmazon Gives Always Awesome packaging and Delivery Keep It up Amazon.  \nPlastic Body have to handle carefully  \nTotal Size From 16GB you will get Only 14.5 GB  \nIf you Going Copy a file you will get Speed of 4 to 6 MB/s  \nIf you Going Cut paste a File you will Get 30 to 34 MB/s  \nFrom my Side is good Pen Drive for regular Use\n\n", "Good product good delivery\n\n", "Perfect pendirve for those who look for basic and at great price.\n\n", "I have Purchase 16 GB San Disk Pen Drive But He was Show Only 296 MB Space. I\nwant too say he is totally bad quality product.\n\n", "Best pen drive compared to all available in the market.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 September 2017", "on 22 September 2017", "on 16 August 2017", "on 22 October 2017", "on 18 September 2017", "on 5 December 2016", "on 27 August 2017", "on 23 July 2017", "on 12 May 2017", "on 24 July 2017"], "reviewer": ["khs indira", "Kranthi kumar", "Vijay Mewara", "Ritesh Parekh", "Amazon Customer", "Amazon Customer", "Amazon Customer", "K.S.thejas", "Amazon Customer", "ENGINEER, SMART BUYER & YOUTUBER"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Five Stars", "Super good pendrive", "Blindly trustable device", "Please don't buy this ... Its just a lose of money ....", "Must buy product...", "Abcd", "16 GB SanDisk Cruzer Blade - Value for Money", "Nice", "Nice Product", "My review"], "review": ["It is very very good price and product and it is small\n\n", "Awesome product with amazing discount loved the way they delivered within a\nday\n\n", "Before purchasing this device I really made so much of research in a eCommerce\nwebsite and I found that this is the best device that I should go ahead\nespecially from mysmartprice.com. To check what exactly the status of this\ndevice and how many ratings has this device got and I really got shocked it's\nreally the best of the best one so I purchased and yes this is really the best\ndevice and I am too much happy with this device. The performance is really\ncharming and ill never regret on my decision.\n\n", "its a stupid stuff.... i got it as write protected.. No way to recover it .. i\nhave tried normal formatting and even after low level formatting also it is\nnot working .... This project is just a wastage of money .... I had purchased\nmany items from amazon .. This is my first experience ... its really shameful\n.. i am attaching the screenshot also ..\n\n", "if you are looking for a good and branded pendrive then go for it without\nthinking twice just buy it..build quality is good and speed is upto\n15-8mbps...overall this product is value for money....\n\n", "This is the best deal\n\n", "SanDisk Cruzer Blade 16 GB USB 2.0 Pen Drive: Value for Money  \n  \nAfter 2+ years of usage, I'm writing the review for it.  \n  \nGood product at this Price  \n  \nPros:  \n1) Really Value for money. Good pen drive at this cost.  \n2) Performance is good.  \n3) Pocket-friendly, weightless & small in size.  \n4) I have been using more than 2 years and its still working fine.  \n5) Comes with Sandisk Secure Access software inbuilt  \n6) A Trusted & Safe storage device. Sandisk is one of the most Trusted &\nPopular companies for storage devices in the world.  \n  \nCons:  \n1\\. Slow data transfer speed, but overall GOOD\n\n", "Good product\n\n", "GREAT PRODUCT BUT BUILD QUALITY IS NOT GOOD HOWEVER TRANSFER SPEED IS GOOD\n\n", "Product is good👌👌\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 December 2017", "on 26 April 2017", "on 22 May 2016", "on 24 August 2016", "on 8 January 2017", "on 9 May 2017", "on 16 February 2018", "on 15 May 2017", "on 27 March 2017", "on 19 April 2017"], "reviewer": ["Ratish", "Amazon Customer", "Anand Kumar Jha", "viju", "Ankit Bisht", "Amazon Customer", "Anand Singh", "Amazon Customer", "mudit joshi", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "250 MB pendrive", "Five Stars", "Good", "Four Stars", "Great Product........", "Five Stars", "Vary Good", "Go for it", "Five Stars"], "review": ["Very Good Product. Transfer Speed Is Too Good. Overall Great Value For Money.\n\n", "The order delivered to me had only 250 MB of space in it instead of 16 GB.\n\n", "Good product\n\n", "I am satisfied to the product.\n\n", "sandisk supplied show 14.5GB in my laptop. why so?\n\n", "I have used a SanDisk cruzer blade before 2 year .And It was good but it\ndamaged only by a throw.This product which I have ordered is good. also very\nfirst delivery. It is also fast.\n\n", "Good pendrive\n\n", "This product is very good\n\n", "On time delivery, good pd...\n\n", "\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 September 2017", "on 4 September 2017", "on 1 November 2017", "on 12 October 2017", "on 28 September 2017", "on 2 June 2017", "on 20 October 2017", "on 7 October 2017", "on 25 September 2017", "on 10 October 2017"], "reviewer": ["Anurag Rajput", "Amazon Customer", "Amazon Customer", "Amazon Customer", "m mahesh babu", "Amazon Customer", "Shashi B.", "Swarup Bhattacharjee", "GREAT G.", "Harshit Singh tomar"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Four Stars", "Four Stars", "Not impressed", "Excellence", "Speed is low, but OK at this Price", "DIFFERENT PRODUCT RECIVED THAT SHOW DIFF. PRODUCT CODE", "... for more than 3 years and its still giving Good performance. So", "Completely useful and cheap", "POOR QUALITY", "good"], "review": ["Best product\n\n", "GOOD\n\n", "Was under the assumption that the device supports android phones because of\nwrong answers given in the search answers section. Since it is of no use for\nme I am going to return it. Also it does not support windows 10\n\n", "\n\n", "Pros:  \n1\\. A Value for money. Best pendrive at this cost.  \n2\\. Performance is good- as expected within this rate.  \n3\\. A Trusted & Safe storage device for files by Sandisk- there is minimum\nchance of device malfunction and losing your data.  \n4\\. I have been using this for more than 3 years and its still giving Good\nperformance. So, its very Long-lasting.  \n5\\. Delivery by Amazon was very good- delivered on-time and very well packed.  \n  \nCons:  \n1\\. Slow data transfer speed- 25 mbps export & 4 mbps import ( it's bit low,\nbut OK within this budget)  \n  \nSandisk is one of the most Trusted & Popular companies for storage devices in\nthe world. This product by them is also Good. I was fully satisfied with this\npendrive at this low price. You can undoubtedly go for this device within this\nBudget.  \nIf you like this review please give a Helpful vote...it helps.\n\n", "PRODUCT CODE IS DIFFERENT IN THIS DISCRIPTION IT SHOW - SDCZ50-016G-B35  \n  \nAND IN THIS PENDRIVE IT SHOWED - SDCZ50-016G-I35\n\n", "I have been using this for more than 3 years and its still giving Good\nperformance. So, its very Long-lasting.  \n  \nThanks a lot for Amazon giving me a great product with great delivery spreed.\n\n", "Hello guys  \nI just got this pendrive from my nearby store but it cost me a lot but when I\nfound the same pendrive with my friend I was shocked. He told me that he had\nbought it from amazon with almost 30-50% off . The pendrive has a great\ndesign, attractive look,and many more. You can insert it in television, setup\nbox ,DVD player, and many more devices. It runs well and good  \nThank you I hope you all like the review plz mark it in the helpful option and\ndo follow my profile for more revies.\n\n", "The speed is too slow please dont buye it waste of money i request to all\n\n", "Product is not bad. ..but its memory shwing 14gb only ..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 January 2018", "on 16 January 2018", "on 6 March 2018", "on 29 December 2017", "on 3 February 2018", "on 26 September 2017", "on 4 February 2018", "on 25 April 2017", "on 25 September 2017", "on 15 October 2017"], "reviewer": ["Pravin", "Hardik.B.C", "Amazon Customer", "Amazon Customer", "Top 5 Originals", "AKSHAY SHARMA", "Amazon Customer", "Pathik shah", "Akash", "Avijit Ghorai"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Very Genuine Product", "the fine packaging by SanDisk merely required a bubbles pack which ...", "Nice product.", "Read Write Speed Is 4-5MB/sec only.", "Wrong shipment", "Good", "But fortunately I received one of the best", "Larg size", "Decent flash drive for the price", "Very Bad Product"], "review": ["Very Genuine Product  \n  \nI ran benchmark on it using Disks tool that comes with Ubuntu.  \n  \nResults were pretty good as you can see them in picture.  \n  \nAverage Reading Speed 33.0 MB/s & Average Writing Speed 13.1 MB/s  \n  \nI hope this will help you to trust this product even more.\n\n", "received the two 16gb and 8gb pen drives within two days where a sunday fell\nin the middle ,well in time as always! the fine packaging by SanDisk merely\nrequired a bubbles pack which Amazon provided. the product is super. why i\ndidn't have two 16gb drives ? Amazon didn't allowed ! so here we go from box\nto operation (for old buddies) ; 1.receive delivery, open package ,find the\nproduct ,check its code and accept the product (and make the payment) 2.cut it\nwith the scissor marks only (and don't spoil the packing, it can be used for a\nlong time) and with the help of the two finger ,with a little care and trick,\ntake it out. 3.Pc's anti virus ready for a removable drive scan, pc connected\nto internet for latest driver installation and automatic installation is\nactive in device installation settings. 4 then insert it into the usb 2.0 port\ngently with the name SanDisk on the top. 5 within seconds ''the driver is\ninstalled and device is ready to use\" message appears. 6 now, antivirus scans\nit and hopefully its clear. 7.now check it for the errors. right click upon\nthe sandisk/pen drive icon and go to properties at bottom and click it. my 16\ngb pendrive shows capacity as 14.5gb (EFFECTIVE)! 8.move to the next section\n'TOOLS' at the top and go for the \"Check now' (radio) button and hopefully,\neverything is good. 9.now the pendrive can be used for storage purposes. make\nat least a single folder in the pendrive,preferably. now drag any item from\nany location window and drop to the new folder window in the pendrive or just\ncopy and paste. 10 additionally, in the Property box, there is also a tab\n'ReadyBoost\" (wow ! my pc has checked the device and found that it can be used\nfor ready boost! when its only USB 2.0 ! ) readyboost can really boost your\nsystem with HDD and low RAM. the box further asks you to dedicate the pendrive\nfor readyboost or allot at least 4gb = 4096mb for the readyboost to work\neffectively or not to use it for readyboost at all ! if you don't want to use\nit for readyboost, just don't do there anything in the readyboost tab. Mind\nthat the space you allocate for readyboost can't be used for storage purposes.\nyou can use 32 gb for readyboost @ maximum on each pen drive and you can add 8\nsuch pendrives @ max to a single Pc. 11.apart from storage and readyboost,\nthese usb drives can also be made bootable. i mean you can also use them to\ninstall windows,etc or start a pc with them.etc, etc. Believe me installing\nwindows,etc with pendrives is a lot faster than with a installation dvd and\nwhere pen drive's life is 5 year and we all know about a dvd's life. all the\nmore external/ internal dvd writers life is hardly two years now a days. an\nexternal dvd writer in the price band of 1500/- to 2000/- is mostly assured of\n1 year life (only TRANSCEND assures 2 year life in that price band). what we\nhave to do is just find a suitable installer for an app .there are tools to\nmake multiboot pendrives. RAYMOND CC is a very good search site for advance\nuses which is secured by NORTON and provides a lot of safe download sites\nwhich you can instantly check with VIRUS TOTAL! 12. back to our task , check\nthe drive for ten days return period and then register it with SanDisk and get\na 5 year warranty/ guarantee.13 CAUTION: dont just pullout the pendrive to\ndetach it from Pc ! data loss may happen. always remove removable storage\nsafely. there will be a a green lock in the 'Task Bar' @ bottom and near the\nright corner of the desktop.and when you hover mouse pointer/cursor over it,\nit would say 'safely remove hardware'. click it and a small box would say\n'safely remove USB Mass storage device' with the listing of removable drives.\nThere you have to select the drive and click it. then a window will appear\nsaying 'this device can now be safely removed from the computer' then you have\nto pull it out gently. otherwise there will be a message window saying that\n'the device cannot be detached' or 'some program is still using the device' or\nsomething like that. in that case make it sure that no program is using that\nfor eg copying , scanning, etc. finish the process(s) , save your work, come\nout and again start from the green lock. if you are not able to make out where\nit is being used or opened, don't panic but also don't pull it out. keep on\ndoing what you are doing save all your work and do a complete shut down and\nthen you can detach it with no fear. additionally, as i know if you are using\nit for readyboost, it would not be detachable in the middle and not even try\nto do that ! 14. i forgot to mention that there is also a special option in\nthe product. you can encrypt your data on it. it means you can block access to\nthat data by other users. therefore SanDisk has put one application Executable\nand one guide PDF (for the use of that application) on the pen drive. that PDF\nis for windows users. and mac users can download guide straight from the\nsecond PDF. i think its more useful for storage purposes. THANKS.\n\n", "Nice product as expected but, the built quality of the USB stick is fragile\nmade up of soft plastic. There is some chances the edge of the USB stick can\npossibly break or damage the USB stick, if accidentally falls from 4 feet or\nso.\n\n", "SanDisk Cruzer Blade SDCZ50-016G-135 16GB USB 2.0 Pen Drive  \n.  \nProduct is good. But read & write speed is too low as not accepted 4-5MB/s.\nDoesn't accept from sandisk. Totally disappoint me.\n\n", "There is a problem with 1 pen drive .. it's 8 GB. I ordered 2 pen drive of 16\nGB . There is a mistake that I realized yesterday..\n\n", "Budget pendrive ever. If u like handy and dustproof then u can go for it.\nWorst thing is that low read speed.\n\n", "Very one is familiar with the name as I was. But I was afraid that whether\nAmazon gives original one. But fortunately I received one of the best.\n\n", "I always use a sandal of eight numbers. But I have eight numbers from you but\nit is a big size, but if you want me to reach seven numbers and take it,\n\n", "Bought this for using it on my LED TV. The packaging and delivery was good.\nTested on Windows 7. The OS recognized the device immediately and installed\nthe drivers automatically without any fuss. Comes bundled with sandisk secure\naccess software. I don't know if i will ever use it. There is a perforation to\ntie a lanyard, but no cap on to protect the USB head. The read speed was\naround 28 MB/s and write speed was 9 MB/s.  \nTried on my TV, and 1080P HD videos(mkv format appx 2 GB and mp4 format appx 4\nGB) played without any lag. Good for normal household use.\n\n", "very bad . Did not Contact any phones and computers\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 December 2017", "on 13 April 2016", "on 22 December 2017", "on 20 January 2018", "on 23 January 2018", "on 2 March 2018", "on 27 January 2018", "on 28 December 2017", "on 23 February 2017", "on 4 March 2018"], "reviewer": ["Sam Daiya", "LittlePro", "Amazon Customer", "Abhishek", "Rathva Ashish", "samrat das", "Seema huria", "Vinod Phalke", "The Viking", "Mallika Saha Mandal"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Reliably fast...", "It looks like that it is not a refundable item as I ...", "sandisk 16 gb pendrive review", "Just Awesome Product", "A superior budget pen drive.", "Very good pen drive for this price", "Nice product, but more MRP than actual is mentioned on website", "Best for this Budget! Surely I say..", "It was worth my money.", "Value for money...kind of"], "review": ["Sandisk the best in storage devices I feel..  \nThey offer a reasonable price for their product and also provides good\nlifetime of the pendrive.  \nI bought this product for my friend...I can blindly recommend this to any\nnormal user... It's writing speed is fast so does reading speed...Transfer\nrate is decent...  \nThis is me buying this product for the 3rd time...I grabbed it on a lighting\ndeal...  \nDelivery is super fast, it did delivered me before 24 hrs...  \n#One incident to share:  \nMy mum washed this pendrive not just once but twice...But to my amazement it\nreally worked super fine . THUMPSUP to SANDISK👍  \nI thank Amazon for super fast delivery...Nice work...\n\n", "As per warranty guide , sandisk cruzer blade 16 GB pen drive is compatible\nonly with windows vista , windows 7 and 8 and Mac OS. It was not given in the\nwebsite. It looks like that it is not a refundable item as I am not getting\nthat option while trying to return because we have windows 10 .\n\n", "This is the sandisk pendrive 16 gb variant And i am a user of sandisk from a\nlong time.  \n  \nThe products are cheap,easy to use and are durable.  \nThis pendrive has a good copying or transfering speed and i am again happyto\nuse it.  \n  \nAnd above it the amazon shipmemt is also awesome.i got my product on time\nwithout any distraction or any faulty things.  \n  \nYou shop shop with amazon as it is a trustworthy site and i am amazonian now.\n\n", "I bought a pair of this products 16 GB variants..... I am using it for last 5\nmonths and till date not faced any trouble at all....... things i like about\nthis product:  \n1\\. It is by far the best USB 2.0 product at this price range....  \n2\\. Possibly the best in class device meant for rough usage....  \n3\\. Build quality is good & is extremely handy with no over-heating issues....  \n4\\. Compatible with windows 7, 8 & 8.1 (tested by me) and compatible with 3.0\nports as well...  \n5\\. Normally gives around 35 MB/s read speed with 3.0 (though the device is a\n2.0) which is just awesome...writing speed is around 5 MB/s...\n\n", "A exemplary pen drive for day to day storage use. Sleek and compact design.\nTransfer rate is satisfactory and easily gives 17 MB/sec. of speed. It was\ndelivered 2 days before the expected and arrived in just 2 days from the date\nof the order. We'll done Amazon.in.\n\n", "SanDisk Cruzer Blade SDCZ50-016G-135 16GB USB 2.0 Pen Drive.. Light Weight\nplastic body, no need to worry about cap loss. No LED indication for drive\naccess  \nI got approx. 10MB/s write speed,  \nNo LED indication for drive access  \nStorage capacity 14.9 GB.It also includes security software for securely store\nfiles.  \ni recommend this to all who are looking for a very cost effective storage\ndevice without spending much delivery was also very fast...\n\n", "The product is very good. The reason for 4 stars is that the actual price\nmentioned on the product is 449 but the price mentioned on website is 649. Why\nthis cheating Amazon?\n\n", "Hello Buyers,  \nBefore going to this review, I try my best to give my review for this product\n. I buy this pendrive before 10 days. I really enjoy with this pendrive at\nthis price range. As this is a usb 2.0 (DDR3 SD)pendrive it transfers file\nupto the speed of 40-50 Mbps in my pc. This is quite good for usb 2.0 pendrive\nparticullary with this price range. Also speaking with its built quality i\ndropped 5 or 6 times at a height of around 50 ft but this pendrive works for\nme perfectly without any scratches. I feel good to recommmend this pendrive\nfor all peoples. You also feels happy with this pendrive performance.. Hope\nthis review is helpful, If you find this helpful hit the helpful button too!  \n  \nBuy AT : SanDisk Cruzer Blade SDCZ50-016G-135 16GB USB 2.0 Pen Drive\n\n", "Working fine after almost one and a half years, So I guess it's quite good pen\ndrive. Max read speed is around 20~22 MBps and write speed sucks, depends on\nfile size and number of files etc, I've seen it doing 0.5~5MBps, but that's\nclose enough to USB 2.0 standards. Buy it if you don't plug it into PC every\nother minute.  \n  \nThe plastic body isn't that strong and plugging point has to be handed\ncarefully while inserting into port but it has lasted fairly rough plug-in\n/plug-outs so quite durable I guess.\n\n", "It may be easy om the pocket but it feels really clumsy . Made entirely from\nplastic. Every time you insert it in a laptop you will be paying that it won't\nbreak into pieces..  \n  \nYou might want to see the review pictures to see the scratches on the surface\nafter using it a just a day!  \n  \nPros :  \n1\\. Cheap,  \n2.highest capacity in it's price range  \n  \nCons:  \n1\\. Really weak body made with plastic entirely  \n2.USB 2.0 hence transfer super is very slow(but what more can you expect at\nthis price)\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 November 2017", "on 14 August 2017", "on 9 January 2018", "on 8 August 2017", "on 10 March 2018", "on 26 November 2017", "on 19 October 2015", "on 27 January 2017", "on 18 July 2017", "on 27 June 2017"], "reviewer": ["Srinivas nayak", "Gokila", "Rutvik", "RRC", "Ankur Shahi", "LEO OOMMEN KURIAN", "Shubham", "Aravind Naveen", "Harshiv Patel", "Amazon Customer"]}
]