[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["its been more than 2 months since i, m ...", "Excellent Product", "Major issues with this model and it's support", "Good deal value for money", "Excellent Product & good service Delivery", "VERY GOOD HDD. SMALL AND EFFICENT.", "Have brought this a year back & it has 3 ...", "Seagate Standards have gone down. What is the point ...", "Much better than Western Digital", "Great transfer speeds Seagate Backup Plus Slim 1TB ."], "review": ["its been more than 2 months since i,m using this product , yes the product is\nup to my expectations.... thanks amazon.... thanks seagate...:)\n\n", "worth of money. I have got 200GB storage in onedrive cloud for two years &\nregistered product in seagate website it is genuine product. one thing which i\nmost like that the product date of manufacturing was one month before the\npurchase, v new and delivered with in two days. excellent experience, this HDD\nis very slim not heating looks great. highly recommended.\n\n", "The device got detected once and then stopped getting detected.tried all\npossible option of checking the same but there is none available. Worst is the\nsewage support asks for 550 dollars as a charge for data that their device\nscrewed up. Beware guys. I guess buying space on cloud is a safer bet tha\nrelying on Hardwars. Seagate is a huge disappointment.\n\n", "Good deal value for money. Will have to check for longevity as the last one\ncrashed in 3 years cant ask for more I guess. Works with Mac and others.\n\n", "Excellent product....  \nOn time delivery  \ni have purchase this product on 2014, this will rocks...  \nawesome service & delivery  \nUsb 3.0 port  \n  \nLooks:  \nThe Seagate Backup Plus portable hard drive's enclosure is made out of matte\nplastic that feels pretty well made, though I'd prefer aluminum for durability\nand better heat dissipation. Glossy plastic enclosures are hard to keep\nlooking good, so kudos to Seagate for using the matte plastic instead. The\nback of the drive has the USB 3.0 port and there's an itty bitty blue\npower/activity light on top of the drive, towards the back. Also, there are\nsmall rubber feet on the bottom, to keep the drive from sliding around on your\ndesk. The USB 3.0 cable is short, so it's best suited for use with laptops.\n\n", "Very fast delivery by amazon. Regarding the external hard disk. it is smaller\nthan the 5.5 inch mobile. looks good. easy to use. maximum write speed i\nobserved is 25 mbps. You can easily carry it in your pocket. i use ubuntu\nlinux . backup software is of no use for me. May be windows users can use\nthat. Overall good shopping experience at amazon.in . Product is as i\nexpected. GOOD.\n\n", "Have brought this a year back & it has 3 year warranty. Now it's broke down\nwithin warranty period and no service center in India. Without service center\nit's not worth to buy it.\n\n", "Seagate Standards have gone down. What is the point in buying a hard drive\nthat is not reliable. In just 2 Months the hard drive has become \"BAD\". Called\nup seagate service center and they said it will go for replacement and data\nwill be lost!. Please refrain yourself from buying this hard disk.\n\n", "Seagate hard drives are any day better than the cheaper Western Digital ones.\nWD hard drives have major issues where they disconnect even if you slightly\nmove your laptop. Have heard similar complaints from a lot of my friends who\nown WD hard drives. No such issues with Seagate. Works as expected.\n\n", "HI,  \nThis Seagate External Hard Drive is superb ,it has good transfer speeds, the\nonly downside of this great product is that seagate s not providing a pouch\nwith the package.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 August 2017", "on 9 September 2016", "on 19 December 2017", "on 6 March 2018", "on 22 January 2016", "on 23 August 2015", "on 6 September 2017", "on 4 April 2015", "on 31 December 2016", "on 6 August 2016"], "reviewer": ["Rajesh Deshveni", "SUBHASH KUMAR SINGH", "Amazon Customer", "Jibin Menon", "Vickey Singh", "ims", "Ravikumar H S", "Tretail", "Chopra", "aQeel"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Real disasters of my life!!! No More Seagate afterwards :(", "Good product", "Pls. don't think about \"Free Mcafee Internet security for ...", "Not trust worthy.", "Very good Product. Worth buying", "Happy with what I bought", "It is easy to use", "Speed very poor(20 Mbps)", "please go for that si you can connect it to ur Smart phn", "Not reliable, its samsung inside"], "review": ["It's not at all worthy if you have some important data. For my precaution, i\nkept around 300GB data but yes correct for me also it's not working. Actually,\nwhen I am connecting to the laptop some sounds like the fan is working but I\nam not able to see the connected drive option in my pc or Hard disk\nnotification light also not showing any status. I have around 300GB data\ninside so may be it will be real disasters about buying this product. Any\nhelpful reviews regarding this issues will be greatly appreciated.\n\n", "I ordered 4 days back and got delivered today no warranty issue it take me\ncouple of seconds to register for warranty and free cloud storage nice slim\nand portable and too good working fine getting 17 to 25 mb on USB 2.0 and\ntriple the speed on USB 3.0\n\n", "Pls. don't think about \"Free Mcafee Internet security for 1yr (Exclusive\nOnline Partner - Amazon) for any query please contact 0008004401392 \"  \nthe given number remains switch off always and amazon people do not know how\nit works.  \n  \nHard disk is OK , the speed is 22 mbps to 48mbps for large file .\n\n", "I bought my Seagate back up plus slum from Amazon. In less than half a month\nit stopped working completely. Now I tried connecting the hard disk to three\nlaptops and 1 desktop, none of the devices could detect the hard disk. The\nlight is not even appearing. These guys should have at least put up a helpline\nnumber.\n\n", "Firstly, I had expected much better packaging for a thing like Hard drive. But\nstill the packaging was enough. I used the free trial of Amazon Prime\nservices. So the delivery was on time (Just in 2 days and that too was free).\nI had read many reviews regarding warranty not successfully being registered\nfor the Indian users. So the first thing I checked was the warranty, Which I\nwas successfully able to claim (3 years, with additional 2 months). It also\ngave me 200 GB cloud storage on one drive by following few steps. The product\nlooks better than it looks in pictures. The matt finishing on one side is\nsuperb. It is very tiny and compact. There is no doubt that in terms of\naesthetics Seagate hard drive is the best. I had very old model of Seagate\nhard drive. I compared the speed. This one is much faster. It goes up to more\nthan 90 Mbps.\n\n", "Seagate is one of the best hatred disk manufacturer in the industry and though\nbeing an amateur user I would still recommend all to use it as my friends have\nbeen using it from 3-4 years extensively without any troubles. I felt I made\nthe right choice by buying this product from Cloudtail and amazon.  \nAbout Amazon...satisfied as always as it is the best in the industry in terms\nof service and customer care. They know how to earn confidence/loyalty of\ncustomers. Cudos Amazon...Keep up the bars\n\n", "I got this at the cost of 3999 from amazon.  \nIt is easy to use.  \nAppearence is not cool  \nOuter body is made of plastic... It compresses on  \nSlightly compressing  \nData speed transferring on 2.5 usb port is 100 to 125 mb per second.  \nStorage given is 938 gb  \nI am partially satisfied with this product.  \nWorking properly.. In good condition.  \nThanks amazon\n\n", "I don't know why is it a bestseller.  \nI used it with my laptop's 3.0 USB slot and the speed was 20 Mbps, yes\nliterally 20 Mbps.  \nI don't know whether the hard drive piece was faulty but the performance was\nvery poor. Returning this item is not an option. You can only replace it. So\nbeware if you are thinking of buying this product.\n\n", "Product is very gud, but it's out dated bcaz now a days samsung is giving HDD\nwith micro USB port and is of very small size, please go for that si you can\nconnect it to ur Smart phn alsi\n\n", "It says \"backup plus\". I have bought it for 4200 and used it for 3 years for\nback-up my mac and it suddenly stopped working one day. Need to buy a new one\nnow to keep my backups. One more thing, inside it is samsung hard disk.\nplanning to go with toshiba next.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 November 2017", "on 27 January 2017", "on 29 November 2017", "on 19 November 2017", "on 13 August 2016", "on 5 July 2016", "on 26 February 2018", "on 27 August 2017", "on 18 January 2018", "on 17 February 2018"], "reviewer": ["Amazon Customer", "Sawan Dhar", "anil kushwaha", "jayadeep", "Amazon Customer", "Sachin", "Ajay kumar", "rishi Rishabh Jain", "Sudheer", "Anil"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Excellent Product !!! Don't think just buy...", "I am purchasing this product second time because my first ...", "Waste of money", "Lost all my data", "Nice portable HDD", "Two Stars", "Fake or defective product..please don't go for it", "Nothing to say... Just buy", "Don't buy is .. very poor performance", "Good to go"], "review": ["Perfect Product with good price..1tb hdd with more than 25 to 35 Mbps data\ntransfer speed , slim and easy to carry very compact ,easy to connect.. thanks\nto Amazon for providing good product with good price and on time delivery...\n\n", "I am purchasing this product second time because my first 1TB Seagate drive\nwas suddenly stopped working and lost all my important data.  \nIts warranty has also been expired.  \nCan anyone suggest me for data recovery.  \n  \nThanks  \nSunil  \n9718628475\n\n", "Seagate is not worth at all. It's been just four months now all the sudden all\nthe sudden the hard drive is not detecting.  \n  \nTried the possible steps by googling nothing works. It's waste of money.  \n  \nCan some one suggest how to apply for replacement. My contact - 8610437674\n\n", "I brought 2 months back and I had all my data on HDD, it suddenly stopped\nworking and its a hardware issue even seagate is not able to fix. All my data\nis lost.  \n  \nSpend some more money and take Solid state disks instead of this scrappy HDDs\n\n", "It's a good and portable hdd. Costlier than WD for sure, but 'Seagate' brand\nname stands for itself. Transfer speed (R/W) is pretty good. Overall, happy\nwith the first impression.  \n  \nNow, about the warranty. As expected, amazon does deliver the product with a\nvalid warranty. If someone willing to buy this hdd, you can validate your\nwarranty in support.seagate.com/customer/warranty_validation.jsp  \n  \nJust, go there and put the serial number and part number of the product. One\ncan find these numbers on front of the Seagate hdd box.\n\n", "After 13 months it has failed. It is 4th Seagate hard disk that has failed.\n\n", "i bought this product and it stopped working feom the very second day..it\nseems like a defective fake one..i lost all my personal data..could not be\nrecovered..the only response i got was that they will replace the item..but\nnot even a hard disk specialist could recovr my files..this product is a night\nmare..please dont fall into this trap..\n\n", "Awesomeness.......... Pure Awesomeness......  \n  \nBeen 3 to 4 months sice i bought this produt, but it doesn't seem like it. It\nwill serve you with the same speed till you can take it to its extent. Really\nsuperb disk at such an affordable price and slim form factor......Easy to\ncarry on with you where ever you go. Very useful for frequently travelling\npeople with usb3.0 speeds and reasonable durability. If you want just consider\nto but a waterproof case for this, just in case. It will also provide\nprotection against bumps and drops. Please protect your investment. I am a\nhappy user.\n\n", "Product delivered is very poor..  \nI even unable to return it now..  \nNot worth of money ..  \nI suggest better it buy from Vijay sales or Reliance digital , at same price\nbut the benefit is u can alleast confirm about quality of product for what u\npaying such huge amount  \nPlease don't buy it.\n\n", "Nice product nice delivery amazon ...But the only thing that bugs me is that\nit's build quality isn't that great it's mere plastic.The company could have\ndone it better.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 November 2017", "on 31 January 2018", "on 9 August 2017", "on 12 November 2017", "on 20 April 2016", "on 9 September 2017", "on 22 November 2017", "on 28 September 2016", "on 17 August 2017", "on 11 September 2017"], "reviewer": ["Arun", "sunil", "Jagadesh.Raju", "Goutam Saini", "Abhishek Banerjee", "Murty", "ANU S KUMAR", "Jayavel CARzy", "Dhruv parekh", "Pratik Pawar"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Extremely disappointed with the product", "Great and Powerful", "Got defective peice", "Failure model", "small light and stylish", "The product is good, i bought it a month back and i ...", "Great external hard drive", "Not even for one star", "Good, but the second purchase was defective", "Loose my all data one time because device got corrupted ..."], "review": ["The device needs reformatting and has a risk of losing all the data. Though\nSeagate is reliable a brand and amazon as a seller is also reliable, thats why\nI went for it. Extremely disappointed with the product.\n\n", "I purchased seagate hdd because i had very bad experience in past with western\ndigital hdd..i used 2 wd hdd but both of them are damaged..therefore i ordered\nfor this great product i.e. seagate 1 tb external hdd..iys almost 1 year over\nyet no problem its working fine..i will suggest you please keep hdd in good\nquaLity caeer case..iy will protecr your hdd in case it drop..or fallen down\naccidently..so i will suggest you go for seagate hdd..and also it. Comes with\n3 yr warranty for that you have to register your hdd on seagate website..\n\n", "Beware. Got defective piece. The hard disk write speeds start 100 mbps and\nslows down to 500 kbps. I got the HDD gift wrapped so I missed the return\nwindow of 10 days. Now I have to get it replaced from Seagate service service,\nwhich offers refurbished device in exchange and guarantee of just 3 months.\nTerribly disappointed in the quality of the product. Do not buy.\n\n", "This is a failure model guys. More than 60% of the hard disks that arrive at\nthe Seagate service centers in Chennai are of this model only. I am telling\nthis because even my hard disk became unresponsive after just shaking it. Data\nrecovery is very costly(10k-30k). So please don't buy this model and for\npeople who have already bought it, don't store anything important in it\nwithout having a backup of it.\n\n", "Very rigid and portable.. The only hard disc I have seen with seamlessly with\nboth Mac and Windows without any problem..I also own a WD and a Sony HD.. They\nboth have given me a lot of problems and have stopped working all together..\nThis has been the best HD I have seen so far...\n\n", "The product is good,i bought it a month back and i find this to be very sleek\nand easy to carry. But getting the 200GB cloud space with One drive os very\ndifficult or next to impossible because Seagate doesn't support you to encase\nthe offer, where as microsoft helps you to the extent where you have to depend\nupon Seagate,they don't revert. I felt cheated by buying this product because\nthe One Drive 200GB is the selling point.\n\n", "I use this for my mac book air. As my mac books internal ssd is 128 gb. This\nexternal hard drive works great for me. I keep all my multi media files and\nvideos that i make for YouTube are stored on this hard drive instead of on my\nmac.\n\n", "Worst product and worst service. I ordered it on 1 august and received it on\n6th august. But on 19 th august it stopped working. Now I am facing many\nproblems to claim warranty.this is the third electronic product I ordered from\nAmazon. But all the three I found to be defective. Got replacement for first\ntwo but this one I am facing many problems to replace. And service of Seagate\nis even worse.\n\n", "I have one of this (blue) and is working well for about 4 - 5 months. I\npurchased one more recently, but found it to be defective using HDTunePro.\nThere was just one bad sector in this brand new HD and i believe its not worth\nkeeping it. I believe we shouldn't be spending our hard earned money in buying\ndefective stuffs.  \n  \nAmazon returns was really quick - have taken it back with no questions asked -\none major advantage is that your money comes back to you as your money and not\nas in e-wallet crap (awful seriously).\n\n", "Loose my all data one time because device got corrupted and I had to replace\nit , wire is very loose also often get disconnected while using even by a\nsimple touch,so I have to careful about not touching while using.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 August 2017", "on 16 April 2016", "on 12 November 2016", "on 10 March 2018", "on 7 July 2016", "on 6 May 2016", "on 22 October 2017", "on 28 August 2016", "on 25 June 2014", "on 30 September 2017"], "reviewer": ["Amazon Customer", "ravi raj", "Deepak", "dhanush", "Edla Emmanuel", "dsm a.", "PRASHANT K", "Deepak", "Wohlthat", "abhishek k."]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Awesome EHDD", "Not working after 5 months", "Excellent product with Disciplined Amazon", "Pathetic Amazon", "Just loved this product", "Simply superb.", "okay", "Worst experience with seagate", "Wonderful product by means of SIZE & SPEED", "HDD won’t work/detected"], "review": ["I'm switched to seagate after my ex-hdd toshiba become completely unusable :(\n, lost so much data, even though i recovered almost from my pc backup, i love\nthis one, i never had any bad experiences with this, this one having\naccidental usb removal policy, so dont worry about it, you should buy one\nproper case to this if you values the data, i prefer Neopack 1BK2 2.5-inch HDD\nCase (Black) combo\n\n", "Please do not buy seagate hard disk in India because it doesn't have any\nservice centers in India except for third parties. Even if you buy this hard\ndisk then please don't save your important files to it without back up. It\nwill stop working all of a sudden.  \nI bought it in January & it worked till June. Suddenly it stopped working & I\nlost all my important data. Data recovery costs minimum Rs. 35,000.\n\n", "Amazon service is great along with a great product by Seagate..Got this\nproduct within 4 days  \nHave to check the data transfer speed yet but it's awesome light weight drive\natleast aesthetically..quite slim n small sized device.. Lots of people\ncomplaining about warranty but I checked my warranty it's 3 years even you\ndon't need to register it just put serial number and site will show your\nwarranty status.I get this device in lightening deal along with 15% cash back\ndeal.Highly recommended .\n\n", "This is the best I can give it to it.  \nIt worked for two weeks...and now ( not even a month from purchase) it is\ncompletely useless piece.  \nAlthough, it is under warranty but now it's my responsibility to get it\nrepaired and Amazon has nothing to do with it.!!\n\n", "Just loved this product. very sleek and slim and light weight too. Aesthetic\nwise i give it 5/5. And even performance wise. SEAGATE has maintained its\nstandards up to the mark. Delivery as usual was prompt and on time. Thanks for\nthis wonderful product and wonderful service by amazon.\n\n", "SEAGATE, the name says it all. I bought the disk at the right time (when my\nlaptop hard disk was about to crash). Backed up all the stuffs. This one\nreally made me worry free. I have been using it for almost a year.  \n  \nPros:  \nOffers very good data transfer rate even if you connect through a usb 2.0\nport.  \nCompact and well designed.  \nVery good case material.  \nHas features like cloud storage, automatic phien backup.  \nCons:  \nRuns little warm if used for 4 or 5 hours together by watching movie or alike\nstuffs.  \n  \nArrived well packed and thanks to amazon.in for the wonderful service. You\nmake things simpler.\n\n", "I was scared it will crash but it hasn't and it's been quite some time. So I\nguess I could recommend it for you to buy.\n\n", "The hard drive went faulty in 15 days. It is completely damaged I do not know\nhow to handle it. I tried contacting seagate but there was no response.\nCloudtale number is nowhere given, there was a lot of data in hard drive and\ndon't know how to have it recovered.  \n  \nNever order anything from seagate, it has the worst customer support.\n\n", "I am shocked seeing the product ,its really small[smaller than smart phone]\n,thin and light weight.But amazon packaging was too bad ,I had a small regret\non that.packing with only a piece of cardboardon other extra covering is\nprovided.  \nNow coming on to the product,we are getting 931GB of storage and it is really\nfast[may be slow down when storage space get occupied]  \nIts built is not at all rigid[poor build quality]eventhough it is a stylish\none. These are showing waranty problems in reviews.I had never checked for\nthat.\n\n", "The HDD will not be detected in windows PC. Not sure what to do with this\nJunk. Why would a PLug n Play HDD require specific drivers to be detected.\nWasted my money on this product and till date unable to use this device.  \n  \nRequest Amazon not to sell such products to India customers without detail of\nits compatibility/system requirement\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 September 2015", "on 9 August 2017", "on 14 September 2015", "on 2 September 2017", "on 12 February 2018", "on 20 August 2015", "on 21 July 2017", "on 23 October 2016", "on 30 June 2016", "on 17 February 2018"], "reviewer": ["Francy C Varghese", "Amazon Customer", "S K Pandey", "Amit", "Rakshith Shetty", "Sangeetha", "Anisha.", "ritika", "Amazon Customer", "SS"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Horribleeeeeeeee", "Digital Inventory", "Nice and compact drive!", "Tiny and reliable HDD for your precious data", "Seagate is one of the best companies known for their hard drives", "Cute, Slim and Awesome product.", "Recorded files/data of CCTV can not be transferred to this ...", "It's the worst anyone can think", "Incorrect product description", "Got a faulty hard drive"], "review": ["I wish i could give 0 rating... i got a defective product.. after replacement\ni again got a defective hard disk.. in my case it worked for first few minutes\nand then stopped working. This type of seller should be banned from selling\nsuch items. Such a bad experience on amazon. I will never buy such items from\namazon.\n\n", "Most effective storage gadget from a reputable brand gives immense relieve.  \nThe capacity is more than sufficient to accommodate all digital inventory,\nsafety  \nand securely. The compact looks add value to the product and can easily fit to\npocket.  \nGreat performance when it been activated, responsive with illumination sign.  \nA personal companion and essential tool to manage self, data and profession.\n\n", "The Seagate Backup Plus was brought by me as a secondary drive for my video\nediting work. The transfer speeds are good and the drive is majorly silent.  \n  \nIt's not as fast as my SSD but it transfer at 150-200Mb/s on most occasions\nwhen multiple transfers are in process. Experience so far so good. Hoping it\nlasts me and secures my data well.\n\n", "Reliable hardware  \n  \nI have been using it as file history and imaging backup for my main dev PC and\nso it must be one atleast 14 hrs a day on all days that I work. Yes I work\nthat long :)  \n  \nThis beauty keeps going without stuttering in the mean time I have gone\nthrough two internal SSD's from kingston.\n\n", "Seagate is one of the best companies known for their hard drives. I have been\nusing this hard-drive for the past 2 years. However, my usage has been quite\nlimited.. I might have used this hard drive hardly more than 40-50 times.\nDuring this time, I realized that gradually the hard-drive micro-usb port\nconnection has gotten loose, leading to frequent disconnections from computer\nas well as one instance of spontaneous conversion to RAW format. A similar\nthing was seen with one of my friend's seagate external hard drive..\n\n", "Small, Slim and a very good product. Amazon delivered it beyond expectations.\nOrdered it evening of 4th Oct'17 and got delivered by 9AM 5th Oct. Product is\nsuper cool, we can set backups of our choice rather than backing up\neverything. Seagate has always been producing wonderful product... this just\nadds to their collections. This is light-weight, easy to carry and data\ntransfer is fast as well. Thank you Amazon and Seagate ! ! !\n\n", "Recorded files/data of CCTV can not be transferred to this device. It do not\nsupport/accept the transferring process. Is there any alternate to make this\ndevice active for receiving recorded files/data from CCTV ?\n\n", "The product has stopped working after few days of use.  \nLight is not coming and can see the usb connected but drive not coming up.\nGoogled and tried all the possible solution including driver installation,\ndisk management issues etc. but nothing worked .  \nIt's the worst anyone can think. Now i fear that data will be lost, the sole\npurpose for which I purchased this product had turned out to be a debacle .  \nAvoid this product.  \nWD passport will be a better choice.\n\n", "Did not get the McAfee antivirus pack as written in the product description.\nAlso, the description says just warranty but not limited warranty. Other than\nthat the drive is functional for now and seems good.\n\n", "The Hard drive is good and light weight. Very portable. But the fact that the\nhard drive is broken makes this review gain 1 star... All what happens when I\nconnect the hard drive is that the light of hard drive gets in and then\nnothing...not even 1 PC could detect this drive...I tried it on Windows 10,\nWindows 7, Windows XP not one PC could detect this drive. One good thing is\nthat they give you extended warranty for 3 years....the replacement for hard\ndrive is on official seagate website...  \n  \nMy verdict: Buy WD instead of Seagate.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 November 2017", "on 4 March 2018", "on 20 January 2018", "on 25 September 2017", "on 14 October 2017", "on 5 October 2017", "on 20 September 2017", "on 15 August 2017", "on 3 January 2018", "on 29 August 2016"], "reviewer": ["Vicks", "Atanu Chatterjee", "Sujoy Shivde", "Arul", "Ankit Jain", "IamMaruthiUjwal", "Abdul Ali Ahmed", "vishnukant", "Manooj", "Nandkumar Adlinge"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["PLEASE DONT BUY IT", "Please don't go for this product", "this seagate 1tb harddisk is very good product.", "Seagate is always the brand to be chose first when ...", "DONOT buy Segate Hard Drives if you want your data SAFE.", "Worst Product", "Seagate!! What you've done to me!!?", "1TB = 931 GB.", "Defective out of the box", "Great hard disk"], "review": ["I had bought a hard disk and its very disappointing to note it stopped working\nafter days.  \nAll my data containing my exam notes are lost and trusting the disk I had not\nkept a copy. It is very frustrating.  \nThis was the 2nd one you replaced. The 1st one was not working from day1  \nI didn't know you recycle and sold these items and cheat customers.\n\n", "Seagate Backup Plus Slim 1TB Portable External Hard Drive with Mobile Device\nBackup (Black) - Please don't go for this product, really not worth. At first\ntime itself, the device was not detected. I have struggled with Accel\nfrontline for warranty claim to get new hard disk because there is no direct\nservice centers for seagate. Again the new hard disk which I got from warranty\nclaim also not working fine. At first time it is detected, from the second\ntime it was not working.\n\n", "this seagate 1tb harddisk is very good product.. i dont know about other\nsellers but i bought it from CLOUDTAIL seller.  \nmy observations are...  \n1,delivery is very fast. i got with in one day and no delivery charges.  \n2\\. i bought it in devali offer sale. i got it fr 4100/-  \n3.before buying i saw many are complaining about warenty, registeration is not\nproper and it is not giving warenty for india as they got produt imported from\nsome other country. but i got it fron CLOUDTAIL seller. igot proper warenty\nregisteration. i got even 1 month extra warenty that is 3year 1month, upto nov\n2019. i bought it in oct 2016.  \n  \n4\\. i think the problem for others is some time when we first register for\nwarenty it shows invalid warrenty for this product (something like that). i\ntoo got same problem while registering. but if we go back and again submit\nwith same detials you will get warenty got successfully. you can try like this\nif facing registeration problem..  \n5.the only negative i observed is packing can be much more better, as these\nare elecrtronic products which needs safety  \n  \nOver all i satisfied with this product. everythig is fine. no heavy\nvibration,no excess heating etc.. thank you AMAZON, CLOUDTAIL(seller).\n\n", "Seagate is always the brand to be chose first when buying external HDD.\nBlindly buy when available in your rates.\n\n", "A complete NO NO.  \nThis product has an epidemic failure.  \nBought this product jest a week back and Read/Write head failed to work.  \nAll my data is lost as Segate is asking almost Rs 50,000 - 60,000 and that\nalso I need to ship my product to some country in Eurpoe on my cost.  \nJust dont buy any Segate product. Most of the SME's in this field have\nconfirmed that Segate has this problem and asked me to keep away from this\nbrand in Future for their poor quality of product and service.  \nDont get carried away with old legacy of Segate.  \nIt is over..\n\n", "It's a pathetic products from Seagate and sold by Amazon. I have used only\n4months and product is failed. Unable to contact Seagate customer care and\nAmazon.\n\n", "I bought the product 10 days ago and I used it for 2 days. It was just great.\nI transferred my big collection of movies into it to make some space in my PC.\nThen I didn't used it till 10th day.. And suddenly after that day when I\nconnect the hard disk to my PC, it stopped working!! I still can't believe why\nthis awesome product is not working at all! It's detecting but showing\nnothing! All my files are stucked and also I can't replace it now! Have to\nsend it to Seagate as under warranty! Hope they'll fix it. Faulty product!\nWhom to blame?! :'( Having 5 year warranty and only 10 days replacement?!!\nAmazon! That's not fair! It should've at least 15-20 days replacement.. Hard\ndisk is not a product that we use daily! Who knows when it'll stop working\nlike that!¡ big loss for users.. Is it a rare case or happening to others\nalso? Or just me!!? Whatever, it should have more days to replace the product!\nPlease do something on it!\n\n", "I got 3 year warranty after registering in the official site. Got the product\nafter a lot of confusion. Very Light weight. Did not got the warranty. Cable\nis too short. Speed in my Lenevo Laptop is 70-80 mbps. Easy to carry in\npocket.\n\n", "Received a defective product but was sealed. Didn't get detected in file\nexplorer but was in device manager. Can't expect something like that from a\nbrand like this. But wd elements is lot smaller and looks much good compared\nto this one.\n\n", "Superb hard disk with USB 3.0 option. It easily connected with my phone (Sony\nXperia z2) using otg cable\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 October 2017", "on 7 March 2018", "on 9 November 2016", "on 4 March 2018", "on 1 November 2017", "on 5 September 2017", "on 11 July 2016", "on 26 February 2018", "on 15 September 2016", "on 14 May 2016"], "reviewer": ["Maria Scaria", "Amazon Customer", "venkat vaduru", "Tushar Kathrecha", "Kumar Dev", "NAVEEN G PATIL", "changchen09", "Hemanta Saikia", "Amazon Customer", "Vignesh"]},
{"rating": ["1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["samsung hard disk put in to seagate and sold. ...", "SeagateToolkit.exe does not download and install rendering auto backup useless.", "Its seagate...isn't that enough :)", "Terrible experience at service centre", "Simply good.. Copying speed is about 25 mbps", "I prefer this is the best.", "Genuine and really good product", "Many statements claimed by segate is false..", "Got few hours before...Satisfied with the product..", "Four Stars"], "review": ["samsung hard disk put in to seagate and sold. it was to my surprise .not\nworking and all data values lost. mere cheating. we purchsed as it shown\nseagate. and inside ist is samsung hard disk\n\n", "(1) Start_Here_Win does not autorun (2) despite numerous download and\ninstallation attempts SeagateToolkit.exe does not install rendering auto\nbackup useless (3) Support page states \"No firmware found for this Sr. No.\"\n(4) page to check \"warranty\" cannot be accessed\n\n", "This was my 3rd external HDD and second seagate HDD.  \nIts good as we expect from seagate.  \nGood thing is, seagate drives will work without formating in Macbooks. You\njust need to install their official driver once in your mac. This is what\nlacking in other brands. But for windows and Linux users this should not be a\ndeal breaker.\n\n", "I bought this product one month back and moved entire data from my pc. Two\ndays back,it stopped working without a proper reason.w hen it is connected to\nPC ,light was not blinking. I went to nearest service centre.Their response\nwas even worse. Without even asking the problem,they offered me\nreplacement.The small sacrifice they asked me to make was TO FORGET THE DATA\nOF LAST 12 YEARS!!  \n  \nI asked them to check the cable, but they said they have no responsibility to\ndo service,they can only replace stuffs(yet they call themselves as a service\ncentre)  \nI can simply throw this away..but iam totally worried abt my data\n\n", "Simply good..but it has some problems like so,etimes its not showing, cant\ninstall the driver,always shows to format the disk!  \nCopying speed is about 30-33mbps..  \nBut if u r using for long time like 1-2hrs then I become heated little bit.  \nSize is small and thin.\n\n", "Below are my views on my new Seagate Backup Plus Slim 1TB.  \n  \n1\\. The harddisk is packed properly  \n2\\. No Problem in registering the product.  \n3\\. Its working on my Windows 10.  \n4\\. It is easy to carry.  \n5\\. The transfer speed from lappy to disk is 25 Mbps. Transferred 10GB within\n10 mins.  \n  \nCons:  \n1\\. When I am connecting to my lappy (windows 10), then all the icons\n(folders, files and shortcuts) are displayed in white colour for some time.  \n2\\. When I am connecting to my TV then TV is got hang.\n\n", "The hard drive was easily registered on the Seagate's website and there was no\nproblem on that part. This is to clarify the impression being created by the\nreviews that the product is fake. I ordered it a month ago and it has been\nworking perfectly fine. The hard drive is sleek and stylish and very fast.  \nI believe there is no reason to be sceptical about the warranty or\nregistration as Amazon guarantees the genuineness of the product and it can be\nreturned if any such issue is faced. I am very happy with the product because\nI got it at competitive rates as compared to other sites and it was delivered\nwithin a day. Very satisfied from the product.\n\n", "I bought this hard disk before 4 days, the main issue with it is -  \n1- Getting heated,  \n2- Not getting connected to andriod phone though it's stated that it supports\nto android version 4.4above  \n3 -Slow transfer rate,  \nAnd it's made in China but my neighbours hard disk in from made in Taiwan for\nsame brand , same price and same colour model..  \nSo I hope somebodys replay for this replay for this..  \nAnd check for few more days..\n\n", "Got it for Rs.3999 (from festival sale). Its great.. Price is low when\ncompared to other websites. But the packaging was not good. Just a sheet like\nthing is used no boxes was used. The product was good and new and it is just\nmanufactured a month ago. Its with new logo in which Seagate changed few\nmonths back. The speed is maximum of 86 mb...but mostly it is around 75 mb..\nwhich is little less when compared with transcend and wd elements bcz they\nboth will be around 80- 85 mb mostly. And too the speed reduces to 30 for few\nseconds.. I dont know why it is like that.The drive is too small than i\nexpected...Registeration of the product is quite easy. A slight disturbance\nwill dusconnect the drive from computer. It is getting heated after usage of\n20 minutes.. I think it is common. After registering the warranty is 3 years\nand 2 months. Very happy with this. Keep it safe using HDD protector. Length\nof the cable is small.\n\n", "WD is a better option. But this is good enough. Win 7 systems give driver\nissues sometimes.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 November 2017", "on 15 March 2018", "on 15 November 2015", "on 19 September 2016", "on 29 June 2017", "on 14 September 2015", "on 20 July 2016", "on 14 March 2016", "on 19 October 2015", "on 27 September 2017"], "reviewer": ["shankar", "viztech", "Vinay Dwivedi", "Dileep k", "Dipanjan Polley", "rakesh", "Aditya", "Masterlook", "MOHAMED ASIK", "AT"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["not because the prev ones go bad but because i need more space for storage", "BE CAREFUL ,decent external hdd from seagate", "Drive not working after only a few days of usage", "I had a bad experience with it", "Amazing product", "Amazingly nice 10/10 1) black color is classy 2) very sleek ...", "Review after more than 2 years of use.", "Shabby packaging... Product seems awesome.", "Awesome amazon", "Worth to buy good quality product."], "review": ["This is my 3 or fourth hard disk, not because the prev ones go bad but because\ni need more space for storage. This one is slim and light and the second time\ni am buying this model.\n\n", "I ordered this product around 11 am on the 10th Jan. and it got delivered next\nday within 24 hours around 11 am. I was pretty desperate for it too.  \nWell, I immediately transfered 47 GB and it took 40 minutes at speed 20mb/sec  \nMy PC USB port 2.0, Seagate comes with 3.0.  \n  \nthen again tranfered 39 GB, it took 32 mins, 54 GB it took 47mins and 7.5GB it\ntook 6 mins  \ntransfer speed being around 21mb/sec throughout.  \n  \nUSB cable that comes with it is not that too short as read here. Its about\nhalf a meter long with the device connected. Well suitabe for PCs too.  \n  \n1TB but actual storage or capacity shows 931GB (69 GB Short?)  \n  \nPreviously, I ordered 16GB memory card from flipkart and I got it withi 48\nhours (Collapse)  \n  \nWas this review helpful?\n\n", "it worked only few days and now the drive is not detecting  \nnow all my data is lost i tried recover from the seagate tools it is not\nworking either  \ni have raised service request to seagate and couriered the faulty drive to\nseagate still waiting for replacement  \npreviously i had 2 WD drives from past 3 years and did not have any problem\nwith them till now.\n\n", "I had a bad experience with it. Returned it after 2 days of use. When I was\nbacking up my 300 gb drive to it, after an hour it became extremely hot and\nthe transfer speeds literally dropped to as low as 0 kbps and didn't go beyond\n100 kbps at max. I removed it let it cool down and tried again but to no use.\nTo be honest the drive is slim and looks beautiful in pictures and in hand too\nbut it is really flimsy. It feels cheap and you can actually feel the plastic\nbending. Maybe it will work for you but didn't work for me. I have seen WD's\nUltra passport and that felt very sturdy than this one.\n\n", "Wow. Nice device. Great speed. Support computer, mobile and led tv. And\ndelivery also fast.  \nI can say Seagate is best and his service is also best. Seagate gives 3 years\nwarranty and if your hard disk fail to read or any other problem.. they help\nand replace it. Love you Seagate.\n\n", "Amazingly nice  \n10/10  \n1) black color is classy  \n2) very sleek and thin  \n3) weight is like feather  \n4) speed is awesome  \n5) space is massy  \n6) cost is apt  \n7) delivery is before time  \n8) packing was nice  \n9) Portable  \n10) Amazone is awesome  \nWhat else one need. Go for it guys\n\n", "My best purchase in Electronics ever! Very slim and compact design. The\nmetallic look is just awesome. It is easily the fastest one out there. I went\nfor the same model but with 2TB size for my second portable HDD.  \nThe cable that comes in the box is not fast. Buy a cable from storite if you\nwant the maximum speed.  \n  \nSPEED:  \nWith seagate cable : Read 70-80 MBps. Write 45-60 MBps.  \n  \nWith storite cable: Read 100-110 MBps. Write 70-80 MBps.\n\n", "Packaging was below standards. I was sceptical to even receive the product.\nJust a layer of plastic wrap on doesn't ensure safety of the product. Other\nsites have really great packing. Also the product has old logo of seagate.\nLogo was updated this year but it seems that the product was manufactured\nbefore. But doesn't matter as the specifications are same with just logo\nchange.  \nThe product is very slim and small. Speed is also good. Got it over lightning\ndeal at 3999/- from cloudtail.\n\n", "Ordered on 5th sep 2017 at 4099rs delivered on 8th sep 2017.  \n  \nNice product, slim, 931gb space avail out of the box, usb 3  \n  \nRegistered at seagate website and got warranty valid upto 11th nov 2020.\n\n", "Good quality product. Small and slim but not very slim. Seagate is worth\nbuying for long term. Average price rate.  \nPerformance ⭐⭐⭐⭐⭐  \nQuality. ⭐⭐⭐⭐⭐  \nPrice. ⭐⭐⭐  \nMobility and ⭐⭐⭐⭐  \nDesign  \nIt is preferable to buy case for Ext HDD.  \nI hope this review will help you guys.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 September 2017", "on 28 June 2014", "on 20 November 2014", "on 13 December 2016", "on 21 October 2016", "on 21 March 2018", "on 7 February 2017", "on 11 September 2015", "on 10 September 2017", "on 28 September 2017"], "reviewer": ["Amazon Customer", "VISHWAJEET KUMAR", "Chowdary", "Navjit Singh", "Neeraj chawre", "SB", "Shantanu T.", "Arjun", "Shriniwas", "Akshay"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Stopped working", "... mentioned as certified on the hard disk it's very bad on this", "Complete Disappointment...", "Dont buy this product", "Didn't find the free anti virus in the pack. ...", "Great external storage device", "Defective product", "Freezes and you are gone", "I love it!", "This is very bad product I got from Amazon this type of cheating ..."], "review": ["Stopped working from 2nd time, Harddist not detected in computer even light is\nnot blinking\n\n", "Within two months got repair after going to service centre they gave me\nanother one which is used by others and mentioned as certified on the hard\ndisk it's very bad on this ...... waste of time and waste of money I suggest\nnot to buy this product\n\n", "Don't buy this product. The harddisk has stopped working in a couple of months\ntime. Its not getting detected in any laptop now. I had backed up some data in\nit and now there is no way I can get it back as its just not getting detected\nby any laptop. I worked fine for a couple of times and then stopped. I read\nmany reviews with the same issue. How can Amazon allow to sell such\ncounterfiet product. My buying experience with Amazon is getting worse by the\nday.\n\n", "I gifted this product to my husband for his birthday. We used it well for\nabout an year and post which it stopped working all of a sudden.  \nWhen we took the product to service center and they said nothing can be done\nif its not detecting. Disappointed with this product and not worth investing\nmoney. Pls dont buy this.\n\n", "Didn't find the free anti virus in the pack. Called Mcafee on number mentioned\nin description. No not valid. Warranty is for 3 years, when registered online\nwarranty came till Nov 2020, whereas product bought in Dec 2017 and registered\nin Jan 2018.\n\n", "Using it for around 6 months but till now didn't come across any issue.  \n\\- It's lightweight.  \n\\- Fast I/O speed as 3.0 USB supported.  \n\\- Pricing is ok, you didn't gonna get any better in 3.8k around.  \n\\- Better than WD I must say because I also used WD hard disk which is quiet\nheavy than this comparatively plus a thick than this for the same price.\n\n", "the product worked fine for a month and then it suddenly died in middle of\nwork all my hundreds of hours of data stored in it is gone and the data to\nrecover costs 600$ to recover which is ridiculous.I never manhandled the drive\neven though this happened my WD drive works fine even after 2 years. THANKYOU\nseagate for releasing such an amazing defective product.\n\n", "Seagate Backup Plus Slim 1TB Portable External Hard Drive with 200GB of Cloud\nStorage & Mobile Device Backup (Black) This is pathetic. This external drive\nperfectly for about a month as if it was waiting for the replacement policy to\nexpire. Every time I plug in this drive, it freezes my Mac, can't copy files.\nI have tries formatting it and literally everything. Searched the forums and\nthere are posted so many number of similar posts their. Don't go for it.\n\n", "I love it !!!  \n  \n1\\. Delivered in 2 days, Wowww!!!!  \n2\\. Product Quality is very good.  \n3\\. Easy way to register in seagate.com.  \n4\\. Got 3 years warranty in Seagate.com.  \n5\\. Transfered my data to my Seagate within 15 mins around 65 GB- Speed\n111Mbps  \n6\\. Over all am satisfied with my Seagate prduct and USB cable.  \n7\\. Packing was good us usual with bubble packing!!  \n8\\. Looking good, slim and weightless  \n9\\. USB cable is also good quality,  \n10\\. Worth for 4050/-\n\n", "I got faulty product. When first time I connect it to my desktop & laptop it\ntakes a long time to install driver after that nothing happened. Now when I\ntry to connect it even don't detect. This is very bad product I got from\nAmazon this type of cheating is not expected from you. I will never recommend\nthis product from Amazon to any of my friend and relatives. Now I can't return\nthis product as I have to return in 10days. As my laptop was not in working\ncondition that time so I could not check the product. I thought may be the\nport issue on my old desktop (dell workstation) so I wait for my laptop but it\ndidn't worked for me.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 September 2017", "on 17 July 2017", "on 20 February 2017", "on 13 December 2017", "on 5 January 2018", "on 10 March 2018", "on 24 December 2017", "on 22 February 2016", "on 16 October 2015", "on 16 August 2016"], "reviewer": ["Swaroop V.", "Amazon Customer", "Amazon Customer", "av", "Amazon Customer", "Rahul", "chanakya", "Shubham Aggarwal", "Amazon Customer", "Amazon Customer"]}
]