[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best trimmer, even better than Philips QT4011/15", "IT LET ME LOOK LIKE A CELEBRITY", "HONEST AND DEEP REVIEW", "... seal was broken and the packing was also not good. their were hairs on the packing", "Buy this product if you have limited budget. Currently using from laat 1 year", "Very satisfied with the speedy delivery items in the box", "REVIEW AFTER ONE YEAR USAGE....", "One Star", "Adequate trimmer. Holds charge for a few hours, only a few parts to keep track of.", "Best Trimmer"], "review": ["The best trimmer you can buy. It's convenient, safe, lasts long and costs\nright.  \n  \nFull review below:  \n  \nPros:  \n-Lasts 45mins with one charge so you can use it multiple times by changing once.  \n-The dial has 1-10 adjustable cover. You can't ask for more. 1 and 2 trim hair pretty clean so if you are trying to trim head hair first time, try it at around 5.  \n-You can open the cover and wash it in water very easily. The cover opens by slightly pressing it and pushing upwards. It's not very tight but also not loose that it might open during use.  \n-The sound is very less compared to other trimmers. You don't want a monstrous sounding machine to roll over your head, do you?  \n-Easy to handle. The body of trimmer is designed so well that it feels good to even hold it.  \n-Looks gentle. I know it doesn't matter much how your trimmer looks but still, it looks gentle. Unlike other monster looking ones.  \n  \nCons:  \n-There's no pouch for it in the box.  \n  \nHow is it better than QT4011/15?  \n-Because only features in QT4011/15 more than this is more dial points in middle of every number. For example there's 0.5, 1.5, 2.5 and so on which is unnecessary. Honestly, you won't need more than 1 to 10.  \n-QT4011/15 lasts 15 minutes extra. I don't think that'll influence much because the price of that is almost double.  \n-The only pro of QT4011/15 is that it comes with a pouch.  \n  \nHope this review helps in your buying decision.\n\n", "I got a new look from this product which is at best price.Experiment and wear\na new look every day when you bring home the Philips QT4000 beard trimmer. The\nstainless steel blade and ergonomic design make it your shaving partner for a\nlong time to come. Comfortable to use the black trimmer comes with rounded\nblade tips ensuring smooth contact with your skin. This skin friendly feature\nalso prevents any irritation or burning sensation. There is also a non\nscratching teeth, which ensures greater comfort and easiness. Try out\ndifferent designs and styles every day from the comfort of your home. It comes\nwith zoomring, using which you can easily adjust the length, the way you want.\nEasy to select, it has lock-in settings between 1-10 mm. If you want that\nperfect, clean shaven look and feel, opt for 1 mm precision settings and\nstubble comb. This comb is designed for more closeness and precision. It also\nhas secured length settings feature, making it easy to use. Comfortable to\nuse, the best beard trimmer, for men has an easy grip handle. After using it,\ncleaning this beard trimmer is easy. It comes with a detachable head, which\nyou should clean after every use, maintaining proper hygiene and care.\nEquipped with AAA Ni-MH battery, it takes about 10 hours to charge. Once it is\ncompletely charge, you can use it for up to 35 minutes. Other features include\non-plug charge indication, cordless design and 100-240 V power requirement.\nThis Philips beard trimmer black can be a perfect grooming tool for all men.  \n  \nSo was this review helpful to you please let me know\n\n", "Hello friends  \nPhilips QT4000/15 and QT4001/15 pro skin Advanced Trimmer are exactly same,\n(there may be minor upgrades in QT4001/15). I am writing this review for\nPhilips QT4001/15 Pro Skin Advanced Trimmer, I bought this product on 21 June\n2016.  \nIn initials the product was charged I think 50 % of its battery. I would like\nto mention that before this order I was using Nova Nh1080 (the one which says\nhas titanium blades). It was good for me back then used it for couple of\nmonths and then one day when I removed my blades and I was cleaning them, a\npart inside where the blades mount broke, for where the bad days started I\nstarted using it with rubber bands and then I decided to visit the customer\ncare as it says it has 2 Yrs warranty. I called the customer care and I said I\nhave a nova timer which I bought online can it be repaired, the guy told me\nthey don't repair products, I said aren't you from nova care he said I am but\nwe don't deal with trimmer repairs. I searched nova care in my vicinity,\ncalled them no one replied. So the 2yrs warranty is just an eye candy for the\nbuyers online. What else everyone wants - drop the price and say it has 2 yrs\nwarranty, decent looking rating(cuz people rate the product the moment they\nopen it (and forgets all that glitters is not gold), somewhat positive\ncomments(by nova Company workers themselves) why will any opt. for any other\nproduct.  \n  \nNow to the product itself, here it's been 6 months since I bought it on\nAmazon. I think you get 10 days return/refund policy.  \n  \nThe trimmer has more power than the nova I mentioned earlier cuts the beard in\na jiffy. Looks premium in hands nice design, looks are sturdy. The blades are\ngood you won't feel the cutting action. Yes, they are very little but louder\nthan the nova. They have a dedicated service center, I checked that out and\nwhen you register the product online you get an extended one year warranty I.e\n2+1 = 3 years.  \nThey are better than nova, you might spend a little more, but you won't have\nto buy any trimmer for the next 3 years and that does save money (instead of\nbuying nova than it stops functioning after months, your trust is gone with\nnova then you buy other brands)  \nSo that was my review and I want to mention that I am not paid by nova nor\nPhillips itself, I am just another online shopper who is in the league of \"Top\n120 reviewers in Amazon''.  \n  \nI am providing you with pictures below as pictures say a thousand words oh\nactually I wrote more than that :). I feel this way you can still buy nova if\nyou want.  \n  \n[...]  \n.THANK YOU  \n  \nCOMPARE BEFORE YOU BUY. Enjoy\n\n", "The seal was broken and the packing was also not good.their were hairs on the\npacking. I think it was used by someone before delivering me.  \nThis was not expected from Amazon.a good product with a bad delivery.not\ngiving 5 star gor delivery issue.\n\n", "Satisfied with the speedy delivery by amazon.  \nItems in the box : Cleaning Brush, Comb Attachment, User Manual, Charger, Main\n& Unit.  \n  \nPros:  \n1) Battery backup is good comparable to old models of  \nPhilips Trimmers.  \n2) Adjustable trimmer head.  \n3) Blades of the trimmer are round in shape so no cuts & Blood.  \n4) Slim design & easy to hold.  \n5) No need of oiling.  \n6) 3 Years Warranty (2yrs 1 Yr on Philips Website  \nRegistration)  \n  \nCons:  \n1) A little too much noise than expected.  \n2) No indicator on the trimmer to know whether it is charging or  \nnot. (Charger has the indicator which is half way better).  \n3) Takes Excess Time To Charge it full. (i.e.10 Hours)  \n  \n👉Suggestion to Philips👈  \nPlease Provide a Cover of Traveling Purpose for Trimmer that  \nwould be very handy for us to use.\n\n", "Very satisfied with the speedy delivery  \nitems in the box :Cleaning Brush,User Manual, Charger, Main Unit.  \n  \nThere are minor differences between QT4001/15 and QT4005/15. You can buy this\nproduct over that. Only difference is the precision and discharging time.  \nPhilips products are overall good & genuine there products quality was also\ngood..they are giving 2years warranty in products as well as on-site\nregistration 1year extend warranty..  \n10 settings provide ample support for everyone to trim how they like...  \nOn full charge provides output of almost 40 min...  \n  \nPROS  \n1) Battery backup is good comparable to old models of Philips Trimmers.  \n2) Adjustable trimmer head.  \n3) Blades of the trimmer are round in shape so no cuts & Blood.  \n4) Slim design & easy to hold  \n5) No need of oiling.  \n6) 3 Years Warranty (2yrs 1 Yr on Philips Website Registration)  \nC0NS:  \n1)A little too much noise than expected.  \n2)No indicator on the trimmer to know whether it is charging or not.(Charger\nhas the indicator which is half way better\n\n", "I am using this trimmer for more than a year.  \nI am impressed by its performance and battery backup.  \nIts skin friendly and after 10 hours of charging ,you can use the trimmer for\n45 mins but the charge will be stored for about one month.  \nIt has 10 types for adjustments ranging from 1 mm to 10 mm.  \nIts very easy to hold and easy to open the blades and get it clean.  \nFOR BETTER BATTERY BACK UP FOLLOW THIS.  \nCharge your trimmer only when the charge is completely drained out.  \nDon't charge your trimmer always even when the charge is there.  \nIF U FOUND THIS REVIEW HELPFUL PLEASE MARK IT AS HELPFUL.  \nTHANK YOU .\n\n", "Received this in a torn pack with No trimmer inside. Only charger was present\n\n", "It's a nice trimmer. When I was shopping around on here, I was mainly\nconcentrating on device maintenance and the versatility of the device without\nan army of additional attachments. For me, I use a few different settings to\ntrim my beard, longer on my face, closer on the moustache, no guard for\nshaping. And this thing does a good job. The guard feels fairly stout, like it\nwon't be giving out or cracking anytime soon. The device doesn't appear to be\noverly needy or anything like that, though the instruction manual for any\ntrimmer will essentially recommend you give the thing a full spa treatment and\ndinner out at The Palm before and after each use. Very quick charge, one hour\nwill turn the light solid green which (allegedly) will last for two hours of\nuse, though I haven't tested that yet. If all that turns out to be true (and\nit did fully charge within one hour), I don't think you can get better than\nthat in terms of charge vs. usage. Anyway, the rotating dial that adjusts the\nguard is fine, certainly nothing to freak about in terms of innovation. Just a\nlittle gimmick thing. I guess more than anything the motor on the thing just\nreally tears, so you feel like you're getting a good cut.  \n  \nIt's just a nice device, perhaps a little heavy on the price at Rs1.5k, but\nquite honestly, you don't have to buy trimmers very often in my experience.\nAre you going to regret dropping Rs1.5k on a device that directly impacts how\nyou like to look and will probably not have to replace for the next five\nyears? Personally, I doubt it. I think there's definite value in the long run.\nI have no problem cutting corners or going cheap on plenty of other stuff, but\nwhy on a beard trimmer? Just seems short-sighted when you're going to use the\nthing at least a few times a month and on your face.Buy it from Adityau\n.com/14 to get 10% Instant Cashback  \n  \nOh, and the last thing about this thing that I really like is the lack of\nattachments. It's just one guard/comb trimmer with 20 settings, one mini brush\nthing for cleaning it, the power cord, and one little bag if you want to use\nit. I think that's pretty great streamlining, especially if you travel. No one\nwants to pack like they're going to a barber's convention.\n\n", "As market have to many trimmer ,but the product from Phillips are the best\n,well this trimmer is best in working ,have an best body and shape and\ncharging capacity overall it is an all rounder ,I really prefer this trimmer\nover all others ,the material used in trimmer is best so the quality , and the\ndelivery of an Amazon is as usual best .\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 February 2018", "on 10 December 2017", "on 22 January 2017", "on 26 January 2018", "on 11 March 2018", "on 4 October 2017", "on 20 February 2017", "on 13 July 2017", "on 5 March 2017", "on 22 March 2018"], "reviewer": ["Samit", "Keshav", "Worth It Reviews", "Shaunak Surendra Khandare", "Kumar Rahul ( So.called.philosopher )", "LEO OOMMEN KURIAN", "Kapil", "Amazon Customer", "UrIndianCustomer", "Sanket"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Worth every penny spent on it, Dont think much just buy.", "Good", "Philps trimer are good", "Always prefer #Philips", "Worst packing", "Very Happy!!", "Very good product...", "I am very disappointed with the packing", "Five Stars", "very very very good product Amazon"], "review": ["This trimmer works tremendously fanatastic. I bet, You won't regret after\nbuying and using this.  \nHere is my review after using it for 2 years.  \n  \nAdvantages- Looks wise it's superb, Blue-black color combination is the\nperfect.  \n\\- The feature that catches everyone's eye is Rotating wheel to increase the\nlength of the comb, you can simply adjust yourself on your depndinh and needs.  \n\\- You can also remove the comb if you wish and believe me It doesn't hurt you\nat all like other cheap brand trimmer does. It provides you the zero shaving\nas possible.  \n\\- You can simply register your trimmer on philips' official website and can\navail your warranty. In my case I got two years + one year extended warrenty.  \n  \nDisadvantages - If a led light or an indicator have provided, it would be easy\nto know weither it is full charged or not.  \n\\- Well charging time and discharging time never bothered me much but when we\nsee it in instructions it scarifies you first that you will have to charge 10\nhours to get 45 minutes of working.  \n\\- There is no any other cons that I found so far in two years.  \nHope this will help you out, Thanks.\n\n", "A satisfying product coz I was nt dat sure about how I would receive the\nproduct bt it was an amazing product\n\n", "More than good and working fastly and processr are and mindbloind code system\n\n", "All my electronics are by Philips loved it with this love i purchased this\ntrimmer fully satisfied full paisaa vasul got it in amazon great indain sale\nwith 35% discount loved Amazon great Indian sale and Philips\n\n", "Product is good\n\n", "As always, it’s a Philips promise....  \nAwesomely good product with a very low humming sound and the detachable part\nis ergonomic so much so that you’ll never find it difficult to clean, wash or\nhandle it while traveling or finding a place in your bag.  \nThe battery backup is like never before phenomenon for it gives a full hour\nbackup with minimum 4 hours charging. The best part is that, it is available\nto you at a pocket friendly price. This product made me happy.  \n  \nOn comparing it with my last trimmer,  \nAn year back I bought a trimmer almost double the price of this one of the\nsame Philips company but that one proved a trouble to me. Just after six\nmonths it sounded like a tractor and the detachable part got loose. It was\ntotally a menace. I wrote a review for that too, I don’t remember the model\nnumber of that and actually I don’t even want to....  \n  \nI say go ahead and it’ll not disappoint you....\n\n", "Nice product but packing is not good\n\n", "I am very disappointed with the packing.  \nThe box of the trimmer was already opened and that was really not acceptable.  \nHowever i have not initiated the replacement but i am very disappointed.  \nThis is very very worst thing.\n\n", "It's a good product.....\n\n", "Great product and good quality product  \nAll of you purchase this one better future\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 March 2018", "on 15 October 2017", "on 16 November 2017", "on 10 August 2017", "on 25 December 2017", "on 22 January 2018", "on 26 November 2017", "on 20 July 2017", "on 10 December 2017", "on 25 October 2017"], "reviewer": ["Harish Gaur", "Ranjeeth", "hanuman singh", "Ravi Kumar", "Mohit Batra", "Abhinav Sharma", "Kalpesh Lote", "Amazon Customer", "Deepanshu", "P Obulesu"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Four Stars", "Four Stars", "Four Stars", "Doesn't sound like original", "Three Stars", "I think its already been used ...feels hateful about amazon", "Box was open", "Great product", "Awesome trimmer ever Used", "Ok with no charge indicator"], "review": ["4 star just bcoz of product but the packaging was came torn\n\n", "All good...but didn't like the packaging of the product ... It\n\n", "Good\n\n", "Doesn't sound like a original packing... the packing was way too different\nthan the one shown in the website... doubt if the product is original.... no\nwarranty card seen. No travel pouch inside the packing as shown in picture...\n\n", "Trimmer is good and working condition but packaging worst\n\n", "I just opened it now...i haven't used it yet...but the packing from Amazon was\nreally mannerless\n\n", "The package was torn. See the attached picture.\n\n", "Very good product from Philips 10 different settings make it Professional\ntrimmer battery back is great and very good charger and price also cheap .\ninbox charger trimmer 2 years guarantee card and information manual card\n\n", "Pro Skin Advanced Trimmer:- The most convenient way to start with your beard:-\n1mm precision settings Stainless steel blades 10h charge/45mins cordless use\nEasy to select and lock-in length settings, 1-10 mm Easy to select and lock-in\nlength settings, 1-10 mm Turn the wheel to simply select and lock-in the\nlength settings you want: from a short beard of 1 mm up to a full beard of\n10mm, in precise 1mm steps. 1mm precision1mm precision Set the trimmer at the\nlowest position for a perfect 3-day beard, just 1mm long. Skin-friendly\nrounded tips for smooth skin contact Skin-friendly rounded tips for smooth\nskin contact Blades stay extra-sharp to always cut hairs neatly and\neffectively, but have rounded blade tips and combs to prevent irritation.\nDetacheable head for easy cleaning. Detacheable head for easy cleaning Detach\nthe head and rinse it under the tap for easy cleaning. Dry it before you put\nit back on the appliance. Ergonomic design for easier handling. Easy to hold\nand use, it’s designed to help you trim those hard-to-reach areas. 2 year\nguarantee, worldwide voltage, no oil needed . All of our grooming products are\nbuilt to last. Up to 45 minutes charging and cordless power for 10 hours .\nthis product is really value for money. I have also used it and recommending\nyou to also buy it.\n\n", "Package is not good , dont know whether it is courier issue or it is not\npacked properly  \n  \nNo charge indicator On trimmer so need to be carefull Dont know whether it is\ncharged or not working simply keep and wait for 10hrs to see\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 January 2018", "on 18 January 2018", "on 28 February 2018", "on 26 September 2017", "on 23 January 2018", "on 20 December 2017", "on 21 January 2018", "on 30 September 2017", "on 6 September 2017", "on 21 August 2017"], "reviewer": ["harsh g.", "Yash kesarwani", "Amazon Customer", "Amazon Customer", "Amazon Customer", "rahul", "Earl", "MANDEEP KUMAR", "Pritam Deka", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Seller packaging was not upto the mark", "Four Stars", "Good product but....", "Four Stars", "Looking good", "Satisfied with this product😄👍", "worst product packaging from the Seller", "Nice and afodable product from Amazon", "One Star", "Five Stars"], "review": ["Came in an original , without much protection or packaging... Was opened and\ntorn ( the box ) , product is user friendly and comfortable to use.. 5 star to\nPhilips and 2 star to seller\n\n", "Nice product.. I am very happy\n\n", "The product is very good ...but the condition of package was worst when\nreceived...it was already opened nd also teared by some places...\n\n", "\n\n", "It's a nice product. Good looking. But deep trimming is not possible.\n\n", "Supperb product.bindass purchase kro. Satisfied with this product😄👍\n\n", "worst product packaging from the Seller  \nPhilips Product r as good as always\n\n", "Good product from Amazon.. but charging time is 10 hour an use only 45 minutes\n😥😥..\n\n", "without comb best but with comb terrible... I am frustrated.\n\n", "Awesome trimmer\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 August 2017", "on 31 December 2017", "on 22 October 2017", "on 21 January 2018", "on 4 December 2017", "on 19 December 2017", "on 28 November 2017", "on 14 November 2017", "on 8 December 2017", "on 9 January 2018"], "reviewer": ["Monideep Gupta", "Nuapada", "Amazon Customer", "mukesh k.", "AKASH", "rohit tamboli", "Lohith Devajana", "Sk mehatab ali", "Neeraj K Gedam", "Mukesh saini"]},
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Product delivery defect", "Worth your money.", "Product is fine . Packaging quality worse than worst", "Three Stars", "Originally product", "Four Stars", "Excellent quality. Trustable brand philips. Loving it", "Packing condition of product is very bad. stainless steel blade is also not available with ...", "Very disappointed with packaging", "very good product. but parking were not good"], "review": ["Product is good but the packaging if the product is not protected total\nproduct box has been damanaged\n\n", "Delivery on time. Good packaging.  \nAnd a good piece of trimmer in affordable price range.  \nConvenient,easy and smooth.\n\n", "Product is good but the package It was kept in was awful and the pic proves it\n.  \nRest all is fine .  \nI checked the product thrice to cross examine it's authenticity .  \nTime for Amazon to wake up .\n\n", "Product was good but box is in very bad condition and the seal is opened\n\n", "I have received I fall in love this product it's original product\n\n", "Product is good but packaging is poor....\n\n", "Great product. As described nd as expected. Used as soon as i got this and it\nwas charged nd was smooth. Awesome product,with amazon prime benefits, should\nbuy.\n\n", "Packing condition of product is very bad.stainless steel blade is also not\navailable with this product.\n\n", "Very disappointed with the packaging :(  \nBut Product is working fine.\n\n", "very good product.but parking were not good\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 March 2018", "on 5 March 2018", "on 25 November 2017", "on 5 March 2018", "on 7 March 2018", "on 21 March 2018", "on 27 December 2017", "on 6 February 2018", "on 26 February 2018", "on 14 March 2018"], "reviewer": ["Amazon Customer", "aman p.", "DIVYANSHU pandey", "Karan sharma", "rakesh shahu", "Zeba parveen", "RAVI BHâKåL", "Poonam jadhav", "JK93", "Raviteja.k "]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Nice product from Philips", "Three Stars", "Two Stars", "Worst Service", "Superb for weekly use!!", "Good", "Best product", "Blade is not long lasting....", "Five Stars", "Don't  thinking"], "review": ["The trimmer is really good. You can't use it while it is charging\n\n", "Product delivered without guarantee card\n\n", "It does trim not only hair but skin too\n\n", "Packaged got damaged. All parts (trimmer, charger and cleaning brush) not in\nthe Philips box, it's within the courier cover. So it's all ok like a already\nopened item\n\n", "Superb.. Worth it\n\n", "Good product\n\n", "Awesome product  \nGo for it  \nThnks amazon\n\n", "Blade of this type philps trimmer will not wtking after 2 years....even with\n2k above priced philps trimmer also have the same problm....\n\n", "Awesome trimmer skin friendly.\n\n", "Best quality\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 October 2017", "on 13 July 2017", "on 24 May 2017", "on 16 August 2017", "on 27 November 2017", "on 30 November 2017", "on 4 November 2017", "on 2 March 2018", "on 15 November 2017", "on 17 November 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "Amazon Customer", "Prakash", "CT", "Kumaraswamy SV", "Ajay kushwaha", "abu", "Amazon Customer", "John Robert"]},
{"rating": ["1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["torned packaging, not even user manual in it..", "Two Stars", "One Star", "Awesome purchase", "Damaged product i received", "Two Stars", "I checked the product it's working good but the packet inside was opened condition", "good product by amazon but packaging is not good", "Four Stars", "Good product."], "review": ["Waste of money..It looks like a used one.\n\n", "Machine good but Packings is very bad\n\n", "Poor quality of packing no protection from damage\n\n", "\n\n", "\n\n", "This is the condition I received this trimmer...\n\n", "I received the Product with 24hrs.I checked the product it's working good but\nthe packet inside was opened condition.Hope that it might have been shown to\nother Customers for operation only\n\n", "good product by amazon  \nbut packaging is not good\n\n", "Good but not be zero size trims\n\n", "value for money but it usefull with out comb. With comb not good.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 March 2018", "on 24 February 2018", "on 20 February 2018", "on 25 March 2018", "on 24 March 2018", "on 16 February 2018", "on 12 November 2017", "on 9 February 2018", "on 14 February 2018", "on 21 January 2018"], "reviewer": ["shubham", "Santhosh", "Tushar S.", "Tennyson", "Nandini singh", "Nishchay Sharma", "Pramodh", "Shivansh rana", "DIPU", "Aditya B."]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["5 stars satisfied with the product worthy", "Worst Packing. 6", "Worth Product to Buy", "Product is okay but I got used product. Box ...", "Perfect Product", "Hmm it OK..", "Scratches on body", "Reliable and value for money trimmer. Love it.", "Decent trimming, average build quality.", "Great trimmer on a budget."], "review": ["PHILIPS TRIMMER compared with so many trimmer I feel that Philips trimmer are\nthe best with good features. IT is very easy and soft to use. It's very light\nweight and handle grip is good with slim design of the product.It is very good\ntrimmer worthy for me and for you also.  \n  \nADVANTAGES(PROS)  \n° Chargable  \n° Long battery life  \n° Washable  \n° Awesome design  \n° Easy to use-with 10 different length setting from 1-10 mm  \n° 2 Years warranty  \n  \nDISADVANTAGES(CONS)  \n° It does not clear the full beared  \n° Blades can be hurting sometimes  \n  \nTHANK YOU FOR SUPPORTING ME  \nIf you like my review then please press vote button. please please!\n\n", "Philips Beard Trimmer Cordless for Men QT4001/15  \nBought this item for Rs.1200  \n  \nFrom my Experiance  \n1\\. Its too much noisy.  \n2\\. No USB charging.  \n3\\. Charging Indicator is in the Adapter and not in the trimmer.  \n4\\. Cordless use only.  \n5\\. Worst Packing.  \n6\\. Seems like Old product.  \n7\\. Frankly not satisfied even as the branded product.\n\n", "Excellent product  \nYou get 10 step cutting size that is excellent...  \nThe head clip attachment can be removed for cleaning..  \nEven the head portion with the cutter can be removed....  \nThe blade is really good and smooth...It cuts really fast without hurting your\nskin.....  \nThe charger is not a common usb type charger...  \nA small brush is given with the pack but no gel is provided...  \n  \n***There is no charging indicator on the body of the trimmer...which leads to\nthe difficulty to understand whether it has been fully charged or not....  \nEven the packaging could be better.....they delivered the product in only a\nbubble wrapped packet....  \n  \nOverall it's kind of a worth but product....\n\n", "Product is okay but I got used product. Box is totally damaged. Have a look on\nthis attached pics. This is unexpected from amazon. Plz take care of this one\nnext time it should not happen with any other customer. And Plz replace this\none as soon as possible.\n\n", "Pros:  \n1) Battery backup is good comparable to old models of Philips Trimmers.  \n2) Adjustable trimmer head.  \n3) Blades of the trimmer are round in shape so no cuts & Blood.  \n4) Slim design & easy to hold  \n5) No need of oiling.  \n6) 3 Years Warranty (2yrs 1 Yr on Philips Website Registration)  \n  \nCons:  \n1) No LED light indication when Trimmer is in Use.  \n2) Vibration & Sound of motor is irritating.  \n3) Takes Excess Time To Charge it full. (i.e.10 Hours)  \n  \nSuggestion to Philips:  \nPlease Provide a Cover of Traveling Purpose for Trimmer that would be very\nhandy for us to use.\n\n", "Product is good. Hope it Serves the purpose without any pain. I saw some\ndefects in vibrating blade , it is kind of melting at the contact point of\nrotor.  \nAnd packaging was not good, torn from below of box.\n\n", "This product is delivered on time and have used only once. My friend wanted to\norder the same and while looking having a closer look, found that it had\nscratches and the print on the back is faded out. Something went wrong, might\nbe used one I guess. Battery lasted for many days as it was not used and\ndrained out unexpectedly. Even after charging for three hours, the product did\nnot catch up sufficient power to use again. Apart from this product, all other\nlooked/packed new. I suggest you all to check the product and if found faulty,\ntake an action immediately.\n\n", "Used it just over ten times over a period of two and a half months. Holds on\nto the Philips brand-name and gets the job it was meant to done. Noise is loud\nbut not blaring and is within bearable limits. Can trim in the range of\n10-1mm. Runs on inbuilt lithium battery for around half an hour from full\ncharge to complete exhaustion in a single charge without getting heated up.\nYou do not have to plug it in to run; rather it does not work at all when it\nis plugged in with the mains which is good from safety perspective as it\neliminates the possibility of the user getting electrocuted. If you have tiny\nhair in good shape, half an hour should be more than enough. Plus it can trim\nthe beard to tiniest stubble you want to flaunt when you remove the clip. The\nclip is very plasticy and can easily break if pressure is applied; so you\nshould handle it with care. Otherwise build quality is okay and the shape is\nergonomic. Do keep in mind you can not wash it with water or use it in the\nshower. However cleaning it is easy; you can blow air to remove sticking hair\nand dust from the cavity where the blade is installed. Do not know about the\nafter sales servicing since I did not require it yet. To keep away health\nhazards use it for yourself only. It is meant for individual and personal use\nand is not suitable for salons. You can elongate the warranty period to two\nyears by registering online with invoice information on Philips website. I do\nnot know what will happen over a longer span of time but so far it is working\nexcellently true to the Philips brand-name which I am dearly fond of. I am\nsatisfied with the product after using it for first two and a half months. You\ncan safely opt for it if you are willing to buy one.\n\n", "The trimming quality is very nice. But comb is very loose with the product I\ngot. I adjusted the comb to 3mm, but it trimmed my beard to 2 mm. Due to\nlooseness the comb went inside 1 mm more into the trimmer. So 3 stars.\n\n", "It works flawlessly as promised.  \nGood looks and grip.  \n1-10 levels covers a wide range and that's all you need. (No need to go for\nthe costlier model which goes down to 0.5)  \nGood blades and great level shifting mechanism.  \nThough not completely water proof, you can wash the blades without any worry.  \nSolid built quality.  \nBattery lasts long. On light daily use, it lasts more than a week.  \nThe sound is okay and normal for the price. Not silent, but not really loud\ntoo.  \nIf you have really short hair, you can trim the sides and the ends evenly at\nthe level you want.  \n  \nNo LED indicator on the trimmer. There is one on the charger which lights up\nwhile charging and turns off when the charging is finished.  \nLow charge levels can be identified by the sound and vibration of the trimmer\n(gets weak in its functionality)  \nI don't know who's to blame for this, probably the courier guys than the\nsellar, my packaging looked terrible. The cardboard was pretty messed up. But\nPhilips had a hard covering on the product, so it was intact.  \n  \nDon't go for the cheap brands that comes around 500 rupees. They're louder,\nlimited in functionality and lasts for like 6 months.  \nPhilips trimmer has got robust built and 3 years warranty.  \n1000 rupees is the right price for this product.  \nPanasonic makes good trimmers too. They will be slightly quieter and costlier.\nBut not the same long working time on the battery as Philips.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 September 2017", "on 6 March 2018", "on 10 December 2017", "on 5 March 2018", "on 30 July 2017", "on 22 March 2018", "on 26 July 2017", "on 11 April 2017", "on 4 February 2018", "on 15 September 2016"], "reviewer": ["bhavesh", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Neeraj Verma", "Jorgie Mathew", "Sandeep Kumar", "Amazon Customer", "Appu", "Jaseel JP"]},
{"rating": ["1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Philips trimer not working", "Inferior packaging, trimmer seems alright.", "best product & battery backup is also powerfull but price ...", "Different trimmer received", "The packaging of the product is totally damaged and seal is opened already when I received my order", "Good product with great warranty coverage and service.", "Product is OK but box is not proper", "Worst packing", "Duplicate produce received", "Perfect product,"], "review": ["I purchase Philips trimer in may 2017 but trimer kharab ho gya without invoice\nPhilips is not giving garnty  \nBad service by amazon not giving me invoice copy of my Philips trimer .\n\n", "Product packaging was damaged. It's been opened just like it's mentioned in\nthe other reviews. The trimmed doesn't seem to be used,the little paper tab\nplaced near the blade was intact.\n\n", "best product & battery backup is also powerfull but price is not affordable\nbut as there is warrenty of 1 year so its good............. also when i\nreceived the package its seal was totally broken\n\n", "Received different trimmer, compare to the frnd trimmer both are looking same\nbut charger not same, Packing not good, box damage, trimmer not working, on\npart missing,\n\n", "I am very dissatisfied with this type of packaging no product manual inside\nthe box, seal is opened already.\n\n", "This product is already averaging at above 4 stars so I won't add a lot about\nthe product, use experience, etc.  \n  \nHowever, the reason I am rating it 5-star is because of the warranty\nexperience I recently had...  \n  \nFor some reason, the device would not charge. So I called up the warranty\n1-800 number. Right from the automated IVR to the point someone picked up the\ncall was very quick (no random inputs requested ... your zip code or input\nyour product code or what not). Then, the person who picked up was extremely\nprofessional and thorough. He took the info he needed from me and explained to\nme the process that would be followed. He even asked if I preferred home\nservice or would like to take the product to a nearby service center. After I\nsaid I preferred the home service option he told me to expect a call to\narrange for a visit within 4 hours before we hung up. Thereafter, I received\nSMS and emails confirming the case and timely updates on when it had been\nassigned, etc. Promptly I received a call in the evening asking when I shall\nbe available on the next day (which was a Sunday). Then, on the following day,\nat the expected time, I received a call from the technician confirming my\naddress and that I am at home. The technician arrived promptly, had brought\nthe necessary equipment with him to test/examine the product out and soon\ndetermined that something internal was wrong in the device (and that the\ncharger was okay). He immediately handed over a replacement unit to me, took\nmy signature, etc., gave some additional tips about maintaining the device and\nleft.  \n  \nThis was the smoothest warranty service experience I have *ever* had with\n*any* product, period! That, I think, makes this a 5-star product!\n\n", "The received product is OK but the box of it is like already opened. Hence I\ndoubt that whether it is used product. You can see the attached images of the\npackage.\n\n", "Worst packing .... Product box is been opened & crushed while opening outer\ncover and Product looks very bad after seeing this..\n\n", "The box seal was opened. It is a duplicate product.  \nReturning it. I could have give zero rating. Please return my money.\n\n", "Perfect product,,fast delivery,Stylish look,powerful motor.  \nThe only thing I hate is there is no charging indication in the trimmer.  \nI would recommend this product ,  \nWorth of money\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 February 2018", "on 7 February 2018", "on 22 January 2018", "on 22 February 2018", "on 22 March 2018", "on 4 April 2017", "on 22 January 2018", "on 24 February 2018", "on 23 February 2018", "on 27 January 2018"], "reviewer": ["shuja abbas", "Omkar S.", "Amazon Customer", "Vishal gohane", "Prashant Manglik", "Manish", "Sathish Kumar Polisetti", "Karthick", "HP Maity", "Emil"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Box destroyed and was in opened condition.", "Good", "Product working was good", "I love it!", "It's a perfect item for Beard lovers GO it", "PRODUCT IS OK OK", "5🌟", "Three Stars", "Good!!!", "Five Stars"], "review": ["\n\n", "Good but box full damage\n\n", "I was disappointed with the packing\n\n", "Very nice experience.. love it\n\n", "I trongly recommend it to everyone who love different different beard styles\n...  \nI'm in love whit this product it made me smart and unique now i can shave\ndifferent styles every week..  \n  \nVery easy to use  \nYou can twist to adjust the size..  \nGood battery backup gives 3 shavings by one time charge  \nIt'll take 6 hours to get full charge....  \n  \n\\+ Smooth shave  \n+Good battery backup  \n+Easy to clan the clip  \n  \nYou can see my beard styles diffidently you'll love my style...  \n  \nFinally I recommend this to everyone..  \nGo for it\n\n", "I am very disappointed with the packing.  \nThe box of the trimmer was already opened and that was really not acceptable.  \nHowever i have not initiated the replacement but i am very disappointed.  \n  \nComing to the product :  \nThe product is ok ok not too good not bad also  \nGiving it 2 stars\n\n", "Awesome product\n\n", "It's good\n\n", "Nice product easy to use satisfied with the product and divery time\n\n", "Powerful trimmer. Worth buying.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 February 2018", "on 25 January 2018", "on 24 January 2018", "on 25 January 2018", "on 8 February 2017", "on 11 July 2017", "on 1 February 2018", "on 30 January 2018", "on 19 December 2017", "on 20 January 2018"], "reviewer": ["Amazon Customer", "Bruss", "abubakar siddiq", "Shaban Khan", "Justine Shreekanth", "Amazon Customer", "MINTu Das", "SANJAY PANDEY", "Amazon Customer", "Naveen nair"]}
]