[
{"rating": ["3.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Nice but high installation charge", "Five Stars", "Three Stars", "Affully poor and bad after sales services by Voltas", "Mixed comments here. The outer unit is aluminium based ...", "Not v good product. Doesn't cool well", "Two Stars", "I respect cloudtail vendor. I guess, he too ...", "Two Stars", "Four Stars"], "review": ["Nice ac but installation charges is very high. The installation person who\ncame to my house for install the ac take total 3500 rs for installation charge\nand wire etc\n\n", "Excellent\n\n", "Good product in this amount.\n\n", "After is sales services is painfull. I got my AC installed a month back and it\nalready has issue of gas leak due to poor installation by voltas team.\nCustomet care would make you hop between service agencies and area manager.\nInstallation itself took atleast 20 followbup calls.\n\n", "Mixed comments here. The outer unit is aluminium based. Do not go for this\nproduct. Call up the Voltas guys to know more about it.\n\n", "Not v good product. Doesn't cool well. Also I was tld installing is free. But\nthey demanded 1500 plus plus\n\n", "It doesn't have a horizontal swing Nd the remote has many options that are not\npresent in the AC\n\n", "I respect cloudtail vendor. I guess, he too started cheating people. It is\naluminum compressor. But mentioned copper. He has to mention clearly, when he\nkeeps low price.\n\n", "No support of installation, very poor quality of service technicians, they\njust don’t know how to install with hidden pipes, making lot of noise.\n\n", "As expected\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 September 2017", "on 14 February 2018", "on 24 January 2018", "on 2 July 2017", "on 14 October 2017", "on 27 October 2017", "on 8 November 2017", "on 19 September 2017", "on 8 October 2017", "on 23 January 2018"], "reviewer": ["Ranjeeta", "Arunkumar. V.", "somnath maity", "Amazon Customer", "kapil acharya", "g k Bhartiya", "Sukanya Unnikrishnan Kodothody", "Amazon Customer", "Kapoor's", "kushal kukreja"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["You will regret buying Voltas", "Works fine but doesn't have the basic horizontal swing", "Volta's Ac is good but installation they charge higher and their service is ...", "Not working after 15 days", "Plastic/material quality need to be improved, look very inferior", "Bad service in Kolkata is", "Amazon is good but not Voltas..!", "Nice Product", "Terrible installation support from Amazon and Voltas", "Pathetic buy"], "review": ["Dont waste your money buying Voltas. They lower their prices and increase\ninstallation costs. Everytime an engineer comes over, he tries to\nunnecessarily sell us attachments we do not want like longer cables. They\ndamaged some pipes while dismantling the AC in our old house and charged us\nfor it again in the new house. Next their engineer sold us a stabilizer which\nstopped working after a few months and Voltas refused to fix it. Bottom line,\nstay away from them. Pay a little more and buy a different brand.\n\n", "Works fine but doesn't have the basic horizontal swing..... Add another 5k u\nget carrier which is a great AC with better features.... The auto mode\navailable is only at 24*C .... and installation is above 5 k... Count that in\nbefore making a choice.\n\n", "Volta's Ac is good but installation they charge higher and their service is\nnot at all satisfactory\n\n", "It stopped working after 15 days of installation, hardly ever used. Seller may\nbe good but the product most certainly isn't. Will connect with installatiin\nguy n voltas with the issue n i strongly recommend to NOT buy this model. Such\na waste of time n effort.\n\n", "value for money, but the overall plastic/material need to be improved. Actual\nperformance will known in peak summer\n\n", "Engineer for installation are very bad take lots of money but not doing his\njob after few reminder and follow ups . Very disappointed\n\n", "Delivery was perfect as committed and Voltas will screw you up for\ninstallation as usual. We need to have one week time window for installation,\nif it is not really urgent. Voltas hired/outsourced technicians are white\ncollar people, and will come only on their own time for installation\n\n", "Nice Product... Gives a nice cooling in very big rooms also..\n\n", "The product has been. Now installed 3 weeks back and refuses to cool the room.\nMultiple communication with Amazon and several phone calls with Voltas later,\nwe are splitting hair to have the problem addressed. Certainly expected Amazon\nto play an active role on resolving the problem but it's a very hands off\nattitude from amazon. Buy this at your own peril.\n\n", "Pathetic buy, Remote did not work, no volts inside n later seller says it is\nnot the part of original product whereas it is mentioned on box. More over\ncover also found to be damaged and Amazon and Voltas are just blaming each\nother.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 31 October 2017", "on 27 October 2017", "on 16 February 2018", "on 7 October 2017", "on 22 February 2018", "on 20 January 2018", "on 25 September 2017", "on 21 March 2018", "on 15 July 2017", "on 28 September 2017"], "reviewer": ["Ashika", "Anirban Ghosh", "Poornapushkala", "Atishay\tjain", "NarsimhaRao", "Biswajit Roy", "Ravi Shankar Davay", "Imaginarytechinhindi", "Amazon Customer", "Vipul Gupta"]},
{"rating": ["4.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best In Class Cooing And Price", "Good product but pathetic installation.", "Should you Buy this Product ? Detailed Review of Product itself.", "Aluminium Condenser and Not Copper", "One Star", "Super", "Defective supply of AC", "Getting fitting done was an issue. There was broken ...", "SUMIT BOUDH", "Good to go for this price!"], "review": ["My First Purchase Of A Voltas AC And I Went With Voltas As Its A Know Name In\nThe AC Industry And I Think They Are Keeping Up Their Promise Of Being Good\nBut Here Are Somethings That I Liked,Disliked And Things You Might Like To\nConsider While Buying This AC  \n  \n========================================================================================================  \n#Box Contents  \n1.Indoor Unit  \n2.Outdoor Unit  \n3.Installation Pipes  \n4.Remote Battery And User Manual  \n  \n=======================================================================================================  \n#Why I Chose This AC  \nI Did Went Through A Lot Of Reviews Before Buying This AC.It Has A Pretty Good\nRatings And Reviews And A Lot Of People Brought This And Also Its Ideal For A\nMid Sized Room And Its Good In Pricing.  \n  \n========================================================================================================  \n#Other Costs  \nEven Though You Can Get This AC In Under 30k But There Are Some More Hidden\nCost Like You Have To Buy And Stabilizer,A Wall Mounting Stand For Outdoor\nUnit And There Are Also Installation Charges. All Of This Can Easily Cost\nAround 5000.  \n  \n========================================================================================================  \n#Cooling  \nNow Lets Talk About The Main Thing And That Is Cooing,And For That Is Really\nGood. For Reference In My Case AC Is Installed In A Medium Big Sized Room And\nWe keep The Temperature Around 25 c And It Gets Pretty Cool.So For Cooling It\nWill have 4.6/5 Rating from Me  \n  \n========================================================================================================  \n#What I Liked  \n1.Cooling Is Very Good  \n2.Budget AC  \n3.Easily Covers A Mid To Medium Large Room Size  \n4.Fans Speed Is Pretty Good With Three Adjustable Speed  \n5.Looks Gorgeous With The Lit Display In The Middle  \n6.Don't Produce Much Noise So You Sleep Peacefully At Night  \n  \n========================================================================================================  \n#What I Don't Like  \n1.The Installation Engineer Was 3 Hrs Late So Voltas, Needs To Improve That  \n2.There Is A Feature Called As Compressor Protection That Doesn't Start The\nCompressor Until 3 Min After You Switch On The AC That Means That The Ac\nStarts Cooling After 3 Mins.Even Though 3 Mins Does't Seems like A Long Time\nBut In Practical It Feels longer.So That's A Little Annoying As If You\nAccidentally Switched Off The Ac Then You Would Have To Wait For 3 Mins For It\nTo Start Cooing Again  \n3.If You Change The Fan Speed. First It Gets To The Lowest Speed Then Slowly\nReaches To The Speed You Set  \n  \n========================================================================================================  \nSo At Last Its An Overall A Very Good AC With Great Cooling And Power Saving\nAnd Hence I Would Definitely Suggest Buying It If You Are Looking For A Budget\nAC.\n\n", "While the product is good the installation done by their service partner\n(Amazon) was pathetic with nil regard for the new product. The jokers who came\nfor installation was using the outer unit as a ladder for drilling holes and\nlaying the necessary pipes as a result the fan got stuck and they had to\nremove the outer cover to make things better. After opening the outer cover\nthey didn't even bother to put all the screws back. That job was done by me.\nNow we can't just stand at one place through out to see what they are doing.\nThey didn't even have the necessary accessories like clamps, extra copper\npipes etc as a result they guy had to go shopping and the time wasted was\nclose to one hour.  \n  \nAll in all one panther service and I am contemplating calling up my\nneighborhood Ac service guy to make things better.  \n  \nLooks like Amazon doesn't even does proper vetting or give guidelines to these\nTom dick Harry's who does these installation work.\n\n", "@ Being a Mechanical Engineer I am stating few stats for better understanding.  \nNOTE:  \n# There is a 3 Star rated version of same model.  \n# Max Power consumption is rated at 1430 Watt which is comparatively lower to\nconsumption of 1613 Watt of 3 star Rated same model.  \n# This means if you use 5 star model for 3-4 hours daily, then you will save\napprox.200 rupees monthly compared to 3 star rated model.  \n# Within 10 months, the Value is recovered and then Saving begins and also\nEnvironment is Less polluted.  \n  \nNote: I do not own this product, my uncle bought it and I am stating my\nexperience after checking the product thoroughly.  \n( He's using this model since last 6 months )  \n  \nAbout this product,  \nPros:  \n1) Product is 5 star rated which is very Environmental efficient as well as\nBudget friendly.  \n2) Compressor is Rotary and serves the purpose.  \n3) Refrigerant used is R22, which gives decent cooling effect.  \n4) AC is damn silent and Pleasant.  \n5) Turbo Mode is OK.  \n6) Display on AC is quite useful.  \n7) Last good thing is Self Diagnosis, which typically states the filter change\nalert and other such minor things.  \n  \nCons:  \n1) Coil used is Aluminium NOT Copper, which is biggest disadvantage.  \n2) Bacteria filter is useful only in low pollution area, if you are Living in\ncity like Delhi or Mumbai, then it won't make huge difference.  \n3) Display on remote is very small, should have being bit larger.  \n4) Cooling takes bit longer than expected.  \n5) Finally the Cross Flow is not very effective.  \n  \nVERDICT :  \nNow the main question, whether its worth buying ?  \nFor the Price given its certainly Not worth going for. Despite of having\naluminium coil its priced around 30k which is not very lucrative.  \nSo far my uncle didn't faced any issue, but maintenance of aluminium coil is\nhuge pain which he might have to undergo soon or latter.  \nI suggest going for other models of voltas or switch to other brands with\ncopper coil only.  \n  \nThank You for reading this review.\n\n", "Note: This AC comes with Aluminum Condenser. Seller has noted wrongly as\ncopper tubes. Also some reviews have been given as Cu tubes. 180JY Jade model\ncomes only with AL Condenser (as per Voltas Installation guys).  \nOther than that this product is a value for money. About cooling and other\nfeatures will update in days to come as we have to give the AC at least a\nweeks time.\n\n", "It is a damaged piece and I dint expect this from amazon. I am attaching the\nphotos also.\n\n", "Nice product and good packing. And installation charges to high. But rest all\nis well\n\n", "Dfective. Your technician reported that he will inform and defective part will\nbe replaced. No action so far.\n\n", "Getting fitting done was an issue . There was broken fan . Which was creating\nhuge noise . However upon call again Voltas guys came and replaced . But he'll\nof a problem after delivery\n\n", "realy this ac is very good nice cooling but its take some more time to start\n.....cooling is nice no sound come from ac if anyone want buy it....\n\n", "Pros:  \n1) Product is 5 star rated which is very Environmental efficient as well as\nBudget friendly.  \n2) Compressor is Rotary and serves the purpose.  \n3) Refrigerant used is R22, which gives decent cooling effect.  \n4) AC is damn silent and Pleasant.  \n5) Turbo Mode is OK.  \n6) Display on AC is quite useful.  \n7) Last good thing is Self Diagnosis, which typically states the filter change\nalert and other such minor things.  \n  \nCons:  \n1) Coil used is Aluminium NOT Copper, which is biggest disadvantage.  \n2) Bacteria filter is useful only in low pollution area, if you are Living in\ncity like Delhi or Mumbai, then it won't make huge difference.  \n3) Display on remote is very small, should have being bit larger.  \n4) Cooling takes bit longer than expected.  \n5) Finally the Cross Flow is not very effective.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 May 2017", "on 27 September 2017", "on 23 January 2018", "on 10 October 2017", "on 25 October 2015", "on 31 January 2018", "on 1 December 2017", "on 6 August 2017", "on 24 June 2017", "on 30 January 2018"], "reviewer": ["Sachin Kumar", "SN", "Sameer Patil", "Jailive", "Chaitanya", "Ammi", "manahar", "Avinash Pandey", "sumit kumar", "Saurabh Mandal"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Five Stars", "Disappointed with amazon", "Five Stars", "Five Stars", "Worst After Sales Installation Service is provided by Voltas. - Installation guy not trained and nobody listening to fix it", "One Star", "Five Stars", "Satisfied with this all rounder.", "Cooling ok very worst", "Three Stars"], "review": ["Since we took it facing some or the other sort of problem...and always a\nservice center person comes and checks and goes back...almost after 2 to 3\nfollow up work is done...no problem with AC ...service boys are ridiculous..Ok\n\n", "A/C not working properly, water coming out from a/c while operating, no\ncooling.  \nRegistered complains to Voltas many times. None came to visit once\ninstallation is done.  \nCalled Amazon recently, but no follow-up from them.  \nDisappointed with amazon. They should not sell Voltas products on discount\ntoo.\n\n", "Good\n\n", "Best product at best possible price!\n\n", "Voltas 1.5 Ton 5 Star Split AC (185JY, White)Worst After Sales Installation\nService is provided by Voltas.  \nThe guy came for installation has not checked AC dimensions and fixed AC at\nhis preferred location. now I am not able to open a door of our almirah.  \ncomplaining to Voltas customer care since 7 days but nobody is listening.\n\n", "We didn't receive remote.\n\n", "Good air conditioner and working super ....\n\n", "Quite Satisfied with this all rounder.  \nIt's been 4 months of use now and I think the AC is working perfect for my mid\nsize room. The installation done by Voltas was quick but bit messy partly due\nto layout of the Room. The ODU (outdoor unit) is huge but the body of both IDU\n(indoor unit) and ODU feels nice and sturdy and both units are silent.  \nIDU in particular has nice features and feels elegant.  \nI am happy and impressed with this Voltas AC, and I might update this review\nagain after 1 year just to confirm if its performance remains same or has\ndeteriorated.\n\n", "Nice cooling , when u claim a warranty means you need pay a installation\ncharges that is condition by voltas very poor condition I am a ac mechanic but\nI pay the amount to installation so very worst condition voltas\n\n", "Its good...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 September 2017", "on 2 August 2017", "on 10 March 2018", "on 12 February 2018", "on 1 June 2017", "on 17 February 2018", "on 27 January 2018", "on 12 October 2016", "on 7 August 2017", "on 10 February 2018"], "reviewer": ["Amazon Customer", "Kuns", "Raghu Mallegowda", "divya", "Gaurav Kumar Gupta", "Chiranjeevi Narra", "gowrishankar", "Kalpesh", "Prasanna Ganesh", "Indradip Bhattacharya"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Five Stars", "Four Stars", "Five Stars", "Good AC", "So far the AC is doing well and no complaints ...", "Five Stars", "Good Product, very efficient cooling and the price at ...", "cooling", "Poorest", "Four Stars"], "review": ["Installation please\n\n", "Not for rooms or spaces more than 200 sq ft..\n\n", "Good\n\n", "Apart from the installation service, the product is good.  \nIt took me more than a week to make them come to my house to install the AC in\nBadarpur.  \nI had to call VOLTAS several times....so the first impression was not good.  \nBut after the AC got installed, I must say, it is damn good.\n\n", "So far the AC is doing well and no complaints. Please note installation by\nvoltas would cost 1500 plus GST and around 300 bucks per foot for wiring\n\n", "nice prodect good\n\n", "Good Product, very efficient cooling and the price at Amazon was at par.  \nJust that product description (copper vs Aluminium etc) and questions on\ninstallation could have been answered better.\n\n", "cooling is very bad not cover full a small room by this ac . i have one more\nvoltas ac and that is 1 year old but cooling is best of that ac.i want to\nchang or replace but there is no option . think before buy.\n\n", "Product was looked good but after 2 days not cooling , voltas service man told\nno gas in it either all leaked .now I have initiated refund horrible\nexperience from Amazon\n\n", "Product is good but I have a problem with the emi kindly help me out..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 January 2018", "on 12 December 2017", "on 23 January 2018", "on 9 May 2017", "on 14 September 2017", "on 11 January 2018", "on 3 September 2017", "on 8 June 2017", "on 18 August 2017", "on 3 November 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "Kiran P.", "Naveen Sharma", "Arjun Sachdev", "sandeep", "nihar", "Amazon Customer", "Amazon Customer", "Sharad purohit"]},
{"rating": ["3.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["it good for this price 1", "Great Product!", "Three Stars", "Voltas 1.5 ton AC JY", "Unfair Deal", "Voltas E5 error displayed in just 5 days.", "Cheated by amazon by means of sale", "Having Aluminium condenser.", "Problem with Voltas not only with the product", "Leakage and denting problem"], "review": ["I bought this product 27K, it good for this price 1.t ton & 5 star.  \ni have asked to seller whether it is aluminium or copper through mail .they\ntold it is copper , but i have received the aluminium coil.\n\n", "Does what it states in advertisement! That's an achievement.  \nVery Satisfied with the product. Real Value for money.\n\n", "It is nice so far .Lets see in the summer\n\n", "Amazon Delivery is ok but Voltas After sales service is very poor,\ninstallation Team service is also not good. My AC has problem since starting\nas it is not cooling. We register the complaint 12-13 days ago but till now it\nis not repaired. I am getting assurance only that we will repair it soon.  \nI am willing to return the AC back.\n\n", "Product received yesterday which is installed today on my cost which I paid Rs\n1500/- to voltas authorized service person. This amount should not be charged\nfrom coustomer. So it is not a fair deal.\n\n", "After 5 days from installation the AC stopped working and showed E5 error. I\ngoogled a bit and came to know that E5 means Fan motor error. Requested a\ncomplaint with Voltas Customer care. awaiting technician to visit.\n\n", "During sale period the rates of Voltas ac 1.5 ton 5 star ac model 185 JY is\nmore. And on regular days the prises is cheaper by rs 2000. Cheating by amozon\n\n", "1\\. Amazon should give Proper and clear Information about the Item. Nowhere\nit's mentioned, Whether It is having copper or aluminium condenser.  \n2\\. Amazon should clear the warranty conditiona and non covered parts.  \n3.\n\n", "No cooling, no demonstration and very low/late in terms of service support. No\ncleaning post-installation mess created by them. It feels like they are doing\nfavor on you by installing the product.\n\n", "Got delivered 2 days back. The ac has a leakage problem and the ventilator has\na denting problem.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 October 2017", "on 23 January 2018", "on 2 March 2018", "on 14 June 2017", "on 18 October 2017", "on 29 September 2017", "on 12 October 2017", "on 10 October 2017", "on 16 October 2017", "on 20 December 2017"], "reviewer": ["Jashwin", "Mr. G Sharma", "deena", "Amazon Customer", "Amazon Customer", "Dharmambal", "mayur", "Swapnil", "Maddy_dub", "Amazon Customer"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Product was not tested ok before dispatch, defective product", "Overall good experience. Installation technician was professional good", "3 Star or 5 star, Go for 3 star.", "Good product", "It is good looking and has been fitted", "DO NOT BUY!!! READ THE REVIEW FOR DETAILS", "Not at all satisfactory.", "I got this for a great deal, installed it the next day", "which not even good quality, i bought the same AC and found ...", "poor service support ( applied and cancelled installation request twice ..."], "review": ["The compressor fan is not working and technicians wasted 4hrs in installing\nthe machine and dont know the actual problem of not working. And also the AC\nswing was also not working. Many defects in the product.\n\n", "Product arrived in 1 day. 5 star to Amazon for that. Installation was hassle\nfree. Overall good experience. Installation technician was professional good.\nNo problem at all. Thank you Amazon. Hope product also good in long term.  \n  \nNote: Mumbai area customers are recommended to buy Copper condenser not\naluminum for good life. I did mistake here and brought Aluminum one.\n\n", "Rating it 5star because people do notice this.  \nI want to make the buyers aware about the star rating.  \nI have come across this information when i was researching which one to go\nfor, whether 5star or 3star AC.  \nSo here it is,  \n  \nUnless you use for 10-12 hours a day for almost 6 months of an year 5star AC\nis not worth it's price.  \nEven if your usage is meeting the above parameters, it takes around 5-6 years\nto fulfill that extra amount, which you have spent on those extra stars.  \nSo think about it before simply shelling 8-9k more money for a higher star.  \nA 3-star AC running for 8 hours a day for a month would cost you 200-240 more\nrupees than that of a 5 star.  \nFor most of the Indian Domestic usage, a 3-star AC would suffice, So calculate\nyour usage time and go for it.\n\n", "Value for money. Product is really good. I would recommend this if you are\nlooking for a 1.5 ton non inverter AC\n\n", "It is good looking and has been fitted. I can only tell about its working next\nmonth when we start using the AC\n\n", "The temperature control of this ac doesn't work. You keep it on 24, it'll cool\nlike you've set it on 16 deg. You keep it on 29-30, when the compressor runs\nyou'll need a quilt to cover, once the compressor stops you'll need to take\noff your quilt.  \nThe filter of this ac needs cleaning every 15-20 days or it makes your room a\nswimming pool.  \nAfter calling the service guy on a regular basis till warranty lasted, we had\nto buy new ACs.  \n  \nWe had 2 of these, so I know it wasn't a defective piece, all ACs are like\nthat.\n\n", "In last two and half week, it was used only two to three times just for an\nhour, unfortunately it stopped cooling now. Voltas Service Station\nChinchpokali is not picking their phone given on pamplet.  \nI hate it. I want solution immediately or have to go to consumer court.\n\n", "I got this for a great deal, installed it the next day, installation was a\nterrible experience, Drain pipe was not included in the package, I had to buy\nthis separately, costed my 100, installation guys charged me 1400, stabilizer\ncosted 1500 more, did not install the brackets as my sunshade above the\nwindows were perfect for the outer part of the AC.  \n  \nAC was great, cools my large bedroom in 15 mins. Not much noise, but this is\njust my week1, will edit more details later.\n\n", "wrost experiance ever with this AC dont buy because company is providing\naluminium condenser .which not even good quality , i bought the same AC and\nfound gas lekage problem in condenser coil now ,voltas service centar is\nsaying to change the coil becasue of gas lekage problem which cost to around\n8500 . please dont buy this AC.worst product from company ever ,\n\n", "outer unit so much sound than other brands, repeatedly huge deformation sounds\nin indoor unit, poor service support ( applied and cancelled installation\nrequest twice but these are considered as utilized free services request). no\nquality cross check after installation. installation guy only hurry in\ncompletion of his work and didn't discuss any options in installation(place of\nindoor unit and stabilizer installation). recently 4 days back i applied for\nservice no one contacted till now...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 January 2018", "on 17 September 2017", "on 21 February 2017", "on 15 March 2018", "on 3 March 2018", "on 21 September 2017", "on 28 October 2017", "on 24 April 2017", "on 3 March 2018", "on 16 June 2017"], "reviewer": ["Uday", "sushant", "Ram ..✒️.....", "Rahul Katiyar", "Dave Sood", "True opinions", "Ravi", "Satyajith", "vishal", "chinnaji"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["A Safe Bet :)", "true value for the asking price", "Worst service by voltas", "Awesome product", "One Star", "Within 6 months the AC not functioning and showing, ...", "WASTED INVESTMENT", "Amazon linking suppliers and delivery/Installation has to be improved", "Five Stars", "VOLTAS  A/C BAD PERFORMANCE"], "review": ["This is a decent air conditioner for the humid and hot Mumbai. The price was\non a bit higher side but still delivering good response and thereby we can\nrate it as \"Value for Money\". The room size of 14 X 12 X 11.5 ft is\nconditioned in 5 minutes shows the power of the machine. This is an overall\nnice product and can recommend confidently to anyone. The cherry on icing was\nI got the AC installed in same day of delivery - Within 2 hrs of delivery the\ninstallation team arrived and got it done for Rs. 2350 including the drainage\npipe. Got a message from Voltas after installation and this amount was even\nmentioned in that message. So im satisfied with the overall product and\nservices till now.\n\n", "best the heat with voltas 1.5ton split air conditioner with supreme wnwergy\nsaving with its 5star rating ,overall features of this ac is easy to use and\nwell built on consumer trends,Final verdict:totally worth the price although\nthe better choice for price is  \nhttp://amzn.to/2Bg8Wb5\n\n", "Service by the Voltas is worst. I have brought the ac 10 days back and i am\ncalling voltas customer care every day till now to get it installed but they\ndidn't respond at all. When called them they are putting my call on hold and\ncutting it after that.  \n  \nWorst service by Voltas\n\n", "I am writing this review after using the AC for 7 months.Working very well,\nNice service by Volta's\n\n", "Started dispensing ice cubes and then broke down within a month after\npurchase.\n\n", "Within 6 months the AC not functioning and showing, E1 and E6 error, I doubt\nhow long this machine will work, have lodged complaint today, let's see how\nVoltas gives service.\n\n", "AC has a problem every alternate day. Voltas service is pathetic, technicians\ndon't know anything and dont replace parts or the AC. they are asking me to\ncontact Amazon now, which i cant as it is within guarantee period of voltas\nand not amazon. Dear amazon pls help, and dear customers dont even go near\nthis cheap piece.. WASTED Investment.\n\n", "Nice product takes time to cool the room. I dont know if 180sqft room requires\nhigher tonnage. But improvement required for co-ordination and installation.\nItems arrived at different intervals(stand and stabilizer and then AC was\ndelivered.\n\n", "Nice product\n\n", "It's only 1 month and Motor and PC both not working , I have never imagined\nAmazon product will perform like this .  \n  \nWant to return it , don't know how to do it.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 May 2016", "on 20 January 2018", "on 22 April 2017", "on 11 October 2017", "on 5 November 2017", "on 5 August 2017", "on 20 March 2017", "on 10 July 2017", "on 20 December 2017", "on 11 July 2017"], "reviewer": ["Renjith Nair", "Unbiased reviews", "mahesh", "Bharathkumar", "Amazon Customer", "Molton Machado", "joshua", "Amazon Customer", "Santosh Thorat", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Simple yet efficient, Good for use in small room.", "Missing items and lot of other probable shocks from Voltas", "Five Stars", "Voltas 1.5 ton 5 star split AC", "good performance AC", "Worst experience", "185JY Vs 185CY", "Please read through before you decide to buy it..", "Five Stars", "Look for some other options if you have."], "review": ["Great quality product. We live in the south so air conditioners are\nnecessities to surviving the summer. Most homes down here supplement their\nhome units with air conditioners unit. Technicians visited conveniently and\ninstalled it to test and it blows cold. The temps settings are ideal for our\nbedroom. The Voltas is quieter overall. This unit have quiet fans on LOW and\nwill blow so hard on HIGH that you will think you have a commercial pedestal\nfan blowing on you. I do also love that the filter is easily accessible for\ncleaning too! Can't beat the price either. These are worth their weight (or\nmore) in gold when these miserable summers are here.\n\n", "The package didn't had the drain pipe.  \nWhen the technician from Voltas arrived and opened the package, the drain pipe\nwas missing. Since I was in urgency I had to procure the drain pipe from\nmarket and then the installation was completed.  \nThe first interaction with Voltas and this happened. I am not sure what all is\nthere in the coming years. My existing AC of Samsung is far superior. I made a\nmistake of trying Voltas.\n\n", "When they installed it, the compressor was in-operational. After fiddling with\nit for a couple of days, they got it going. Mr. Chabbra from Voltas assured me\nthat this was a rare occurrence and that they would stand by their product for\nan extended period - 2 years! Since I was close to the date when my guests\nwere coming, I went along and did not opt for return via Amazon.  \nWell, now, 13 months later, after 4 months of use last summer, the AC is not\nworking and I was told that the warrantly had expired. I convinced the service\ncentre manager to be reasonable , once again explaining thr story to him. I\nwould have has to return from Canada and test the product in Winter of 2016-17\nto avail of the warranty. While helpful, this manager had no idea or\nrecollection of any of my conversations with Voltas rep from last year! NO\nRECORD or he has no assess to it.  \nTwo kids came over and said there gas has leaked and this happens to even\n\"new\" ACs, I was told. Apparently, only Voltas suffers from this malady\nbecause my other 5 ACs have gone strong for 5 years now! My question for\nVoltas:  \nIs my product a lemon?  \nWill Voltas stand by the product? Replace it?  \nIs Voltas actually a \"bad\" product, as many people seem to think? (I was\ncertainly willing to give the product a chance, but I am being proven unwise.)\n\n", "Great product. The delivery was super duper fast and the item was well packed\nand safe. Voltas team did a wonderful job by getting it installed within 12\nhours. The cost of installation taken was Rs 1000/- and NOT rs 1500/- .  \nThe only question is that the Split AC and Outdoor Component have different\nserial numbers. I am not sure if it is generally different or same .  \n  \nThe AC is working great, it is noiseless, worth for money. Amazon has SAVED Me\nRs 10,000/ due to price difference from the local market here\n\n", "timely delivered , good performance AC. Value for money deal ........\n\n", "I got AC but it does not work. I have switch on AC it takes forever to turn it\non. Also if I can switch off it takes forever to turn off. Water of money.\nAmazon do not take any responsibility of this product even if they are selling\nfaulty products. Worst experience\n\n", "I did a lot of research to find out the difference between 185CY and 185JY but\nthere was hardly anything available on the net. Now that I have both the\nmodels installed at my home, let me try to summarize the difference:  \n1) Sleep mode - In 185CY, all the lights can be switched off so it not disturb\nyour sleep but in 185JY, you will have 1 light 'on' even in sleep mode. Worst\npart is - this light starts flickering as soon as the outdoor unit shuts off.\nIf you are sleeping in a dark room without any night lamp, this may annoy your\nsleep  \n2) Looks - Aesthetically, 185JY beats 185CY hands down. It looks premium and\nthe display is also very nice  \n3) Features - One important feature that 185JY misses over 185CY is 'auto' fan\nspeed. This is a very good feature in CY which increases the fan speed and\nhelps cool faster automatically rather than you controlling the fan speed in\nthe middle of the night. All other features seems to be same  \n4) Sound level - I felt 185CY to be quieter than JY  \n5) Remote - CY remote looks better than JY but this is debatable  \n  \nOverall, a good product from Voltas other than the flickering light!!\n\n", "I have bought Voltas AC 1 TR a 1.5 years ago through other kart. Voltas AC are\nhigh on maintenance. The technicians that come from service centres are from\noutsourced agencies on turn key basis. Handling of the ACs also is too bad.\nYou would be forced to opt for AMC as the cost of spares is too high. AMC\nwould be as low as 3000 per year to 6000 per year. The coils are not of good\nquality  \n  \nIts a strict no no if u live in or near coastal areas, buy other brand like\nmitsubishi samsung or carrier blue star who are experts for this region  \n  \nWill update with pictures of the coil i mentioned in next update\n\n", "Chill Chiller Chilling Chilled\n\n", "Please look for some other options if available. The installer installed the\nAC & there was leakage in air so worst installation experience.  \nTotally disappointed with AC performance & installer.  \nThe only positive was fast delivery & good customer support from amazon.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 August 2017", "on 24 January 2018", "on 18 March 2016", "on 3 October 2017", "on 4 May 2017", "on 27 February 2018", "on 30 March 2016", "on 10 October 2017", "on 22 December 2016", "on 25 December 2017"], "reviewer": ["SwordFish", "Amazon Customer", "Gurprit S. Kindra", "Ashish Kumar", "ameet", "Pankaj", "Rikhi", "Tushar M", "vikramseth", "Pankaj Jaiswar"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Never again voltas", "Defective product received and poor customer service by Voltas", "ONE STAR", "Looks like the one delivered to me was bad, else this product performance very well", "Beware of voltas authorized installation technicians", "Disappointed", "An average product but awesome support by Amazon", "AC unit is working fine, but not the remote control equipment", "Beautiful Product", "Worst Service"], "review": ["Absolutely never buy voltas product and I would suggest amazon should never\nspoil their reputation with voltas product sale on their portal.  \nAfter delivery matter has been with their installation department and they\nhave a truly held me at ransom. They asked me for 4500 for extra six feet\ncopper pipe and 1500/- installationZ I have the material and still they\ncharged 2400/- and after all done with ten days of head ache water leachate is\non and airconditioner is closed.\n\n", "This is the worst AC that I have received. The problem started fr Day where\nthe installation tram has not installed the device properly. And the cooling\nis not happening. It has become a weekly activity to cal Voltas customer\nservice and report the issue. They have changed the outdoor unit first , the\nproblem is not resolved. Again after a week the same issue is repeted and the\ni door unit also changed but the issue is not resolved. Very frustrating from\nday one after purchasing this AC. Better don't buy the Voltas ACs.Go for Blue\nstar or Daiken even though they are little expensive , at least you will have\npeace of mind.\n\n", "AC WAS GOOD BUT WIFI OPTION IS NOT WORKING AND ON TIMEER BUTTON NOT WORKING\nONLY WIFI OPTION INCREAS PRODUCT COST I AM NOT SATISFIED DONT BUY IT\n\n", "I am Changing my feedback from 1 to 4 Stars coz the fault was not with the\nproduct it was by chance error in installations which VOLTAS fixed. The\nwhistle blowing noise was due cramping of the inlet tube. So as told earlier\nthis is one of the best products from VOLTAS at an excellent price of range of\n29990 - 32000 INR.  \nI am not giving 5 coz I would want Amazon and Cloudtail to see if they could\nfurther such feedback with the makers of the product and improve the end to\nend customer sastisfaction :-)  \n  \nOld Feedback on 6-May-17:- This is second AC I am buying and is same as the\nfirst one. But post installation after 30 minutes of operation it started to\nmake a very terrible metal noise. Called Votas customer care they had a\ntechnician visit us but he could not rectify it. I have similar product\nrunning in the other room no complaints till now, possibility this piece is\ndefective. Cloudtail and Amazon are one of my favourite service providers I\nthink you should tell your Voltas Dealers about such miss in quality checks.\n\n", "The product is good. However the voltas installation service is pathetic. They\nhave outsourced installation to some Rss enterprise whose technician are not\nskilled enough. They will suggest you to install the ac at the place which\nrequire you to buy more copper pipes and other stuff. I would recommend you to\nget the 2nd opinion from the local electrician to make sure what they are\nsaying is correct.\n\n", "I have ordered this AC and they delivered defective product where the\ncompressor was not working. Voltas ppl didn't even check it before\ninstallation and got 1500 payment from us. We got to know that something is\nwrong with the AC as we switched it on and the room wasn't cooling even after\nan hour. Then voltas ppl came to check and said the compressor is not working,\nafter checking for two days. And they are also like if at all we r getting new\nAC they will charge separately 1500 for the installation again. So unfare 😠. I\nhave initiated return for this product and the blue dart guy is not here yet\nto pick it up. Such a bad management Amazon.\n\n", "I totally confused whether it is trust-able to purchase this kind of product\nfrom online. Finally I took risk and purchased this product. The package and\neverything was very good as per the Amazon and Cloudtail Service. After\ninstallation I found there is a crack in the drainage tray of this product\nthen I started panic but Amazon has really given confident to me that if\nVoltas Customer Care does not fix that on time then we can definitely return\nthe product with in the 10days from the delivery date. So at least I was\nrelaxed from the Amazon service side. After I following up with the Voltas\nService, it was finally fixed. About this particular model, I can say it is an\naverage product not too good.  \nDrawback:  \n1\\. Little noisy inside when compressor run  \n2\\. NO adjust for horizontal air flow  \n3\\. Cooling is very much chill but not so much comfortable - it is my personal\nfeeling\n\n", "Hi  \nthis product was bought by me, but I had an issue with this product accessory,\n(the remote) which does not work well, the installation of AC was done only in\nthe last week of November in a new site. When the amazon home services team\nwas installing it, they found that the remote control device display is not\nfunctional. Now the return and replacement window has been closed. I don't\nknow how to get a replacement remote control equipment from the seller.\nchanging the battery also did not help me to have the remote working.  \nI guess, Amazon will have a way to help me from this situation.\n\n", "It has Aluminium Compressor but don't worry if you are not living near coastal\nareas. Copper Compressor is build for coastal areas. Nothing happens to\nAluminium Compressor. Such a good product in this price. This product consumes\n1 Unit/Hour. You can calculate as per your need. Ac takes 3-4 min to cool the\nroom when room temperature is 35. It has LED display but it can be switched\noff so don't worry. To be honest , it has smooth swinging. I don't find any\nnoisy voice. Go for it.  \n  \nBUT BUT BUT  \nVoltas service is such a Ridiculous and Pathetic. Voltas technician are not at\nall expert in installation. Better is go for local technicians whom you know.\nThey never listen and given genuine answer. This is big disappointment from\nVoltas.\n\n", "Not yet sure about the product, but the service quality of Voltas is pathetic.\nThere service representatives literally blackmail for providing services. I\npurchased this product from Amazon and after delivery registered an\ninstallation request at Voltas's call centre as suggested by Amazon. Along\nwith it I also made a request for gas top-up for my another voltas ac. The\nvoltas representative visited my premises and demanded service fee without\ndoing any thing on the pretext of labour charges, I requested them to charge\nme whatever their service fee is long with the final bill, but he refused to\ndo any work and said he will not do anything unless I pay the service fee. He\nsaid stuff like if you have bought voltas ac you have no where else to go (in\nNoida area) or return the voltas ac.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 April 2017", "on 10 March 2018", "on 13 October 2017", "on 6 May 2017", "on 28 March 2017", "on 23 October 2017", "on 20 May 2017", "on 7 December 2017", "on 15 April 2016", "on 29 June 2017"], "reviewer": ["Timmy", "Amazon Customer", "RAVI TEJA GUDIVADA", "DevM", "Amazon Customer", "pavithra", "Verified Customer", "Amazon Customer", "Rahul", "D.H"]}
]