[
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Good budget phone.", "I give u 4 star", "the look of the phone is very good, its very slim", "Good", "Great price, great deal, delivered less than 24 hrs and the phone is awesome", "Does its job!!!", "Awesome phone.", "Nice :)", "Excellent Budget phone.", "nice design, fast processer"], "review": ["Camera - moving objects photos are not coming properly otherwise normal photos\nare coming good, video is okay.  \n4G - though it is a dual SIM phone, only 1 SIM will support 4G, either SIM1 or\nSIM2.  \nHeat - Mobile heat is not coming.  \nProcessor speed - Speed of the processor is Good.  \nMusic - Music quality also good  \nPrice - this is very good phone in this budget.\n\n", "I love this phone but market me na cover milta he na temperd glass Chandigarh\njaisi jagha me accessories nahi milti tab gussa aata he but phone work\nproperly camere ki sab tarif karte he sahi me tarif e kabil he but mujhe music\njada pasand he to thoda bad feel hota he speaker and headphones me quality\nnahi he music ki otherwise phone is awesome\n\n", "I've been using this for 8 months and so far no issues has arrived. the look\nof the phone is very good, its very slim. but the battery could've been made\nbetter. and the only issue im facing with this handset is that i dont get the\ntempered glass for this in maket you'll have to buy it online at not very fair\nprice. the GUI is very good. the touch is very good. camera is good specially\nthe rear one front cam could've been better. so wont get better thn thn this\nat this range of money. I hope my review will help u. thnks.\n\n", "I'm writing this review after 2 weeks of usage. Overall phone performance is\ngood. Front camera is not good in night light. Slow motion video is awesome.\nNot getting heat while usage. Gets little heat while charging. HD games works\nwithout lag. Menu is little difficult arranged icons manually, getting used to\nit. Headset is not provided in the kit.\n\n", "After using for over a month, I am writing this review to tell the product is\njust too good. Dont I am not an avid user, where I play games or use phone to\nextreme levels however I use it to check frequent emails, and some very common\nsocial media apps.  \nThe camera is simply awesome with lot of features to explore.  \nI am very satisfied with the phone and this was delivered in less than 24 hrs.\n\n", "It does its job well considering the price. Camera is better than Samsung\nmobiles of same price. Dual camera set-up is good. Call quality is good.\nBattery can run whole day.  \nI think that the best thing about Honor phones is that they do not slow down\nlike Samsung phones (I guess that Samsung has already resolved that problem).  \nCheers!!!\n\n", "Awesome phone... I was looking for a budget phone with heavy performance, good\ndisplay, battery backup and extra features... All in one is honor phone.... I\ncan not pay more so choose 6x.it is really great. Internal IE features, I am\nloving it. At night, phone takes care of ur eyes by switching on eye care\noption which removes the blue light. At least, bettery goes one and half\nday... Camera is great, no regrets. Good budget phone.. If u can invest more\nthen 8 or 8pro looks and hardware was best.\n\n", "Phone is good.  \n🔋 lasts for a day .  \nAfter Nougat update phone runs decently.  \nAmazon is saying 15 months of warranty but i have got only 12 months warranty.\nYou can check it in Hicare app provided by Huawei.  \nPhone heat's up.\n\n", "Honor 6X (Grey, 64GB)  \n  \nPerfect phone for 12k - 13k  \n  \nPro :  \nPremium build  \nGorgeous, large display  \nMindblowing Camera - In this price range  \nPowerful processor - Brilliant processor  \nVery impressed with battery  \nRAM management is excellent  \n  \nCons :  \nNo protection for screen - No Gorilla Or Dragon trail glass, so need to\nprotect screen using good case and external screen protector  \nThe speaker is mono and average, not so loud.\n\n", "I am giving 5 stars but want give 4.5 bcoz no option for 4.5 star.  \nUsing about 9 days..  \nPros.  \nNo hanging, decent screen, nice design, fast processer, so nice camera with\ngood low light performance, nougat updated, very good battery backup, good\nearphone sound and smooth touch.  \nCons.  \nNo sound recorder on dialer, bit low output sound and sometime unresponsive\ntouch (may be in my handset, not sure)  \nConclusion.  \nA nice phone with very good price and I think good then reddi note 4 in some\nturns. (Note 4 has very good battery and nice customisation)\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 January 2018", "on 4 December 2017", "on 27 January 2018", "on 15 October 2017", "on 22 February 2018", "on 25 February 2018", "on 23 November 2017", "on 20 August 2017", "on 19 September 2017", "on 28 August 2017"], "reviewer": ["Mastanreddy", "Amazon Customer", "Jitendra Kumar", "Prabhu", "mohd abdul aleem", "Avijit Sett", "Rocky", "Amazon Customer", "Gaurav Aher", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["A Good Budget Mobile with Super Specs", "It's a nice phone for this price range", "Just awesome", "Best you can get at this price", "Awesome!", "Overall good, but battery capacity compromised", "Best in 11 to 13 thousands", "Product is very good with many feature battery backup good screen good camera ...", "A Decent Phone", "Worth buying phone if u want ur device to look good along with the good snapper."], "review": ["I bought this about 15 days back. After 2 weeks usage, find the Honor 6X great\nvalue for money at 13k (with accessories). Overall I would give it a rating of\n4.5 stars. 4 GB RAM and 64 GB Memory means cutting edge specs for Super\nPerformance.  \n  \n1\\. Battery - Very good. Easily lasts a day with moderate usage like mine.- 4\nstars  \n2\\. Speed - With 4 GB RAM its super fast. No lags. - 4.5 stars  \n3\\. Sensor - Finger print setup and usage very easy. - 4.5 stars  \n4\\. Memory - Mine's 64 GB and am left with about 48 GB for my files. Super -\n4.5 stars  \n5\\. Looks and feel - Very compact and fits nicely in your hands. Buttons\nwithin easy reach. Not exactly premium looks, but pretty good - 4.5 stars  \n6\\. Camera - I am not a heavy user of this feature but found the picture\nquality more than adequate. Excellent edit options for camera buffs - 5 stars  \n7\\. Call Quality - Good, clear and crisp, though I would have preferred the\nmaximum earpiece volume up by two notches - 4 stars  \n  \nCons I could notice are i) made in China tag (saw it on on the box) 2) lack of\nan instructions manual &, 3) no earphones. But that's too much to expect at\nthis price.  \n  \nTo sum up, a good budget phone with Super Specs.\n\n", "It's a nice phone for this price range. I have been using this for 2 months\nnow.  \nBuild quality is good  \nRam is good, that the phone doesn't hang. The new Android 7 is has this split\nscreen option where you can run two apps at the same time. I tried it and it\nworks fine without any heating problem or without closing other background\napps.  \nTried using it with hotspot on while charging to check for heating or hanging\nissues.. no over heating problem.  \nDisplay quality is good. Nice sound quality too.  \nHave no problems in making calls or anything. The person on the other end is\nable to hear clearly.  \nThe phone has a 4G shortcut icon so that we can access 4g even at low coverage\nareas, this comes in pretty handy if you have to send a document or something\nwhile traveling or while in a low network area. Camera quality is not that\nbad. Some pics are actually pretty awesome. Camera has some good features.\nFront cam is also good. Front cam image is not dark or blurry.  \nFingerprint sensor works great. Detects really fast . Battery life is also\ngood. Doesn't drain quickly.  \nThe only setback is it doesn't have Gorilla glass. So you try not to drop it\ntoo much. Also it has a small curvy display, which is good for viewing, but it\nis hard to find a tempered glass that fit perfectly, because of the curve. But\nall the phones with curvy display has this same problem.  \nIn conclusion, I'm really happy with this phone, it's powerful, and does\neverything it is supposed to do..\n\n", "Mobile is awesome.  \nUsing from past 4 months. No single issue till now.  \nExcellent camera quality.  \nGood performance.  \nJust go for it\n\n", "The phone's camera is best you can get at this price. Performance is very\nsmooth and never lags. NO HEATHING PROBLEMS. Can handle games like modern\ncombat, asphalt extreme, asphalt 8, dead trigger 2 very smoothly. I bought\nthis phone 11 months ago and still it is as good as new. Battery backup is\nvery awesome although it is 3350 but it woks like more than 4000. Lasts for 1\nand ½ days easily.\n\n", "I have used the phone for about a month and I would say it's splendid!  \nI purchased this phone during the great Indian sale and got the 64gb varient\nfor 13k and further I am eligible for 1.5k cashback. That amounts to 11.5k and\nat this price it's an absolute steal.  \nPROS:  \n->Camera (Best in class for the price, hands down)  \n->Day to day performance is top notch and absolutely no heating. Kirin 655 rocks.  \n-> Battery life is decent 1 and half days on a single charge and normal usage. Phone charges in about 2hrs 15 minutes.  \n->All sensors are present and pedometer is a bonus.  \n->EMUI 5 is feature rich, elegant and snappy.  \n->The screen has nice viewing angles and the colours are pretty accurate. It's quite sharp and and has enough brightness for outdoor visibility.  \n  \nCONS:  \n->With dual SIM only one slot acts as 4G and the other reverts to 2G only.  \n->The back has a faint and wierd creeking sound but it can be easily fixed by using a case, so not a major issue.  \n->The speaker output has decent loudness but the quality is not up to the mark.  \n->No Equaliser settings are present in the phone.  \n->No Gorilla Glass protection.  \n  \nI would advise everyone to put case on the phone as it helps in protecting the\ncamera lens and the edges are slightly raised and screen is also protected.\n\n", "Great.  \nBattery backup is good,lasts for 1 day in normal heavy use,, but full screen\non time with hd youtube browsing will only last for 5 to 6 hours. It should\nhave more battery capacity about 5000 mah, if so, then this phn will be a\nmaster blaster adaaru item.... He he...  \nTouch smoothness is not good,, most of times while scrolling down, it slips\nand not in our control,, and this was soo irritating, i think after some time\ni will become adjust with it.  \nLength is much lengthy. Not suitable in one hand.  \nPhone is slippery, u can't use it without good back cover.  \nFront camera sucks,,, too bad... But back cam is too much good, gives perfect\nshots...  \nUI is complicated, but good when u used to it.  \nSlim and weightless.  \nOverall good, but battery capacity compromised.\n\n", "I'm fully satisfied with its features and performance.  \nCamera is far better than redmi devices and vivo y55s.\n\n", "Product is very good with many feature battery backup good screen good camera\nalso good only i love this product.  \n  \nonly one thing witch isn't good earphone not available with this handset,\n(Already mention in product) i know that before buy Honor 6X,\n\n", "Pros :  \nSleek Design.  \nGood Viewing Angles.  \nAmazing Camera ( In Day Light ).  \nDon't know if this supports fast charging but charges the phone is less than 2\nhours.  \nFingerprint Sensor Functionalities.  \nDecent Battery Backup.  \nCall connectivity is amazing.  \n  \nCons:  \nEven though I got an update to Android. 7.1.1 the phone hangs up a lot and\nneed to force restart every time this happens.  \nLow light photography is below average.  \nSelfies don't have that extra punch to the image.  \nPhone volume and earphones volume not so great.  \nDoesn't connect properly to any public shared wifi.  \nNot enough range for wifi.  \n3G/4G lacks the speed that other devices carry.  \nNo resale value.\n\n", "This is my first time to write review on Amazon. I used to change my phone\nevery 2-3 months depend on the impression of the phone that gave me. But after\nusing honor 6x for a week I feel I may spend more time on this phone. Main\nhighlight feature of this phone  \n1\\. Dual camera set up which gives an impressive result.  \n2\\. The phone looks really good and lightweight.  \n3\\. Battery capacities is more than average. It can easily last a day for a\nnormal user.  \n4\\. This phone is value for money.  \n5\\. While holding the phone the device feels very slim.  \n6\\. UI of the phone is very good.  \n7\\. This phone is made for a low light shooting.  \n  \nHowever, I face some issue not actually an issue but I must say my dislike\nabout this phone.  \n1\\. Battery got heating up if u r charging for a long time.  \n2\\. If u r expecting too much in Bokeh effect or portrait mode pliz don't\nsince the bokeh effect does't came out expected result as that of one plus 5\nor iPhone 7. I should say the quality of bokeh effect is poor. U wound't get\nexpected result.  \n3\\. The processor of the phone is far lacking behind if u r a gamer never\nconsidered buying it. I play some simple game and it crashed.  \n  \nOverall this phone is worth buying.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 December 2017", "on 21 September 2017", "on 18 July 2017", "on 13 February 2018", "on 17 September 2017", "on 1 December 2017", "on 28 July 2017", "on 24 July 2017", "on 17 November 2017", "on 16 August 2017"], "reviewer": ["Ramg", "rashique", "Srinivas", "Jabir", "Prashant", "jaison elias", "Alfanse", "Amazon Customer", "Akshay Dugni", "Gongz"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Its really swag phone ... Go for your Swag", "best phone for photography lovers in this price tag", "My first impressions and Points to note", "There underrated Superstar!", "better call quality and some processing power for video games/media", "Nice pick for this price range", "Awesome phone", "A phone worth buying if you are photo geneic or photography with low budget!!", "doesn't hangs good phone", "Do not wait......."], "review": ["Ultimate design, slim & very smooth touch. Am very happy with product and its\ncamera quality, battery performance & ofcourse processing.  \nIf u looking for a best phone in 14000 range then go for it. Am using phone\nlast 1 week so happy with product.  \nDisadvantage- not available.\n\n", "best phone for photography lovers in this price tag..GO FOR IT.. BUT BEFORE\nTHAT YOU SHOULD KNOW YOUR PRIORITY..  \n  \nPROS- CAMERA IS BEST WITH HUGE OPTIONS  \nDISPLAY QUALITY ALSO GOOD(FHD)  \nBATTERY BACKUP AWESOME (AVG 8HOURS SOT)  \nUI ALSO HIGHLY CUSTOMISED..  \nPHONE LOOKS GREAT WITH DUAL CAMERA  \n  \nCONS-audio output through speaker is not so loud.. same case in case of\nearphone(it's sound quality good but not so loud)  \n  \n2nd sim slot only supports only 2g..  \n  \nHIGH QUALITY GAME, (bigger than 2gb) lag sometimes..  \n  \nACCORDING TO MY OPINION This phone is great.... go for it.. rest depends on\nyour choice. THANKS..\n\n", "Got it yesterday and I love it. It has quick charging which is a blessing and\nthe battery is also pretty strong. The phone has no issues latching on to any\nof the bands used by Reliance Jio for VoLTE calls and it's crystal clear with\nno issues with call or data reception. The fingerprint sensor is really good\nand quick. You will get Android 7 Nougat and EMUI 5 update once you boot up\nthe phone and check for updates. And Android Oreo willl also come to the phone\nas Honor already confirmed it. The camera is also good. Out of the 64 GB you\nget around 51gb of usable internal storage.  \n  \nThings to note  \n  \nYou don't get earphones or protective case with the device. And screen\nprotector is already applied out of the box.  \n  \nIt's a wise investment.\n\n", "The Honor 6x is a very good entry level smartphone!  \nFor the price its superb!  \nWay better in camera comparison than the redmi note 4  \nThe major thing of me purchasing this phone was the camera specs, trust me\nthis guy will deliver you some very good photos in day as well as low lights!  \nThe 3gb ram version was kinda the optimum choice for me because i am not a\nhardcore user!  \nBut i am running some very heavy files simultaneously and they run with no\nproblem whatsoever!  \nAnd talking about memory there's always room for a memory card!  \nThe phone actually looks prettier in person  \nIt is sleek but slippery  \nThe screen clarity is very very good!  \nI didn't find any heating issue after using the camera for too long  \nThe battery backup is good too!  \nHighly recommended!  \nGo for it!\n\n", "My first Huawei cellphone. It is durable and has all features i need. Mainly i\nwanted long battery life, better call quality and some processing power for\nvideo games/media. My previous smartphone was Google nexus 5 and although you\ncant compare a cellphone that was built 5 years ago with a celphone built\nrecently , i feel huawei purchase was not bad at all. 2 days battery life ( no\nwifi), reasonable camera, not very expensive and still impressive enough to\nshow off to friends.\n\n", "Honor - i could mark as reliability. It is quite suited for this product.\nEvery software and hardware available with this kit is fantastic. Only area\nwhich I feel low is from its camera. If you zoom in a picture once taken, it\nis not so precise (which pix-elate). This camera output compensate color and\ndoesnot produce the exact description of colors in the object.  \n  \nI tried to pic a car where it was covered with dust particles, the camera\ndoesn't capture the dust particles, rather it compensate the majority color on\nthe entire car.  \n  \nOverall, I'm completely satisfied with the product's performance. I love when\nI place Asphalt 8 with this mobile. No heating issue or battery drain-up. Love\nit!  \n  \nThank you, Honor.\n\n", "Ultimate phone in the price segment. Now on emui 5.0 with nougat. Looks\nstylish in black. No problems till now. Better than competitors and regular\nupdates. Camera is awesome as per price. Battery life is amazing. Install\nhibernator app from playstore. Better than redmi note 4 and moto g4 plus.  \n  \nPros  \n-Camera awesome in both lighting conditions.  \n-Battery er life excellent even with heavy usage lasts 24 hours.  \n-Android 7.0 and emui 5.01  \n-Dual camera  \n-No heating problem  \n-will get oreo update  \n  \nCons  \n-slow motion video at 480p only  \n-image noisy bit in indoor conditions with low lighting  \n-whatsapp hangs sometimes\n\n", "Perfect camera phone , dual camera is just good ya it's admittable that the\nportrait is not up to the mark because of the setup. But this kind of dual\nsetup helps you to get a better low light pictures. That's why OnePlus also\nSwitched to this setup in op5 T . And the front cam is just the best you could\nget at this price point, no other phone perfoms so well with front cam.  \nYa if you just need a 2x zoom and better portrait choose the Mi a1 , and need\na better low light, selfi mode choose this one and the pro mode is best part\nand no other phone would provide such a pro mode. Ya I know Honor 7x has come\n, but it's not a big upgrade as screen resolution is lower and beside the\ninfinity display the phone has nothing new , even the design is not good for\nregular use as could damage the cam setup. Processor is a bit upgraded not\nthat much.  \nBut I think proper care and covers may help & choosing that one is also good\nif you just need a new gen display. But if you want better resolution opt for\nthis or honor 9i (which is bit costly).  \nPerformance___________________________________the performance is good and can\nplay many of the graphic intensive games without lags and can store much of\napps and games . So performance is not a issue, sometimes now I get some\nframedrops in some of the games very rarely I think it's bcz I have loaded\nmore than 100 apps and games.  \nDesign_________________________________________design is good but very prone\nto scratch and damages as it is metal surfaced , a slight hit could get some\nstraches or bends and the screen is too delicate can break if you drop it down\n. So get a tempered glass and cover so that it doesn't get damaged.  \nMany say that the audio quality of speakers is not good . But actually it's\ngood and gives loud sound in indoors. Outdoors every phone just fails to get a\naudible sound tested with Mi a1 and Xiaomi note 4 .  \nBattery life is good due to the battery backup and software, for a normal user\nit's two days and a heavy users may get a battery life of 1 day.  \n___so at last the it's up to you, choose according to your needs and\npreferences & not according to friends or 3rd person advice or tte best value\nfor money phone_______________________________  \nI also on YT , channel name is TecH 16 and also there a fb page , any doubts\nor difficulty to choose a phone just msg me your budget, requirements and\npreferences of features and i would suggest you the best.\n\n", "Using it for more than a month good product  \nIt came with a scratch guard on the screen that's too a good one.  \nOut of 4GB ram OS and other process tooks nearly 2.2 gb of ram.  \nCons  \nFor screen mirroring it connects and show pictures but it lags not good for\nscreen mirroring for my sony Tv.  \nBut after restarting the phone screen mirroring worked well.  \nbut still now it doesn't hangs good phone.\n\n", "I purchased this hand set a week ago.  \nIt is really superb. Clear and smooth screen  \nVery fast processor. 4 gb and 64 GB is excellent combination.  \n  \nBattery life is too good with saving functions  \n  \nHandy , excellent voice clarity and camera is too good  \n  \nYou will get 50 GB space post soft ware updation  \n  \nHas two profile option and is really class apart\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 August 2017", "on 12 November 2017", "on 23 October 2017", "on 12 August 2017", "on 11 August 2017", "on 15 March 2018", "on 27 September 2017", "on 24 December 2017", "on 16 November 2017", "on 15 October 2017"], "reviewer": ["Kr Ash", "Arunraj", "Robin T.", "Mandar savant", "Nikhil Jain", "sarago.k", "Anur", "vivek", "Amazon Customer", "Adithya"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Just great, as per discription, worth buy at this range", "Awesome in this price Range", "Good phone inside a flimsy body", "Excellent Phone", "Great value for money", "Thanks to Honor and Huawei for this amazing mobile. I have described about its working.", "Worth for money..", "Definitely worth every penny", "Impressive at the price", "A do good & feel good phone"], "review": ["Everything about this smartphone is good but you cannot use two Sims and\nmemory card simultaneously  \n  \nBut this problem is fixed when you have OTG cable and pendrive. As far as it\nis technology advance phone in this price range\n\n", "Awesome Product ,awesome camera, works charm no heating, no lag go for it gys\nwithout any hesitation every thing is great in this mobile.. I'm attached some\nphotos to show the camera quality n battery backup is also great... Thanx\n\n", "Excellent budget phone just as advertised and in fact more. Astounding battery\nconsumption optimization, thanks to the EMUI. Performance is good but the\nmetal body causes makes it hot fast... Maybe that will affect the chipset life\nin the long run. Though build quality is good, durability is down the drain -\nno Gorilla glass, no support of metal body to phone giving no structural\nsupport. Charging takes a while but is compensated by battery life. Cameras\nare beyond excellence. Overall its a good product with bad durability. If you\nwant to go for it, you have to spend a little more on tempered glass and\nprotective cover if you want it to stay all nice and fast even after a few\ndrops.\n\n", "Best Camera and rest all is better than most phones in the market although a\nlittle improvement in battery go for it without any hesitation!!Although i\nwould prefer Redmi Note 4 over Honor 6x it is tough competitor...\n\n", "Amazing product- totally happy. Great camera.. one of the most affordable dual\ncameras when I bought.. Now you've more options in this price range. Detailed\nreview on my blog. Limitations- either 2 SIM Cards or 1 SIM and 1 memory.\nCan't have 2 SIM card + memory card. The non removable battery and having to\ncarry that pin is not very convenient. Otherwise overall very good phone.\n\n", "I love honor so so so much.. Honor is my love. I m a hardcore fan of Huawei\nand honor. I purchased honor holy and then I was amazed with its speciality.\nThen I unfortunately bought redmi Note4 in between but disappointed with its\nusage. Then opted this mobile which is honor 6x. It fulfilled all my\nexpectations and beyond my expectations too. It has great things which other\nmobiles dont have. It does things which latest mobiles fails to do. Even\nthough I have dropped it several times it didnt break. I dropped my phone from\na running bus, trust me Still worked awesome and no scratch too. It has so\nmany specifications really u will enjoy when u use it. Camera is good. It has\nmany options too. U can also have running video at the top to watch and use ur\nmobile simultaneously. It never hangs even if u use more than half space of\ninternal memory. Redmi mobiles and Samsungs hangs a lot. This phone doesnt\nheat up too. It has WiFi and wifi bridge too and another coolest option is\nwhen u shake ur mobile the wallpaper display will change automatically and it\nalso contains voice command calls too which means it detects ur voice and\ncalls that particular person. U can also change the color of the display And\nits size too. This mobile gives so many inbuilt applications to enjoy such as\nmirror, campus,health check and all UC apps. If u buy this mobile u will\nsurely enjoy. What I have said is very little. There is lot more to amuse us.\nThanks for those who read this.I have also attached few pictures which I room\nfrom this honor 6x mobile.\n\n", "Super mobile .. But note some drawbacks if it is ok.. Then go for it..  \n1\\. Video clarity is low  \n2\\. Hybrid sim slot  \n3\\. Slippery while hand it  \n4\\. No front flash  \n5\\. Speaker quality is low.  \n6\\. Ear phone and vr headset not available  \n7\\. Phone memory storage availablity is 49gb only.\n\n", "I bought this phone for 15k. I still won't regret even though the prices have\nfallen diwn to 12k. Been using this phone for almost 6 months now and it is\none of the best phones out there.  \nThe build quality is great, it feels awesome to hold in hand. It has slipped\nmany times from heights as far above as my shoulder, yet, no shatters or\ndents. The screen as well as fingerprint sensor is very responsive. The best\nthing in the phone is its camera. Kirin processor adds a cherry on the top by\ngiving very good performance and optimizing battery usage despite of having a\nsmall one.\n\n", "Overall very good phone at this price point. I have used this phone for more\nthan 6 months now.  \nPositives : Excellent battery management, processor speed is very good and\ndon't see a lag, upgrades for operating systems and installations have been\nvery smooth so far, does not need to install any additional utility apps as\nthe base system brings most necessary ones like cleaning tool, etc  \nCould be better : camera in low light, dual sim but one slot gets into micro\nSD\n\n", "I used 5 phones before this in last 5 years and then I used it, I must say I\nloved it. If you are not hungry for high end games and high end name then it's\nfor you. Superb phone with great look, light weught and comfortable to use.\nExcellent battery life which easily stays with you for more than 24 hours if\nyou use your phone for continuous browsing and average 50-60 phone calls.  \nPerformance is buttery smooth with no lag at all and camera is superb with\nmultiple modes which are actually useful.  \n  \nHighly recommended for the people who are looking for a great midrange device\nwhich is good looking, light weight and has great battery, smooth performance\nand superb camera.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 August 2017", "on 28 September 2017", "on 16 February 2018", "on 6 September 2017", "on 10 September 2017", "on 26 October 2017", "on 14 August 2017", "on 15 December 2017", "on 22 September 2017", "on 26 September 2017"], "reviewer": ["Gaurab Gurender", "ashish", "G.Aaditya", "Amazon Customer", "Shrinidhi Hande", "RAHIMUNNISSA", "Venkatesh", "Chetan Chawla", "Vasanth", "shekhar suman"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Blindly buy :)", "Best phone I ever used ..", "Fully loaded value for money package", "Best phone at this price range.", "Found better than the order mobile phones", "Better than redmi", "Its a BATTLE  of CAMERA & MUSIC", "The amazing Honor 6X mobile!", "Excellent camera, premium feel but just average sound output.", "Best u can get to ur money....."], "review": ["Worth for money.Used 3days and i am making this review  \nPros:  \n1.Huge Battery life  \n2.Attractive UI  \n3.Fast charging  \n4.Responsive Fingerprint sensor  \n5.Supports 128gb SD Card.(I recommend to buy 64gb model only, since Honor 6x\nhas Hybrid slot not a dedicated slot (2Sims can be inserted or 1Sim+SD Card))  \n6.Supports OTG  \nConc:  \nSlightly Heavy.No other problems\n\n", "Initially I purchased Samsung J7 prime being Samsung user for last 10 years\n.Never had second thought to buy any other brand.within 3 days connectivity\nissues .. Service centre accepted return..after lot of research, thought of\ntaking risk to go with Honor 8 but dropped being single sim..and I placed\norder for 6x..  \nBest phone ..really Happy ..it can beat high end mobiles ...all of us know any\nmobile will last only for 2 years..then why spend 20-30 k ?  \nThis phone I loved it...good speed , Battery is best, Good network\nconnectivity, UI is one of the best ...many small things are useful..  \nI think within the price this deliveries very high end performance..I am end\nuser and first time writing review on website being satisfied with brand.\n\n", "At this price it's an unbelievably super hit phone..... camera is better than\nmany expensive phones, processor is so advance that you can work on several\napps at the same time, back is metallic with a finger print scanner that makes\nthis phone commendable........\n\n", "Im sure most of you might think the k8 note or coolpadcool1 are almost neck to\nneck with this phone... However, coolpadcool1 has heating issues while my\nexperience with lenovo has not been very good. Though i have not experienced\nthis myself but through two of my very close friends both of whom owned a\nlenovo phone once and suffered hardware problems within a yead and very poor\ncustomer service. In the end they had to buy a new phone because they had no\nother choice.  \nThe honor 6x is not only a feature rich phone but also packs a punch with a\ngood battery life and performance along with a very good camera. It is for me\nan all-rounder phone who knows how to do his job. And does it well.\n\n", "It has been delivered on 14th August 2017. I was bit scared of this brand but\nwhen I started using this... Found better than the order mobile phones.\nSpecially it has a very good camera and camera focus. It look like, pictures\nhas been shot from a DSLR camera. I am playing the game from the day I bought,\nbut doesn't hang or heat. Very good mobile phone in this price range. 😀😀😀😀😀😀😀😀\n\n", "My mom's been using it for a while now. Better than redmi... OPPO... vivo...\netc... I bought it at a higher price as it was a new launch then. Now cheaper.\nBuy this phone. This phone can be compared to Samsung's 15 to 20k phone. 6x\nhas never hanged and my mom uses a lot of apps and games. I'm impressed.\n\n", "After using phone for one week..i struggled between redmi4 and honor6x ..Main\nreason to buy this CAMERA ..becoz camera and battery are the most people's\nrequirements..go for pros and cons ...  \nCONS-  \n1.Biggest problem in this honor device is..Audio output..its not only the\nvolume but also audio output itself is baaaad..i am a audiophile..i thought to\ncorrect it by equalizers but its a time waste ..so if u luv music u will get\nhurt by the honor audio output..i have used senheiser/sony/skull candy ..but\nhonors audio output beats their excellency nd give u the horrible output  \n2.next all are minor cons- some times glitches  \nhappen,hang one for 1or 2secnds when there is heavy functioning  \n3.In camera in normal mode also..the more the clarity in the middle grids..the\nmore the blurr in the corners...corners are so blurred in the images..dnt knw\nwhy ..  \n4\\. I just really dnt like the branding in front wasting so much space..  \n5.let look into some NO - NO ir (infra red )facility + in redmi devices, No\ndouble tap sensor, No fast charging its usb type B only ...dont use while\ncharging..back is metallic one so u will feel definitely heat .. after\ncharging remove the pin keep for 5-10 mints then use ..  \nNow PROS Which u will like more  \n1.BATTERY-..NEVER EXPECTED This from honor ..its a 3400 mah battery ...but it\ncan make ur whole day ..screen on time with mobile data like heavy usage -\neasily u can get 13-14 hrs a day..for rest if ur a just popup visitor u can\nlast for 1nd half day easily... specifically should mention about the power\nsaving modes  \n2 modes - power saving mode& ultra power saving mode -excellent ways for\nbattery life  \n3.RAM management- u wnt believe this ..actually i got 3 gb ram one ..in my mi\ntab when i open about 10 apps the ram will be about jst 100 mb left and phone\nwill be slow...but i was shocked with honor ...i nearly opened about 15\napps..its still gives 1.8gb freee..and when u open these apps they wont reload\nalso...this might be the main reason for such a long battery life also..i was\nso impressed  \n3.CAMERA- As u all knw it is at its best..best thing is front cam is so good\nand in artificial light alsoit gives u the best output.. but dnt expect beyond\nwith this..its a 13mp cam only it cant make miracles in CLARITY but showcases\nthe pic in beautiful way ..up on zooming its all grain u get ..but its the\nbest camera i have used around 10k range..best for photography people  \nConclusion-BADLY needed batterylife and photography..go for it  \nBut if u luv music - think twice /thrice before buying it ..\n\n", "I am so happy with this Honor mobile! At this modest price it is offering a\nvery fast and flawless system equipped with all the weapons needed for a\nprofessional use and at the same time it is an excellent playmate! What a\nwonderful camera! Thank you Huawei!\n\n", "Excellent camera quality --- Both front & rear however the review is all for\nlooks, camera, speed & display etc but not for music output quality is NOT\nGOOD AT ALL both earphone & loudspeaker.  \nIf you are interested in phone with real good music output, this wont be a\nprime suggestion.\n\n", "I am using this phone from past 28 days....  \nMy previous mobile is Honor 4c which made me choose Honor again....  \nHonor 6x is un doubtedly the best phone in this budget.  \nIt got good camera, both rear and front  \nPerformance is awesome and no lag at all.  \nUser interface looks rich with customised software EMUI....  \nno heating at all.  \nIt charges fast.  \nSlim and premium in look...  \nThe only disappointment is its battery... Though it is having 3340 mah it\nseems like 3000 mah....  \nMy suggestion is go for it.... It is the best what u will get in this\nbudget....\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 August 2017", "on 15 August 2017", "on 29 September 2017", "on 20 August 2017", "on 5 November 2017", "on 29 September 2017", "on 25 October 2017", "on 14 January 2018", "on 14 November 2017", "on 3 October 2017"], "reviewer": ["Chelladhurai S D", "Amazon Customer", "Vaibhav Chauhan", "Olivia Banerjee", "Luxmi", "Virmohan S.", "MOHIT REDDY", "Sandip S.", "Mrs Dutta", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Excellent value for money, does basic things well", "Awesome phone with amazing specs", "No.1 smart phone in this range...!!!", "Good For the Price", "Best camera phone in this price range", "Best Phone in this price segment.", "Good phone with some great features...", "Best dual camera phone in this price range", "excellent camera with document scanner facility and manual mode", "Blindly go for it"], "review": ["I have used honor 5x before which was great value for money  \nHonor 6x is also good VFM. Oveall lot of improvements in the UI and I also use\nthe googleNow launcher. the fingerprint and voice recognition are excellent. I\nam not .a power user of the dual camera so cannot comment. I use chrome,\nyoutube, gmail, music, all very smooth  \nBattery Life is good.  \nA couple of small issues, alarm clock doesn't work (I think this is an android\nthing) - I downloaded app for it. And occasionally it doesn't pick up mobile\ninternet when I move out of wifi needs a restart  \nRest all features are great\n\n", "Amazing phone at this price. I bought it in Great indian sale and the product\nwas delivered just within 4 days.  \n  \nAbout the phone:  \nIt is amazing phone by honor. The blend of dual camera Kirin 655 octa core\nprocessor and 4gb ram fits in and works perfectly although the software\ninstalled was marshmallow 6.0 and i expected it to come with nougat installed\nbut its okay you can manually update the phone.  \nThe design and build quality is also good \"Better then MI phones\". It has 64gb\ninternal storage so you never run out of storage and the UI is also very good.\n\n", "Its an outstanding combo of camera and GUI.specially d dslr mode is\namazing...I tried Redmi note 4 also,but camera quality was hazy and quite\ndark,even u can take pics ni d day time it's seems like it's a ni8 pic.so\nfinally I purchased honor 6x.  \nPros:1) amazing dual camera, especially front one.  \n2).it's GUI  \n3).it's a slim phone.  \n4).fast charging.  \n5).many amazing hidden features.  \n6).it's a no.1 in dis range.  \nCons:1).dual app features for all app,only provided in it for fb & what's app.  \n2).sound quality should be improved.  \n  \nBut overall,if you are going for review in YouTube n all,it's my suggestion\ndon't mingle in up,simply have a look in ur surrounding if any one have your\ndesired or short listed pH so take a personal experience on it by operating\nit...dats will help you to buy ur dream pH...👍\n\n", "I have been using this from around last 3 months, previously i was using motoG\nTurbo and it is a lot better phone in terms of everything except the build\nquality. screen get scratched easily and phone is bend from one side i don't\neven realized when.  \n  \n-Camera  \nIt has a great camera in this price range and it offers a lot of shooting\nmodes, Portrait mode is just fine, i don't use it much but sometimes it gives\nreally good results. it even provides a pro mode but sadly no raw support, it\ncan shoot 1080 video with good audio pick up, it can shoot slow motion video\nbut it is bad. front camera and video quality is decent. overall the camera is\nreally good for the price and moreover the camera software rocks !!  \n  \n\\- Battery  \nOne can expect a full day of battery life with heavy usage easily. if you are\na normal use it can last you about1.5 to 2 days. Very Happy with the battery\ncause i never have to think about it for the whole day. it would have been\ngreat to see the fast charging though.  \n  \n-Display  \nGreat Display with good color reproduction.  \n  \n-Performance  \nI don't play games so i wont talk about gaming performance. Overall good\nperformance in day to day usage. but now i feel there is a bit of lag\nsometimes after updating to emui 5.0, it happens rarely till now so, not much\nworried about it.  \n  \nIf you are a person who wants good camera phone in this price range with\ndecent battery life go for it. i chose it over redmi note 4 for camera.  \ni wish it would have a better build quality, a bit loud n clear audio from\nspeakers and raw support in camera. Hope this helps.  \n  \nThanks\n\n", "Honor 6X is the best camera smartphone you can buy at this price.  \nLet me start my review.  \nPROS :  \n1\\. 5.5 FHD display  \n2\\. Awesome battery life  \n3\\. Quick charging  \n4\\. 64 GB Memory is enough  \n5\\. Fingerprint Sensor is very accurate.  \n6\\. Multi tasking is very smooth.  \n7\\. Additional uses of fingerprint sensor like swipe left right to change\npicture when you have opened the gallery. Swipe up down to open notifications\nand swipe right to clear notifications.  \n8\\. Front camera takes pretty good selfies.  \n  \nCONS :  \n1\\. Hybrid slot  \n2\\. No USB C type cable  \n3\\. No front flash  \n  \nVerdict: If you are confused between redmi note 4 or honor 6x then you must go\nfor honor. If you think about price then it is only 1k more than note and on\nthe occasion of so many sales on Amazon you can get it for 13k which is\nsimilar to redmi note 4. Redmi note 4 only have more mah of battery but in all\nother departments honor 6x completely outclass RMN4. And when it comes to\nbattery also it has quick charge which takes less time when it comes to\ncharging. So without having a 2nd thought you can go for this phone if you are\nlooking for a solid smartphone with pretty good camera, battery, performance\nand after sale services. Huawei(honor) is a more established brand then xiaomi\nand have more number of service center in India so you will get better after\nsale services.\n\n", "I am totally satisfied with this phone. I bought this phone at Rs.9,999. I am\ngoing to list the pros and cons of this device.  \n  \nPros.  \n1\\. Best Camera in this price segment.  \n2\\. Its speakers are not bad as described in the other reviews. The sound\nquality is not excellent but is up to the mark.  \n3\\. Performance of this device is very good. I have not experienced any lags\nin 15 days of usage of this phone. There is always 1.7-1.8gb of RAM free in\nthe 3gb variant.  \n4\\. Multitasking is very good. Memory Management is excellent.  \n5\\. Call Quality is excellent.  \n6\\. Battery Backup is also very good. I charge this phone once in 1.5 days.  \n  \nCons.  \nThe only con is that it has a hybrid sim slot. But you can use both sim cards\nand a memory card by buying a hybrid sim adapter.  \n  \nOverall this phone is worth buying as it is the best in its class.\n\n", "Today i am going to give you guys a short review on honor 6x. Well, the\npackaging was great. The was in good condition.  \n1\\. This phones main feature is the dual camera 12MP+2MP. The camera quality\nis good during daylight.But tge night or low light photo shoot is not that\ngreat. Maybe better than some other mid range phone but, not very good. I am\nkinda disappointed on the camera. Maybe i expected too much.  \n2\\. The screen quality is good. Its 1920x1080 resolution which is great. The\nsunlight readability is also fine. Overall i am happy with the 2.5D screen.\nThe videos look great.  \n3\\. The sound quality is not good. The bass is worse. The high and lows are\nalso medium. The speaker is not good for listening to music.  \n4\\. The battery works fine. It gives a full day usage with normal use. I am\npretty satisfied with its battery.  \n5\\. The performance is not great in Android 6.0. But after upgrading to\nAndroid 7.0 the performance is superb. You can run any high def. games\nsmoothly on this device. The memory management is also good in this phone.  \n6\\. This phone doesn't include headphone with it. Although sound in headphone\nis far better than speaker.\n\n", "what I really like about the phone is its standout camera features. With this\nphone I can actually use the pro mode which enables me to adjust the images\nexactly the right adjustments. and the other features of this phone are\nactually proving quite handy without the need to install third party apps. I\nlove this phone. I'm a guy whose priority for buying an android phone is the\ncamera. And I can tell you I'm really satisfied with this one. in fact I did\ncompare with my cousin's dual camera phone of the same range. but this phone\nstands out excellent in almost all aspects.  \nThe battrey backup is awesome as it gives you options to actually control the\napps permissions to run in background so in that way you can save a lot of\npower.  \nWith all the negative comments about this phone, I don't find them worthy,\nit's all about how you use it and how you customize it.\n\n", "Superb phone, long lasting battery, excellent camera with document scanner\nfacility and manual mode. Manual mode make u a professional photographer, the\nforemost important thing is it's not get heated even after hours of gaming or\nvideo streaming. While charging also it's not get heated and fully charged\nwithin 2 hrs. The USP of the phone is tower picking, I have Moto G3 and\nSamsung's a9. It not even pick up tower signal in remote areas but Honor 6x is\nexcellent in it. It get the signal with full 4g support. Am using this phone\nfor last one month. Really worth for bugs.\n\n", "Bought it(4 gb, 64gb) on Rs.7796/- after exchanging my 20 month old coolpad\nnote 3 lite on 2103 rs.  \nNow coming to device.this device loaded with marshmallow os, thankfully got\nnogut on same day ota update.  \nEmui 5.0 have app drawer feature. I dont like multiple home screen feature. I\nam waiting for oreo update now, however there is no confirmation from honor\nside, kept my finger crossed  \nCamera- i have bought this phone just for camera. Excellent low light\nperformance. This device easily beat mi a1, Moto g5s plus in low light\nperformance. However bokeh mode is not good.cant detect edges properly. But\ncamera is best i am loving this camera  \nBattery- this device last typical working day please note i am heavy user. So\nthough you are heavy user , you dont need to connect charger in a day. Battery\nlast 1.5 day for moderate user  \nScreen quality- screen quality is excellent  \nBuild quality is also excellent  \nEmui 5.0- is far better than other chinese ui and stock android version  \nThough this device launched in 2017 still it is best buy if you get below 10\nk.dont go for honor 9 lite , its having glass back, easily broke in just one\nfall.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 October 2017", "on 28 January 2018", "on 22 October 2017", "on 31 August 2017", "on 1 September 2017", "on 19 November 2017", "on 15 August 2017", "on 21 November 2017", "on 14 August 2017", "on 4 March 2018"], "reviewer": ["Jai Natarajan", "Amazon Customer", "Robin", "Amazon Customer", "Ajay Budania", "Subhadeep Dan", "deb", "Iaineh", "R RAJESH", "vaibhav nagarkar"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Camera is quite good and gives the SLR feelings with depth analyzer", "Super duper... Cool phone...", "Total value for money", "True Reviews", "The phone is very good with premium look and thin body", "Really Amazing", "Highly Recommended..", "Overall a very good smartphone", "Dual Camera phone @ budget 10990 with great stylish looks...", "Writing review after 9 months usage."], "review": ["Camera is quite good and gives the SLR feelings with depth analyzer. Although\nthe selfie cam requires improvement.  \nPerformance wise okay sort in this price range  \nIn built apps are good and in house OS junk & memory handlers are a big plus\nwhich requires no third party app installation to maintain this phone and it's\nquite good  \nPhone's output volumes - both from loudspeaker and call speaker are bit less,\nwith headphones it produces decent sound though  \nOS updates are okay, it delivers what it promised but updates appear\nconsiderably later than other products in the market  \nBattery is ok sort, with the provide mAH, it should have performed better  \nBig turn off is hybrid second SIM slot, which considerably lessens opportunity\nas a smartphone user, I mean why companies even think of hybrid slots in this\nage!!!!  \nAll in all, a good candidate with decent camera features in sub 15K category.\n\n", "Awesome product... Though honor doesn't advertise it self much but I could\nsurely assure that it is no less than the big brands in our Indian market...\nVery feature of the phone is at its best... And the most promising feature of\nit is its camera... I could bet it could defeat Any of the camera phone in the\nmarket... No such lags... Just some times it gets heat up after a long\nduration of continuous use... Which is a common problem in every smart\nphones... Else other features are at its best... I personally would recommend\nthis phone... At its price..\n\n", "Though skeptical at first, I finally ended up buying the Honor 6X hoping it to\nbe a good purchase. After using it for a while now, I can safely say that it\nindeed was a total value for money.  \n  \nThe features are good, UI is smooth, the phone does not lag and the camera is\npretty decent! The only downside is the unavailability of a separate micro sd\ncard slot.. Apart from that, everything else is just perfect for the price\npaid\n\n", "Around 2 Months With This Phone ..  \nThe Phone Is Perfect For Everyone .  \nI am A College Student The Phone Easily Works All The Day With Me the phone\nHas a Good Battery Backup .. Some Of The User Has Doubt About it's speaker . I\nwant To Say That Left One Is Mike & Right One Is a Speaker (Only one speaker\nIn Phone) ... The Camera Quality Is Good As Compare To Mi A1 But The Portrait\nMode Is Not Good As Mi A1 ... The Portrait is Not Crisp.. But Image Is Of Very\nGood Contrast & Bright Color .. Front Camera Is Good... I feel Sometimes The\nTouch Became Irresponsive . For Few Seconds.. I think It's an ROM problem\n..The Fingureprint Sensor Is Very Fast As Compare To Other Branch.... The\nAntutu Benchmark Score Came Out To be 77500 Which Is Impressive.. At all The\nPhone Is Good With Nice Design..\n\n", "The phone is very good with premium look and thin body. It has full HD screen.\nThe dual camera is really good for normal use. Nano SIMs only can be used. One\nSIM slot is common for SIM or Micro SD memory card. The Octa Core processor is\npowerful enough most of the users. It comes from Huawei which manufacturers\nnot just handsets but also the complete range of Telecom Equipment Gear. It\nhas finger print scanner. Recommended.\n\n", "I bought it after thorough comparison with Mi note4,Eluga ray700& Lenovo\nK8note.By god's grace,I was right!Camera beyond Comparison,battery usage less\nthan50% up to evening!No heating issue.Upgraded to Nugat very next day.Go for\nit Blindly.A lottery for 10999/_\n\n", "The best mobile under 15k undoubtedly..  \nBest battery backup ,camera also satisfactory ,good looks ,best network\ncoverage in this range .mobile networks always show full bar that's really a\nbig thing..  \n  \nI can't found even a single con in it aftr using it for 4 months ..Happy wid\nmah decission to buy it.  \n  \nHighly recommended....\n\n", "Review updated (16/02/18)  \n\\-------------------------------------------  \nPros:-  \n1\\. Display: 4.5/5*  \n  \n2\\. Camera: 4.5/5*  \n  \n3\\. Battery backup: 4/5*  \n  \n4\\. Performance: 4/5*  \n  \n5\\. Software & Updates: 4/5*  \n\\---------------------------------------  \nCons:-  \n1\\. I think the biggest drawback of this phone is the sound output and its\nquality. Sound output and its quality via the main loud speaker is just\naverage (if the volume is set below 60%), at higher volume it is the worst I\nhave ever heard. The sound output quality via earphones is good but the max\nvolume is quite low (It's like 70% of Redmi 4/5A)  \n  \n2\\. Display backlight flickering issue on brightness changing (I think it's\nsoftware related and can be fixed easily with an ota).  \n  \n3\\. 4G can be used in any sim slots but only one sim slot supports 4G while\nthe other one supports only 2G  \n\\-------------  \nOthers:-  \n1\\. Charging time: It takes 2.5 hrs to charge the phone (0-100%) using\nsupplied charger (5V/2Amp)  \n  \n2\\. Battery backup: Easily lasts 2 days with normal usage and 5-6 hrs of\nscreen on time (SOT)\n\n", "i received this on thursday august 2017. built quality is good. looks wise\nvery imperesive on hand. camera department is nice i think this is good but\nnot best in low light photography. some noice you see when you zoom the\npicture. the charger a bit slow it takes 2.5 hours to full charge. i am a\nlight gamer so it is good device for me. out of the box the software is 6.0\nbut when i connect to internet i found 7.0 nougat. but i don't why seller send\nmade in china box. i have not much problem by this but where is made in india\npack. so overall good experience with this device. i purchased this at 10990\nrs.\n\n", "I have used the phone for about a month and I would say it's splendid!  \nI purchased this phone on the MAY 2017.  \nI bought is for Rs. 13000-/  \nI am writing this review after 9 months of usage  \nTill now I have not found any fault in the phone  \nThe phone is working super duper smooth  \nIt is receiving updates at regular intervals.  \n  \nPROS:  \n->Camera (Best in class for the price, hands down)  \n->Day to day performance is top notch and absolutely no heating. Kirin 655 rocks.  \n-> Battery life is decent 1 and half days on a single charge and normal usage. Phone charges in about 2hrs 15 minutes.  \n->All sensors are present and pedometer is a bonus.  \n->EMUI 5 is feature rich, elegant and snappy.  \n->The screen has nice viewing angles and the colours are pretty accurate. It's quite sharp and and has enough brightness for outdoor visibility.  \n-> Recently working on Naught 7.0 and to the Oreo 8.0 is on the way,  \nCONS:  \n->With dual SIM only one slot acts as 4G and the other reverts to 2G only.  \n->The back has a faint and wierd creeking sound but it can be easily fixed by using a case, so not a major issue.  \n->The speaker output has decent loudness but the quality is not up to the mark.  \n->No Equaliser settings are present in the phone.  \n->No Gorilla Glass protection.  \n  \nI would advise everyone to put case on the phone as it helps in protecting the\ncamera lens and the edges are slightly raised and screen is also protected.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 October 2017", "on 30 September 2017", "on 19 January 2018", "on 6 March 2018", "on 13 August 2017", "on 14 October 2017", "on 27 August 2017", "on 12 February 2018", "on 21 August 2017", "on 21 February 2018"], "reviewer": ["Subhadip B.", "Roop Kumar Chatterjee", "Ashish Ganguli", "Amazon Customer", "Sekhar", "Amazon Customer", "Amazon Customer", "Anup", "Bikash Prasad lal", "Harnish pithadia"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Nice buy", "Good package overall", "Awesome phone under 15k", "Best device I've ever purchased. Huawei You Did It....HONOR 6X....", "A Nice budget phone", "Superb Camera", "Honor lost its HONOR.", "Buy Now Regret later", "Good", "I love its look and style its slim with 5.5\" Screen."], "review": ["Using it for 3 months now and seems very decent phone for its price 11k with\nadditional cashback. Back Camera is good - better than redmi 4 but not as\ngreat as some reviews suggest. And after installing many apps n multitasking(\neg running multiple browser windows , hotstar, prime, YouTube, wync, camera n\nfew more apps) I noticed some lag, nothing major though. Other than what most\nreviews already hilighted in pros n cons I would mention \"eye comfort\" as\npros.. Con would honor \"Mirrorshare\" is not smooth with my LG TV campared to\n\"super cast\" of my Lenovo phone. Infact same version of hotstar wont cast at\nall with this phone but works perfectly on Lenovo which I find surprising.\n\n", "PROS  \n\\- Sturdy  \n\\- Pre loaded screen guard  \n\\- Dual Sim  \n\\- Dual Cam (Good picture quality as compared to rivals)  \n\\- Initial battery life if 1.5 days now after 9 month reduced to less than 1\nday  \n\\- Screen colour hues are configurable. Much Much better than crappy yellow\ntones on MI displays which you can't control.  \n\\- This makes it very good phone to edit pictures  \n\\- Deep enough blacks  \n\\- Huawei models are available internationally as compared to MI that are more\nintended for Indian market  \n\\- Huge difference in streaming music over bluetooth when compared with Moto G\n5. Music quality over bluetooth is much better than Moto G 5.  \n  \nCONS  \n\\- Only single sim supports 4G (WTF...)  \n\\- Krin processors with EMUI are bit slow as compared to rivals like MI  \n\\- Slow to charge when compared to MI phones with same battery capacity and\ncharging specs (5V 2.1 Ampere)\n\n", "I have used lot of phones, but I love this phone so much. Performance, memory\nmanagement, design, battery backup , camera is superb. I will recommend to go\nfor this phone. After using this phone for last 2 weeks didn't find any issues\n. Only thing I love to improve in this phone is sound its bit low.  \n  \nPerformance 9.5/10  \nCamera 9/10  \nMemory management 9.5/10  \nBattery 9/10\n\n", "This is first time, that I rated any product 5 star. It's the best phone in\nits range. And not only in its range but it's is the competitor for all\nsmartphone under 20k. The best part what I like is its UI, it's is very soft.\nThen in performance and built quality is too good. It just have an amazing\nlook too. I think person who are thinking to buy this they should just go with\nthis phone otherwise they will miss something really very important and\namazing device.\n\n", "Based on 2 months experience,  \n  \n1)Best phone for the price.  \n2)Good pics in low light too.  \n3)Battery performance is also nice. Even if u r draining out you can extend\nthe power for additional 2 or 3 hrs (depends on the battery charge when u turn\non this mode) with ultra power saving mode.\n\n", "My review is only of the camera as I haven't really tested the performance in\nother areas. This camera beats any competition in this range by a huge margin\nand I'll just attach a few unedited pictures as testimony to that fact.\n\n", "I have bought this in the month of May 2017 and it was quite good mobile for 6\nmonths and after that frequently its freezing screen and now the issue is\nincreasing day by day....and suddenly the network error comes also it restart\nautomatically...Not fit for professional use...only camera is very good other\nthan that HONOR has lost its Honor from its customer......Better honor model\nshould improve its quality....Feeling very bad for recomending this to my\nfriends.... since they are also facing this issue ....\n\n", "It was obvious that honor 6x will never get oreo update. The 7x is in market.\nall focus will be on promoting 7x. And they had already given 1 major update\nfor 6x. The only thing I did not like was the fraudulent promotion of honor 6x\nin the second half of 2017. There were news about oreo update confirmed for\nhonor 6x with reffence of some company person's statement. After this price\nwas droped. and then after few months 7x was released. Looking at this, it was\nvery clear that news of \"confirmed oreo update for honor 6x\" by the end of\njanuary 2016, was a marketing stratergy to clear the stock of 6x befor release\nof 7x. Company was not openly denying the oreo update to 6x till now because\nthey don't want to affect the 7x sale. Not giving major android os update is\nimportant negative point for any company. So we were getting vague answers\nthat \"the update is under evaluation\".  \n  \nAgreed that they had given one major update for 6x, but the phone (released\nwith android 6) had many important issues such as volte connectivity problem.\nPhone was officialy released in feb 2017. in the current competition of\nsmartphones, users expect at least 18 months (if not 2 years) of update\nsupport. Also considering (false) marketing of confirmed oreo update for 6x,\nits expected that company shoud have given oreo update for 6x.  \n  \nI think 6x users, who were highly expecting oreo update, shoud take out at\nleast 2 to 3 min to post about this issue on social media and importantly in\nthe Amazon review of honor 7x. Spreadinig \"Huawei is the company which does\nnot give major updates\" is the only way to force them to rethink their update\nstratergy. Same thing had happen before with Samsung (The update policy was\nimproved from worst to average ;)  \n  \nNot only Android update, there are many minor and some major issues in honor\n6x. Heating, bleutooth syncing/connectivity Camera, etc.  \n  \nGood bye to Huawei - my first and last phone of Huawei company. And worst\nexpirience.\n\n", "I do not want to write technical positives/negatives. But I would say Huawei\nkeeps the standards in all aspects.\n\n", "After Using it since 20days. I love its look and style its slim with 5.5 inch\nDisplay. It have inbuilt function for dual watsapp and dual fb with dual\nscreen without installing app for dual fb, watsapp such as parellel space,etc.\nFront facing and dual back camera work with full hd shots its mind blowing ,\nawesome hats off to honor for such quality in 11k. Battery back up is also too\ngood as i use fb,watsapp and several app at 9:30am but at the end of the day\nbattry shows 67% which sounds good. But there is a little bit lagging as kirin\nprocessor are not so much eligible as snapdragon.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 August 2017", "on 28 February 2018", "on 24 August 2017", "on 7 October 2017", "on 29 August 2017", "on 10 August 2017", "on 22 February 2018", "on 15 March 2018", "on 8 August 2017", "on 4 September 2017"], "reviewer": ["Sachin", "100RUB", "Rajagopal", "Ankit S Jha", "AKHIL", "Nemesis.", "Musheer Ahmed", "Hima", "SKumar", "Mayank Singh"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Excellent phone...  Five stars", "Camera is very good comparing to other phone according to the price range ...", "Read for true review", "Battery life and cpu performance is also great pros about this phone", "Way above expectations", "GO FOR IT GUYS.. 😃", "Loved it!", "It's good phone but there is a drawback", "You really love it.  (Grey color)", "Bought it for 7999 on great indian sale"], "review": ["Camera quality is excellent, I'll attach some pictures with this review. There\nis No heating issues. Display is very good. Charging lasts long enough. Looks\nexcellent. Also Speaker volume is loud and no hanging problem a  \nFingerprint sensor also working well .... Overalls its fantastic smartphone in\nthis price range... And delivered also on time thank you amazon...!!\n\n", "This phone is up to my expected as the price range. Camera is very good\ncomparing to other phone according to the price range and the battery is super\ngood. Fast charging and long live battery.  \nThe advantage of owning honor phone is good camera resolution and long live\nbattery comparing to other phone as the price range.  \n  \nHowever I can't guarantee that honor is the best phone because not everyone\nreceive the phone in the same conditions as the manufacturer proof. This is my\nsecond honor phone I bought and I love it.  \nMore about camera, the camera is not very good at nights but day time it's\nsuper.  \nIf anyone is looking for a phone to buy at 10 to 15k. I suggest you to go with\nhonor with your choice according to the price. You will not regret.\n\n", "Great phone with great camera and specs  \nHave a good camera but portrait mode not that great,  \nStruggle in low light.  \nRam management is good  \nPhone doesn't heat up too much, just little warm  \nOrder a case with it, as it have a camera hump.  \nMacro shots are awesome.  \nVideos are great.  \nScreen quality is good considering price  \nBuild quality is also good.  \nBattery is fine.  \nSupports 4g\n\n", "Got this phone for the camera features. Battery life and cpu performance is\nalso great pros about this phone. Before this i was using xiaomi mi4i and in\ncomparison to that everything is better but i miss some features like ,  \n1) Double tap to wake up screen  \n2) 3 finger drag for screen shot  \n3) automatic call recording feature (inbuilt)  \n4) use of power button to close the flash,  \nexcept for all these features everything is better in honor 6x in terms of\nperformance, battery and camera.  \n  \nP.S : Gyroscope is not stable even after update. It keeps on shaking even if\nusing mobile stand or kept stable in floor.\n\n", "Got this after a lot of research. From youtube to amazon reviews.  \nWell to start with, got the andriod 7.0 update as soon as switched on.\nTransitions are great and really looks great in hand. Back is a bit slippery\nwith out cover, and trust me getting the cover is hard from market. I tried in\ndelhi. Coming to battery life, with 4g data onn its provides a decent back up.\nFunctions like app twin for fb and whatsapp is great. Fingerprint scanner is\nalso pretty fast. At this cost the camera functions are too damn cool. With a\nsteady hand or tripod the night mode is awesome and the star track too.  \nRest every things sets this phone way ahead from the rest at the same price\ngroup.\n\n", "After 4 days of use. This device is flawless and I'm loving it. Display is at\npar. Cameras are extraordinary better than redmi note 4. I'm not a gamer but\nmultitasking is at the best. This won't annoy you. Got it @9999 from Amazon.\nFound some kinda delay in delivery but at the hands of courier department.\nHave been using continuesly since the launch of redmi 1s till last thursday.  \nCons;  \nMiss the loud sound of redmi as this device occupies lil bit lower sound.  \nAnother con is while placing a call this ui doesn't hv the option call\nrecording in the dialing interface which is a major drawback for me. However\ncall quality is very nice, you can't face that much issues even in noisy\ntraffic.  \nOne thing to suggest amazon team is please develop option of sending invoice\nof the item to the customer after delivery like flipkart does.\n\n", "Using this phone for last 6 months. I faced absolutely no problem with the\ndevice. Very smooth and fluid Android experience. Phone got better and better\nwith new updates. The camera is best in this price segment.\n\n", "It's good phone but there is a drawback. If you are a selfie lover and you are\ngoing to purchase it due to it's camera quality please keep following issue in\nyour mind:  \n  \nThere is no flash in selfie camera. It use your phone's light to use selfie in\ndark-light which isn't sufficient.  \n  \nBy the camera quality is amazing and you will love the photos of it.\n\n", "At first, I thought of return the phone as it came with Android 6.0\nmarshmallow and with some network issues . But, after updating to Android 7.0\nNougat and EMU 5.1 Version all the issues are neutralized and it is simply\namazing.... Self cam images are so beautiful. Little bit disappointing with\nback cam images. No heating issues while charging and playing games. WORTHY\n\n", "Bought it for 7999 on great indian sale.  \nUsed for 1 month  \n  \nNice display, better than rn4  \nPerformance is great at thas price....hangs 1 time i dont know why but it\nfreezes for almost 1 minute and then automatically restarted and become\nnormal.  \nBattery performance is good could have been better.  \nRear camera is takes some good shots in low light also. But I dont like the\nfrnt camera my sis rn3 frnt camera is better than this and my previous Zenfone\n2 laser. Call quality and network reception is good. EMUI is great better than\nmy previous zenui.. people says miui is better but I dont like miui.  \nSound quality through speaker is not great as redmi phones but better than\nmany other phones. Headphone sound quality is better than previous zenfone. Rn\n4 build quality seems good than this.  \nOverall at 7999 it is very good deal. Buy if got less than 9000 otherwise go\nfor redmi note 5.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 September 2017", "on 26 November 2017", "on 19 October 2017", "on 20 August 2017", "on 27 July 2017", "on 17 December 2017", "on 12 October 2017", "on 7 March 2018", "on 24 December 2017", "on 2 March 2018"], "reviewer": ["TJ...", "Alambe Haiding", "Pratik", "Taru", "Anirban Datta", "Ghulam Ahmad", "Yashwant Chougale", "Sachan.Rishabh", "g suresh", "Amazon Customer"]}
]