[
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Bokeh master in 16 K budget", "The design and built is good. The 18", "Review time!!!!", "Worth purchasing at this price range", "Complete satisfaction", "Best under 13k", "I Really disappointed with this phone", "Great piece of hardware But had to cancel my order ...", "Best in the range", "Good phone"], "review": ["If you are looking for a budget phone with good bokeh effect , then you can go\nfor it. In Rs12,999 Redmi A1 can provide you the bokeh but its bokeh is not\ngood as this phone. I will recommend honor 7x. Have been using this from 1st\nJan, till no issue.\n\n", "The design and built is good. The 18:9 display feels good but its not the best\nsometimes something is missing. The battery life Is good. The things i hate is\nthe quality of output from the built-in speaker is poor, the mi a1 on this\nprice range has good quality, even from the headphone jack is also below\naverage, equaliser for tuning is not available in emui 5.1, i think things\nmight become good from the new oreo update..!!!??\n\n", "It really feels really great to write review of this phone after using it for\na few days.  \nIt's seriously a great phone under this budget because the camera is stunning\n(with various modes especially portrait mode) , the great photo editing\nfeatures ( by default installed ), Android 7.0 with EMUI OS which makes\ncustomization really smooth , body design is sleek and has perfect edges ,\n18:9 display which makes screen much wider , long lasting battery , the great\nprocessor etc.  \n  \nSome disadvantages are -  \n1\\. Heating issues  \n2\\. Slow charging  \n3\\. Gaming is not that much good  \n  \nBut the fact is you can't demand much things within this price range.  \n  \nSo, I pretty much assure you it's better than Mi, Gionee, Tenor etc. Phones in\nthis price range.\n\n", "One of the best phone i have purchased.  \nIt has good built and very nice screen. Hery handy in using and not at all\nbulky. Till date date no problem ib using the phobe except few glitches in\ncontact no. That may be due to truecaller app.  \nBut yes missing the fast charging facility and little bit more battery\npower,.... May be 4000mh.  \nOverall paisa wasool.\n\n", "Very beautiful phone in 13000 lovely smooth screen clear loud sound super\ncamera both , good 4 gb ram good battery backup . I love honor 7x. I bought\nalso honor tablet t3 8 inch after this phone honor quality is so good.\nComplete satisfaction .\n\n", "For 13k it's a beast..  \nFull HD display.  \nWith 5.93 inches display it's perfect..  \nThough it have some cons by its kk.  \nWhat u need more in 13k..  \nAmazon rocks..\n\n", "I Really disappointed with this phone, display touch is ok, But a Problem is\nVolume button not working properly, any app will not display install\nimmediately, need to always restart, whats app any new message or regular\nmessage no alertness, etc etc\n\n", "Great piece of hardware  \nBut had to cancel my order  \nAs i got a honor 8 for myself  \nI found it to be more value for money as the price has dropped  \nIf you don't have any problem with chunky bezzels  \nGo for it  \nOr  \nHonor 7x is also a capable device  \nIf you a performer guy like me  \nMy recommendation is honor 8  \nOr  \nIf you want a futuristic looking mobile  \nGo for the honor 7x\n\n", "Lovely phone. Honor is doing a great job. i upgraded my phone from 6X to 7X\nand this phone has definitely justified its precedor. looks premium, feels\npremium and pretty smooth performance. camera has been good as expected after\nusing 6X which also had one of the best camera in the price range. loved the\nexperience and Amazon's before time delivery.\n\n", "@Plus points@  \n  \n> screen is 5.9 but phone is about 5.5 inch in size  \nwhich is good  \n> phone design is awesome  \n> battery backup is good lasts one day  \nSignal and call quality is good  \n> little to no heating issue  \n  \n@minus points@  \n  \n> well screen is plus but not every app is compatible  \nwith it (app is having little dark area above navigation  \nbuttons ) example google chrome  \n> camera is not that good despite having dual  \ncameras,  \n> night mode without flash is blunder photos came  \npitch black  \n> there is no fast charge support of any sort.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 January 2018", "on 4 February 2018", "on 14 March 2018", "on 6 January 2018", "on 19 January 2018", "on 11 February 2018", "on 9 February 2018", "on 15 March 2018", "on 4 January 2018", "on 15 March 2018"], "reviewer": ["sanjeev", "ARUN KUMAR", "sanjay negi", "Amazon Customer", "Ravi gupta", "Aman", "Amazon Customer", "Seraj Mohammad", "Amazon Customer", "rajeshrao"]},
{"rating": ["3.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Cannot load 2 Sims & memory card like other mobiles", "Not good phone for heavy user.. Battery is main draw back..", "worst service by amazon", "Excellent..", "Superb!!! Happy with the phone!", "Overall a good experience.", "Five Stars", "Very good in all department. No lag no issue", "Good", "Great phone battery backup disappointing"], "review": ["Usage experince only from last 1 week.  \n1.The mobile SIM card tray is not convenient to operate using pin tool.  \n2\\. The tray is very flimsy & may brake at any time.  \n3\\. Cannot load 2 Sims & memory card like other mobiles.  \n4\\. can load 1 SIM & memory card or 2 Sims a limitations.  \n5\\. The photographs from this large sized camera is not much clarity compare\nto smaller cameras of any other mobiles.  \nFurther benefits & limitations will be known only after regular usage & can\nreport in my next mail.\n\n", "Battery drain very fastly.. This phone not for heavy users.. Camera is\nbetter.. Main cons battery not even half day.Touch sensitive is not good too..\n\n", "Touch not working properly, hangs sometimes and 3.5mm audio jack not working\nproperly technician checked 3days ago still no reply for refund/exchange\ncreated, worst service by amazon.\n\n", "Excellent ....Honor 7X ..Iam using this mobile from past 15 days...It's looks\nstylish,touch also working very smoothly..battery backup coming easily 1 to 1\n1/2 day...so there is no prob with charging..call quality also good....its\nprocessing multiple apps in same time..there is no lag issue..  \nBut in some reviews i saw screen flickering issue while using youtube and\nwhile watching some hd videos...But for me no problem ...may be they fixed\nwith latest patch recently i did update..  \nFinally mobile was good..\n\n", "Stylish looks and lightweight, smooth and fast processing speed, great camera\nesp. the front camera, rich display and plenty of customize-able options! In\nshort, full paisa vasool!\n\n", "The look and feel of this phone is really beautiful, you actually won't feel\nthe extra burden of a big screen phone. Display quality really good. Processor\nis quite fast.  \nNot really happy with the secondary rear camera, in normal mode it takes\nreally good pic, but if you select dual camera mode it won't give you a proper\nDOF image output as its been done in software level and not in proper hardware\nlevel.  \nLastly not good for long time usage as the battery is really not that big, can\nrun for around a day with moderate usage.\n\n", "Have used it for 2 weeks so far all good...  \nCamera is superb ...  \nDisplay owsom....  \nTouch response and finger print great...\n\n", "Simply go for it it is best phone in this price range  \nEvery phone has major pro and cons  \nBut this phone have above average in all criteria such as disply battery\ncamera gaming performance just decent in all  \nFor eg mia1 camera is good but screen is not upto mark and slighty slow as\ncompared to 7x. battery backup is more in 7x than mia1\n\n", "Phone is awesome. But the back camera is not up to the mark. The rear camera\nis slightly in rose color. Overall it is good. Some heating issues.\n\n", "Best phone you can buy right now under 15k only con is battery is draing quite\nfast like only 4 hrs of onscreen time on full charge\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 March 2018", "on 20 January 2018", "on 27 January 2018", "on 5 February 2018", "on 21 January 2018", "on 7 February 2018", "on 25 December 2017", "on 14 January 2018", "on 13 January 2018", "on 12 January 2018"], "reviewer": ["Amazon Customer", "NAME_NOT_RETURNED", "Jagat Panchal", "Amazon Customer", "Abhishek", "Saunak Banerjee", "Amazon Customer", "kumar sonal", "Amazon Customer", "Utkarsh kumar singh"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Great value for money!", "Best device in this segment...", "Nice product in this price range", "Phone comes with very good screen at this price", "Must buy phone.. When compared to mi a1 exept back cam, 7x better in every segment", "Worst packaging..!!", "Pretty decent. Recommend.", "... android after using iPhone 6s and i m really glad to know that this is so awesome and smooth", "been using it for a month and am totally satisfied..", "Great Display"], "review": ["Just perfect. Value for money. Awesome phone in all sense! Specially you love\nBlack colour and it's a Matte Black. Real beauty!  \nI used Moto X Style before this phone and if I compare it's just it had a\nwidescreen hence the keyboard was large (I use gboard), and here the keys are\nvery tiny. But who cares when you have 18:9 display!\n\n", "Very good device ,,,in all context...unlike in android device this has many\nfeatures like in a mi device...But this honor has advance camera\nfunction...which can capture detail and clear pictures expect low light\nvision.  \nI would suggest evryone who seraching for realy smart device with good camera\n,vider display and battery pl go for this without second thoughts.  \nIf wants to know any specific info about this device regarding performance pl\nreply here....\n\n", "Nice product in this price range.  \n  \nPros: Good display, perfect size to handle it, split screen option is very\nuseful.  \n  \nCons: Battery last in approx 15 hours with decent usage, Rear camera is\naverage.\n\n", "Phone comes with very good screen at this price. The camera seems average.\nBattery will last a little over a day with moderate use. No lags or problems\nas of now.\n\n", "Reviwing this after 1 week  \nPros.. Display camera sunlight visibility, audio via speaker as well as\nheadfone jack is awesome, no heating issue, good ram mangement, calling is\nawesome, build look and feel is sexy,  \n  \nCons... Battery draining very fast while gaming and no fast charging[after 3\ndays it charges in about 2 hrs]\n\n", "Phone is awesome..!!  \n-Camera is nice ....front cam especially  \n-Battery backup is also good .(not for heavy users.....you can play games upto 5hrs)  \n-Better RAM management  \n\\- Fingure print sensor is quite awesome...super fast.  \n  \nPackaging is so worst. I get damage mobile box... didn't expect this kind of\nservice from amazon.\n\n", "I would definitely recommend this phone if your budget is 15k. It's amazing\nfor that prize.  \nThe problems with this phone are  \nCharging takes a lot of time  \nOK battery life  \nDual camera but could be done better  \nYouTube app GLITCH which got fixed with the software upgrade.  \nThats all,don't worry if u have 15k then buy this phone this is definitely the\ncompared to vivo which is providing outdated stuff for 22k. Lol.\n\n", "Its my first experience with android after using iPhone 6s and i m really glad\nto know that this is so awesome and smooth.... very light weight and theme are\nreally good... performance mast...nd the best thing never hangs n the charger\nis damn awesome....within n hour it is like 80 to 85% charge...woahhh ..m so\nhappy with my Phone.\n\n", "its a very smooth performing device...been using it for a month and am totally\nsatisfied...can be trusted blindly...it captures good pictures but in this\nprice segment mi a1 has a better camera...coz it has almost zero artificial\nlighting but honor on the other hand has some artificial lighting...but other\nthan that its a great device\n\n", "Great. Package was delivered on time, phone is great, No flickering issues\n(saw in other rewies) till 1 week. Camera is good,but Mi has better one I\nthink. I just loved the Display. Bought one for my brother too.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 January 2018", "on 11 March 2018", "on 27 January 2018", "on 24 January 2018", "on 15 January 2018", "on 2 January 2018", "on 12 February 2018", "on 5 February 2018", "on 17 January 2018", "on 11 January 2018"], "reviewer": ["Saad Ahmad", "Parth Patel", "Deepak Bansal", "Nishant Sharma", "md sazid ansari", "Amazon Customer", "Amazon Customer", "Manali", "Amazon Customer", "Sanil R."]},
{"rating": ["1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["A worthless purchase", "Honor 7x", "Honor 7x good one, value for money", "Good Quality and Great Features", "I have a honor 4x and that was good reason for us to buy this one", "Best phone in this range", "Superb  loved it", "good Display  mobile performance very smoothly", "Best in segment. Under 15k", "Value for money."], "review": ["This is realy not a good mobile. Issues in touch screen , camera and main\nissue is calls are not well audible. Over all it was a bad purchase. We have\nrequested for refund or at least option to purchase another mobile, but amazon\nwere too reluctant and stuck to its replecement only policy.\n\n", "Very stylish look with a high quality front camera (even iPhone 7 front camera\nis a no match). But coming to rear dual camera you need to think twice (\nbecause of 16MP + 2MP clarity is questionable) i has come with a great\nfinishing  \nand battery life is good for now . Finally I think it’s over priced compared\nto other mobiles of this 4gb ram variants by 1500rs.\n\n", "Super build quality, good finishing, curved edge, metal body, full screen\ndisplay is the USP of this phone. Picture quality is very good. Front and rear\ncamera works good even in low light. Good phone to buy in this price range.\n\n", "My experience with the phone has been great up to now. I have been using the\nphone for more than a month now without any heating or hanging issues at all.\nThe display is too good with decent sound quality. The Honor UI is also very\nuser friendly and has many user friendly features to make your phone usage\nexperience a delight. I hope this phone would stay the same for at least 2\nyears. All in all great product from HONOR.\n\n", "Bought Honor 7x for wife. I have a honor 4x and that was good reason for us to\nbuy this one. The full view display looks good. Overall fit and finish is\nexcellent. I use an LG G4 which costed me 34k during its time. This one at\nhalf price or less(when comparing to premium phones) is either better or equal\nin quality. Processor is good. Do not look and feel like a budget phone. No\nlag at all. Battery as always good with honor phones this one also offers\nreasonable backup. Data can be kept full time on without much battery drain.\nOver all very satisfied customer. Camera also good. exact color reproduction.\nMy benchmark is with LG G4 which i use which is having a good camera. This one\nis better infact. Recommend it to prospective buyers. This is my 3rd Honor\nphone and none disappointed yet.\n\n", "Best phone in this range.  \nCompare with honor 6x.  \nBetter backup is not good.  \nDrain fastly in normal use.  \nSome time hang in writing text.  \nIn looking is phone is awesome  \nYou have to spend time to be in handy.\n\n", "Awesome product and I just love this mobile phone.....\n\n", "honor 7x mobile review  \n1)Display 10/10  \n2)camera 8/10  \n3)battery 8/10  \n4)fingerprint 10/10  \n5)performance 9/10  \n6)music 8/10\n\n", "Straightforward: a very decent and feature loaded phone. Mia1 only recommend\nif u love stock android. Else 7x is better in all aspects.  \nBetter battery, better cameras, equivalent performance. Better SCREEN.\n\n", "An excellent phone with a full value for money. The screen is awesome and the\ncamera quality is also good. Sound quality is also very decent. There is a\nvery little lag in spite of multiple apps being opened simultaneously.  \nOnly con is  \nThe firmware eats away almost 10gb of your total space of 32 GB. Now I uses 2\nSims so , the sim slot being hybrid with memory card, I will be struggling\nwith space.  \nOtherwise a very good phone. Go for it.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 March 2018", "on 9 March 2018", "on 22 January 2018", "on 29 January 2018", "on 14 March 2018", "on 20 January 2018", "on 29 January 2018", "on 5 January 2018", "on 17 January 2018", "on 12 February 2018"], "reviewer": ["ajay", "sreekar", "Amazon Customer", "Nachiket", "Nevin", "AJAY K.", "Salman ali", "challa madhu", "Prashant", "ANIRBAN DUTTA CHOUDHURY"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["SUPERB, FANTASTIC, WONDERFUL product. Appreciation is unlimited for this product.", "Fantastic product", "Great", "Excellent Product", "Nice phone", "Good Product Good color & appearance", "Good but need some minor works", "Once again big thanks to Amazon for perfect delivery timelines", "Best phone for Photography!", "Amazing budget phone. Buy this for sure."], "review": ["It is a 'fantastic' product. The battery life is really good and last a day\nwith ordinary usage. The screen is large and the 18:9 aspect ratio with full\nhd+ makes it even better. The camera is really good, portrait photo comes\nreally nice. Kirin is actually a good chip set , the EMUI skin is good. Only\nthing is that is the camera had image stabilization and the set would come\nwith a fast charger it would be so nice. Now I am looking to the next update\nof android OREO and face unlock. THANK YOU!!!\n\n", "Very good phone with a pocket friendly price. Honor has created a beautiful\nbudget friendly phone which is having all features.\n\n", "Great phone and I must say the best phone in this price range.  \nBest part in this phone is the camera i must rate this 4.5/5, 0.5 is deducted\ndue to the lack of natural blue effect.  \nPeople go on say that this phone comes without proximity sensor, but don't\ntrust them, this phone comes with proximity sensor out of the box.  \nThe battery of this phone is pretty good, it lasts around 1 days and 2 hours.  \nElsewhere this phone is very clean, smooth in its run and very much efficient.\n\n", "Excellent product within this range. I like it so much love this phone.  \nI thank to Amazon for providing this product within 22 hours in bangalore.\n\n", "Having used OnePlus 3 before this one, I would never get a fabulous experience\nwith this one. But for the price it is offered at, the product is awesome.\nSlim enough and attractive too. The processor seems decent enough. For 16000\nit is a very very good phone.\n\n", "Greetings! Thank you for Quick Delivery, Amazon Deal for Exchange was very\ngood, But as it is hybrid slot i can't use 2 sims & SD card at a time  \nBattery backup is ok after using for 2 days i use mostly for E-mails & Calling\nby the end of the day battery drains to 20% i have to use additional power\nbank.  \n  \nSuggestion : Screen protection is not available in market so, Buy from Amazon\nalong with This smart phone  \n  \nOverall its good Product.\n\n", "I post this review after using it for more than a month.The phone is decent\noverall.The camera is good for its price range but most of the times the\nbhokeh effect is not working and also the selfie at indoor lighting is\naverage. The battery backup is normal. The phone struggles for a minute when\nthe notifications pile up when you switch on the mobile data after a long time\nother than that it is swift. Even with some backdrops it is still good for its\nprice.\n\n", "Once again big thanks to Amazon for perfect delivery timelines.  \nI got the phone with complete protection.  \n  \nHonor 7x is really an awesome phone within 14K budget, i prefer go for it.  \nHonor is doing great by doing market analysis and demand then releasing the\nproducts.  \n  \nCamera: Awesome  \nQuality : Good  \nRAM/ other features: Good  \n  \nGo for it !!!!!!!!!\n\n", "Well, I bought out one for me, and by god its working amazing.  \n1\\. Camera: rear Camera is best in class, front is okay.  \n2\\. Looks: Looks are superb, most slim piece.  \n3\\. Everything is great, Sound is just okay,  \nPackage was some poor, like you will not get Earphones, and protective glass.\nCover will be free.  \n  \nI recommend you this phone in this price range.  \nAnd i order one more today.  \nYou may check my photos here  \nInstagram.com/rdwith7x\n\n", "Amazing value for money phone. I bought this more than a month back. Its fast,\npretty looking, sleek and the camera is decent too. The blue colour phone\nlooks better than the black one as it is different than the other 1bn BLACK\nphones around us.  \n  \nOne issue which I have faced is that sometimes the media volume button doesn't\nwork, should be a software issue. It works only after restarting the phone.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 March 2018", "on 28 January 2018", "on 13 March 2018", "on 26 December 2017", "on 4 March 2018", "on 7 March 2018", "on 4 February 2018", "on 9 March 2018", "on 28 February 2018", "on 17 February 2018"], "reviewer": ["Aniruddha G.", "Ajaya Naik", "Subir Kumar Dey", "Ajay", "J A", "jinay", "ASHOK KUMAR", "Sharique Habib", "Ravindra Singh", "pradhumn kumar"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Worth of Paying..", "Nice experience with 7x... 7 of 10 points given", "I LOVE HONOR 7X...... Go for it", "Just go for it.", "Value for money!!", "Good budget phone", "Worthy", "Good phone for this price", "Gadget that has got beauty and brain too.", "Pros Looks very stylish Lighting fast fingerprint sensor Front camera is superb Screen is good Processor is average"], "review": ["I am using this phone since last 3 Months. Performance wise its great compare\nto other same price range phones. Only need to be careful about screen which\ncan easily break once slipped from hands.  \n  \nPros  \nTouch is awsome.  \nCamera in normal mode also excellent.  \nFinger sensor is faster as compare to other MiA1.  \n  \nCons  \nThis is not a Gorila glass. So be careful.  \nCamera is not upto a mark in wide aparatur or Bookhe mode as compare to MiA1.\n\n", "Working fine till now... Camera awesome in this price segment... Screen\nquality is good; specially with its 18:9 aspect ratio, it's worth every\npenny... Sound and call quality also good... But the only cons I faced is\nthat, it has a single LTE 4g sim slot and the other one is 2g which was not\nclearly mentioned in the specs...\n\n", "I wrote this review after using 15 days. This phone is really awesome. Both\nfront and back cameras quality is superb. No heating issue. Battery is also\nawesome. No flickering issue. Design is really cool nd stylish, it's look\nreally rich in ur hand. All over very nice product. Amazon delivery is also\nvery fast. Thanks amazon.\n\n", "The mobile is stunning.  \nPerfect design 😎.  \nSound clarity great.  \nDecent camera.  \nBuy 64 gb variant ( 32 Will not be enough)  \nEventhough it doesn't has gyroscope we can play 360 using VR PLAYER app.\n\n", "I guess this is the best phone in this range. Have no complaints regarding the\nphone. Excellent display, smooth performance and good enough camera. Does the\njob well considering the money spent on it.\n\n", "Thanks Amazon and team for timely delivery with magnificent product.. Honor 7X\nis cool phone... But again you have some pros and cons which are,  \nPROS,  \n1.Big and beautiful screen.  \n2.stylish look with metallic body.  \n3.call clarity pretty good.  \n4.battery backup acceptable.  \n5\\. Price range very much affordable.  \n  \nCONS,  \n1.front and back camera very disappointing.  \n2\\. Touch on screen somewhat late responsive.  \n3.Hydrid sim card slot limits to either 2sim or single sim and SD Card.\n\n", "Using mobile from last 45 days before Writing this review Worthy mobile for\nthis amount. Good camera quality,Decent battery backup, no hanging issue while\nplaying game. Overall good mobile to buy at this price.\n\n", "The phone is pretty good as compared to the price.  \nThe camera is also pretty good and the phone works pretty fast for this price.  \nThe looks and finish of the phone is pretty good and gives a premium look.\n\n", "Fast charging would have been cherry on the cake.  \n  \nNevertheless, Battery backup is decent enough for moderate or heavy users.\nAdditionally, this can put on charging on 9pm with 40 juice left on Charing\nfor approx 1hr 45 min to get fully charged.\n\n", "Cons  \nOutdated ui  \nHeating problem for continuous usage of 30min for calls  \nmy phone got hanged twice for the usage of 30 days.  \nAverage rear camera performance  \nBattery drains fast. ( with Jio 4G Network it drain in 10 Hours)  \nSlow charging  \nrear camera projected outside. we have to use back cover to protect the same.  \n  \nPros  \nLooks very stylish  \nLighting fast fingerprint sensor  \nFront camera is superb  \nScreen is good  \nProcessor is average. ( hangs for heavy usage)\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 March 2018", "on 4 February 2018", "on 13 February 2018", "on 30 December 2017", "on 15 January 2018", "on 16 February 2018", "on 20 January 2018", "on 17 February 2018", "on 1 January 2018", "on 2 March 2018"], "reviewer": ["Amazon Customer", "@rP@n", "GOURI", "rahul", "J-Man", "Sachin", "Amazon Customer", "Adi", "Diwaker ", "Sridhar Gandra"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["It feels like very luxurious/costly phone", "Honor 7x my experience", "Awesome phone", "The beast with beauty", "Awesome Phone", "Honor 7x", "Good phone Only drawback it's don't have separate dual sim ...", "Very nice look very nice display Very nice performance Very nice ...", "Love with this model♥️", "I brought 3 mobiles."], "review": ["It feels like very luxurious/costly phone. Best for me. Battery saving is\namazing like only 3-4% consuming in hole day with ultra battery saving mode.  \nPicture quality best but its ZOOM action is not equal to 10.or phone. But in\nlow light it gives very clear scan/photo. For Document scan or Computer screen\nscan it is best.  \n  \nGorrilla glass missing.  \n  \nGovind Singh\n\n", "I am very satisfied with Honor 7X. I just moved from Redmi Note 3 to Honor 7X.\nThe phone is light weight, beautiful screen display, processor fast enough for\ncommonly used apps. Camera I have not tested enough.\n\n", "I loved the phone. Its display is very good and battery is also enough for me.\nOnce fully charged it lasts for a day with heavy video streaming and internet\nusage. The most important thing that I loved in this phone is themes. Every\nmorning i change my theme and its like a new and exciting experience for me. I\nloved the phone. Camera is also good. It has pre installed apps like pitu with\nbasic version for advanced version i installed pitu and its great too. Soooo\nhappy with the phone. Highly recommend it to everyone.\n\n", "It's a real charm, very well built phone, looks nice and performs well too.\nCamera is way better than the mi phones but don't buy this one if you are\nlooking for portrait mode then go with mi a1.  \nI purchased 32 GB variant, though I wish to buy 64 GB variant but 3k hike\ndidn't allowed to me to.\n\n", "I Have To Say This Phone Is Best Buy. It is better than Apple I Phone in Terms\nOf Pricing And Some Features.\n\n", "No screen flickering issue as reviewed by many that screen is flickering while\nplay youtube or video player ,  \nDevice is good enough  \nbut camera and battery could have been better.\n\n", "Good phone  \nOnly drawback it's don't have separate dual sim & memory card slot.its hybrid\ndual sim & this thing is not clarified in specification\n\n", "Very nice look  \nvery nice display  \nVery nice performance  \nVery nice onehand operate  \nI trusted to Huawei Honor brand  \n  \nPlease send invoice copy My mail id  \nchavdaPraful@hotmail.com\n\n", "The phone wss so gorgeous! A very cute design honour ever built. Trust me guys\nlow budget smartphone with powerful performance. I’m totally love with this\nphone\n\n", "Awesome handset... Nyz display with honor full view.  \nDual camera very good focusing.  \nI brought 3 mobiles to my family 💝  \nI suggest this phone compared to other brands.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 February 2018", "on 13 January 2018", "on 23 February 2018", "on 30 January 2018", "on 22 January 2018", "on 10 January 2018", "on 26 January 2018", "on 9 January 2018", "on 31 December 2017", "on 26 January 2018"], "reviewer": ["govind singh", "Neeraj Kumar", "Amazon Customer", "Nitin B.", "Zain A.", "Sunny", "Nilesh Marathe", "Amazon Customer", "Rahul Singh", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Good phone except for the memory slot.", "Worth it", "Looks amazing. Average Camera", "There is Minor issue in touch but there are totally ...", "Nice but not a must buy product. There are options too.", "A budget fun filled mobile..!!", "Officially qualified., but battery draining quickly", "Value for money product once again by Huawei", "Trendy display within the budget", "Honer able mobile..."], "review": ["Awesome phone. Using it since a couple of days. Only change recommended is it\nshould have one separate slot for inserting memory card. One can use memory\ncard only in the sim2 slot but that limits our available storage space.\n\n", "Very good product in this price range.. Honouring 'Honor'. Camera is above\naverage, body is fantastic. Blue colour shade is perfect.  \nFinger print sensor is fast.  \n  \nOverall good product, you should go with this one.\n\n", "Received today.  \n  \nCons:  \nPlease do not mention that headset is also present inside the box. I did not\nreceive any headset.  \nIt does allow you to insert 2 sims but you have to choose either one sim + SD\ncard or two sim. We can not insert 2 sims + SD card.  \n  \nPros:  \nLooks amazing. Average Camera. Fingerprint sensor works faster. Lots to\ndiscover yet.  \nOverall good product for this price.\n\n", "There is Minor issue in touch but there are totally mismatch screen card which\nI bought with this. Back Cover is also below average. Surprised thing is that\nwhen I escalate this matter with seller and Amazon team. Both are in Sleeping\nmode. However Product sold and payment already release. There is no option for\nrefund and replace also.\n\n", "It's been 2 months since I am using the phone, It works nice, Battery life is\nnice and lasts a single day long. Performance, Camera are very good. The minus\npoint of the phone is There is no VOLTE Video Call available for Jio, Audio\ncall works good. And the best thing of the phone is Network Connectivity, So\ngood in compare to other phones.  \nNot a must buy product but such a nice phone that can be bought.\n\n", "After using this mobile - Pros:  \nCamera - Both front & rear are impressive!!  \nBattery - Fast charging is not available but battery stands by more than a\nday!  \nInterface - EMUI steals the show  \nDisplay - Besel less display is awesome  \nMemory - RAM is good & ROM is adequate  \nCool metal body (I own 64GB Blue variant)  \nFingerprint sensor works great!  \nNo heating issues.  \n  \nCons:  \n64GB (Rs.15999) variant is quite high compared to 32GB (Rs.12999)  \n  \nOverall you can go for it!!\n\n", "Officially qualified., but battery draining quickly, no flash in front\ncamera., there is no separate tray for memory card., single Sim with memory /\nr dual sim card there is no more option for insert memory card., over all\ngood., no option for updating OS for latest version 8., so price of this\nmobile little high., consider with huwaii honor marketing\n\n", "I bought 64gb version. It's an awesome phone guys believe me. Camera is\nperfect. Display is perfect. What a beauty!!!! Touch is so smooth like butter.\nGaming is good. Graphics intensive games r playable. Battery also lasts for a\nday. Everything is good. I gave it 9/10.\n\n", "For 13k it's a better option to pick up with the trending display. There is\nsome compromise in the camera segment. Camera quality struggles in low light\nconditions and bokeh mode/depth mode, portrait mode are not enough to\nacceptable levels. Battery life is good but not great. Overall good phone for\ngeneral users.\n\n", "Superb mobile which i bought my first. Superb looking and fine colour (blue),\nattractive metal design, i cnt explain how i enjoyed with this large screen...\nSensor and camera quality is uncomparable with any other...  \n  \nEveryone asking about price of this phone and got some awful expressions...  \nReally i loved it...  \nThankyou huwai...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 February 2018", "on 10 January 2018", "on 15 March 2018", "on 10 March 2018", "on 24 February 2018", "on 6 March 2018", "on 8 March 2018", "on 1 March 2018", "on 28 January 2018", "on 5 January 2018"], "reviewer": ["Loving Uday", "ilesh kumar", "Amazon Customer", "VINOD Dutt", "Rutvij J.", "Amazon Customer", "Lakshminarayanan", "Vivek Muskan", "Krishna Prasath L", "BATTULA DORABABU"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Best in it's Budget.", "Five Stars", "Love the phone", "It's the best.. Honor is the", "Awesum phone with great inhand feel", "This awesome phone, it has good quality good features", "Five Stars", "Bang on buck", "Excellent transporatation Service and Now about Product * Camera 9/10 ...", "nice product"], "review": ["I am in love with this phone.  \n8/10 Camera  \n8/10 User interface  \n9/10 Build quality  \n8/10 Display  \n7/10 Speaker (could've been better)  \n7/10 Battery (Drains quite fast on regular use but its manageable)  \n  \nOverall - 8/10  \n  \nFor this budget, it is pretty darn good. Though i am using as my 2nd handset,\nso my usage is not that much but still, whatever i have done on this phone has\nsatisfied me to a great extent. Overall, amazing experience.  \n  \nHighly recommend.\n\n", "Best Premium Phone @ budget price.....  \nCamera quality, battery life, processor smoothness and overall Performance is\nthe best....\n\n", "It's a nice phone.. screen is good. I know one can be sceptical that it's a\nChinese product.. but c'mon which product isn't. I love it's features and the\nscreen is awesome. I gifted it and it was worth a gift.\n\n", "Go for it.. It's the best.. Honor is the future.  \nI had used mi, oppo and samsung.. Honor makes differenc.. Simply its the beast\namong all and the best in the industry..  \n  \nThank u Honor\n\n", "Awesum phone with great inhand feel. You can find very easy in holding this\nphone because the screen is long instead of much wide as in case of other\nphones.  \n  \nThe battery backup is very good. It lasts for almost 1.5 days for heavy usage.  \n  \nThe processing speed is very fast.  \n  \nReally like the Wifi Bridge feature in the software.  \n  \nJelly cover is inside the box.  \n  \nOverall you will find the phone is very good.\n\n", "This awesome phone, it has good quality good features, only thing is speaker\nfeel like vebrating if you increase sound more then 50%.  \nLooks is good. It has dual SIM facilities but can't facility of memory card.\nEither you can use memory card or one SIM. There is no sep  \narate slot for memory card.\n\n", "For the price of 13k its take away phone.\n\n", "After going through reviews on C4E Tech and Geekyranjit, one thing was a big\nlet down was gyroscope. Once that was fixed with an update, this phone was\nbest for the money. 18:9 nearly 6\" display is wonderful for videos. Volume is\nhigh and camera is good. Not great on the portrait mode though. Good battery\nlife lasted a day with videos, games, hangouts and lots of browsing on Mobile\ndata.\n\n", "Excellent transporatation Service  \nand Now about Product  \n* Camera 9/10  \n* Display 10/10  \n*Battery 8/10  \n* Desigen 9/10  \nnice smartphone for 13k buyers  \nbetter then A1\n\n", "writing this review after using the product for one month ,  \n1\\. very nice smartphone,  \n2\\. no heating issues ,  \n3\\. battery well supported for a one and half day heavy use.  \n4\\. front and back camera portrait mode very fantastic. back camera video\nquality very good.  \n5\\. Gorrila glass not up to the mark , minute scratches in one month even\nafter a very careful use.Also type of gorrila glass not mentioned by\nmanufacturer and Amazon.  \n6\\. overall a very good product in this price range.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 February 2018", "on 15 January 2018", "on 12 March 2018", "on 11 January 2018", "on 9 February 2018", "on 20 January 2018", "on 21 January 2018", "on 9 February 2018", "on 31 January 2018", "on 5 February 2018"], "reviewer": ["Raksh Kainth", "Bhargav Dhagia", "Bhaskar", "shanu", "Sumit S.", "Mangesh", "Devadas Naik R", "Arvindh S.", "Ram Narayan Jangir", "Rajesh G"]}
]