[
{"rating": 4, "title": "Value-for-money", "review": "Pre Ordered the Pixel2, got a great deal on my one plus 3T and Flipkart delivered on time.\n\nNow coming to the phone,\n1. The bezels don't bother me so much.\n2. The speakers are pretty loud\n3. The camera is awesome, portrait mode is brilliant.\n4. If your front facing camera dosent have portrait mode update the camera from Google store, some phones aren't shipped with the updated software.\n5. Kinda blue looks kinda nice. :)\n6. If you are into Music you'll love the now playing feature\n7. You may need a powerbank, if you want to keep the always on display and few power hungry apps on.\n8. Android Oreo is smooth \n9. All in all I'm liking this phone.\n\n\nHope this helps you decide :)", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Nov, 2017", "reviewer": "Rashmi Ingale"},
{"rating": 5, "title": "Best Android experience you can get", "review": "-- For Pixel 2-- \n\nThis phone is handy, feels good in hand, and doesn't weigh much either.\n\nYou get the best and smoothest android experience when owning a Google phone. \n\nThis phone doesn't suffer from any of the issues that are being highlighted on the pixel 2 XL. \n\nGood and prompt+ on time delivery by Flipkart. Thanks for that FK.\n\nFor Broader reviews, please go on to youtube :) my perference is go and look for MKBHD's Pixel 2 Review\n\nCheers!", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Bharath M"},
{"rating": 5, "title": "Delightful", "review": "Pixel 2 is quite good in terms of camera, speed, smoothness, battery life  .. only con is it doesn't look like a premium phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Dec, 2017", "reviewer": "Abhishek trivedi"},
{"rating": 1, "title": "Defective handset", "review": "A defective handset delivered. Unable to charge the handset.And no option to return or exchange this handset via Flipkart, though no such information was displayed while buying the handset. Why such hidden terms and conditions? You displayed a 10 Days exchange option at the time of purchase, now that is also not visible! Hope you are reading this review and will provide a solution soon.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Brilliant", "review": "The best phone ever", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Nov, 2017", "reviewer": "Vishal Sukhija"},
{"rating": 5, "title": "Brilliant", "review": "Best camera in smartphone period. Have note 8 and iPhone X also but pixel 2 with single lens beats them hands down", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Great product", "review": "Got this phone pre_order and delivered today before lunch. Best delivery by Flipkart.\n\nAbout phone:\nBest part I loved about the phone is it's soft skin and lightweight. It's super lightweight. Operating screens is smooth... finger print is fast as well.. However most of the times it says too fast can't unlock. It has face unlock as well which works like faceid... \nDaydream with this phone is world-class. I feel proud to own best smartphone ever made in this era and after a lot of comparison, reviews and thought got this phone. It has not disappointed me so far.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Triguna Mutuguppe Sripathi"},
{"rating": 1, "title": "Terrific purchase", "review": "Ordered this phone on 7 Dec and got it delivered on 9 Dec. Thank you Flipkart for your speedy delivery.\nA days experience with my Pixel 2:-\nComing to phone itself, it's an amazing experience using Pixel 2. Software is super smooth. Camera performance and software of it is top notch. Since it's 5.2&quot; easy to hold it in your hand operate. I exchanged my OnePlus 3T and upgraded to this one. Coming to speaker quality this reminds me of HTC m8 front firing speakers.\nOnly draw back I noticed here is battery performance, they could have added 3000mah. This is still okay which should push you till a day. Since HTC has manufactured this device I won't complaint they always give less importance to their flagship.\nIf you're planning to buy an Android device, close your eyes and go for it.\n\n\nReview after 4 days:\nCamera app keeps crashing\nToday, 13 Dec 2017 onwards phone restarting by itself. Called Google customer care and none answering the phone. May be a defective piece received?\nCan someone suggest what should I do?", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2017", "reviewer": "Karthik Kesavan"},
{"rating": 1, "title": "Waste of money!", "review": "I bought Pixel 2 from Flipkart. Phone is not charging with given charger. I can see &quot;return&quot; option in my order history but unable to make a request as it is asking to take support from Google care. Flipkart has mentioned 10 days replacement service then why it is not returning it. Flipkart sold me deffective product. I am really disappointed by Flipkart service. They should accept 10 days return or replacement service as promised.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2017", "reviewer": "Nikhil Goyal"},
{"rating": 4, "title": "Delightful", "review": "Flipkart/ekart needs to work on delivery the items in time.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Dec, 2017", "reviewer": "MANISHANKAR PANDA"},
{"rating": 1, "title": "Dont buy through hdfc credit card on no cost emi", "review": "Pixel 2 is best phone but the offer of hdfc credit card is bogus because there is no cost emi but there is an extra 14 % p.a or 1.17% p m easy emi finance charge on reducing balance.\nAdding 18% gst without any notice by flipkart so do not buy with hdfc credit card", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Best of Google but display and build quality needs work", "review": "Best of Google all in 1 device. Portrait mode in camera is fantastic. Speed, responsiveness, battery backup along with a super fast finger print unlock is all good. Bezels could have been smaller.must have for an Android fan. Negatives are a poor display and build quality. Screen is not as bright as compared to iPhone 7. I just moved from an i7 to this device and could immediately see the difference. It seems to lack the vibrant colors. I feel the body could have been all metal  similar to other flagships.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Nov, 2017", "reviewer": "Devanshu Jatana"},
{"rating": 4, "title": "Phone is awesome, delivery delayed.", "review": "About Google Pixel 2:\nIts the best Android phone I have ever used. If price is not a constraint, it is the phone to have. Stock android UI is awesome. \n\nAbout Flipkart delivery:\nWhen I placed the order, it was showing delivery after 2 days. I placed the order and received confirmation mail. But within few seconds, received another mail that your delivery date has been updated. They shifted the delivery date one week after. Finally got the phone on 7th day. Though product was in well shape and delivery man was very good. \nBut it looked like Flipkart was showing false expected delivery date just to attract the customers, otherwise delivery date would not have been changed within few seconds after placing the order.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2017", "reviewer": "Akhil Tiwari"},
{"rating": 5, "title": "Brilliant", "review": "I have been using it for past 4-5 days. It's a great phone as it is but at a price tag of 39999 it's the best you could get there. No phone can beat it . Period.\n\nCamera :- like Google said best in any smartphone. Now Google has also launched AR stickers.\nPerformance :- smoothest. Buttery smooth. \nBuild quality :-  sexy ( for me at least from back)\nSpeaker's :- same performance on full volume as my flip 3 on 60% volume. \nBattery :- will get you through day on medium usage. But on heavy usage like continuous video surfing ( back to back movies) and social media in between it will give you about 4-5 hrs.\nQuick charge: really fast \n\nAdditional \n1. Get a good cover and 3d screen protector as it tends to slip. Stuffcool is providing very good official accessories for pixel phones.\n2. Wireless headphones ( I got Skullcandy method - really amazing under 5000 category) \n\nPS:- Google Assistant is amazing, intelligent and if u didn't used it earlier u will start using it now for sure.\n\nVerdict :- if you are looking for a phone above 35000 bracket go for pixel 2 undoubtedly. It will be the best decision trust me.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Dec, 2017", "reviewer": "Arpit Sagwal"},
{"rating": 5, "title": "Best deal", "review": "Great deal on 39999.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2017", "reviewer": "Amit Kumar"},
{"rating": 5, "title": "Just wow!", "review": "Value for money and great specs from Google. The power cable is C Type to C Type, so a heads up for people that you need to get a cable if you need the phone to connect your pc (USB to USB cable) since there is no extra cable provided like it was in Pixel devices.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2017", "reviewer": "Nandkumar Santhanam"},
{"rating": 5, "title": "Terrific purchase", "review": "Moved from iPhone 6 to pixel ,I have to say I didn't see the world.its just awesome.loving it", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2017", "reviewer": "Prasoon Dixit"},
{"rating": 5, "title": "Simply great", "review": "Chosen it over one plus and at 40K in december, its way better than op5 &amp; 5t.\n\nPros: \n   The best primary and secondary camera phone for photos in any scenario even video stabilization is very good\n   The smoothest android experience, Pixel launcher and live wallpapers are amazing\n   Front firing speakers sounds good\n   Finally always on display and off screen google voice search feature available after moto x\n   Compact for one hand use\n   Decent amoled panel\n   Fast charger in the box and the phone supports qualcomm quick chargers too(One plus works with only dash charger and their car chargers are overpriced 2500)\n  2Yrs of HW brand warranty with 3Yrs of SW support\n\nCons: (Doesn't bother me)\n   Old design\n   Average battery backup 4hr screen on time\n   No 3.5mm jack", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Dec, 2017", "reviewer": "Harshit Singh"},
{"rating": 5, "title": "Best Smartphone of 2017", "review": "'Android' here is not a mere 'Android' any more. It has already subdued iOS in its own game, ie, its CAMERA. This Pixel version of android is now proven to be more 'buttery smooth' than the iOS as it's faster, smoother and more importantly not 'girlish'. Now lets check the five pillars that makes a great smart phone great:\n\nI) Display: Crisp 1080p AMOLED 5 inch Display which is actually apt for such screen size, rather than the QHD ones that unnecessarily drain the battery. No glitches in the display at all. (5/5)\n \nII) Performance: Its just like the 'King of Smoothness' just like SRK as in Romance. The 835 Chip Rocks !!( I know I sound a bit more analogical..) (5/5)\n\nIII) Battery: Don't you worry about it. I would suggest forget the fact that it has a just 2700mAh. 5.5hrs to 6hrs screen on time.. Bang !! (5/5)\n\nIV) Design: Yes I know they should have shrunken the overall size a bit more by reducing the bezels (Including speaker there is not an excuse Google! bcoz Pixel 2XL has it) . But you should consider the texture on the back also the sturdy build quality and also the feathery weight.(4/5)\n\nV) Camera: If it's simply put then it is the Best Overall Smartphone Camera in the World and I think it would continue to hold that spot for atleast a six months period. (5/5) \n\nMiscellaneous: \nSpeaker is really awesome. It has the same clarity and loudness as the iPhones have but it comes in a dual stereo mode that too in the front. \nGoogle Assistant with a squeeze. This gimmick actually makes you use Assistant more than ever. And its really fast. Thumbs UP to Google.\n2 Years Brand Warranty and 3 years of front of the line Google major updates. That's an awesome deal.\nThe much improved Haptic Feedback which can be comparable with the iPhone Taptic Engine.\nAnd many more(This is actually a bonus round. Here no matter how many extraordinary features you have, you will get 5 points only overall.)\n\nFact: Though Google has been doing the same thing that Apple does but, in a much Smarter way..  (eg. The swapping of 3D touch with just a simple long press. and also the fabulous dual pixel technology for super awesome Portrait photography)", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Sanjeet Behera"},
{"rating": 5, "title": "Must buy!", "review": "Great camera, great speakers, buttery smooth software experience and 3 years software updates from Google makes it an exceptional smartphone despite the big bezels\nAlso the smaller version doesn't suffer from screen problems like the Pixel 2 XL\nThough I got it for a much cheaper price on pre-order(and great exchange value on my old phone), the price of 61K is waaay costly in India (in US you get it for ~43K). OnePlus 5T would provide more value for money according to me", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Good quality product", "review": "If only it had slightly smaller bezels. I actually wanted to rate it 4.5 but that's not an option.\nGoogle has done wonders with the camera. The most amazing thing is the performance in low light. Whatever algorithm they are using, it works, works amazingly well actually. Noise is at a minimum even in the darkest settings but it does not compromise the details too. Best.camera.ever (on a smartphone) period. The portrait mode works more often than not, bonus is it also works for selfies. \nThe software of course is bloat free and really how android should be. Lag free, smooth animations and great ram management.\nThe front firing speakers are a boon for binge watching. How i missed this since my HTC m8. This should be a standard feature and I for one will prefer this over a bezel less look. \nEnough with the praises, let's get objective now. The design could have been better although I really like what they have done with the back metal. But metal also means no wireless charging.\nRemoving the headphone jack is acceptable if the adapter works everytime. Right now it is wonky at best and needs a restart from time to time for it to work. \nBottomline is you can't get a better phone at this price (thanks flipkart for the amazing offers). At around 39k this is much better than the OP5T if you are okay with the bezels. Frankly that is more of a novelty feature and one I am ready to sacrifice over a superior camera and software experience. Don't get me wrong, OP5T is a top phone (my last phone was OP3T) and probably the only other manufacturer that gives you good software experience. But here it comes second best.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Dec, 2017", "reviewer": "Dhrubojyoti Saha"},
{"rating": 5, "title": "Best Android phone period.", "review": "Got it for 40k. Also had 3T to exchange with. Making it even better. Amazing camera, perfect size, great sound and smoothest and most consistent Android experience I ever had.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2017", "reviewer": "Ajish Nair"},
{"rating": 5, "title": "Terrific purchase", "review": "Lovely experience. Works silky smooth. Absolutely no complaints. I'd strongly recommend this product for users who don't fancy external design/appearances.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Nov, 2017", "reviewer": "Narayanan Ramesh"},
{"rating": 5, "title": "Awesome", "review": "PROS\nThis is one hell of a smartphone. \nThe camera is epic, it feels superb and battery (for me) lasts an entire day without charge (whatsapp, photos, little bit of music, web browsing, with active display on. \nThe 'now playing' feature is phenomenal! (detects hindi songs and works offline)\nactive edge is a feature i did not see myself using it this much. \nSound quality is really good along with screen quality. \nits super fast and smooths!\n\nCONS\noverheats a bit when clicking too many photos\nnothing else\n\n\nHOWEVER, I got a damaged phone, the edge of the phone had paint chipped off and the glass at the back was shoved inside in the same place..as if someone dropped it! Flipkart refuses to replace it i went to google and they said the same.. Awful service by flipkart AND google for a really great phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Worthless", "review": "Phone is OK but after i restarted it, it is in recovery mode science then tried to get it back in normal but nothing happened. Worst Service by both google and flipkart. Flipkart is not returning or exchanging it or taking any responsibility and google customer care is not responding even after receiving the complain after days.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2017", "reviewer": "Sudhanshu  dubey"},
{"rating": 5, "title": "Highly recommended", "review": "The pixel 2 is the perfect phone in many ways. Its beautifully balanced so it feels light in the hand and its of a perfect size that it fits comfortably in your hands. The build quality is very good and the design is very understated. This maybe a problem for some but for me its perfect. I don't want the whole world to know that I have a new phone. The camera is excellent for a phone and the software is the icing on the cake with it being pure android with guaranteed updates. All in all love the phone and would recommend it to anyone looking to upgrade their phones in this price bracket.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "I have been using it since 3rd Nov. I love the phone, it's super fast. A true Android experience. Android O is simply awesome. Battery backup is amazing. I charge once in a day and it's sufficient. Touch is very responsive. Performance is great. The only issue I felt was that the phone is slippery. Unable to find a case that fits this phone yet. there's no lag. Last phone I had was nexus 5. I m a die hard Google fan.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Dec, 2017", "reviewer": "Deepti Ladsaria"},
{"rating": 5, "title": "AI Power packed beast", "review": "Pros - \n\n1. I'm in love with the 5 inch device, feels like there's nothing in your pocket but it's still in there.\n2. Amazing Camera - I could say it's the best camera on any mobile device.\n3. Dual Speakers are awesome &amp; loud.\n4. Performance is incredible, everything is superfast and quick.\n5. Google Assistant is kickass.\n\nCons - \nI think the only con is it's full bezel display unlike most of 2017 phones. But I think it's okay as I am more inclined towards other factors of a phone.\n\nVerdict - It's an amazing phone with soo much Google onto it, you can directly access local places form your contacts app, you can talk to maps &amp; much more. If you're looking for a smart device which could do most of the tasks with voice that too with accuracy &amp; speed, Pixel 2 is for you.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Nov, 2017", "reviewer": "Srivatsa Mudumby"},
{"rating": 5, "title": "And The God of Phones arrived in a day", "review": "Black Mammoth in hand in 1 day.\nNo Cons... \nand yes it arrived in Office... the packing was Unbreakable...a wooden Box... which was of this Out of world ... felt like I will enter Zumaanji\n\nGoogle knows to surprise. A sunheisser CapTune wireless  free with it. And all cables all kind provided with it.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Nov, 2017", "reviewer": "Vibhanshu Kumar"},
{"rating": 1, "title": "Waste of money!", "review": "Best product.. worst service by seller and Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2017", "reviewer": "Sagar Giri"},
{"rating": 3, "title": "No proper customer service", "review": "1. Product packaging is good and no damage. (Which we normally see in flipkart)\n2. Worst customer service. Need to learn a lot from Amazon. \n3. Delivery promise is something that Flipkart need t learn. \n4. I went to nearest hub to collect the delivery. Atleast the hub personnel was humble and helpful.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Yogesh Elumalai"},
{"rating": 1, "title": "Unsatisfactory", "review": "Very poor customer service from Flipkart... The phone is great. I love the phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Wonderful", "review": "Google has finally nailed it! I've been using iPhones since the first iPhone came out but have tried various Android phones over the years. Finally, Google has delivered a phone that is actually smart. The camera is fantastic, especially the portrait mode. I'm pleasantly surprised at how well Google Assistant works. This phone is actually a testament to Google's superiority in machine learning and data. Highly recommend this phone to anyone looking for a truly SMART phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Honest Review", "review": "I received my pixel 2  just on time, and for 40,000 its a great buy thanks to  flipkart for such a great offer. Now about phone.\nIts been 15 days now.And my experience with the device has been awesome.\nIf you want to get my review of the device, then read below: \n\nPerformance: (9/10) It is one of the smoothest device out in the market.No lags or stutter, the interface is buttery smooth full credit to google for the stock android experience.\nCamera:(10/10)Best auto camera out there, sharp and excellent quality images great dynamic range not over saturated like some other devices.Great  performance in low light but a little bit grainy.Smooth and stable  video recording.Best front camera , great portrait mode.   \nDisplay:(7/10)Not the most eye pleasing display but more of a color accurate one.Not the best full hd display.\nDesign:(6/10)Same old boring design with huge bezels, if you want the mobile just for design that this device is not for you.The only positive side about  the design is that the back which is not slippery and is not a fingerprint magnet like other devices.\nAudio:(7/10)Great front duel stereo speakers,not too loud but are clear to hear.But unfortunately no 3.5 mm headphone jack.\nBattery:(8/10)One can get nearly 6 to 7 hrs screen on time with normal usage and can disable the background activity of the app for saving some battery,steps are:\n1.Go to settings.\n2.Apps &amp; notifications.\n3.Choose the app.\n4.Go to battery.\n5.Disable/Unable background activity.\n\nOverall:(8/10)This device is for those  people who want a phone with smooth performance and promised  future update from google, the best camera  in any smartphone both rear and front but with the expense of  poor design and omission of 3.5 mm headphone jack.", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Dec, 2017", "reviewer": "Rituraj Singh"},
{"rating": 5, "title": "Must buy!", "review": "Unbeatable camera. Both front and back camera incredible. Smooth and fast Android experience.\nJust google need to fix problems faced due to the way images getting saved in file manager. Different folder is getting created for every portrait photo which is annoying.", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Dec, 2017", "reviewer": "Pritam Bankar"},
{"rating": 5, "title": "Super!", "review": "Awesome ! Phone is such a piece of art. Beats any iphone with ease. And you dont need Dslr this phone's camera is beast. &amp; Thank you flipkart for such a fast delivery.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2017", "reviewer": "vishal dhiman"},
{"rating": 4, "title": "Nice product", "review": "I expected the battery life to be better. \n\nPros: speaker, camera, storage, software and operating system\nCons: tall, slippery, 20hrs max battery life for light to medium usage, small battery, big phone for small screen", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2017", "reviewer": "Ramana CG"},
{"rating": 5, "title": "Must buy!", "review": "I've done heavy testing. This phone is a beast. Battery, performance, camera, multitasking, screen quality, every single thing is best in class. Except for those big bezels, this in love with this phone. And Google has recently rolled out AR update for camera which works well too.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2017", "reviewer": "Moola Omkar Teja"},
{"rating": 5, "title": "Classy product", "review": "Great product with Flipkart's delivery. Delivery was done ahead of time and packing was done neatly. Phone is a killer phone. There's no looking back for this phone. Got it for 39,999 on deal price. Recommend for people looking for a phone with great camera and great performance.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2017", "reviewer": "Prithvi Jagannadh Koppisetty"},
{"rating": 5, "title": "Awesome", "review": "Absolutely brilliant phone and truly the best camera ever. If you have the money &amp; love the Android experience as much as I do then there is no better option than this one. Battery is a bit of an issue though, especially if you are a heavy user.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Nov, 2017", "reviewer": "Nikhil Idicula"},
{"rating": 5, "title": "Brilliant", "review": "Great product from Google. Software quality and hardware feels excellent. It would've been great if it came with some sort of protection plan for the hardware, mainly the screen.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Nov, 2017", "reviewer": "Shyam Prasad"},
{"rating": 5, "title": "Best in the market!", "review": "After two days of usage, I've come to know that this phone is the fastest android phone having best ever camera.\nIf you don't mind the bezels on top and bottom, this one is the one you want.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Himanshu "},
{"rating": 1, "title": "Useless product", "review": "Product was good. Packing conditions are avg but delivery was very poor. Flipkart taken 11 days to deliver the product in Hyderabad location. Great service keep it up Flipkart....", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Just wow!", "review": "Just Fabulous. Received the same day when it was launched in India. Pixel 2 is flawless product. With incomparable camera quality. Flipkart provided me amazing Google Launch Pack. Complete wooden box. Thanks Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Debopriyo Ray"},
{"rating": 5, "title": "Highly recommended", "review": "Don't waste you hard earned money on iPhone 8 or X or whatever\nJust buy this bombshell from Google\nIt's camera is just outstanding , no competition\nBest phone for any Android lover", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Nov, 2017", "reviewer": "Vibhor  Mahendru "},
{"rating": 4, "title": "Worth the money", "review": "Phone is awesome \ngoogle done its job \npricy becoz gst but never mind to get this beast\nwaiting for head set!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Nov, 2017", "reviewer": "subhash"},
{"rating": 5, "title": "Classy product", "review": "People can complain about bezels and it's price... But personally I believe sometimes we have to get over these small things to enjoy the experience that this phone provides... Love the camera and the authentic Android experience... The photos are simply awesome especially the details... The front facing dual speakers are simply stunning...love the experience... No complaints...", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Dec, 2017", "reviewer": "Guru Prasad Das"},
{"rating": 1, "title": "Does the job", "review": "My brand new pixel 2 is switching off because of heating problem, not expected from you Google. You don't know the reality of big brand's &quot;Quality Assurance&quot; unless you be the victim.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "Fantastic phone for the price. I was looking for a 5 inch phone with flawless performance. This phone has perfect size and can easily be used by one hand. Oreo is great. Even though the battery is 2700 mAh ,I get around 5.5 hrs SOT and have more than 20% remaining   by end of the day. Front firing speakers are good. 54Gb storage is more than what I need. Price is a bit on the higher side ,but google is going to provide 3 years of update to the pixel 2 phones. Screen is not over saturated and I like the subdued colours. But google is coming up with an update to bump up saturation. Excellent phone upgrade for me from my Nexus 5.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Savignya More"},
{"rating": 1, "title": "Unsatisfactory", "review": "Perfect phone for my needs. Was tired of using light sabers with pointless screen aspect ratios. Oreo is fluid, touch is great, camera is super awesome. Will post updates as and when I can.\n\nEDIT: Its unfortunate of google to reduce the price of their flagship phone by a huge 20k in a matter of just a month. Did not expect this kind of response at all. Won't be buying a google product again!", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Kaustubh Phadtare"}
]