[
{"rating": 5, "title": "Highly recommended", "review": "Short and simple review:\n\nPros\n1. Eye catcher. Amazing looks\n2. Perfect size. Not too large not too small.\n3. Great screen. Amazing color output.\n4. Outstanding camera.\n5. EMUI is wonderful. It takes time to get used to but its really precise, functional & efficient.\n6. Kirin processor is great. There is slight heat but its only normal.\n7. Speedy fingerprint sensor and useful for other functions.\n8. IR Blaster is really nifty with the built in app having profiles for most devices in the world. It could even control my local cable stb!\n\nCons\n1. This phone is a fingerprint magnet.\n2. All glass body makes it really slippery. Better use it with a cover.\n3. Single sim. This depends on preference though.\n4. No usb 3 or quick charge. At this price point, such features are expected.\n5. The battery saver app is quite strong. Makes some apps behave weird. It cud be turned off fr settings though, for each app separately.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Oct, 2016", "reviewer": "Nyukeit Thakkar"},
{"rating": 4, "title": "Good choice", "review": "I enjoyed the photos clarity and cpu performance of phone. I bought at 15k\nCons:\n*Display brightness low at day time\n*Average battery life\n*I received faulty product ( GPS not at all working)\n* No inbuilt video calling features via jio volte\n* GPU performance is average\n*No speed charger provided in box, normal 5v/2A charging\n\nPros:\n*CPU performance is super like Snapdragon 821 or 835\n*Phone design is sexy but need to carefull with glasses\n*Rear Camera is best under 25k, Selfie is best clarity\n* Finger print sensor is fast and have best button features\n*Display is like amoled, like deep black and perfect colour suturation. It is better than amoled and LCD display under 25k but need to sacrifice with brightness department at outdoor.\n* I like Emui Very much because it as many inbuilt features which is useful for me ( no 3rd party app required) waiting for Oreo update  \n * Battery saving mood is handy . I got best SOT 5 to 6 hr.\nBuy according to your priority.\nWhy I bought Honor 8 ?\n1) Display.\n2) Camera both rear and selfie\n3) Super CPU performance like flagship level phone ( best performance under 50k phone) User interface\n\nPlease give me a like, dis is 1st long review for me.\n\nThanks", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Jan, 2018", "reviewer": "Udhay Kumar"},
{"rating": 5, "title": "Terrific purchase", "review": "Hi...All\nColor...shapire blue colour of honor 8 is awesome. \nCamera...quality of picture is very good and front camera also giving the details.\nMemory..32 gb internal...4gb ram with 128 gb external memory is making this device great.\nDisplay....colour combination is very good with ltps lcd display.\nIt is a very premium looking device and you will feel good in your hand.\nVery fast finger print and also it is a smart button you can use for multi task.\nBoth side is with glass...and it will be slippery if your hand swatting. .\n\nPerformance is awesome. .And android v.06 is there and EMUI is great..\n\nLoud speaker also pretty good.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2016", "reviewer": "Azizur  Rahaman"},
{"rating": 5, "title": "Terrific purchase", "review": "Awesome looks, great build quality, fantastic EMOUI, value for money features. Only con is it's slippery as hell. Using a cover hides it's beauty.\nBut at no tables did it not turn heads.\nTotally happy about it.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2016", "reviewer": "Ketan rane"},
{"rating": 5, "title": "Just wow!", "review": "Awesome phone with great specs at great price", "verification": {"CERTIFIED_BUYER": true}, "date": "17 May, 2017", "reviewer": "GAURAV AHUJA"},
{"rating": 1, "title": "Waste of money!", "review": "two time defective prodect sold by flipkard camera not working and now flipkard not accepting return.going to consumer court", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Really Nice", "review": "Very awesome for this phone. But dual sim are not available and Jio volte.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2016", "reviewer": "dhirendra Mehta"},
{"rating": 5, "title": "Great product", "review": "Excellent phone. Awesome build quality, fluid UI, excellent camera and battery backup.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "The mobile comes with the ready Android 7.0 update which is followed by the small volte update\nBut, the volte feature isn't added\n\n1. Camera\nThe dual camera setup stands awesome even in night shots, wide aperture is excellent & the tail light photography is an inbuilt option. Slo-mo & time-lapse also sounds good. The Pro-Video mode is an added advantage to this mobile whereas no others have\n\"100 marks for the camera\"\n\n2. Battery\nEven with the GPS turned on all time, the battery backup stands with the day.\nThe battery on this mobile is reliable.\n\"100 marks for its battery\"\n\n3. User Interface\nIs simply awesome & user-friendly\n\n4. Fingerprint sensor\nThe dual act of the fingerprint sensor is amazing.\nActs as also a button & the fingerprint responds faster than thinking\nIt acts as various functioning to answer call, browse photos, notify bar pull etc.,\n\n5. Display\nThe 5.2\" full HD display is good & catchy with its 2.5D curved screen\n\n6. Look\nThe glassy look at the back is amazingly extraordinary with the 2.5D curve also on the back.\nThe borders of the mobile has a matte finish that gives some grip to hold\nThe mobile looks so slim that gets an additional advantage for the look & usage\n\nIt's highly recommended to use a back cover if yu are a rough user..", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Just wow!", "review": "Nice phone", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Jan, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Masha Allaah", "review": "I am using since 1 month. till now no any issues i have faced. \nVery fast\nVery good camera [back & front]\nquick fingerprint sensor\nSapphire blue color is awesome\nultra smooth\n\n\nNote: Before honor 8 i was using honor 6 and it was also 5 star mobile.\nhonor is best", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2016", "reviewer": "Musaddik Patel"},
{"rating": 4, "title": "Good choice", "review": "Awesome phone.. amazing camera, superb touch, lots of features.. terrific build quality with a classic look (especially the sapphire blue)..this should be a Huawei Flagship model..\nHowever, its battery is not upto the expectation. \n5 star to the phone. Worth buying this device.\n3 star to the seller (NSCreationss) cos initially I received different phone but next time I received the correct one.", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Dec, 2016", "reviewer": "Debashish Saha"},
{"rating": 5, "title": "Perfect product!", "review": "It's been about 10 days since the purchase and being my first Honor phone I must say I'm very impressed with this phone. I'm not much of a gamer so this review is not based on the gaming performance although I only played temple run and it was a flawless experience! \n\nLikes\n1. Smooth performance without any lags or abrupt closing of apps. \n2. Primary camera performance is awesome in pro mode.\n3. Screen looks awesome and is good to view in daylight as well if the brightness is set to nearly 50%.\n4. Flexibility of expandable storage or dual SIM.\n5. Although more than 80  apps are installed on the phone there is still 2gb memory free at all times.\n6. Front facing camera is very impressive in artificial lighting conditions as well.\n7. Customization options in EMUI are excellent but may be an overkill for people coming from pure android phones.\n8. Battery life is awesome and lasts 24hrs with normal usage and atleast 18 hours with heavy usage.\n\nDislikes:\n1. The default mode in which the camera opens is not pro mode and I personally don't like this as the depth of field has to be adjusted in the default mode almost every time to take group pics.\n2. EMUI takes a little getting used to esp for first-timers like me. The notifications setting is a bit of a pain to get used to.\n3. Noticed heating around the camera area when using the camera, esp when taking 10-12 pics.\n4. Full charging takes nearly 2 hours although it takes around 30 mins to get to 40% when needed.\n\n\nOverall a great phone at this price range though it has its flaws like every other phone. If the budget is limited this one and the op3  would be great choices to consider.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Nov, 2016", "reviewer": "Saleem Khan"},
{"rating": 5, "title": "Unsatisfactory", "review": "I got it with broked screen and Flipkart is doing nothing about it..i complained 7 to 8 times but there is no processing for return.. \nAll people who read this plzzz dont buy something from flipkart...\nIts for our sake.\nVery disappointed.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Aug, 2017", "reviewer": "Deepanshu Richhariya"},
{"rating": 5, "title": "Highly recommended", "review": "Fastest phone ever used", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Oct, 2016", "reviewer": "sunil  Gupta"},
{"rating": 5, "title": "As beautiful as i guessed.....", "review": "This smart-phone looks stunning, having amazing features. IR blaster works very well for all my  remote-controllled devices. Camera is also quite good.\nThe only con i felt is it got little heated while downloading in high speed(but that is not too much). No need to mention about its speed because it has 4 Gb of RAM out of which minimum 2 GB always remains free. So i  am giving this premium device a 5 star rating.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jul, 2017", "reviewer": "Shashikant"},
{"rating": 5, "title": "Awesome camera phone!!!", "review": "LTPS display is very share and smooth feel.\n\nFinger print sensor is very responsive even with the slight touch.\n\nBrilliant design. Stunning look. Reflects in sunlight.\n\nGood build quality.\n\nBattery backup is 1 day on heavy usage with data/wifi on.\n\nRear DSLR picture quality, front camera is mind blowing.\n\nKirin 950 processor is lag free. Can handle multiple apps. Very fast software/applications response.\n\nMore fun with EMUI\n\nReally worth for 30K.\n\nIt would have been flagship killer if Honor 8 has the following:-\n\n1. Latest GPU \n2. Gorilla Glass protection\n3. Ear phones not available in the box which is very disappointment for this price.\n4. Phone is slippery, it is advisable to use back case for grip.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Nov, 2016", "reviewer": "Balu KB"},
{"rating": 5, "title": "Classy product", "review": "Superb", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jan, 2018", "reviewer": "Vivek"},
{"rating": 4, "title": "Pretty good", "review": "Best phone but I had only issue with the size", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jan, 2018", "reviewer": "Sidhartha  dutta"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "I am so happy. Honor 8 is perfect camera phone. Game is very smooth. No any lag. Display is very good. Under 24000/- compear any phone it's best. Really very good. 100% Batter than asus zenfone 3.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Jul, 2017", "reviewer": "Kaushik Mustafi"},
{"rating": 5, "title": "Must buy!", "review": "super phone. camera outstanding. stunning looks. one handed use. battery backup is too good. just go for it.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Feb, 2017", "reviewer": "Srinu Sri"},
{"rating": 5, "title": "Must buy!", "review": "This is what I was looking for...awesome looks,   stylish logo, dual cam, great specs, reasonable price, honor brand, 2year warranty, VIP card, rare gem, one of its kind blue sapphire color, expandable up to 128GB, 15 layer crystal glass also slippery, 3 month screen damage warranty, feels like Samsung edge and iPhone 6s, amazing speaker, NFC.....................love you honor...\n\nI have used honor holly, honor 6, honor 5x and now honor 8 ...so without a doubt I am big fan of honor brand........honor brand always takes my expectations to the next level.....love you more than my all ex....", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2016", "reviewer": "Rahul Saini"},
{"rating": 5, "title": "Terrible product", "review": "Phone is really very good. But flipkart is really very very bad. I received my phone in 18 days.\n\nLove the quality, features and look of phone. \nCamera is awesome.\nI invested Rs. 19K just because of camera.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jul, 2017", "reviewer": "Aditya Sharma"},
{"rating": 3, "title": "Worth every penny", "review": "I'll Explain in the end, why 3*  after having everything perfect except one. But that one is too risky to handle.\n\nThis phone looks fantastic and works like a charm. Out of the crowd it actually stands out.\nRegarding reliability of hardware from honor, i can say that I'm using honor 6 from last 2yrs & I still find it my best companion until i had a hold on this gorgeous Honor 8\nFYI: I used honor 6 parallel to Galaxy note 3\n\n cons:\nIts single sim\nWorst thing is its glasses on front and back are least durable. Make sure you put a cover & hide the beauty as its too fragile to handle even a 2feet drop.\nFYI: VIP warranty doesn't covers even the front damage if there's any notice of physical injury to the back glass. And you can expect easily that since its glass on  both front & rear a drop will damage both sides as was the case with me.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2016", "reviewer": "ANKUR Jaiswal"},
{"rating": 4, "title": "Good", "review": "Because of the glass  back side of mobile heat is feel..\nYou get latest android up to date.\nEvery day price is fluctuate. So buy at minimum price.\nI brought this mobile at price 17,725. Rupees.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Aug, 2017", "reviewer": "suraj bangar"},
{"rating": 5, "title": "Excellent", "review": "Looking good", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2016", "reviewer": "Aftab  Alam"},
{"rating": 4, "title": "Worth every penny", "review": "Amazing Smooth... Great Clock Speed... stunning camera.. sound is also good... these are the first impressions...\n\nPost using One Month\n\n1-  70% of battery drives me wholeday with 4G full on use ... whatsapp videos and email ...hasslefree\n\n2- Photos Awesome...\n\nOne issue (under observaion)\n\nOne issue which making me rate 4 star... although I am not fully sure... at times phone makes me out of reach even in full network...I am keenly observing the issue n ll keep updating my reviews in the interest of buyers..", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Oct, 2016", "reviewer": "Aarya P"},
{"rating": 5, "title": "super phone 👌👌👌", "review": "good camera , excellent display quality , good battery , no lag , no major heating issue ..", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Jul, 2017", "reviewer": "Mihir Chowdhury"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "AWESOME", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Nice product", "review": "I have purchased Honor 8 device. But I am unable to check wheither it is referbished or new. The phones heats a lot and touch does'nt response freely. Rtn menu is also not opening on this device that means this device is refurbished and sold in a froad way. If you can prove my device is new and genuine then its ok but if you cant prove then I will challenge it in court. Thank You.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Nov, 2017", "reviewer": "Vishal Kewat"},
{"rating": 5, "title": "Honored", "review": "The phone is Drop Dead Gorgeous with Killer Specs and UI... Go for it. \\m/ \nDon't think twice if you are a little skeptical about the Kirin processors. Its a different beast... The one with a cool quotient...\nAlmost forgot to mention the ultra-fast delivery by Flipkart... Kudos!!!?", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Oct, 2016", "reviewer": "Prasad Kawadkar"},
{"rating": 5, "title": "Just wow!", "review": "Phone was excellent", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Worth every penny", "review": "Awesome!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2016", "reviewer": "pankaj Sharma"},
{"rating": 2, "title": "Not getting nougat update", "review": "I checked for update but it is not displaying emui 5.1 update. But update is already rolled out . please help me", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Aug, 2017", "reviewer": "Sanket Patel"},
{"rating": 5, "title": "EXCELLENT WITH KIller looks and specs totally satisfied", "review": "1 st  impression is its looks and camera is top to the notch ,and kirin 950 although some few months old but otput is marvelous no frame drops and no lag while using and playing heavy games like mortal kobat x ,asphalt 8,modren combat 5...some ...Awesome phone i loved It", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Oct, 2016", "reviewer": "Venu Gopal"},
{"rating": 5, "title": "Bingo", "review": "Received the product before the scheduled date.\nPros:\nNougat experience (after update)  has been really smooth on this device.\nGreat Camera and crisp display although automatic brightness control doesnt work as good. Manual mode preferable. \nEMUI is really fluid.\nIn love with the Fingerprint scanner and its unique functionalities.\nRAM management is great.\nIR blaster + NFC + OTG support (Great!) \nDevice charges quickly.\n\nCons:\nBattery drains a wee bit earlier than expected. (power bank recommended if heading outdoors for more than 5 hrs) \nThe device is really slippery hence a cover is a must.\n\nOther than that the device has been doing great. \n\nPs.  Happy with Flipkart's packaging and delivery timing.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "An Awesome Phone", "review": "Great handy size, dual cam, amazing looks..what else do you need", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Oct, 2016", "reviewer": "Vipul Elawadhi"},
{"rating": 5, "title": "Highly recommended", "review": "Best phone in the range ...", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Oct, 2016", "reviewer": "Aadil "},
{"rating": 5, "title": "Great product", "review": "Honor has just honored me .. love this phone.. perfect finishing..fully satisfied with its looks", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Nov, 2016", "reviewer": "PRiyaranjan Gouda"},
{"rating": 5, "title": "Simply awesome", "review": "Superb", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Does the job", "review": "It is getting heated when using camera and games", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Oct, 2016", "reviewer": "krishna teja"},
{"rating": 5, "title": "Worth every penny", "review": "Awesome....!!! Best phone in the price range segment", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Perfect product!", "review": "Buy the cover first . Then mobile... fragile as hell", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Dec, 2016", "reviewer": "Pallav farsoiya"},
{"rating": 5, "title": "Simply awesome", "review": "Excellent performance", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Oct, 2016", "reviewer": "vijay j"},
{"rating": 5, "title": "NICE", "review": "nice phone if I tell it is competitor of I phone 7 and google mobile camera is nice ad best deal is I buy it just 24,500", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Timely delivered.and found satisfactory.", "review": "HONOR 8 functionality issue : it's very hard to receive the proper network signal require restart to regain the strength and mobile networks issue.and too slippery...rest is fine.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Oct, 2016", "reviewer": "Rashid Jilani"},
{"rating": 5, "title": "Highly recommended", "review": "FANTASTIC PHONE.\nHi,\n\nThis is the 1st time I am using any phone from brand huawei (honor 8). \nI would say the experience on this device had been awesome since now.\nThere are some awesome things which I like about the phone.\n1. The phone is super awesome in looks and feel. It feels premium man.\n\n2. The phone is super smooth in handing all the task u throw at it.\n\n3. The phone can surprise you when it come  to  camera. It can take some breath taking pictures.\n\n4. The phone has good ram management.\n\n5. This phone can  give you a full day that's more then enough. \n\nI believe at this price point it's a deal breaker.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jan, 2017", "reviewer": "nakul rawat"},
{"rating": 5, "title": "Super!", "review": "amazing ...simply amazing in the feel..too good to handle and just feels so rich in handling. Runs smooth with the interface (emui).  Very nice fingerprint sensor.\n\nhighly recommend to buy this phone(especially blue version)", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2016", "reviewer": "Arbaz Sayed"},
{"rating": 5, "title": "Fabulous!", "review": "Excellent front and rear camera, excellent look, excellent performance, overall worth the money.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jan, 2017", "reviewer": "Bipin Kumar  Yadav"},
{"rating": 4, "title": "Good choice", "review": "Back panel can easily get scratched. Performance is alright. Camera is good. Overall  phone is one of the best in this range.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Nov, 2016", "reviewer": "Oliver Alva"}
]