[
{"rating": 3, "title": "Not up to mark to be called a Flagship", "review": "I have been using this product for 2 days and its the review based of the 2 days of usage\n\n\n1.Its heats up like anything even for normal Browser usage\n\n\n2.battery backup is about 1 day 4 hours with Single Sim (2G) and wifi on continuously on single charge,with minimal usage i.e 1 hour youtube,minimal calls and other Social Networking etc.\n\n\n3.The call clarity is awesome, the sound is clear and crisp,but after making calls for 22 minutes continuously,I felt unusual heating near the earphone thats very irritating.\n\n\n4.There is bit of Lag in the UI,can't be sensed so easily ( I felt lag while toggling from one app to other) hope Mi would come with an OTA for this\n\n\n5.At the first Boot I got a Ram of 1Gb from 2GB,but during usage after killing all apps u get something close to 800 mb ram.\n\n\n6.At the first Boot the internal Storage of the phone was close to 10.6 Gb after removing unnecessary preinstalled apps the memory came up to 11.45 GB (with NO other apps loaded) since there is no Option for memory card you have to keep a Pendrive with you and transfer your clicked photos via OTG.\n\n7.the camera is descent takes good photograph,but there is lot of noise in low light conditions,which will literally spoil the pics,so this phone doesn't perform well in Low light\n\n8.Gaming was just Ok with too much heating,there is something strange in Mi 4i that even the Screen heats up dangerously.\n\n9.The tall claim of Xiaomi as flagship device for India is'nt apparent after using the Phone\n\n\nverdict:\nIf heating and short memory storage is'nt an issue the phone is the best.hope xiaomi will come with an OTA in order to curb the heating issue.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2015", "reviewer": "Sanjay Mishra"},
{"rating": 5, "title": "HEIGHTS OF AWESOMENESS......:)", "review": "Awesome phone...no lags..no heating problem...great UI....\n\n+ Battery\n+ Camera(front n rear)\n+ UI\n+ SCREEN :}\n+ NO LAGS\n\n- No headphones\n- lack of accessories in market\n\nIMPORTANT POINT:\nUpdate your phone before using it, there is a update of 800mb. IT WILL SOLVE THE HEATING ISSUE ETC.....", "verification": {"CERTIFIED_BUYER": true}, "date": "7 May, 2015", "reviewer": "Gagan Gupta"},
{"rating": 5, "title": "superb mobile", "review": "looking very beautify and also looks very slim\ncamera is good\nvideo recording is also good\nscreen resolution is very good\nMiUI 6 is so good\nmobile performance is also good\nbut little bit heating issue....", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2015", "reviewer": "vignesh Kumar"},
{"rating": 5, "title": "Beauty and the Beast", "review": "This phone is excellent in terms of style, performance, battery and camera. \nToo weightless and had a mat finished like back panel\nCant say that this device didnt heats up...actually it does..but only when you are charging or using mobile internet.\nMIUI is as fluid as iphone..in fact its superior with a lots of features; like \"one hand use\",themes etc\nThe only con i had found is that the sound is only average(or below average).\nDisplay and camera are excellent. (both rear and front)\nsuperb call quality\nBattery is more than average than other android phones.\nAll the sensors are working perfectly.\nWill update this after a months usage.\n_____________________________________________________________\n\nDon't hesitate. Its the best you are going to get at this price !\n____________________________________________________\nEdit:\nHave been using this for almost 2and half years now..still works like a charm.. only drawback is non expandable memory.. since i keep my phone clean most the times, that's acceptable to me. \nHad replaced the screen twoce in this period due to broken display.. but it's completely my fault. \nCamera works better than current mi models at this proce range.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2015", "reviewer": "Hilal HR4"},
{"rating": 5, "title": "Excellent flagship for an unbeatable price", "review": "Overheating?: I was initially concerned about the reports of overheating from reviews on FK as well as from some reviewers. After using the phone for a few days I have not experienced any overheating. Like all phones, it gets a bit warm if you use it while charging and also for highly intensive games. But even during gaming, it never got too hot, just slightly warm. This is on Asphalt 8, Subway Surfers and Clash of Clans. \n\nDesign: The device feels extremely great in your hand, even better than the Mi 3 and much nicer than the bigger phablets like Zenfone 2 and Honor 4x. The matte finish make the device feel premium. Every person I have shown my phone to has first commented on how light it feels, but also remarked how solid it is. \n\nBattery: The battery has been great, easily lasts me a day with some room to spare.\n\nDisplay: This is the main reason why I decided to buy the Mi 4i. The display is unparalleled in this price range and even in 20k+ devices. 1080p display just looks beautiful. The Corning OGS glass is same as GG 3 and makes me feel safe with my purchase. Also, I thought Sunlight Display was just a marketing gimmick, but it actually makes it easier to use my phone outdoors.\n\nPerformance: Really love the performance of this phone. There are some minor lags after playing games for 30min+. Once the device cools down again it works as normal.\n\nOverall: Best phone since Mi 3. Don't believe the overheating reports until you actually use the phone. I was worried after watching a YouTube video showing really bad overheating, but he switched on performance mode. I have not seen any overheating in default mode and am still able to play all the games I want.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2015", "reviewer": "Rohit Ghalsasi"},
{"rating": 1, "title": "Quality issues", "review": "Issues with the phone.\n\n1. LED leak at bottom of the screen, under the back-lit buttons. \n\n2. Phone overheats even with brief usage on 3G/WIFI.\n\nHave requested for return.  Waiting for reply from Flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 May, 2015", "reviewer": "Navjyot Singh Sansoa"},
{"rating": 5, "title": "Overall Happy !!!", "review": "Phone is pretty good   !!!!\n\nNo abnormal heating and the heat it generates is normal for a phone of this Kind !!!\n\nFirst Xiaomi Product !!! Happy with the performance !!! \n\nCamera beyond my expectations !!!! Total worth for money !!!\n\nOnly concern is Service centers !!!! Hope ill not get any issues atleast for an year until I get another one !!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2015", "reviewer": "Balaji Kannan"},
{"rating": 1, "title": "Very Heating", "review": "Please don't buy this product.its like a heating pad.I just started setting up the phone on first boot up the phone got heated up and it is really unbearable to use.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 May, 2015", "reviewer": "Vivek Madaan"},
{"rating": 4, "title": "Mi 4i Review after MIUI6.5.5 update", "review": "After doing research on the latest phones , I bought this phone.\n\nReview of mi 4i after upgrading to 6.5.5 MIUI stable version\n\nPROS:\nBuild is perfect for usage as well to place in pocket\nAmazing Screen\nGood battery life\nHigh speed network connectivity in performance mode(better than iphone6 in my test)\nHDR Photos are very good at its price range\nGot it for Rs,11,700 in Flipkart during offer days with 24-hour delivery\nOne hand usage is good.\n\n\nCONS:\nSlight warm on continuous use of 20 min or more\nVolume and Power buttons are sharp at the corners(doesn't feel premium)\nPlastic body feels delicate, especially if you have kids\nMicro USB connector is not comfortable while plugging in or removing the pin(very tight)\nLimited memory\nLoud Speaker is not great; OK sound\n1 GB is used by MIUI and if you open a couple of apps, the remaining RAM shows 700MB(RAM is not being used optimally)\n\nSome Observations in my usage\n\nRan Antutu BenchMark Tests after OS upgrade:\nbalanced mode 31k\nperformance mode 39k\n\nUsed the phone extensively in balanced mode\nFull battery got charged in less than 3 hrs with the 2A charger given along with the phone\nWhen using the camera/browsing/gaming for 30 min makes the phone warm (Not heating); Same thing observed in my htc also; felt not a problem\n\nBasic camera settings doesn't give very good photos; need to do small changes for good photos\n\nFaceBook app hanged once in my use.\n\nNetwork speed is amazingly fast (compared to my htc one X and iphone6)\n\nScreen looks little dull at 50% brightness compared to other phones at same brightness level\n\nRan few games like temple run without any issues\n\nLoud speaker sound is on the lower side\n\nReceiver sound during calls also is not on the higher side; It is Ok\n\n1 GB RAM is always used by MIUI; only 900MB to 1 GB left for the user. \nIf you open large number of apps, may be a problem; Tried with 7 to 8 apps, no issues.\n\nRan Asphalt8 for 10 min in balanced mode; didn't face any UI lags; but the device became warm beside the camera, checked the temp - it is around 40 (same thing on my htc was 40, but because of the material and build, i dont feel it much on my htc) may be because of the chipset density and octa core in mi 4i,so i am feeling 40 also as light heat on the outside.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 May, 2015", "reviewer": "Deepak Patta"},
{"rating": 4, "title": "Bang for the buck...with a catch", "review": "Here is what you need to know about the phone before you purchase:\n\nThe good:\n1. Amazing display with display calibration and color gamut found in Apple Hardware. The sunlight readability works as advertised.\n2. Well built with anti-slip matte back and very light weight. Easy to hold and won't drop too often unless you are butter-fingered\n3. 'Flagship-grade' rear camera with quick focus, good HDR mode and great details and colors. Decent front cam, gets the job done but don't expect much detail in the picture\n4. Good battery life. Lasts a typical work day with about 20% battery left. Obviously depends on usage pattern. For better battery life, keep the phone in balanced performance mode and 40-50% brightness set on Auto\n5. Did I say, gorgeous display ;)\n\nThe bad:\n1. Performance is middling at best and doesn't deserve a 'flagship' rating. App launches are slow, sometimes won't happen at all. Signs of an unoptimised OS running on decent hardware. Expect a Day 0 software update of 800 mb+ which is a must-have else the phone overheats and performance stays sluggish. There is an update in the works which should fix most of the issues though.\n2. Battery life could have been better. A problem possibly because of Lollipop 5.0.2. An update to 5.1 is needed to remove memory leak and battery life problems which should happen soon enough.\n3. The balanced mode takes the life out of this phone. Multitasking is a pain, app launches slow down further and you can notice the stutter in animations.\n4. Continuous camera usage can overheat the phone to the point that the camera app starts to lag a lot and the focus struggles. You will have to let the phone cool down to go back to smooth performance.\n5. Severe CPU throttling when phone heats. Don't know if its the OS or the Snapdragon 615 problem. We will know after the Software update for sure.\n6. 16 GB non-expandable storage with about 11GB of user available memory. If you keep a lot of media or love to take pictures, you might wanna wait for the 32/64gb one\n7. The OS uses a lot of RAM. 1.5Gb out of 2 is usually taken by MIUI. This is not a deal breaker but definitely a drain on performance and battery life. Lots of other bugs which need a fix.\n8. Only white option. If you've got to give only 1 option, make it black. seriously.\n\nNOTE to Buyers:\nIf you see a lot of heating in general use or a light bleed below the backlit buttons, ask for a replacement right away. The heating problem is mitigated by the update so do that before you ask for replacement. The light bleed problem is due to poor panel lamination and replacement is the only option.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 May, 2015", "reviewer": "Anupam Singh"},
{"rating": 5, "title": "Review after 4 days", "review": "Ordered this phone on 14th of Aug, and got delievered by Aug 16th. So here is my review, before buying this handset I was using Redmi 1s. \nPros\n1. Processor which is a Octa Core processor\n2. 2 gb Ram\n3. 32 gb internal (out of which got 25 gb for user)\n4. Light weight phone\n5. Battery lasts for a day (my usage is high, 24 hours mobile data or wifi would be on and would play high end games)\n6. MENU, HOME & BACK key has light (feature which we can't find in Redmi 1s)\n7. Smooth interface, smooth runining \n8. Games - It supports hight end games and plays so smoothly (gets heated up little bit)\n9. Signal recepetion is good (as redmi 1s has few drops when it comes to signal reception)\n10. Display is good both in daylight and low light\n11. Front cam is awesome \n12. Mi 4i will be getting MIUI 7 update (but we need to install developer ROM, as it comes with stable ROM)\n13. Dual 4g sim, even 3g is giving awesome response (I didnt use 4g service) \nCons\n1. VOL KEY & LOCK KEY are made out of plastic\n2. Camera - rear 13mp but it doesn't look like 13 and it is worst in low light\n3. Sound is low, as it has big speaker in the rear but it sounds so poor \nOverall it's a good handset as the no. of pros and cons says.....12 Pros and only 3 cons. So if your looking goods specs at 15k then you can go ahead with this handset. \n\nNote: And if you buy this phone means please buy temper glass and install in it to avoid display damage because I dropped my redmi 1s without any screen guard, so display got damaged and for new display it is priced half of the handset's price. So avoid this buying and installing tempered glass in your Mi 4i", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Aug, 2015", "reviewer": "Joshua Sathyaraj"},
{"rating": 4, "title": "Just go for It. MI 4i excellent Mobile ( My 1st Xiaomi Phone)", "review": "This is my 1st Xiaomi MI4i, i was a user of Samsung Note 3 & iPhone 5s. MI4i and excellent phone, Its flawless in every aspect. Please go for it. Well, 16GB is enough for storing songs 600mp3 and 30mp4 videos. Many people have complain about heating isue.Lets come to me perception , people who r saying its getting heated up during 1st boot& setting up the phone for the 1st time. i guess they haven't use any smart phone either. Its obvious while booting for the 1st time any phone will get heated up. Because all the applications will be running along with WIFI with highest performing speed to update apps UI, screen will be light-up for long time. Charging for 1st time may heat up a bit. leave the phone to get fully charged. use it for a day or 2. Turn off the 4G LTE, always use GSM for better call connectivity and a great battery life. . Turn on for G when it requires. i bet , you are not going to face heating issue . At least i am not facing any heating issue.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2015", "reviewer": "Chiradeep  Bhowmik"},
{"rating": 4, "title": "Complete satisfaction and more than expected.", "review": "Hi,\n\nBought this phone in the third flash sale because I was waiting to know the reviews about this phone from the previous customers. So far, this phone has been very impressive and I have no complaints (just a missing external memory card slot, which is not really a big deal). This phone was delivered in a day's time, which was good.\n\nFollowing things I've noticed after using my phone;\n\nHEATING - This phone heats up normally like every other phone, it has no extensive heating issues like every other person has been complaining about in their reviews. If you play heavy games continuously for like 10 minutes or so, the phone heats up a little bit, but that is completely normal. Even while charging or talking on the phone for quite sometime, the phone will heat up, but in a normal way like almost every other phone. I had updated my phone almost immediately after opening the package, so I don't know about the heating issue before the update, but as of now, its completely fine.\n\nCAMERA - The camera in this phone is freaking brilliant. If you're getting blurred photos from your Mi4i camera, then you're just not focusing it properly because it has a manual focus as well (tap on the screen where you want to focus). None of my photos have come out blur (what I had focused on came out crisp clear). The front camera is also equally good. Sometimes the photos do come out a little (just a little) grainy, but remember, sometimes even digital cameras and dslrs' produce a little grainy photos and that is not the fault of the camera. Grainy photos are produced due to low light.\n\nRAM - 2gb RAM helps a lot. The phones barely lags and when it does, its for barely a second and that is totally manageable. I've noticed that the phone lags only when I switch from app to app very quickly, like when you open one app by mistake and realize that's not the app you wanted to open and then you click the home button and then quickly click on the other app, that's when the phone lags. That's not even the right way to operate a phone I think, so I'd take the blame for that. There is a shortcut button for task messenger (left bottom, feather touch button) which shows what all apps are running in the background and you have the option to kill those apps instantly. After the first update, the free memory after killings all apps would be around 400mb. I got a third update (one day before writing this review) and after that the free memory goes up to 700mb. No worries about the RAM in this phone and no lag issues.\n\nINTERNAL MEMORY - Of course, an external memory card slot would have been a major plus point, but quite frankly 16gb memory is enough. You get to use almost 10gb only because the system also uses a lot of memory. If you think you're running low on phone memory, then please check the photos that you've clicked from your phone and the music list. I had low memory issues with my previous phone only because of excessive and unwanted photos and music in my phone. Otherwise, the memory issue should not be there. \n\nSPEAKER/HEADPHONES - The volume of the sound is actually less, even at full volume. Sound quality is not bad. People have been complaining about poor sound quality and that isn't the case. Sound quality is definitely not great, but it's definitely not bad. Sad thing is, earphones were not provided along with this phone. So pair up your phone with some really good earphones and enjoy the music.\n\nBATTERY - Though the battery capacity is really good, I don't get a very good backup as I use too many things on the phone and some heavy apps. If you play a lot on this phone (or any other phone also), the battery will die faster. Internet browsing, facebook, whatsapp, games, etc do drain the battery, but there are certain apps which run in the background which also helps in draining the battery. The default security app scans the phone at times without your notice, but I'm not sure if that does too much damage. Otherwise, the battery backup is good. Lasts properly for a day and a half with heavy usage of the phone.\n\nDESIGN - The phone has a very beautiful and a minimal design, nothing unnecessary on the front or the back. The back panel is a little slippery, but it ain't a problem. The interface of this phone is simply amazing with a lot of customizing options, just love it.\n\nVOLUME/POWER BUTTON - A little sharp, but you'll get used to it. So far no cuts on my finger and it will not even cut your finger.\n\nSIM CARD SLOT - The pin to open the sim card slot was not provided with this phone. I had to use a paper clip for this. The slot does not open instantly once you insert the pin in the hole. I had to literally force the pin inside and was scared of damaging it, but it finally came out. Just be careful on this one.\n\nVerdict - Amazing phone, seriously no complaints. Go for it. If you do have complaints, then you're probably not using it right. Cheers!", "verification": {"CERTIFIED_BUYER": true}, "date": "27 May, 2015", "reviewer": "Rohit Choudhary"},
{"rating": 5, "title": "Worth more than the price", "review": "The Best in class. Fantastic user interface. Superb speed. Sleek look. Awesome battery back up. Fabulous display clarity. Smooth touch.\n\nOn the whole this is a very good product at affordable price beats all the other market leaders.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2015", "reviewer": "Siddartha Srinivasan"},
{"rating": 4, "title": "mi 4i", "review": "excellent phone. loving it. screen and camera is brilliant. solid value for money.build quality is good. the phone is very light and easy to manage the screen controls with one hand.ui is friendly and the phone is not cluttered with too many pre loaded apps.the battery life is excellent.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2015", "reviewer": "rahul sharma"},
{"rating": 4, "title": "Great phone for average use", "review": "Well it looks stunning, I got the pink one for my wife.\ngreat display and performance and built quality is amazing.\nBut its not made for heavy usage, I mean you get only 10.5 GB of available internal space and there is no memory expansion option and after downloading all the necessary apps and syncing contacts you get only 8 GB left.\nagain if you import say 2 BG music, 2 BG Videos and 3 GB Pictures(Old ones and click new ones) and you are left only 2 GB Space thats quite less as per my standards.\nCamera is awesome. Both rear and front. no complaints on that.\nMy wife is not a heavy user like I am. and she loved the colour and being a 5 inch screen its comfortable for one hand operation.\nMiui looks good with loads of themes available for download.\nand overall performance is good so far. \nBut lack of memory expansion is forcing me to give it 4 star.\nFlipkart delivered it before said date and packaging was good too.\nI am always satisfied with Flipkart services and this time its no different.\nIts a highly recommended phone if you are looking for an average usage as it has limited storage.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Oct, 2015", "reviewer": "Soumajit Chakraborty"},
{"rating": 4, "title": "Best buy of the season for this price range!!", "review": "Dear all, I have handled Mi 4i over two days. Let me explain in detail about the phone.\n\nPros:\n1. Very sharp display quality without any spike/lag\n2. Very slim and sturdy. Extremely light weight.\n3. Good camera both rear and front with added editing features\n4. Very good touch & light response. MIUI 6 awesome and super-fast.\n5. Fast browsing experience\n6. Clear audio\n7. Faster WiFi & network capturing\n8. Multiple key boards including Hindi, Bengali, Telugu and Tamil \n9. Got 4G download speeds upto 1.8 MBPS (Airtel Postpaid- Bangalore).\n\nCons: \n\n1. 10 GB free space for Apps only\n2. No gesture control\n3. Does not come with added accessories like earphones and scratch guard\n4. Battery lasted one day only on Wi-Fi (moderate usage).\n5. Low RAM availability (900MB-1GB max even after closing all apps) \n6. Not very sure if it comes with Gorilla Glass (doesn't seem like it though)\n\nMany people say it has heating issues. Well I tested the phone by playing \"Asphalt 8\" in full graphics. It does tend to heat up slightly after playing for an hour, but which phone wouldn't? It is certainly not an area of concern. Please update the MIUI version as soon as you receive the phone (800 MB download) and you will not get any heating problems.\n\nI expected better results from the battery, and wish it was available in 64 GB version. Other than that, even without the earphones and scratch-guard, this is definitely the best buy of this season at this price.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 May, 2015", "reviewer": "Shouvik Sarkar"},
{"rating": 1, "title": "Less of PROS and lot more of CONS mobile", "review": "Pros:\n1. Good display\n2. light weight \n\nCons : \n0. Unable to see the pictures, videos and music, need to download various related apps to listen music, photoes etc.,\nThey didn't provide any manual also...........\n1. Heats up a lot\n2. Only 9.5 GB Memory available after the update. U will be scared to install any apps in this.\n3. Camera not that great.\n4. Rigng volume is dead low.Even vibration mode is not effective.\n5. One can feel a electric shock around Camera area while charging(try to keep the charging phone on your cheeks, you can feel mild zerk)\n6. Week WIFI connectivity and some times it won't connect at all.\n7. Hangs now and then.\n8. The white back is prone to dirt and will be soiled soon.\n9. No proper back covers available in the market.\n10. Available Ram is below 500mb with minimum apps installed. No idea where the rest is consumed.\n11.Better carry a hair pin/or the one provided by company in your wallet,you may need it while changing the sim cards. \n12. No ear phones provided for a mobile of RS. 13000/- \nMore detailed review wil follow soon.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2015", "reviewer": "Chenna Veera Bhadra Rao"},
{"rating": 1, "title": "network problem", "review": "I have purchased Mi4i mobile from Flipkart on 15th May 2015, This Mobile\nlooking very nice. Camera, colour display so good. But it has main defects\nis network!!! I have purchase microsim for this.\nFirst day i have inserted the called to meny time working good outgoing\ncall. @ night i have full charged the mobile Kept it. Morning i sow the\nmobile its shows as No sim!!!\nits surprize to me, I have inserted micro sim called kept night morning it\nshows \"Insert sim\" sudden i have rebooted the devise & then i got able to\ndo outgoing calls & incoming call. But after 45 minutes (if no use the\nmobile) Same thing continuing \"insert sim\" Again i did selected Network\n\"3G\" Now phone not showing \"insert Sim\" but the main problem started\nhere!!!! I am not able get call form incoming. becaused called from other\nmobile its says *switched off!!!!!. I *missed lots of call. I checked the\nsim inserting in Samsung ( basic mobile) mobile it working good. checked\nwith Airtel people also ( service provider) they have also checked Network\n& sime working good.\nSo i had raised request for replace the Device (mobile) 4 time many times\nflipkart not able to contact me because of the phone network issue they\nhave agreed also!!. Yes! i am not able to get calls, i am missing so many\ncalls, suffering from this mobile. Request you to Please take this high\npriority replace the Mobile Mi4i\n\n\nBelow are the phone problems\n\n\n\n1. Sim slot not working ? No sim\n\n2. Network place also if called from other mobile it telling as Not\nreachable or Switched off\n\n3. Many times called from Other Mobile Mi4i will ringing after4 to 5\nrings.\n\n4. Calling to other Mobile Saved Contact Photo not able to view.\n\n5. Other Application open that time Mi4i become not reachable ( ex:\nSMSing using Watapp)\n\n6. Many times calling other mobile it will take 1 mints to give ring.\n\n7. Manny time Mi4i will become Not reachable/Switched off!!!.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jun, 2015", "reviewer": "Vasanth"},
{"rating": 2, "title": "Decent phone but heats up a lot", "review": "As usual great service by Flipkart, on time delivery.\n        I am using this phone from past 1 day now.  I was setting this up with usual stuff like accounts, wifi and sound etc, it started getting heated up.  Even 10 mins of subway surfer like games gets this phone to get heated up.  Otherwise phone is decent with miui v6, good camera etc.\n         I have mi3 which is pretty solid in this area.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2015", "reviewer": "Pradeep"},
{"rating": 1, "title": "Very Very Bad first Experience with Xioami Phone", "review": "I bought my first Xioami Phone , Some of my friends are already using Xioami and all of them have good feedbacks about the phone.\n\nAs soon as i unpacked the phone, I found that its touch keypad is not working properly Key \"S\" and Key \"Z\" are not getting pressed, The particular area of the screen is not recognizing the touch....\n\nI was very shocked with the build quality of Xioami Phones.\n\nFlipkart is sending a replacement I will get back with more reviews once I receive the replacement and use it for some days...", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2015", "reviewer": "Dinesh Gupta"},
{"rating": 4, "title": "Review  on MI 4i", "review": "First of all, This is my 3rd Mi mobile.\nConfiguration- Good- People say it is average as they compare it with high end mobile, Ofcourse you will get good config if you send more money\nHeating problem- Remember, Phone is a phone- it is neither a SLR camera nor XBox. Let expert do its work. there is no substitute for one another.\nWould you feel the same confort of the car in BMW bike of the same cost, not for sure the reason is both are meant for a different purpose. same is the case with phone. If you need 3 hour gaming and do not want your phone to heat then go buy XBOX :)\nBattery- no complaints- as they claim 40% in one hour- Thats pretty fair.\nMi Ui is awsum\nMicromax has long way to catch up with Mi, unless they come up with something innovative.\n\nall and all- very good mobile under this price band and definitely a good compition to Sony and samsung.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 May, 2015", "reviewer": "Tarik Sheth"},
{"rating": 1, "title": "very poor display strength...very fragile..its not gorilla", "review": "hi all...\nI seriously doubt that this phone has corning OGS glass... \ni bought a new Mi4i few days(40-45 days) back from flipkart...\nand now this mi 4i with gorilla glass got cracked by a little thumb pressure\nnow touch is not working....and service center told me that it cost rs 12000\n\nphone costing 12999\ndisplay costing 12000\n\nmy overall experience and review is very bad..plz dont get trapped.. don't buy.. this cheap, fake, Chinese company product..", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jun, 2015", "reviewer": "mudit agrawal"},
{"rating": 1, "title": "Please don't buy the phone on 7 May 2015 sale", "review": "Phone gets heated usually at the top of screen as well as on the back side.\n\nI read few reviews quoting about phone getting heated. \n\nEven after updating the phone (which took around 1 hour_internet speed dependent), the heating problem persists.\n\nThough the phone is packed with great features & ergonomic design, but this problem can't be overlooked.\n\nWould like to request all future buyers not to buy Mi 4i, until this problem gets officially addressed by Xiomi.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 May, 2015", "reviewer": "Nishant"},
{"rating": 5, "title": "My First MI mobile", "review": "It's just awesome...\nthey said it's a \"FLAGSHIP\" mobile...it's definitely true.\nonly con i prefer to say is heating issue. when a game app runs is background..mob is started to heat...other than that...this mobile is fantastic and lovely...\npros:\n>superb selfie cam(5mp) and 13mp jst awe me...\n>outer look \n>MIUI simply great\n>all the ETC...they said in specification...", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2015", "reviewer": "ganesh"},
{"rating": 1, "title": "FEELING CHEATED BY FLIPKART", "review": "For the first time i am feeling cheated by Flipkart.\nThe phone I got has several problems.\nFirst its sound output is very low.\nSecondly the phone gets heated very quickly. The battery drains very fast.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jun, 2015", "reviewer": "MANOJ MANJUL"},
{"rating": 5, "title": "Phone is absolutely ok after the update", "review": "I had ordered the phone in the first flash sale itself.Then after reading so many negative reviews i cancelled my phone and started hunting for a new phone.My options was SG S4, and iphone 5C and zenfone 2. \nMy requirements were-\n\n5 inch mobile.(Its the best for one hand operation)\nGood pixel density screen\nGood processor/Good graphics processor\nGood camera(Both primary and secondary)\n\nSet back for the SG S4 was the phone was very slow after the lollipop update and the battery charge was also affected drastically.Max you will get 7-8 hours which is not tolerable.Moreover this flagship model was released in 2013 and got 32 bit processor.I considered this because amazon was giving this phone for 16k.\n\nOpted out Iphone 5c 8gb because of very less storage space after the ios 8.3 up gradation.You will get only 3.5 gb user space.But there was no report of lags or whatsoever in this phone after updated to latest version.You can consider this one if are ok with limited 3.5gb user space and want to experience the ios.Cosk under 20K.\n\nZenfone 2 (2 gig) is the best competitor for Mi4i.Almost the same performance and screen quality but there are some bugs reported which makes phonecalls dropping/voice quality etc(This may be rectified soon with some OTA udpate).The camera is not as good as Mi4i.Intel processor are notorious for the power consumption.It can hardly last a day.\n\nEveryday i am spending some time to read the reviews of above said phones and i came to know that the major cons of the mi4i heating problem is resolved by an update from Xiaomi,so took a chance and brought it.\nIntial impression about this phone was very bad because the phone started to heat up when i kept it for charging and then i made a call to test its voice quality and it was heating like anything and you cannot put it on ears,that much heat.Then i updated the phone (860MB) and phone really cools down.Now i am not experiencing any heat while charging.But there is some amount of heat developing during call which is tolerable. So my advice is to the prospective buyers please update and use the phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 May, 2015", "reviewer": "Vishnu PS"},
{"rating": 5, "title": "MI 4I GETTING VERY HOT (NOT FOR SUUMER)", "review": "I HAVE  BUY 3 CELL (S1 , S2 & NOW 4IMI)\nBUT I AM NOT HAPPY WITH THIS CELL  THIS IS GETTING VERY HOT AFTER KEEPING IN BOX (IT WAS ON ) ITS BECOME VERY HOT IN 30 MINIUTS\n\n(I HAVE PAID RS 13000)FOR THIS HEATER ????????????", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2015", "reviewer": "pravin ghate"},
{"rating": 2, "title": "Overheating of phone when it is getting charged/Updating", "review": "I got the phone today though it is good to look there is problem of overheating when the phone is getting charged or updated.Really disappointed on seeing this just after opening box and charging the phone.Hope they fix this issue.Regret buying this phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2015", "reviewer": "vijay Bernard"},
{"rating": 5, "title": "After 2 replacement finally got a mi4i !", "review": "Finally got mi4i after 2 replacement.\n1st one had a display problem, i.e. the screen was elevated at the left side so the inside bright white coming out from that part.\n2nd issue was the device had a calibration issue, i.e. the mobile's compass was showing 30 degree instead of 0 degree when it is placed on ground. Tried to fix it but later come to know that it was a hardware issue. For this issue the screen was auto rotating every time and this is a big issue.\nFinally , flipkart agrees for a 2nd time replacement. And this time it is all ok.\nSo, when you buy a mi4i dont forget to check the following things:\n1. The LED screen is perfectly placed or not. ie, no light is leaking from the sides.\n2. The calibration of the phone. To check just tun your compass on and place the device    on ground level and see it is showing 0 degree or not, if its not showing replace it immediately.\n3. The camera quality. No doubt this phone has a brilliant camera but dont forget to test it as multiple complains are coming regarding faulty camera. To test just go outside of your workplace and click some pictures in normal daylight, try to capture some with full zoom, later check whether it is pixelating or not.\nThe above issues are coming nowadays so please check before you start using it.\n  I am giving the product a 5 star because it is the best phone in this budget(I got it in an exchange offer and it costs 8000) and I think everyone is aware of its pros and cons , so I am not mentioning the same. And dont forget to update MIUI7 and to do a factory reset !", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Nov, 2015", "reviewer": "Sandipan Patra"},
{"rating": 2, "title": "Do not buy it and perfect gift for your enemy", "review": "If we talk about the phone camera, interface, themes, user easiness, no lag etc then its an amazing phone in this segment. \nMain Problem\n1. Heating with minor multi use.\n2. Withe every system update you get camera lag issue or touch not working or phone hangs during call for 10-15 second\n3. major apps some function do not work, example- whatsapp voice notes do not work.\n\ni am amazed by the flipkart service though, they send a link to me by which i downloaded the app and by that app flipkart checked my phone and then eventually when they found issues they refunded me. Hatss Off service by flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2015", "reviewer": "Rajan Dhaka"},
{"rating": 1, "title": "Low Speaker Volume, So So Audio & No 3G Network Video calling.", "review": "Common a phone supports 4G and cannot fully support 3G?\nStrange wrong description, it calls for return.\nPhone does not supports 3G Fully, you cannot make direct 3G network video call.\nSpeaker volume is low.\nAudio quality is so so.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 May, 2015", "reviewer": "Ambika Prasad Tiwari"},
{"rating": 5, "title": "Its almost Perfect", "review": "I did a hell lot of research before finalizing Mi4i 32 GB. And eventually chose this one over Moto G gen 3. Just received it yesterday.\n\nJust read the below before you buy this one :\n\n1. There are no heating issues in this phone. The phone temperature is absolutely fine, trust me.\n2. The 872MB flash update to upgrade the MIUI version to 6.6.10.0 has algorithms which optimize the phone to perform well even with high profile gaming and I updated my phone today.\n3. The battery is a 3120maH one and it lasts easily ( literally speaking ) for about 1.5 days. It was at 75% when I slept and when I woke up, it was at 70%.\n4. The camera quality is like 8/10 with defined features.\n5. There's no app crash or lag issue on the screen. The 615 qualcomm processor gives you optimal performance. The UI is smooth and the HD display is superior.\n6. The phone speaker quality is great and enables clear voice transfer during calls.\nAll in all, there's nothing much you need to worry about, its a splendid phone with an affordable price tag.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Aug, 2015", "reviewer": "RAKESH.R"},
{"rating": 5, "title": "Worth every penny. at this price!", "review": "Final Verdict: Go for it !!!! \n\nFirst thought:\nI'm writing this review after using Mi4i for 2 days. After unboxing, the first thing that caught my attention were the build quality, ergonomic feel and light weightiness of the device. \n\nWhat a display: \nThe display is exceptionally good and smooth to touch. The colors and resolution is amazing at this price point. \n\nAlthough, i haven't tried any high performance games yet, there are no lags or performance failure. \n\n\nHeating??? Nah, just warming up for normal people like me!! \nFelt warm initially, but after updating the software (to MIUI 6.5.3.0), it hasn't felt any warmer than any other device people are using these days. If you put pressure on the processor, which smartphone would stay cool? Please don't ask for a BMW at the price of a Honda City. \n\n\nThe battery does hold up for a day and a half at normal usage. \nAll in all, i would recommend this phone to anyone thinking to go to the next step from below 10k devices. The device you're getting is worth every penny!", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2015", "reviewer": "Jignesh Parmar"},
{"rating": 3, "title": "Heating problem", "review": "The phone performance is very nice and good camera but there is a heating problem in this phone.\n\nQuality of the phone is good , its handy and good to use.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2015", "reviewer": "Akshay Nath"},
{"rating": 5, "title": "Superb Handset", "review": "Very Nice looking color with handsome features.with 13k range. Good user interface and performance is superb. Design wise also good.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Sep, 2015", "reviewer": "SANTOSH P"},
{"rating": 1, "title": "Don't Buy Mi 4i", "review": "I purchased Mi 4i from flipkart, which was delivered on 3rd may. I found following faults in the mobile:\n\n1. Voice distortion, call not properly audiable.\n2. It takes 10 hours for full charging, which is against promise of fast charging.\n3. Battery drains fast. Lasts in 8 hours with normal use.\n\nI requested flipkart for return but they outrightly refused. Feeling cheated. Please don't buy this mobile.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 May, 2015", "reviewer": "Harish Mehta"},
{"rating": 5, "title": "A 5\" dynamite with stunning display", "review": "I was using Windows phone (Lumia 720) for almost one and half years. Entering into Android platform with this awesome machine is truly an amazing experience. One'll get all the features of a flagship phone ( Be it Samsung, HTC or any other so called \"branded\" phone). Shedding extra bucks for \"brand\" is absolutely a waste and I was no exception to this brand phobia until my eyes were opened, thanks to my friends and colleagues who gave honest reviews about these line of phones they owned (Honor, MI, Asus among many)\n\nComing to the negative reviews that were posted here, I can only say- Please be mindful about the money you are spending for the specs given and also note that playing HD games is unfortunately not the function of a smart phone. You have different set of machines to do that. Please don't spoil the ratings (which can deceive a normal user's perception about this awesome phone)", "verification": {"CERTIFIED_BUYER": true}, "date": "9 May, 2015", "reviewer": "haricharan bapatla"},
{"rating": 5, "title": "The Beast....", "review": "I am giving reviews after one day use. & I am first time user of Xiaomi phone.\n\n1) Best phone in Rs.15000/-.\n2) Very very slim Phone.\n3) I want double tap to unlock feature and i got this feature in this phone.\n4) No heating issue till now.\n5) Screen is very crisp. Thanx to 441 ppi.\n6) Front camera is like mirror, i m gonna fan of its front camera.\n7) And Lots of features\n\nOnly one drawback which i noticed in this phone, Sound is not loud but its not very low.\nOther than i have noticed any negative point in this phone.\nMust buy phone...\n.\nI m giving 9 out of 10 score to this phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Aug, 2015", "reviewer": "Rajat Ahuja"},
{"rating": 5, "title": "Shame on you Flipkart", "review": "Few days back on 15 july i order this phone. the phone i received was heating so much that one can iron the clothes with that i contact flipkart they said update it... i do... \nthen the issue was not solved... last week i request for replacement nd flipkart rejected my request. I again try then after a lot of talk they replace the phone. Now the main twist... the replacement i got is a Mi4i in which the touch screen is not working... when i complaint they said call later... again i try they again assign a call for today i.e 6 august 15. The customer care disconnect the call nd message me tht they will call me tomorrow.... Flipkart Just passing the time so tht 30 days just fly away... nd i left with a damaged phone.\n\nI m very disappointed with this behaviour. I thought Flipkart is good. but i was completely wrong.. Recently purchased 4 phones from flipkart to gift my family... But now i will never recommend flipkart to anyone.\nShame on u flipkart.\nI dnt want to use that phone anymore.\nPlz refund my money.\n\nI am rating 5 star for the brilliant Idea of cheating the customers.\nBrilluiant job Flipkart for fooling customers.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Aug, 2015", "reviewer": "Anupam  gupta"},
{"rating": 1, "title": "The worst phone ever!", "review": "Please do not waste your money on buying this phone. The sound quality is pathetic. Even at the maximum sound, you would miss calls. Its that bad. \n\nI have been told by Flipkart that they cant be bothered, as Xiaomi is at fault. Its really a sad situation to be in.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jun, 2015", "reviewer": "Prabhu"},
{"rating": 3, "title": "Heating too much", "review": "I received Phone on 4th may. Faced Heating issues while setup.\n\nAlso it is mentioned in the specifications that User Memory is 12.77GB, but on my phone it is 9.6GB. I am not clear on this.\n\nOtherwise phone is worth the price.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2015", "reviewer": "Yatendra Vashistha"},
{"rating": 5, "title": "Amazing Phone - Recommended", "review": "Finally i got it.Yeah I Agree MI.Its Great Device.Super slim & Attractive Design.Premiuim look.I liked it a lot.I loved its Matte finish on back.Now i feel White will be awesome than other color varients.(Iam Black lover).Coming to software/Rom.Its Packed with Powerfull MIUI6.You will get update once you switch on your Device.I recommend to update it.It has more improvements.Camera is awesome.Both rear & Front.Watching video & Hearing Music is Great.I feel its better than My MI3.Multi tasking is fantastic on it.Almost 18 apps opend now.Tasking is great.It gives me huge difference compared to Mi3 & Others.Almost all are talking about Heating issue.Frankly i didnt get such issue.I used device for about 2 days.Even late night with 2g Data connection & Wifi.Used some social apps & 3 browsers continuesly.I got just normal heat.Iam not  gamer so i cant confirm it on games.My friends & My bro's 2 yr baby played some games like Candy crush,Subway surfer...Its fine.Battery backup is great on this device.\nFinal word: Its a great device. Fantastic specifications packed in it.Powerfull device.Just Buy it.\"RECOMMENDED\".", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2015", "reviewer": "SELVA KUMAR"},
{"rating": 3, "title": "good one", "review": "a v.good piece for this price tag, \nill give my ratings as follows out of 5..\nmodel/design:    4/5\nscreen:               4.5/5\ncamera:              3/5\nui:                       4/5\nbattery backup   :4/5\ncoming to ram it has 2 gb in which the whole 1 gb is used for pre installed apps well we can uninstall them tough.\nprocessor speed is good, well according to the price. we cant expect speed as compared to 2+ghz devices. \nfor the first time when i turned on the device got heated up within moments but after that its normal not much heating update the software there is a software available.\nam pretty disappointed when i opened the box no headset no otg cable, jus device and charger that's all very disappointing... my overall score for this device is 3/5. i would have given at-least 4.5 if other accessories were given.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2015", "reviewer": "Vishnu Vardhan"},
{"rating": 1, "title": "Heat Bomb", "review": "Going by the advertisement Mi4i is just a pathetic mobile phone in terms of Gaming & Camera usage.\n\nMobile is good for making calls...but battery is pathetic for user making more than 50 calls and using Whatsapp & Google Masps.\n\nIf u are a gamer then U jus did the greatest mistake of ur life by buying this mobile. As I played Need for Speed for 30 mins....it was unable for me to hold the mobile temp was 55 degree Celcius. Try dis *#*#4636#*#* and check for battery temp.\n\nI'm really fed up with this mobile...within less than a month, the mobile is hanging and heating up like anything. Plz Plz dont buy this phone. Moto G2 is the best option.\n\nDont go for this pathetic piece of shit...", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jun, 2015", "reviewer": "Abhisek Parida"},
{"rating": 4, "title": "A very fine product!!", "review": "i had a little bit of heating issues in the beginning... but then.. after updating the software... kinda reduced... performance wise it is totally awesome. \nWith internal memory of 32 gb .... pretty cool to store a good heap of data.\n TO KEEP IT SIMPLE...\n\n SLIM, SEXY, STYLISH,COMPACT AND A GREAT A CAMERA.\n\nHI5 for selfie freaks :P", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Aug, 2015", "reviewer": "Anurag Rajan"},
{"rating": 1, "title": "Hottest phone ever", "review": "Imagine a situation where u have a delicious dish in front of u but can't eat it even knowing that its going to taste awesome just because its too hot to eat..something similar had happened to me with this Mi4i..all specs performance was great..the display the camera the overall touch experience and the built quality with a slim design its really brilliant..overall it do seems a very expensive phone..also the battery life was really good with the fact that it has an octacore processor and a full hd display...And the miui over android gives a very much an iOS like experience which is also really great..but with so many great things and pros there is just one major cons which surpasses all pros is that the heating issue.. yes i can understand any smartphones do get heated up a lot when u do heavy tasks like gaming continuously for 15-20 mins but with very casual uses like doing Facebook and net browsing just for 2-3 mins if gets heated up that too so much that u can't even place the phone in our ears for taking calls and have to depend upon earphones or loud speakers , that is really intolerable even for a great phone like this..and i have been using the phone in an ac room..although xiaomi has given a few updates on miui which demands it solves this heating issues but believe me it doesn't do things any different at all..\nWhen I first reported this problem to Flipkart they did provide me a replacement but that new one had the same issues as well.. infact the new one along with the heating issues has various other small issues like light sensors not working, wifi was not working properly..so after that being really irritated i called Flipkart and this time I requested to give my refund as I had enough with this phone..and i must thanks to Flipkart's customer care guys who really helped me a lot and agreed to give my refund..so thumbs up to Flipkart's service which did provide my refund within less than 24hrs of making the request..\nBut  I really wish I could keep as I said within 13k its really impossible to get a phone as brilliant as this .. So finally i would recommend who ever planning to buy this purchase this only if u r leaving in a place where the temperature is at sub zero level :D", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jun, 2015", "reviewer": "Dibya"},
{"rating": 1, "title": "TOTAL  WASTE of MONEY.............. VERY IRRITATING", "review": "this is total waste of money.............. this phone is nothing but cheating with customers.\nI have bought this phone last week itself android apps are not working. over heating problem is there..... it become terribly hot when talk over the phone for just 10 or more minutes......\n\nNOTIFICATIONS ARE NOT GET ACTIVATED.......\n\nWHATSUP IS ALSO NOT GETTING CONNECTED WITH THE PHONE MEMORY......\n\nI AM VERY MUCH FRUSTRATED....... \n\n\n\nso my humble request is DONT BUY THIS PHONE.\n\nDON'T BUY THIS PHONE\nDON'T BUY THIS PHONE \nDON'T BUY THIS PHONE", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Jun, 2015", "reviewer": "Dhruv Kothari"},
{"rating": 1, "title": "HEATING HEATING HEATING!!", "review": "1. HEATING HEATING HEATING!!\nFirstly heats up during charging up to 40 degree  and browsing 42 degeree. Then Just try and change themes or browse internet for a while and your phone feels like its suffering from high fever and it goes up to 45 degrees . Then play games for a while and you can make water warm and milk if it is water proof. If you still want to push it, go ahead and try to make a call and stay on it for 20 min, you will have to get medication for ear burns!\n2. MIUI - A SPACE HOG\nAfter installing the latest updates i am left with only 10 GB of space. I have not installed any apps from play store than what came along with the phone. With no expandable memory this is quite an issue.\n3. LAG - SOMETIMES\nEven switching home screens lags sometimes. My old 512 mb ram powered android ics mobile was better when it was new in playing games of its time. Subway surfers starts lagging after just 15 min of gameplay. Now 2 GB of RAM and a 64 bit 2nd gen octacore and then lag, c'mon who are we kidding here!\n4. LOW VOLUME ON EXTERNAL SPEAKER\nGo to a noisy indian market and i assure you that you will miss a call coz you could not hear it.\n5. 13 MP BACK CAMERA - produces blurry images in moderate lighting. Its good in very bright lighting though. \nBottom line: I could have bought a yureka (almost same specs but larger screen) for a far lesser price, but since i wanted a screen not more than 5 inch, i bought this. I don't mind spending extra money but do not want heat generating hand warmer. I live in south india, NOT kashmir.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 May, 2015", "reviewer": "manjureddy patil"},
{"rating": 2, "title": "Review After replacement, please update to solve HEATING ISSUE.", "review": "Flipkart has replaced my phone. After replacement n update it is working fine(nominal heating i.e. 42 C on gaming). Some lags are there while gaming on balanced mode. Can play full HD without lags. \n\nNominal heating is expected by octa-core fanless processer while processing demanding applications. \n\nI got this mobile in its first flash sale. A review after 1 week usage \n1. Display is very crisp n clear.\n2. Camera is good in good lightening conditions.\n3. Call quality is good though earpiece needs little more volume.\n4. Battery has heating issues while charging, sometimes for no reasons, on gaming also. Here heating means heating above a normal threshold. \n5. Compact design and sleek phone. \n6. Lollipop is good and performance is also good. \n\nThis is my first Xiomi and I am disappointed.\nReviewer please do give honest reviews about a product. \n\nI have asked for return lets see if Flipkart processes is or not.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 May, 2015", "reviewer": "DHRUV KUMAR SHAKYAWAR"}
]