[
{"rating": 1, "title": "Biggest mistake of my life!", "review": "Need adaptor to do everything", "verification": {}, "date": "17 Dec, 2016", "reviewer": "shubh mehta"},
{"rating": 5, "title": "Pricey, but worth it.", "review": "You may not get the specs that you will be able to get with a PC, but in the laptop world I don't think you could get something as classy and optimised as the MCP, surely there a tons of people who miss the traditional USB ports (including me), but us techies knew this day would come. \nOn the bright side, since Apple has done this industry 1st port deletion, Samsung,Dell,Lenovo,HP,etc have followed the trend and started including USB-C in their higher end laptops, comparable in price as the new MacBook Pro. \nIt's going to be a bit tough in the start but I'd recommend investing in a good AiO type of dongle which includes all the ports we need. \nThat's the biggest problem you'll face with this laptop. \nThat aside, it's a powerhouse and is Mac users will love it. \nTo get an even more comprehensive and accurate review please check out, MKBHD, Casey neistat, Austin Evans or Jonathon Morrison on YouTube. (They also have recommend some good dongles)\nI'd recommend this over a hp spectre or an XPS-13. \nBy no means is this a gaming laptop and at best you should only stick to content creation on this.  \n\n\nOverall: \nPros: IO is much faster, SSD used is crazy fast, final cut render times have dropped, touch bar may prove to be useful in sometime. \n\nCons: super expensive in India. Port deletion will be a hassle for 95% users for a minimum of 1 year. \n\nVerdict: if you're looking for a solid build laptop which is future proof and you create content, look no further. Worth the upgrade if you're coming from a pre-retina MCP (2012 or older) or a premium-ish windows.", "verification": {}, "date": "11 Jan, 2017", "reviewer": "MAHIN Doshi"},
{"rating": 4, "title": "Value-for-money", "review": "everything is fine but no backlight", "verification": {}, "date": "17 Feb, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "good but type c port is killing the fun", "review": "we need adaptor for every thing we cant connect usb type 2.1", "verification": {}, "date": "24 Feb, 2017", "reviewer": "dhruv madaan"},
{"rating": 1, "title": "Not worth it", "review": "Buy other laptop", "verification": {}, "date": "28 Dec, 2016", "reviewer": "Akshay  Kumar"}
]