[
{"rating": 5, "title": "Best in the market!", "review": "Superb phone\nAwesome\nFast delivery\nThanks apple and flip kart", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jun, 2017", "reviewer": "Salman fariz"},
{"rating": 5, "title": "A Reliable phone !", "review": "If you are good to control your greed towards iPhone 7, this is the best phone to have.\n2 GB RAM and 32 GB ROM is a deadly combination at this price range.\nFlawless design and material.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Feb, 2017", "reviewer": "Kaushik Ghosh"},
{"rating": 5, "title": "My Experience", "review": "Update after Seven days of Usage: \n-Received in a good package\n-The manufacturing date was recent . \n- The phone is Good, No issues with it. \n- battery life can be Compared to Androids 3300 mAh battery phones\n-A beast in terms of performance.\n- I would not say anything super exciting but Good Camera Performance. The camera has an awesome shutter speed which is good for clicking pics of Notes very fast.. lol, thus it servers my Purpose \n- Excellent Voice assistant Siri.\nCons \n- Not recommended for Heavy Multimedia lovers, they can Go for for 6s plus, as 6s screen is a bit small. \n- Certain small tweaks are absent which were important. For eg Call recording and Vibration alert when the call is connected so u have to stick it to your ears.\n-No fast charging.\n-Can't access all the files.\nAs an Android user I could store any type of file on my phone. .rar .zip .exe any format of file could me stored and accessed when ever needed. \nBut on an I phone u can Store and Access only Pics Mp3s Videos Pdfs and other .doc files. Other than that u can't access all other file types from files from a file manger. \n- Has an Higher level of SAR as compared to other smart phones.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jun, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "iphone not working big disappointment", "review": "I opened the piece and installed the sim.   The apple logo isnt appearing.  neither is the phone charging.  i am terribly disappointed.  my hard earned money down the drain.  please replace my piece.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "No 1 as always!!!!", "review": "As always.. apple will be apple in terms of class and products.. loving it..", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Apr, 2017", "reviewer": "Saurav Kumar Singh "},
{"rating": 1, "title": "Bekar hai", "review": "It's so hitting when I do charging and calls.\nI will do FIR for iPhone companies and sellers who sale to Flipcart.\nWait and watch.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Master piece", "review": "Iphone 6s is one of the finest products from Apple and phone is just flawless and thanks to Flipkart for prompt delivery.\n\nI was shocked by seeing the dead iPhone in the box,tried to switch it on but....!!!\nThen plugged it on and eventually it started and i am loving it.... :)\n\nYou will never go wrong with Apple.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 May, 2017", "reviewer": "MR NARAYAN PARAJULI"},
{"rating": 5, "title": "Great product", "review": "I was a bit skeptical before ordering an iphone online because i have seen many negative reviews about people getting damaged products or fake products. So i sent a mail as a pre-order enquiry to Flipkart. They have assured me that i will be receiving a genuine product. So i just ordered an iphone 6s 32gb and i received it today. I request buyers to make a video while unboxing the product so that they would have a proof if the product turns out to be fake. I got an original product from Flipkart and im thankful to them for that and for making it available at such a low price compared to retail market.\n\nNow coming to the phone itself, what can i say.... its an iphone after all l. No company can match apple's build quality and after sales support.\nEverything is great about this mini beast. The one thing that attracted me towards this phone is its form factor. It feels great in hand.\nCamera is great.... ram management is superb..... display is comparable to other Android flagships but will not match amoled screens..... the storage u get out of the box is around 22gb so keep that in mind.... havent installed any high end games yet but im sure that it can run any game smoothly as i have seen in all the reviews.\nSwitching from Android to ios is a bit of a hassle. I have been an Android user for the past 4 years and i think that if u want ios like optimization then only Google's nexus and currently pixel devices offer that. But i didnt get a pixel because the after sales service is poor. Hopefully the next pixel comes with collaboration of LG rather than HTC.\n\nIn this price range there are only 2 good devices and they are oneplus 5 and iphone 6s.\nIf u want a larger screen then go for oneplus5 or else i would recommend iphone 6s... it is a great device overall and im loving every bit of using it.\n\nJust go for it u won't regret ur choice!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Jun, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "iPhone 6s 32", "review": "Product is awesome!! But if u hv more money then go for 64 gb", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Feb, 2017", "reviewer": "Priyank  Jain"},
{"rating": 5, "title": "One Word Awesomeness", "review": "One word Awesomeness at the peak.Genuine review after using 5 days.\n\nAs I am a hardcore Android user , senior member in xda,iPhone rocks over Android.No lagging at all while my Nexus 6 worked like a hell even in 3GB ram.\nGot the iOS 10.2 update and phone runs buttersmooth.Installed 50 heavy apps and run all and all runs smoothly even Asphalt 8 and moder combat runs simultaneously without any problems.\n\nBut little bit restrictions are there but I am happy with iPhone", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Dec, 2016", "reviewer": "Bibhuranjan Bihari"},
{"rating": 5, "title": "Iphone 6s review", "review": "I bought Iphone 6s 32GB from flipkart, This is first time I'm purchasing a product online, I was little scared if i will receive a duplicate product. I was very happy to see that i received a genuine product. Thanks to Flipkart for ensuring the product delivered is genuine. I have been using it for 15days now. I'm very happy with the quality of the product.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 May, 2017", "reviewer": "santosh A"},
{"rating": 5, "title": "Worth it", "review": "Was very afraid to buy online , cuz iphones are on the top to be decocted ( jhol ). Many sellers send used , clones , copy , or change accessories from the box. \nBut cause it was flipkart and as per my experience i trusted it . And yes it was all worth it . \nDont worry for frauds , the delivery guy was too very friendly and co-operative, i asked him to pay after i open and check the product , he denied but said rather u can just shoot a video for ur assurance and as a proof and if anything goes wrong ill stand besides you. \nLuckily evrything was fine the product and accessories were 101% genuine . \nPacking was good , its been months and still no heating issue no battery prblm no screen/display issue , speaker and evrythng works as good as it should. Very happy with Apple and Flipkart . \nGo for it . \n\nAbout the product : \n\nIf u are looking for an upgrade from iphone 5s or 6 \nThis is the phone for u \nIts almost close to iphone 7 \nDont go for iphone 7 rather save money and buy 6s its worth it \n2 Gb ram in an iphone is like 6 GB ram in android. \nIphone 7 and iphone 6s specs are almost same . \nCamera quality is just upto the mark \nClicking pictures in 12mp was never so better. Gives so rich look to ur pictures \n4K video recording is also good \nOnly thing that lacks is optimal image stablization. \nSo if u are running while recording a video it may not be stable and may give u blurr or low iso pictures ! \nBut anyone who is confused between buying an iphone 6s what are u waiting for ? \nGo for it . \nBest phone u can have even after its 3 years of releasing.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Feb, 2018", "reviewer": "Anurag Bhoir"},
{"rating": 4, "title": "Works like a charm :)", "review": "Well After reading many negative and positive reviews I finally decided to buy this phone.\nGot this phone for 32000k from the sale\nWas bit worried about receiving defective phone instead \nBut using it for more than 3 days and working fine till now :)\nJust go for it \nOr wait for any sale to come..\nNo heating issues\nBattery is decent as it last a full day in light usage \nAnd 4 to 5 hours in heavy usage\n\nFew things should kept in mind while buying this product from online\nAfter product gets deliver make a video of unboxing and check almost everything like speakers, mic, accessories etc etc\nThis can be kept as proof if any defective product is being delivered\n\nFor me it was excellent \nThe delivery timing was good got this in a day\nPackaging was also good\n\nAnd iphone is an iphone", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2017", "reviewer": "Purab Pandey"},
{"rating": 1, "title": "Iphone ordered", "review": "Please dont rely on fliplart ever. This is the worst ecommerce website you will ever come across. No responsibilitu after delivery", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Good experience", "review": "Received phone in good package. Honestly at first I was fearing that I may stuck in fraud. But trust me you can confidently buy iPhone from here. I had some problems at delivery because delivery men thought that someone is joking as I stay in hostel. But I received my product from the office. I am happy with the phone. It is my first phone. Just go for it ..", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Just wow!", "review": "What to expect.. \nApple+Flipkart = Smile on Customer's face..  :)", "verification": {"CERTIFIED_BUYER": true}, "date": "24 May, 2017", "reviewer": "Vishal Rupani"},
{"rating": 5, "title": "A must buy phone in budget", "review": "I am writing this review after 2 days of my purchase.. I got this phone in Big Billion Day and surprisingly Flipkart delivered this to me in just 1 day.... Phone is just awesome and m luving it.. Did I mention that I got it in just 29999.. Thanku Flipkart!", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "Vivek Gupta"},
{"rating": 1, "title": "Flipkart service and support", "review": "Product is good however delivery service and Flipkart help desk support is very very bad , I must say 3rd class .", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Apple Best", "review": "Best phone", "verification": {"CERTIFIED_BUYER": true}, "date": "13 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Not recommended at all", "review": "the phone automatically switched off and not on again the product was not good .It happened within 13 days of my usage .the executive told me to wist service centre.simply a garbage piece deliverd to me...... now a new issue came with the iphone ...the care repiled that the internal parts of the phone is already changed and rejected the phone without repair and cancelled the warranty..such a nice technique to make fool flipcart and the consequences will not good flipcart", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Still one of the greatest phone by Apple.", "review": "First of all, great service by Flipkart for delivering it in just one day. Well the iphone 6s is a remarkable smartphone by apple. Was introduced in 2015 but still outperforms many flagships of this year too.\nNow coming to Pros:\n1. Performance: No lag at all. Use any application and it just flows easily.\n2. IOS: Sweet, simple and intuitive. Great animations and great user interface.\n3. Camera: Iphone is still one of the fastest pic capturing camera in any light. Flawless pics in any light source.\n\nNow coming to some cons:\n1. Less functionalities: IOS has some user restrictions like no external downloading from internet. Still some apps can be used. Music can be downloaded via wynk music or savnn but can't be just added from computer. You got to use itunes for that which is a bit lenghty process.\n2.Battery: Some might say battery life of iphone is very less but for my use it is just enough for the day.\n3.Other features like Dual sim and microsd slot are missing.\nOverall a great phone to buy if you have to use for a year or more and you are ok with one sim only.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Oct, 2017", "reviewer": "Vijayant Malik"},
{"rating": 5, "title": "Terrible product", "review": "You guys are cheater... \nno cost emi still you are charging 3000 se extra on my total bill.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Apple is the best as always!", "review": "Fast and efficient delivery of the product, all thanks to Flipkart's awesome services! I ordered it a day before and received it the very nexy day. The person who delivered the phone was extremely professional and did a very good job. \nThank you Flipkart! You rock!", "verification": {"CERTIFIED_BUYER": true}, "date": "15 May, 2017", "reviewer": "Nikhil Gadi"},
{"rating": 3, "title": "Decent product", "review": "Good product but the date behind the box of my iphone 6s was january.It is not a problem.First of all the battery is very weak and if you are heavy user you will not be satisfied with this phone.The display is good with 3d touch.The touch id is very very fast.Perfomance is also very good and I repeat if you are a heavy user you will not be satisfied with iphone 6s.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jul, 2017", "reviewer": "Anshad Ellias"},
{"rating": 1, "title": "Unsatisfactory", "review": "I recently got iPhone 6s but its not switching on neither phone is charging....Even though I plugged in the charger for more than 2 hours...", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Defective product received - I phone 6s", "review": "I have received Defective product, Phone mic and speaker is not working, Phone making \"cut cut\" noise while phone vibrating.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 May, 2017", "reviewer": "Rajeev Shukla"},
{"rating": 5, "title": "Delivered Genuine Device", "review": "Delivered device 1 day earlier than expected delivery time line. Great work by team flipkart. Product is genuine as I gone through Apple website and checked the serial number of my iPhone.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Oct, 2017", "reviewer": "ajay kakde"},
{"rating": 1, "title": "bekar", "review": "There is a totally useless phone. The screen does not work properly I have been bought only for 15 days.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Oct, 2017", "reviewer": "SUMANT KUMAR"},
{"rating": 1, "title": "Waste of money!", "review": "I got an defective iphone 6s", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific purchase", "review": "Good piece", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Pretty good", "review": "Really appreciate flipkart at this time on their delivery..!\niPhone.. Always proving it's independent.\nOverall I it's really good.!!", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Mar, 2017", "reviewer": "Giri Tharan"},
{"rating": 5, "title": "Terrific", "review": "Nice", "verification": {}, "date": "4 Jan, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Classy product", "review": "iPhone 6s \nBattery awesome it lasts 1.5 days under normal usage.. 1 full day under heavy usage... \nOther things are pretty\nTouch , display, look performance, charging time, everything is good.. BUT \nCamera not satisfied fully... Under low lights it sucks.. esp front camera..  It would be fine if potrait mode is added in the next update.. like Google camera.. \n\nSame way kindly drop iPhone X price to 60k. How long I can use this...!!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Classy product", "review": "flipkart service is always awesome m loving with this iphone\nflipkart sell geninune products at geniune cost and very best products compare to other e-commerce website :)", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Sep, 2017", "reviewer": "Raaj Kumar"},
{"rating": 2, "title": "Slightly disappointed", "review": "Nice", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Apr, 2017", "reviewer": "Kapil Sharma"},
{"rating": 1, "title": "Value-for-money", "review": "Nice phone 📱 but to much problems in I phone 6s Flipkat done worst job my money goes to hell Flipkat is a sit..", "verification": {"CERTIFIED_BUYER": true}, "date": "22 May, 2017", "reviewer": "Mohammed Kaish"},
{"rating": 1, "title": "Bad experience with the Vendor and Delivery partner", "review": "Today i Have cancelled the order because while our honorable Prime Minister is promoting and empowering Digital India, Flipkart is entertaining Delivery partners who doesn't even have card swipe machine. \nIts true that i ordered cash on delivery , but as the amount was 34k, I had expected that these people will have card machine. The card on delivery option is not present .\nSecondly none of the customer care executive including floor supervisor helped me in any way , rather talked in an bad manner . I thought it would be good experience to  buy but was proved wrong . Thanks Flipkart for not helping\n\nDon't buy from Supercom seller or if your delivery partner is Ecom , only buy if its WS retail.", "verification": {}, "date": "18 May, 2017", "reviewer": "Pratik  Sanghvi"},
{"rating": 4, "title": "iPhone 6s", "review": "The product was good but I m disappointed with the seller as the price was decreased to 4K just after I had ordered online( I had bought the phone during the apple day when discount was been offered) .... wish I had received the product with the discounted amount, I would have been very happy", "verification": {"CERTIFIED_BUYER": true}, "date": "12 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "No need of review", "review": "It is an original product from Apple itself which I think don't need any descrption and review.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Apr, 2017", "reviewer": "Suvesh  Singh"},
{"rating": 5, "title": "awesome offer and awesome phone", "review": "this is an amazing phone and with an exchange offer flipkart provides this phone in a very cheap price. thank you flipkart for this exchange office, love you guys, you are only market king in india for e@market store, and always comes up with amazing offers. \n\niphone 6s 32GB, \n\nbattery backup awesome\ncamera awesome with live photos,\nfeatures awesome.\n\n*note the person who say that the battery is not working good ,nd bla bla, guys go and first learn how to operate an Iphone, frome flipkart i bought 2 iphones, one is 5s and 6s 32, and till now there is no problem with battery.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2016", "reviewer": "Abhishek Rajvansh Rai"},
{"rating": 5, "title": "Great phone", "review": "I had ordered the product on 1st june and recieved it on 3rd june. The delivery was awesome.. the delivery boy was really a good person... i loved the phone but the only problem i faced is the front camera wasn't working after 4 hours of delivery. At last i sent the phone to the service provider of apple and after nearly one month i had got my iphone 6s with the grace of allah...whatever the experience was awesome. The phone is pretty cool specially the colour. Camera is good. Performance is excellant. Battery is ok... and at last but not least thanks to flipkart and the whole team...", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jul, 2017", "reviewer": "Latifur Rahman"},
{"rating": 5, "title": "Awsome", "review": "Must say i had my doubts ordering apple phone  online seeing few reviews, but\nPhone was delivered  ontime on same day. Genuine product , manufactured in feb.  Thanks to seller\n\nMust say loving it didn't want to bet that amount of money on Samsung or alternatives. Build quality is amazing . Battery Lasts me easily throughout the day and camera is the best you get in this range. A must buy at this price", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2017", "reviewer": "sachin kaundal"},
{"rating": 3, "title": "Average Phone with hang issue on high price..", "review": "Hallo All, I have bought this phone from Flipkart with a big hope and making a royal image that I am buying Apple IPhone 6s. I am a first user. Delivery from Flipkart is good. Few points I want to clear here -\n\n1. Battery back is average. Not good. It's 1750mah battery.\n\n2. I am feeling now that my phone is being hang some times after 15 days use. Going to Apple service care to meet them.\n\n3. It's head phone is malfunctioning some time. Have to visit for that also.\n\n4. Being a first user of IPhone, was having a big brand and quality image. But this is average, some time I feel that I have spent much more for apple, I can buy some other good Android phones in half of its current price.\n\n5. Some software issue also, about transfering the pics from IPhone to my laptop.\n\nSummary - average phone with a big brand name.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jun, 2017", "reviewer": "DEVENDRA RAI"},
{"rating": 5, "title": "Super!", "review": "Happy to flipkart customer support specially Mr Manoj from fripkart grivience team who helps me slot regarding the replacement of the product. I purchased an iPhone 6s on 23 march but i got iPhone 6 instead of 6s whose touch is not working and finally after 2 unsuccessful attempt of replacement i got my genuine product today. I am so happy.....\nThanks flipkart team.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Apr, 2017", "reviewer": "Vaibhav Raj  Kukreja"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Got it for 29400 rs in Big billion day sale  absolutely worth it and thanks to flipkart for faster delivery", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "Nishant Nagar"},
{"rating": 4, "title": "Very Good", "review": "It's a good experience with iOS but some it hurts when come to battery life", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Best in its class", "review": "A smooth phone combined with many other features which make this stand against other phones in this category ....", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Apr, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent product", "review": "Good product and delivered on time.. really liked it and I would recommend.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Superb Product", "review": "Awesome product,reached home in complete packaging,no defect,used for 4 months and highly recommended", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Mar, 2018", "reviewer": "Aswin K Menon"},
{"rating": 1, "title": "Useless product", "review": "Not satisfied with product as phone increase volume button is not working. Go through the customer care but unable to find proper solution. Need replacement as product having problem.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific purchase", "review": "amazing fast delivery superb phone 100% original product\nthanks to flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Feb, 2018", "reviewer": "Thomas  Minj"},
{"rating": 4, "title": "iPhone 6s summery", "review": "1 camera is fantastic.\n2 Battery is average \n3 Touch is very sensitive\n4 Overall good , but price is high", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Feb, 2018", "reviewer": "Rudra  Mishra"},
{"rating": 4, "title": "Delightful", "review": "Gud", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Pretty good", "review": "Its superb", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jan, 2018", "reviewer": "Supriya Meher"},
{"rating": 5, "title": "Go ahead", "review": "Nice shipping, nice phone, everything is perfect.... thanks Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jan, 2018", "reviewer": "SANTOSH  DESHMUKH "},
{"rating": 5, "title": "Mind-blowing purchase", "review": "After one month of use I am writing this feed back.\nEverything is good in iPhone6s.\nBut the speaker has some sound issue.\n\nPlease suggest what to do ??", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jan, 2018", "reviewer": "Dillip Lenka"},
{"rating": 5, "title": "Best one of all, but power bank is recommended", "review": "Nice mobile but better if we have a long lasting battery \nBut charging time is also very fast \nIn 1 hr it nearly charges from 0 to 85%", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Dec, 2017", "reviewer": "phani chandra"},
{"rating": 5, "title": "Terrific purchase", "review": "love it this iPhone", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Dec, 2017", "reviewer": "deepak rajak"},
{"rating": 5, "title": "Perfect product!", "review": "An iPhone does not require a review. The name itself stands for quality. The price put for it is totally justified. Have been using it for last two weeks and totally satisfied with it has to offer. Health readings are extremly accurate.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Dec, 2017", "reviewer": "Naveen Tikeriha"},
{"rating": 5, "title": "Flipkart Rocks so as Apple Products", "review": "I have purchased iPhone 6s space grey (32GB) and the product was delivered on time. Checked the warranty details on Apple website and it was intact. Always loved the products from Apple.....no complaints so far......thanks Flipkart!!!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2017", "reviewer": "Praveen Kumar"},
{"rating": 5, "title": "Must buy!!!", "review": "Totally Awesome product", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Dec, 2017", "reviewer": "Navi Sparrow"},
{"rating": 5, "title": "Excellent", "review": "100% genuine product. Brand new of very recently manufactured. I wasnt  very sure about Flipkart but they delivered excellently and to my surprise very quickly within two days", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Dec, 2017", "reviewer": "Lwmsao Brahma"},
{"rating": 4, "title": "Good quality product", "review": "I rate it 4 because flipkart has harassed me alot for delivery...after lot of patience and fight with flipkart teamit was finally delivered to me....Product is awsomee...dream purchase...m using it for 2 months now...works very smoothly...loving it...", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2017", "reviewer": "SWAPNIL BHOSALE"},
{"rating": 5, "title": "Brilliant", "review": "Good product for the price..", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2017", "reviewer": "Dip Garai"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Classic peace from 🍎", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Dec, 2017", "reviewer": "Vishnu vardhan Medempudi"},
{"rating": 5, "title": "Classy product", "review": "For student this self earning device is mind blowing. Purchased it on June 2017, still havenot face anykind of problem. The best part id headphone jack is there :)   flipcart also have good service. Thanks", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Nov, 2017", "reviewer": "Shubham Kar"},
{"rating": 5, "title": "I got this phone for 27200", "review": "Nice phone working fine thanks to flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Nov, 2017", "reviewer": "nandieswara rao"},
{"rating": 5, "title": "Review On My Latest Brand New Iphone6s", "review": "Delivered my order in time as given with good packing\nI take this opportunity to thank flipkart for being discount for iphone 6s about 8,000 compaired from store.\n\nInitially i was scared to order on flipkart regarding product geniue but my opinion was wrong product iphone 6s was brand new iphone. Thanks to flipkart again.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Nov, 2017", "reviewer": "Prashanth Kumar Vaddepally "},
{"rating": 5, "title": "Steal Deal :)", "review": "Got it for 29.5K after applying all the offers. I had been waiting on price cut for many months and comparing prices across different websites and retailers. Flipkart offered the least possible price during Dashera sale. As far as delivery and quality of product is concerned, no complaints. Have been using it for 2 months now.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Nov, 2017", "reviewer": "Sameer Kaushike"},
{"rating": 1, "title": "Horrible", "review": "CONS: Receiver sound is having issues.\nIt creates a noise while attending a call. \nWhen contacted to apple support the asked to show it in apple service center. It is very disappointing to see such issues with Apple product as well as after paying a lot of money.\n\nPROS:\nDelivery of product was very fast.\nPrice and performance is pretty descent.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Oct, 2017", "reviewer": "Abhijit Jadhav"},
{"rating": 1, "title": "Either refund money or replace it with brand new", "review": "You guy have delivered a second hand product instead of brand new and it's not at all working plus your team is also not responding.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Pretty good", "review": "nice product from apple and flipkart....good job. flipkart but 10 days replacment policy is feak....!after mob deliverd return option are hide ...\nplz remove the policy from sit..becz they not give u replacment...\nand flipkart provide refublish apple mob \nin low price....\nif u have new brand mob then purchase from apple store", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Sep, 2017", "reviewer": "Mahesh Tambe"},
{"rating": 1, "title": "Horrible", "review": "i wanted to change the shipping address but didn't git any help from flipkart.Why there is system generated query solution process,why there is no physical person by whom the queries can be solved.To all my queries I have only received system generated answers via mail.Highly Disappointing", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Sep, 2017", "reviewer": "Nitu  Yadav"},
{"rating": 5, "title": "Good", "review": "Good", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "iPhone 6S 32, perfect", "review": "I bought a iPhone 6S 32 GB during the sale period for 30999, the phone has been delivered the next day.\n\nI had a doubt that the phone might not be a original, but to my surprise, the phone is awesome and perfect. I have even confirmed the warranty coverage in the apple website and found everything is perfect.\n\nThank you Flipkart, you made my week.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Sep, 2017", "reviewer": "Harinivas A"},
{"rating": 2, "title": "Not good", "review": "IS  BED", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "Mallesh Ca"},
{"rating": 5, "title": "Super!", "review": "Awesome product\nBattery lasts 9 to 4", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Sep, 2017", "reviewer": "Vipin Aggarwal"},
{"rating": 5, "title": "Best phone I have used", "review": "This is an amazing product. The camera is awesome specially the autofocus. Delivery was on time", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Sep, 2017", "reviewer": "Sagar Roy"},
{"rating": 5, "title": "Awesome Buy", "review": "Really nice product, almost used for 6 months without any issues. Really loved the purchase.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Worth every penny", "review": "It has a headphone jack enough said, the only apple device worth buying", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Sep, 2017", "reviewer": "Faizan Ali Khan"},
{"rating": 5, "title": "Perfect product!", "review": "Best phone i have ever used . iphone 6s is the best phone . buy on flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Sep, 2017", "reviewer": "Sunay Patel"},
{"rating": 5, "title": "Brilliant", "review": "The product is good and the cherry on the cake was early delivery. 5* product.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Sep, 2017", "reviewer": "Anurag Sethi"},
{"rating": 5, "title": "Amazing product", "review": "I was a bit apprehensive about getting a phone online as I have many stories of damaged products being delivered. It turned out that there was no reason to be doubtful and delivery was very quick and reliable. \n\nAbout the phone:\nThe processor is good, the phone is fast, can operate efficiently with multiple tabs open and the camera is excellent. I was an avid Android user till then but switching to iOS was very simple and GUI is amazing.\nI would recommend getting it with higher memory though as 32GB is just not sufficient.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Sep, 2017", "reviewer": "Akshay  Ramaswamy"},
{"rating": 2, "title": "Could be way better", "review": "The phone speaker was.very defective. Have given for servicing since last 5 days.  If you guys can help that would be great", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Aug, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Pretty good", "review": "I am loving it. Delivered before the date. Front camera and back cameras are awesome. Superb pics are coming out of it. The only issue is the battery. It drains even when I use my phone even in offline. Thank you Flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Aug, 2017", "reviewer": "Narahari Pasupulati"},
{"rating": 5, "title": "Must buy!", "review": "Very good product", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Jun, 2017", "reviewer": "rajesh"},
{"rating": 5, "title": "Terrific purchase", "review": "Best phone ever....", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jun, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "Very good mobile, smoothness everywhere but do have some heat Problem when using wifi.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Jun, 2017", "reviewer": "Natarajan"},
{"rating": 5, "title": "iPhone 6s", "review": "Product is original and good working in condition and again thanks to flipkart for early delivery.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 May, 2017", "reviewer": "Manmohan Singh"},
{"rating": 5, "title": "Brilliant", "review": "This is my first iphone. Still Learning tricks of it. But overall till now I think I will recommend the phone to everyone who wants to have iphone.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 May, 2017", "reviewer": "Ashutosh Shrivastava"},
{"rating": 4, "title": "Value-for-money", "review": "Amazing phone, battery backup is good. All accessories are ok. Thanks.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "What a surprise", "review": "Wonderful service by flipkart I received the product today, 4 days earlier from DOD. It is a nice surprise. Thank you", "verification": {"CERTIFIED_BUYER": true}, "date": "18 May, 2017", "reviewer": "Makarand A"},
{"rating": 5, "title": "Excellent", "review": "Came on time and amazing product, 5 STARS", "verification": {"CERTIFIED_BUYER": true}, "date": "18 May, 2017", "reviewer": "Devidas Jharbade"},
{"rating": 5, "title": "Apple iPhone 6s", "review": "Amazing , no lag, ease of use and comfortable to use.. \niOS makes the difference, \nrecommended!", "verification": {"CERTIFIED_BUYER": true}, "date": "16 May, 2017", "reviewer": "Chethana Kishore"},
{"rating": 5, "title": "Simply awesome", "review": "Fantastic Mobile and user friendly...", "verification": {"CERTIFIED_BUYER": true}, "date": "15 May, 2017", "reviewer": "Nagarjuna Reddy"},
{"rating": 5, "title": "About 6s", "review": "Nice phone iPhone 6s", "verification": {"CERTIFIED_BUYER": true}, "date": "15 May, 2017", "reviewer": "Aamir Sohail"},
{"rating": 5, "title": "love it", "review": "on time delivery and handset in perfect condition.clear finish and super duper perfomace.\n\n\nLOVE IT", "verification": {"CERTIFIED_BUYER": true}, "date": "15 May, 2017", "reviewer": "MOHAMMED SHAROOQ"},
{"rating": 4, "title": "Good", "review": "Good one, Battery is still not as good as it was in iPhone 6plus", "verification": {"CERTIFIED_BUYER": true}, "date": "13 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Very Good", "review": "Very good phone ... speed is good... camera quality is awesome .... over all perfect phone", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Mar, 2017", "reviewer": "Piyush Gada"},
{"rating": 4, "title": "Worth the money", "review": "Awesome phone...", "verification": {}, "date": "15 Mar, 2017", "reviewer": "Sachin Gupta"}
]