[
{"rating": 1, "title": "Very poor", "review": "PlZzz take it from Apple store it was not sealed n earphone r replaced n stickers r missing n it is opened n used set ....not acceptable from Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jun, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Sexy got black, really black!", "review": "First to Flipkart delivery service - Thanks a lot, I received it earlier than promised. I also received a chocolate from you guys, it felt really nice. Multiplied my joys of receiving my new phone.\n\nNow to the iPhone.\n\nPackaging - As always - neat & superior!\n\nThe phone - It feels great. I personally chose the iPhone 7 over 7+ because of the size. Moving from iPhone 5 to 7 was absolutely no downer in terms of size, the size suited me well. Specifications wise - still exploring. ;)\n\nWhat's evidently different - the home button (the number 3 pressure press feels quite weird. Chose number 1 option) and yes of course the no-audio jack. So you do receive wired earphones better known as lightning compatible earphones. The end of your wired earphones connect to the slot of the lightning connector.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2016", "reviewer": "Priyanka  Parkar"},
{"rating": 2, "title": "Seems repackaged", "review": "Voice reception is very feeble. Product packaging does not seem to be original. Seems like meddled and repacked using small small cello tapes at corners and stickers.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2017", "reviewer": "PACKIAMARY JEROME"},
{"rating": 1, "title": "Faulty phone", "review": "Not even a month has passed since i started using it and its display has gone dead.. Could not expect that flipkart is offering such low quality phones..", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Jun, 2017", "reviewer": "Akshay Gupta"},
{"rating": 1, "title": "Terrible product", "review": "Brought a month ago and  Used phone for while ,  facing battery problem .. Now it is in apple service centre from a week . Prefer buying iPhone from croma or maple.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Sep, 2017", "reviewer": "ONKAAR KRISHNA THOMBARE"},
{"rating": 1, "title": "Radiculous", "review": "My name is narsiredddy I booked apple iphone 7 32gb I received yesterday 2:30 pm from u r courier executive on Flipkart name box that is apple iphone u r executive said that I paid total 44999 amount and I broght to my home that box I open that box I was utterly shocked there is no mobile come inside the box only they sent iphone 7 box and earphones and charger but no phone inside so I wil go to complaint against on u today in our police station and I wil file petition in consumer court", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Phone is Good but that is used phone", "review": "When I got this phone, Battery is dead and as I know all phone which is brand new that is come with some of charge battery. So as I think they are providing used display phones. \nSeller was ---SuperComNet", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Mar, 2017", "reviewer": "Rakesh Koranga"},
{"rating": 4, "title": "Awesome phone.. Worst delivery Service by Flip", "review": "Awesome phone.. m in love wid iphone.. really happy.. finally I got this after so long wait because the worst delivery service by flipkart.. worst experience ever", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Oct, 2016", "reviewer": "KAPIL GOYAL"},
{"rating": 5, "title": "Makes a Compelling Upgrade from the iPhone 6", "review": "Writing the review upgrading from an iPhone 6.\n\nThe increased speed and camera are great! 3D Touch feels a little incomplete but is convenient nonetheless. While the design is the same as the 6, the black really makes it stand out. Stunning finish on the matte black.\n\nWill update the review upon further usage.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2016", "reviewer": "Sangeeta Banka"},
{"rating": 5, "title": "Good!!", "review": "Dont worry go for it 100% original", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2017", "reviewer": "Ayush  Jaiswal"},
{"rating": 5, "title": "Super!", "review": "Simply outstanding & no compare", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Ajay Pratap"},
{"rating": 5, "title": "Flipkart Rocks!!!!!!!!!!!!!!!", "review": "Buying the most awaited phone of the year and that too from flipkart was amazing.\nReally thankful to flipkart for understanding the customer's egarness. \nFlipkart Delivered the product on 7/10/16 at 7.10 pm when apple conducted all india launch.\nThis kind of commitment from flipkart towards its customers is highly appreciable.\nFlipkart is another word for Geniune products.\n\nIphone 7 in first looks is a awesome phone with gr8 camera. Altogether a new home button which is more faster than previous phones.\nbuild quality is very premium with black colour adding further to it.\nsound quality is also very good. Battery backup is very satisfactory.\nHighly reccomended.\nKEEP IT UP FLIPKART.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Oct, 2016", "reviewer": "Bhavesh Kothari"},
{"rating": 5, "title": "Iphone 7 Amazing experience", "review": "I have been using iphone since few days . very much contended from the experience and services provided by flipkart on product delivery. Thanks for giving the seamless experience.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Nov, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "NYC experience", "review": "good delivery speed by Flipkart and my new iPhone is awesome.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Oct, 2016", "reviewer": "Hitesh bhardwaj"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "received product..nice packaging and excellent overall experience", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2017", "reviewer": "venus sethi"},
{"rating": 5, "title": "iPhone 7!!", "review": "The black is a Good and different colour!", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "battery", "review": "the battery life of the cellphone delivered is very poor.\ncharged at 84% in night and in mornin the phone was switched off without any use.\ndont know whats the problem", "verification": {"CERTIFIED_BUYER": true}, "date": "31 May, 2017", "reviewer": "MAYANK TULSHYAN"},
{"rating": 4, "title": "Good choice", "review": "Just awesome", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Nov, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "A Worthy Upgrade from IPhone 6 Plus", "review": "Shift to IPhone 7 from IPhone 6 Plus\n3 features that standout are:\n1. Loud and Clear Speakers\n2. Camera quality is top notch, a tough competition to Galaxy S7\n3. Waterproofing \n\nWorthy upgrade from IPhone 6 Plus", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2016", "reviewer": "Satej Rao"},
{"rating": 5, "title": "Terrific purchase", "review": "The product is as usual best ,and thanks for the best service by flip kart,its always the best keep it up I give thme 10 out of 10 for their genuine products provided ever", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Nov, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "New iPhone buy", "review": "I buy new iPhone 7 from flipkart. It is really awesome. Thanks", "verification": {"CERTIFIED_BUYER": true}, "date": "10 May, 2017", "reviewer": "Rana Ji"},
{"rating": 5, "title": "Amazing service from Apple & Flipkart", "review": "On Time Delivery Best Part Of Flipkart. \n\nAmazing Deal as always with Flipkart. \n\nComing to iPhone 7. Really nice feel. \n\nApple has the best product they know what people want. All the features in one hand. Really a fan of apple. \n\nFlipkart delivered what they promised.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Unknown products need review not iphone", "review": "What you expect\nIts iphone;)", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Dec, 2016", "reviewer": "Varun Dhamija"},
{"rating": 5, "title": "Awesome but don’t buy Matt black", "review": "Pros:\nSleek and handy, no more chunks of heavy metal\n\nPremium and stylish, Matt black looks royal. \n\nCamera is stunning, you can't believe, it nurtured a hidden photographer in me to such an extent that I bought a dslr now, most of my pics are clicked on it. Camera is comparable to point and shoot standalones.\n\nBattery life is more than sufficient.\n\niOS is more secure and reliable.\n\nSound is louder and crisper then 6 th generation \n\nAluminium 7000 series is more sturdy\n\nCons:\n\nNo 3.5 mm, but there is an adapter to bridge that\n\nI my personal opinion screen should be 5 inch, reducing bezels.\n\nPrice.. but I got it in deal, cheapest ever, thanks to flipkart \n\nEnjoying my iPhone . Go for it else for i8 if budget doesn't matter for u ;)\n\n\n21.11.2017-colour review\n\nI have rose gold 6s and mattblack iPhone 7, I noticed that Matt black is more prone to scratches and fading of color. Rose gold still rocks after an year. \n\nmy suggestion is to buy a matellic color rather Matt.\n\n\nPlease click helpful, if u like.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Sep, 2017", "reviewer": "Arun Kumar"},
{"rating": 1, "title": "Poor customer service", "review": "I got the product on 25th sept. Since then I have been waiting for the order invoice but have not received it even after following up with flipkart customer service executives multiple times. I am so disappointed with their responses. It makes me feel as if I am dealing with some sarkari office which doesnt want to work. \n\nFor this bad experience i would never shop again with flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Very good mobile and smooth  clean software", "review": "I received my product before one day delivery date.I fear due to some negative review against seller supercomnet. I don't understand why people are comment negative review.But I had recieved original product.I have checked serial number and imie no in apple site and it shows original.I am first user of apple.Really it is amazing to use i phone 7.Before I have used samsung note4.It is totally difference between ios and android.Ios is very smooth and clean software.So thanks to flipkart and supercom net for send me original product.I exchanged my samsung note4 mobile at good price in exchange offer.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Oct, 2017", "reviewer": "Rakesh Ranjan Sahoo"},
{"rating": 5, "title": "Super!", "review": "Upgraded from iPhone 6 to 6s to se to 7... Build quality has been awesome from Apple... They are surely investing a lot of their intellect in designing... No one can beat them in that section. Coming to performance, well there's only one conclusion - at the end of the day it's an Apple..The Name says it all... Camera captures natural true tone colors... Not oversaturated or washed out, almost the perfect.. Battery - has improved a bit but not spectacular as always... Definitely an improvement is there.. A10 processer handles almost all the apps, period.\n\nSatisfied with apple, not with flipkart.. Satisfied with the delivery executive, not with flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Oct, 2017", "reviewer": "Arjun Shankar"},
{"rating": 3, "title": "Met Expectations", "review": "Product I received is having damage... Not able to replace it", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Apr, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "FLIPKART IS FRAUD", "review": "You Fraud Flipkart\nThe Iphone displaying in ur app as delivered was never delivered to me. Although it was COD but still you did not fulfill your promise of delivering the phone on Sale Price of 39,999/-\nFlipkart is Fraud. Will never order anything from flipkart anymore.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 May, 2017", "reviewer": "Keshav Gupta"},
{"rating": 5, "title": "5 Star service, Awesome experience", "review": "Flipkart always gives his best when it comes to quality and delivery. Thanks for making purchases so easy and effortable. 5Star to all your services and offers you being to us. 5star to Flawless service and trust full offers", "verification": {"CERTIFIED_BUYER": true}, "date": "18 May, 2017", "reviewer": "Amjad  Khan"},
{"rating": 1, "title": "Received defective item , seller not helping", "review": "Hi I've just got my iPhone 7 32 gb black , and one of the bottom speakers are not working . I called up the guys at service centre and this woman Shruti , who's a senior attended me and said that they can't help me anyhow , I'll have to visit the service centre . What kind of stupidity is this ? I spend more than 40,000 on a mobile phone thinking that it's flip kart and seller seems to be good and this is the type of stabbing they do to you. Now I'll have to run to the service centre for their bastardness , the retailer has mentioned 10 day replacement guarantee . I received my item 10 hours ago and this is how they work . The apple logo glass is tiny bit missing , this can never happen if u buy it from the store and this ensures the defective or factory item which they've sent me\nDon't ever but from this supercomputer net seller and never ever everrrrr trust people at flip kart . I'm really regretting as to what I've done . Would definitely never ever recommend or myself buy from flipkart. And if I get charged for this stupidity I will sue you sir / madam from supercomputer net . Mark my words , I will . \nAnd if you're even reading this try helping me out for the sake of ur customer loyalty , I've been ordering from u since years and even you flipkart ! Highly Disappointed and ensure coming back !\n\nUpdate 19/05/17 - received my replacement today. The product seems to be okay , but the box was duaty from inside and plastic wrap on phone had bubbles . Can't say what is happening to flipkart and to us . Even this seller , shreyansh pvt. Is a fraud i feel . Idk from where he's getti g such used products , replacing my item was a gamble , im not gonna try it again . There are slight scuffs on the phone . Idk what. Really giving up and never ever everrrr comimg back to shop from Supercom.net or flipkart , you gys suck !", "verification": {"CERTIFIED_BUYER": true}, "date": "17 May, 2017", "reviewer": "Prabhsharan Singh"},
{"rating": 1, "title": "Order cancelled", "review": "Dont buy from flipkart providing fake offers. I purchased 7 on credit card emi delivery boy came and took the product along with him poor service nd not got satisfied revert from the support team bad experience ever.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Rahul khatwani"},
{"rating": 5, "title": "Compelling upgrade from my 4 year old iPhone 5", "review": "Great phone, exceptional camera, impeccable delivery and service by Flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Oct, 2016", "reviewer": "Sarthak Patnaik"},
{"rating": 5, "title": "This is 7. But doesn't live upto expectations.", "review": "iPhone 7 - 32GB Black\n\nPros : \n- Superfast A10 Processor \n- Improved Home button (Haptic Feedback) \n- Excellent Low light camera with Image stabilisation \n- 32GB Storage from base models \n- Improved Stereo sound from speakers \n- Great battery life. Almost lasts for a day with a full charge. Significantly better than the predecessor.\n- Most importantly, this time it is waterproof. \n\nCons : \n- I had the iPhone 6S (16GB), I haven't noticed much difference and the aesthetics of the phone just feels the same. Not worth upgrading from an iPhone 6 / 6S. \n- No headphone jack. Have to insert the adaptor in order to use any external headphones with 3.5mm jack. \n- Screen quality is the same. \n\nVerdict : I feel the phone was overhyped while the phone is a very good buy for new iPhone users or anyone upgrading from 5S and below.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2016", "reviewer": "Rinse John"},
{"rating": 5, "title": "i (for ideal) phone", "review": "It would be presumptuous to not acknowledge that all those who pre-ordered this device, myself included, have done it simply for the allure of the latest iPhone. Even as I say this, I wasnt entirely convinced of the iPhone 7 when I watched the livestream of the Apple Keynote. However, a timely launch in India, less exorbitant pricing and a hefty cashback was what finally swung me in favour of it. \n\nWhile Apple might have not made much headway in design for 3 generations now, I take some solace in the fact that I got the Black variant which sets it apart from the earlier generations. Having said that, the accumulation of the incremental updates is what makes this a significant step up from the 6s - IP67 protection, cleaning up of antenna lines, camera with better low light performance and OIS, stereo speakers, brighter screen with wider colour gamut, 40% faster quad core CPU, hexa core GPU and the bigger 1960 mAh battery. However, the focus will be more on what has been lost, namely, the headphone jack and the physical Home button. Coming from Android phones with capacitive only buttons, the latter doesn't matter at all, especially since it is now a multi-function button that does a lot more than the physical one. However, I must admit that pressing it felt odd initially and I mistook the vibration as flexing of the case in which my phone was encased. The loss of the former however will not be an easy one. It may have been a courageous move but also a bit impractical. I use a Sony SBH54 Bluetooth headset and the audio quality is still some way off to justify using it all the time. It is even more antagonizing when you have invested a significant amount in purchasing high-end 3.5mm jack headphones. At least, there is the headphone adapter which comes only in white and goes very well (not!) with the Black variant. I guess that is a compromise I have to live with and really hope that Apple has made the Lightning port a lot sturdier. I can somehow accept this decision if indeed, as Apple has stated, it was a price to pay for a larger battery, water resistance and stereo speakers without ruining the dimensions, even though I can accept an additional 2mm of thickness any day. Apart from the device itself, you buy yourself in to a large repertoire of accessories that simply dont exist for other devices. \n\nAs far as iOS is concerned, Apple has been more forthright about picking up whats good in others (as has Android) which means a more accelerated rate of iOS progression compared to an approach of deterrence through suing. Also, Apples walled garden now has a pet door with overtures to developers to utilize aspects of iOS that were previously, preciously locked away. iOS also continues to be the platform of choice for innovative app developers who are not simply targeting income through baited ad clicks. Even Google and Microsoft continue to offer an incredible experience on iOS which is inexplicably better than what they offer on their own platform. It is perhaps not contestable that iOS offers the best security, privacy, optimization and consistency of any phone, even though most of it comes from Apples control of every aspect of the device. Also, the exclusivity of the OS has some appeal to it at a time when Android can be experienced on any PC. To sum it up, you cannot go wrong with buying the iPhone, unless you had to take out a mortgage to finance one. \n\nP.S. I received my iPhone at around 8 p.m., about an hour after the launch and really loved the custom packaging. Enjoyed purchasing something from Flipkart after a long time.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2016", "reviewer": "Saurabh Majumdar"},
{"rating": 4, "title": "Its different than android and EASIER ROBUST", "review": "Yeha it is amazing phone oh I am sorry its iPhone \nIt was quite difficult for me because I switched from android but right now I am more comfortable with iOS \nI am using almost all features of iPhone \nThat was not happening with android \nYes I was thinking to buy Oneplus product but my decision was right because its hardware features is only huge number \niPhone is highly optimise yeha but battery life is quite less", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Feb, 2018", "reviewer": "Ashok Shakhawar"},
{"rating": 5, "title": "#beast", "review": "#beast\n\nThis is my second iPhone. I upgraded from 5s.. My advice: If youre looking to upgrade your phone, iPhone 7 is awesome. If you have some spare money iPhone 8 is better but 7 & 8 has no much difference;so why waste another 10k on the same product. \n\n After a week of nonstop uses:\n\nPerformance: 9.5/10. Its a #beast. Lightning fast. \nBattery: 8/10. Single full charged,I can used the whole day\nCamera: 10/10. Awesome.\n\nOverall: One of the fastest and best looking phone. Go for it. After all its an IPhone 7.", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Jan, 2018", "reviewer": "Wisanni Newmai"},
{"rating": 5, "title": "Excellent product and service from Flipkart", "review": "Ordered iPhone 7 (Black) from SuperComNet during Republic Day sale. Received a genuine phone on the very next day. Not sure why so many negative reviews for the seller. Overall I am very happy with the seller and of course Flipkart and its courier partner ekart.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Jan, 2018", "reviewer": "Prashant Vishwasrao"},
{"rating": 1, "title": "Absolute rubbish!", "review": "Phone repacked product  does not buy", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jan, 2018", "reviewer": "Rakesh Kumar"},
{"rating": 1, "title": "Terrible product", "review": "Flipkart is worst app to shop any product. Their customer care agents are what to say. . Everything is so bad that you cannot expect any help from them. They are going to blame you only for their faults whether it is app issue, any return, any refund, any damage, any thing.. hate you guys. Your escalation team was going to call me back in 24 hours and it's more than 60hours where the hell is your escalation team.\n\nOne should never purchase any thing from flipkart. They make fool of you with their offers and will never accept that fault was from their end. They can even say that their was any such kind of offer on this product on Flipkart. Trust me they did this with me.\n\nIt requset you all to purchase I phone from authorized centre. They now have the same discont schemes of cards as shown on apps. And they will never blame you for any thing. And quality of the product is of no doubtebly A1.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jan, 2018", "reviewer": "Rohan  Shukla"},
{"rating": 5, "title": "Awesome", "review": "Awesome phone even in 2017 great performance, camera and someone looking to buy an iPhone go for this rathar than i8 coz performance vise there is not much difference but price vise there is difference. Only iPhone X outperforms this on sheer performance and thank u flipkart and associated for delivering my product on time.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2017", "reviewer": "Kartavya Partap Singh"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "It's was an owsm experience with the sale one of the best product in market today", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Sep, 2017", "reviewer": "Akshat Dubey"},
{"rating": 5, "title": "Terrific purchase", "review": "Awesome Product. No need to tell more about product. Original, genuine, in time delivery. \nBest deal from flipkart. Awesome!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Aug, 2017", "reviewer": "atish Channawar"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Its my first review ever\nThanx to Flipkart for wonderful Deal\nI'm so happy to have this iPhone 7 for just ₹38499\nAmazing phone @Amazing price", "verification": {"CERTIFIED_BUYER": true}, "date": "25 May, 2017", "reviewer": "Rishabh Bhateja"},
{"rating": 5, "title": "Brilliant", "review": "Got iphone 7 at unexpected price 39999..thank you flipkart..packing was not as good as a iphone 7 should have..", "verification": {"CERTIFIED_BUYER": true}, "date": "23 May, 2017", "reviewer": "YOGESH SONI"},
{"rating": 5, "title": "Great product !", "review": "Great product :)", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Oct, 2016", "reviewer": "Mandeep Singh"},
{"rating": 5, "title": "Awesome", "review": "Brilliant product with super internal specs!!", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Oct, 2016", "reviewer": "Adarsh Rodrigues"},
{"rating": 4, "title": "Worthy upgrade from iPhone 6", "review": "Firstly flipkart did a fair job on delivering the phone despite the huge number of orders.\nOverall iPhone 7 is a nice upgrade from iPhone 6 as I got 3D touch, Live photos, better camera, Better processor, Stereo speakers and it's water proof.\nBut I don't think it has much to offer if you are already using iPhone 6S.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Oct, 2016", "reviewer": "Kiran Chaluvaiah"},
{"rating": 5, "title": "Superb!!!", "review": "Thanks to flipkart for fast delivery. No need to explain the product, iphone is just self explaintory.\nAnd for those having issues or claiming the product to be defected, first of all go for fassured seller only and watch out some unboxing videos beforehand so as to get an idea of sealed box and when ever unboxing new iphone just look out for sealing i.e. Original seal is not hampered and match that IMEI no of phone and bill with that of box, you will be good to go", "verification": {"CERTIFIED_BUYER": true}, "date": "17 May, 2017", "reviewer": "Jashan Sandhu"},
{"rating": 4, "title": "Extremely satisfied despite being sceptical at 1st", "review": "At first I was very sceptical about the seller and genuineness of the product since I bought this product at extremely cheap rate during sale. However after one month of using it, the product has shown absolutely no glitches that makes me doubt that the product is counterfeit or something. Hence I would recommend others to go for this one.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jun, 2017", "reviewer": "Tushar Gupta"},
{"rating": 5, "title": "Awesome Product", "review": "Excellent product, worth the money...", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Nov, 2016", "reviewer": "Raunaq Oberoi"},
{"rating": 5, "title": "Nice phone", "review": "Used an ios product for the first time, thanks to flipkat's 40k price, nice phone, heats a little more than what I expected but performance is amazing, benchmark score varies according to the temperature, kept in the fridge and benchmark scores were on par with other iPhone scores!! Overall satisfied with the purchase", "verification": {"CERTIFIED_BUYER": true}, "date": "25 May, 2017", "reviewer": "Rohan Saini"},
{"rating": 1, "title": "Good service cnt complain good delivery time n all", "review": "Was not expecting this, the cable inside box is not working i sent flipkart a complain  but not receiving any reply yet i checked it with other devices too bt no use now using my old iphone's cable for charging", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Mar, 2017", "reviewer": "Mahesh Shelar"},
{"rating": 5, "title": "Its safe and genuine", "review": "I have never ordered anything expensive online. This was my first, and I was nervous how it will be. However I am pleased with Flipkart and the seller. The product was delivered on time and original. Thank you.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Genuine & the best !!", "review": "Ordered on 22nd last month during Big Billion Day offer & received on 24th !! Too happy with the device. Confirmed positive as a genuine device from Apple India Customer Care!! Happy with the performance since I just switched from Oneplus 3T . But only issue is the battery backup after upgrading to ios 11. My advise to the newcomers, do not upgrade from ios 10 before the fix is being released by Apple !! Cheers !!", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Phone getting heat with mobile data", "review": "I am unable to use this with data phone is getting huge heat need to replace", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Oct, 2017", "reviewer": "prasanth singamsetty"},
{"rating": 5, "title": "Classy product", "review": "Awesome phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2017", "reviewer": "Ankit Mohania"},
{"rating": 5, "title": "Terrific purchase", "review": "Awesome phone at best price..thank you flipkart for great deal. Quick delivery with great packing. Initially afraid to buy it online but flipkart made this experience great n amazing.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2017", "reviewer": "Nishant Daryanani"},
{"rating": 2, "title": "Not good", "review": "I bought this Apple Iphone 7 32gb black, with exchange of old phone. but the phone some issues i got some doubt when the delivery guy was hurry to take the money go, don't know why also packing is also very poor not much highly sealed. when checked with customer care they asked to visit near apple store. where this product was only 1 day old.  i loss my old good condition phone (Redmi 3S prime) they told exchange phone can not return now. \n\nCould please return at least my old Redmi 3s Prime with same price, which is way better condition.\n\nneed to very careful while buying costly phone or items now on flipkart. :(", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Nov, 2017", "reviewer": "chaitanya kumar"},
{"rating": 1, "title": "Got defected phone", "review": "Ringtone not working.There is no replacement as well", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Awesome", "review": "Fulfilled the wish. Nice work . Got my iPhone 7  black . Loved the facility of flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Dec, 2016", "reviewer": "Abhishek pati"},
{"rating": 1, "title": "Worst Service experience till date.", "review": "I have ordered an I phone 7 and I got it on 25th of september. It works for 3 days and now it stop working unexpectedley. Its not even turning on now. Apple support is asking me to return it but there is no return option available on site. I want to replace it or want my refund.\n\n\nApple is asking for refund from Flipkart and Flipkart is not giving any return option (Not even a single day replacement)\n\nWill never buy anything from Flipkart and suggest you guys the same.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Oct, 2017", "reviewer": "Nitin Sehgal"},
{"rating": 5, "title": "Amazing is the one word for Apple.", "review": "So I got my first Apple I Phone 7 , thanks to Flipkart for amazing low price of 38499/- on there big billion day, package arrived before time. \nHere was my New I phone 7, mesmerizing look, feature touch , crisp and clear display, sound at its best, even the ear-pods are too classy and give a good sound.  When I started using Apple I phone then i realized why they cost more than any other smartphone. They have terrific after sale support. My phone was heating a bit for Initial 2 days, then i contacted apple customer service through chat and phone support and they solved my queries .Apple has unique feature of adapting when we first start to use the phone and that's why  in initial days it will heat a bit to get with the envrm and it was true.  Now I don't feel like using other phone's ,I phone are light weight and this u can feel once u start using this gem device. Camera is above par no other phones comes close to pic quality than I phone 7 .Finally I must say if you have not used I phone , Use it for once you will surely not regret. Thanks.!!", "verification": {"CERTIFIED_BUYER": true}, "date": "24 May, 2017", "reviewer": "Piyush Ranjan"},
{"rating": 4, "title": "Great experince", "review": "Mobile is good. No defects thanks to supercomnet retailers. Flipkart delivered after a week and promised date but they would have delivered early before promised date. They miss routed couriers and I can see misrouted sticked on package.Apart from Ekart delivery product is good and I have noticed mobile heating up when high utilisation is happening mostly using WhatsApp video calling but not frequently.its been two months of experience in iphone7 mobile is good and inbuilt apps are cool.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific purchase", "review": "Nice product. Camera quality is average. I should have bought iphone 8 instead. No other regrets.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Sai Chakradhar Sana"},
{"rating": 5, "title": "iPhone 7 great value for money", "review": "Excellent and great value for money. It's been a great experience after moving from iPhone 4s for 4 years to iPhone 7. Everything seems to be new, fast touch response and finger print sensor is great. Best and fast processor in the current smartphones. Camera is outstanding, I always had better camera experience in iPhone 4s and now iPhone 7 with 12mp & 7mp is really great, especially low light shots are great. Although missing 3.5mm jack but lightning cable for headphone and charger is also way too good. Overall it been a great buying experience with Flipkart with great discounts and exchange offer. Thumps up :-)", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2017", "reviewer": "Diwakar V"},
{"rating": 4, "title": "Worth buy", "review": "Product:\nA better touch and response time then previous versions of iPhone. Black color is super cool, though not much change in looks. Camera upgrade is good, with a brighter display.\nStereo sound is good, new home button is quite sensitive, overall a good buy.\n\nDelivery and packaging:\nTimely delivery and in a uber cool box, kudos to Flipkart for that", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2016", "reviewer": "Anubhav Agarwal"},
{"rating": 5, "title": "Superb and stylish!", "review": "Superb phone, elegant, stylish and classy colour matte black...made a great choice :)\nFlipkart lived up to its delivery promise which is today the launch day. Overall brilliant! Worth the money spent", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Oct, 2016", "reviewer": "Ullas"},
{"rating": 5, "title": "Gorgeous black", "review": "iPhone 7 was launched at 7 PM IST on October 7 in India. I received an SMS at 7 PM that the delivery boy is out and I will be getting the product. I received my product at 8 PM, within one hour of the launch. With great excitement I open the packing that said priority. Upon opening I found a flipkart exclusive black box designed for iPhone 7. This packing is elegant and a surprise. Kudos to flipkart for the packing and delivery. \n\nComing to the phone:\n1) The colour is elegant. Even though the design is nearly the same except for the 3.5mm earphones jack, the colour is something which makes it different and gorgeous. The touch is awesome and the phone setup is easy.\n2) The speakers are louder than the previous versions of the phone. But I am not sure if it is 2 times the sound of previous phones.\n3) 4G reception is good. I tried Airtel 4G and Reliance Jio.\n4) The camera is good.\n5) I absolutely love the customisable home button which gives me feeling that I am pressing a button which is against the feeling of using most android phones.\n6) More storage is a delight.\n\nCons:\n1) The battery backup is not great. It is draining quite fast even at minimal YouTube and internet usage with no new apps installed and running in the background.\n2) The display satisfies my eyes but it could have been better when it comes to resolution. But I love what I am seeing.\n\nThe phone is gorgeously simple. Thanks to flipkart and Apple.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2016", "reviewer": "Nikunj Gupta"},
{"rating": 5, "title": "good more then expected.", "review": "I have serched over all enternet for buying an iphone 7 i cheked many shopping sites reviews and all customers feedbacks and after talking with many friends finally i get that many friends buyed mobile from flipkart and they got authentic mobiles so i finally decided to buy from flipkart and at same time i listened about big 10 sale and i ordered at exect time for cod and i got it only for 39,999rs. Then i waited for 4 days and i got that product i have doubt in mind that i have buyed it online and also at time of sale, it will be authentic\\real,then after payment i directly went with that box to inspire and unboxed their by recording full video by my mobile and then i have got a first look of mobile which is fresh look and looking perfectly new mobile my first doubt was cleared that it is not an empty box and not a box with a stone. Then they started mobile and checked all accessories and then said it is 100% real and then he activated my mobile and now I am enjoying it without any problem if any problem occurred in feature then their is warranty I can contact inspire(apple store) easily as it has all rights that any iPhone has. Thank you flip kart. Really 100% authentic. You can also search me on instagram I am student and really I got iPhone 7 at lowest price and as much as authentic as any other real iPhone in world.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Jun, 2017", "reviewer": "aman kag"},
{"rating": 1, "title": "Dont buy this product from Flipkart", "review": "Worst worst ever experience of buying phone from Flipkart.. Received my phone today and in call volume is too low that I cant hear anything.. also the next person is not able to hear me properly \nAt the time of buy Flipkart showed 10 days replacement policy and now when I click on return pop up comes which shows cont device service centre\nWill not recommended buying an iphone from here", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Jan, 2018", "reviewer": "siddhant patil"},
{"rating": 5, "title": "Fabulous!", "review": "Very happy as this is my first iphone and satisfied with delivery service by flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jan, 2018", "reviewer": "Krunal Thesiya"},
{"rating": 5, "title": "Worth waiting for you!", "review": "It's been 6 hours since I've been using this phone. Perfect beauty....no lag camera is awesome. Every penny spent on this phone is worth it. Only problem that I am facing is with ringtone. My phone is only vibrating while an incoming call. As I am able to play song so it means speaker is fine. I will figure it out. One star deducted is for that only. Hope the problem will get resolved. Last but not the least flipkart is good as usual. Delivered next day of placing my order. Hope the phone is genuine:-) Overall I am really happy with my phone. The new iPhone 7. Will post again after using it for some time.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Awesome", "review": "I got my iPhone 7 on 9th Nov. 2017 and this is my 2nd iphone in a row. I'm using 5S and now bought iphone 7.. filpkart delivery is awesome, got it within 18 hrs from the order. Nothing to say about iphone 7.. it's really sleek and black model looks hot in hand. Live picture is looks nice. Camera took pics like they are live. Battery backup it really gd, I use it for 2days once it changed full. Bt I hv little disappointed bcz I bought it in a price of Rs.45K where flipkart was giving it in Rs.40K jst little days ago. Nevertheless, I'm happy to gv 5K extra bcz I got it on my bday frm my beloved one. Thnk u flipkart to mk my bday spl. Lv u iphone 7.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific purchase", "review": "Product is genuine and I have been using for more than a month...I like it.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Nov, 2017", "reviewer": "Praveen Gurindapalli"},
{"rating": 5, "title": "Terrific purchase", "review": "very good product, genuine and original iphone, very fast delivery within two days. thanks flipkart hope to deal with you again", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Nov, 2017", "reviewer": "sahin sultan"},
{"rating": 5, "title": "Must buy!", "review": "I love iPhone 7. It's really awesome and Flipkart delivery also too good.....", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Oct, 2017", "reviewer": "sandeep dhakad"},
{"rating": 5, "title": "Delightful", "review": "IPhone build quality is great and it looks premium, it is slightly slippery in hands make sure u have good Case and the greatest drawback is the battery drains lot more faster compared to other high end mobiles....", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Sep, 2017", "reviewer": "Saigoutham"},
{"rating": 5, "title": "Highly recommended", "review": "nice genuine product", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Aug, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent....", "review": "Excellent product.....", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Dec, 2016", "reviewer": "Vidyut Verma"},
{"rating": 5, "title": "Just wow!", "review": "As good as 6S", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Nov, 2016", "reviewer": "ROOPALI GOYANKA"},
{"rating": 5, "title": "Sleeker than ever", "review": "Super Fast delivery, upgraded from iPhone 6 and felt this phone is even sleeker! Enjoying the experience. A good buy on Flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Mar, 2018", "reviewer": "Nishant Tiwari"},
{"rating": 5, "title": "Awesome", "review": "very nice phone and thanks to flipkart for good service", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "***************", "review": "Good product paisa wasul.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Don't buy high end products rather go Apple Store", "review": "My opinion is to buy this type of costly products from the Apple Store only, because the product which I received was a opened sealed box, then Flipkart replaced it and now I am having a brand new product, but this is not at all expected when you are buying such costly products, I had to be without any smartphone for 8 days, so please go for Apple Store rather than buying used products.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Mar, 2018", "reviewer": "Arpan Jha"},
{"rating": 5, "title": "iPhone 7 awesome", "review": "Excellent product with nice packaging. Delivered ahead of schedule.  Was worried whether it could be refurbished.  But to my surprise a new device. Feeling happy with the service from Flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 2, "title": "Not satisfied", "review": "Not satisfied with the product", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Highly recommended", "review": "Got it at an all time low price of rs.37250 in diwali sale last year that too at an attractive zero cost EMI. The best iPhone so far.. Handy, water proof, great camera and killer performance.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Mar, 2018", "reviewer": "Vishwajeet"},
{"rating": 5, "title": "Fabulous!", "review": "Awesome\nGot the phone as fast as possible.\nThe phone is original no problem with the phone. you have not broken my trust flipkart. \nEveryone waiting must buy this phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Mar, 2018", "reviewer": "Anand Shukla"},
{"rating": 3, "title": "Errmm", "review": "There's always a problem on buying phones at a super cheap rate online because they sell faulty pieces. I bought at 38k but had to replace the fingerprint sensor within two weeks. Anyway, a good deal. Flipkart should be loyal and honest to its customers who count on it.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Feb, 2018", "reviewer": "Rishabh Gowardipe"},
{"rating": 4, "title": "Really Nice", "review": "At first I was afraid to buy an iPhone from this seller after reading so many negative reviews.. First I ordered Iphone7 plus but reading so many negative reviews I cancelled the order.. I again after two week  ordered Iphone 7 .though delivery was late by one day but as far as product is concerned I don't find anything wrong or missing... Its working fine so far... I dint want to review it... But I am happy with the product so I thought I should write... Don't flow in negative reviews...", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Jan, 2018", "reviewer": "Kishan Kumar"},
{"rating": 4, "title": "Excellent service and product", "review": "Fast delivery by Ekart \nExcellent mobile in best Deal ,no other site gives you enough discount like Flipkart \nBuy iphone from flipkart only", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Jan, 2018", "reviewer": "Bhavik  Bhavsar"},
{"rating": 4, "title": "Good choice", "review": "Nice and good  i fhone", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jan, 2018", "reviewer": "dileep kumar"},
{"rating": 4, "title": "Replacement done with in 48 hours", "review": "Product received with different IMIE and serial number as on box and on bill . Scratches on the screen . The phone came with dead battery and the delivery boy didnt waited to let me check the authenticity of the product .\n\nReplacement received with in two days .\n\nThe replacement is genuine and perfect .\n\nThe flipkart support team was very helpful. Only thing flipkart to do is to instruct the sellers to be more genuine or bar them . \nAs a end user we the costumers dont know the seller we are dealing with flipkart and such hassle effects the image of flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Kudos", "review": "Ordered much hesitantly, seeing all the videos of people get soap brick in phone boxes. But turned out to be a great experience. First of all I got a good buyback for my 3 year old iPhone 6. Also that greatly helped as a steppingstone for the new phone. The entire process was hassle free. Delivery person was patient enough and also created a video of the unboxing, in case things go sideways. But after all said and done, I am really happy. I dont need to review the product coz there are billions of reviews posted online. Also I was promised delivery in 4 days. But I got the phone 2nd day only, took them not even 48 hrs to get it to me. Much thanks.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jan, 2018", "reviewer": "Chetan gupta"},
{"rating": 5, "title": "Worth every penny", "review": "Best product in this price beautifull product...Thank you Flip cart", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Worst experience ever with seller , fake seller", "review": "wrost seller , show wrong info for the product prize , ask extra amount if pay through emi", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jan, 2018", "reviewer": "Navee Punia"},
{"rating": 5, "title": "Excellent", "review": "Very good product with good packaging", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2017", "reviewer": "karun bagde"},
{"rating": 5, "title": "Marvellous", "review": "Excellent delivery Flipkart go on", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Worst experience ever!", "review": "Battery backup low", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Dec, 2017", "reviewer": "Flipkart Customer"}
]