[
{"rating": 5, "title": "Good Drive", "review": "I purchased the product on 1st of August, 2014 and recieved it two days later on 3rd August. Flipkart offers one of the fastest delivery.\n\nPros:- Fast drive (Upto 85 MBPS on USB 3.0 And Upto 22 MBPS on USB 2.0 on normal usage, i.e. a lot of small files and folders), Backup Software\n\nCons:- No Security software, No Read - Only mode to prevent viruses, Expensive\n\nNote:- Flipkart demands the highest price for the product. Check other sites for better price options.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Sep, 2014", "reviewer": "Akarshit Dawra"},
{"rating": 5, "title": "awesome product. higly recommended", "review": "this hard disk is the best. its the slimmest and the fastest. \nhigly recommend this product for its sleek design. and quite cheap for a 2tb hard disk. \nthe transfer speed is amazing!! \nand got it on a amazing deal. thank you flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Oct, 2015", "reviewer": "nivetha  annamalai"},
{"rating": 3, "title": "Flipkart prices are not at all comparative", "review": "I am following up this Product for two months but flipkart prices are not at all cheap.\nEven they are selling it more than eight hundred rs. extra.\nI don't know what happen to flipkart these days no offers no good prices!!", "verification": {}, "date": "22 Jun, 2014", "reviewer": "surbhit gupta"},
{"rating": 1, "title": "FlipKart Price seems higher then the market price", "review": "Just some time back  I inquired market price is just 4500/- but flipkart price more than that, better pls check market before buying any online product", "verification": {}, "date": "9 Jan, 2015", "reviewer": "Gowrishankar V"},
{"rating": 1, "title": "Utterly Disappointed", "review": "The hard disk received by not working..tried connecting it with laptop but was unable to do so..", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Nov, 2016", "reviewer": "Harleen  Kaur"},
{"rating": 1, "title": "I dont get the product on time", "review": "It is very bad that flipkart could not update my order details .\nwhen i track it out i find difficult , is was displaying that you have returned your order.\ni give a call to flipkart they could also not able to give perfect info.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Oct, 2014", "reviewer": ".om uike"},
{"rating": 5, "title": "Great product", "review": "I bought this product on 20/05/17 during a sale of Rs 5400. It have the generous design, compatible user handling and light weight. Have a speed of 40-50 (copy+paste) and 70-87 mb/s (cut+paste) having 1.81 TB of user space.  Most important it can we used for for cloud  on  Mac,  windows and Android operating system. Thank you", "verification": {"CERTIFIED_BUYER": true}, "date": "23 May, 2017", "reviewer": "ABHISHEK SAHU"},
{"rating": 1, "title": "not the good product", "review": "I got this product 8 days before, but the hard disk is unable to get detect by my smart tv as well as by my computer", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Oct, 2017", "reviewer": "MAHESH JAGTAP"},
{"rating": 3, "title": "Satisfied", "review": "Slim hardisk, with very fast transfer speeds.\nFlikpkart delivered it on time.Satisfied with product.However the original packing of item was little bit damaged  product was in new condition only.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Mar, 2016", "reviewer": "nebu"},
{"rating": 5, "title": "Lovely product", "review": "Great product, delivery was done on time and as expected. Use the port with care. The port where the USB wire connects with the HDD is flimsy, have heard lots of complaints about how it becomes lose and spoils the HDD. All else looks sturdy and great.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jul, 2016", "reviewer": "Aditya  Sonphavde"},
{"rating": 1, "title": "Utterly Disappointed", "review": "Worse product!!! Not detecting n my laptop... Raised complaint for replacement.. hectic!!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Sep, 2016", "reviewer": "Arpita Kar"},
{"rating": 1, "title": "Device has not detecting...", "review": "Device has not detecting...Almost 1TB data has gone...Very Very Sensitive Product...I Never Expect From Seagate...", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Sep, 2016", "reviewer": "Davidson Samuel P"},
{"rating": 5, "title": "Best in the market!", "review": "Awesome product.......\nI got it in 5700", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Hated it!", "review": "Worst experience. Will never buy anything again from flipkart. It's only 15days that I have brought a Seagate 1tb hard disk now it has crashed by itself. My data is stuck in it. Just praying desperately to get back it.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Sep, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Super!", "review": "In my view the speed of transfer either read or write is really very good to feel like ultra. No problem till now (2 months). Slightly heating which is I think not a problem. And also no problem with connectivity with computer.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Jul, 2017", "reviewer": "SHUBHAM"},
{"rating": 2, "title": "Disappointed!!!!!!!!", "review": "The only reason i wanted to have this hard disk was due to the rose gold colour..This was a gift to my sister as she had a rose gold phone and he order came with the golden colour!!!!!!\n\nIt was so clearly specidifed that this is rose gold and the seller has sent me the gold colour..", "verification": {}, "date": "28 Jul, 2016", "reviewer": "Arpana gurjar"},
{"rating": 1, "title": "Utterly Disappointed", "review": "Plz don't buy on big billion day \nThe worst product in my order list ..\"NO REPLACEMENT \"", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Worst to choose Flipkart Now a days", "review": "I came to buy this hard disk on Flipkart but I just tried to check in other websites, the hard disk comes around 4k but here in Flipkart , it`s so costly. This happens in most of the products that Flipkart selling. I guess now it`s my time to buy all my required products to other websites. Thanks Flipkart.", "verification": {}, "date": "2 Feb, 2015", "reviewer": "sakthivel singaravelan"},
{"rating": 5, "title": "Flipkart you are the Best.", "review": "Got this product few months back, did not get an opportunity to review and thank Flipkart and the Seller, OM Shakti.. I was afraid of getting anything apart from WSretail.. but good job good Delivery, Awesome Packing Job...  I'm am Extremely Satisfied with the seller with Flipkart and Ekart.. Thank you.\n\n1 Thing. I got this product in Summer and I think it was kept somewhere very hot.. before they delivered. when I opened it it was like hot hot hot.. the Hard disk I mean.. and inside the box.. Please notify E-Kart to take special care of Sensitive Electronics while delivering..\n\nRest all good.. I use it for back up, so use it rarely, but all Is fine.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2016", "reviewer": "Arun S"},
{"rating": 5, "title": "It's just wowow.....", "review": "Rating:\n\nLook : 5/5\nSpeed :4/5\nPrice :4/5\n\nIn simple words it's just wow....really the blue color is fking awesome,,,,looks sexy..... i wonder that how did they built such a big volume in such a little box....i didnt thought that it would look so small and handy.....smallest of all other counterparts,...\n\nTransfer speed:\nFrom laptop to HDD : varies between 45MB/s - 19 Mb/s (for short files it will transfer at its maximum threshold and for huge data it took 19 to 22 Mb/s )\n50 GB data (@ 19 Mb/s) as whole it took 20 min + , and for 700 mb file  ( @26 Mb/s) \nit took 30s \n\nFrom HDD to Laptop : varies between 36 - 25 MB/s \n700 Mb file (28 Mb/s ) it took 24s......\n\n\nAnd also checked the same with my frnds WD my passpoer 2tb.......Both of them are similar at these rates.....comparatively Seagate is very thinner and looks good.....am a fan for seagate ...so went with this...its lovelyyyyy", "verification": {}, "date": "8 May, 2015", "reviewer": "Johnger"},
{"rating": 1, "title": "NEVER EVER buy from \"CyclopsInfo\" seller", "review": "Hi,\n\nI have booked this product from 'CyclopsInfo' and i have done the payment , even the seller confirmed the product. But the product was cancelled by the seller after 15 days and the product was not delivered,Though this seller was marked as 'Filpkart advantage' seller, he is not worthy to wear that badge. So, my advise is Never ever buy this product from seller ' CyclopsInfo'. \n\nFor attracting the buyer, this seller keeps his price as low, compared to other sellers. But he wont send you the product at that price. Finally you will end up with your waste of time and money dealing with this seller. \n\nThanks.", "verification": {}, "date": "11 Jan, 2016", "reviewer": "Ramesh Reddy Chegireddy"},
{"rating": 1, "title": "damaged product", "review": "its totally defective..cannot read the hdd still now..also cannot format the hdd..upon clicking on the hdd..the cursor woudnt stop circling..very much dissapointed..", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Nov, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Slimest Hard Disk among all the other hard disks...!!!", "review": "I have purchased Seagate Backup Plus Slim 2 TB External Hard Disk.\n\nSpecifications : Usable Memory is 1.81 TB\n                         Slim and comfortable..\n                         Speed : 50-60 mbps write speed (USB 3.0)\n                                      20-30 mbps write speed (USB 2.0)\n\nYou would also like to take it with you by simply putting in your pocket....!!!\n\nSo,no more writing about this product....\n\nIf you want 2 TB external Hard Drive.......Then rush for this one....!!!\n\nThanking u very much \"Flipkart\"...!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Oct, 2014", "reviewer": "Jaydeep Kapopara"},
{"rating": 4, "title": "Price is very high when compared to other e-commerce sites", "review": "Seagate backup plus is being sold around Rs. 4800. Other e-commerce websites are selling the same product at Rs. 4200. It would be good if you people decrease the cost.", "verification": {}, "date": "16 Mar, 2016", "reviewer": "Prajwal Narayan"},
{"rating": 1, "title": "Absolute rubbish!", "review": "Absolutely pathetic product.. only 10 days replacement validity.. for only 10 days this seagate hdd worked.. later it didn't connect nor did it respond!! Wasted my 6k on this one! \nDON'T BUY THIS HDD!", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Oct, 2016", "reviewer": "Sneha Ashtekar"},
{"rating": 5, "title": "Worth Product", "review": "The body is small, slim and quiet light. The data write speed for larger files is 51MBps (average) and read speed is 62MBps min. The body is tougher than that of 1TB models. Its plug and play in windows.\nI think the product is worth buying.", "verification": {}, "date": "22 Oct, 2014", "reviewer": "Mukul Sharma"},
{"rating": 5, "title": "Size Zero HDD", "review": "The first thing that strikes you surprisingly is its size. It is actually smaller than Galaxy S3 and probably of same thickness. Its dimensions can be gauged by its box itself.\nThough I didn't happen to buy this product from Flipkart, I am in awe of it due to its light weight, small dimensions and super fast functioning owing it USB 3.0. \nTo make perspective more clear, it took me 2.5 hours to take backup of 200 GB data which in USB 2.0 took me 8 hours approx.\nBuild quality is not that rock solid but I never drop my HDD's and hence cant comment on impact.\n\nTIP : Do not buy 2.5\" HDD covers available as accessories as this HDD is quite small for it", "verification": {}, "date": "30 May, 2014", "reviewer": "Nishan Desai"},
{"rating": 1, "title": "Utterly Disappointed", "review": "Received a defective piece. And when I called flipkart help service, they said that it must be my laptop fault or I must not know how to operate it. Totally disappointing experience,they cleared my return request after third call. And the boy who came to collect back the product was behaving like rudely like he is doing me a big favour . disappointing  experience by flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Oct, 2016", "reviewer": "Utkarsh  Chaudhary "},
{"rating": 1, "title": "cheating by flipkart and other e-commerce companies", "review": "this product is far more cheaper in the market/in a store and these e-commerce companies just write the price higher as they like and offer a discount as if they are doing a great favor to the customers. Dont buy like a fool. Go to a store , check the price and then buy the product ......These e-commerce sites are nothing but traps.........Its a zero rating from me....", "verification": {}, "date": "2 Aug, 2015", "reviewer": "utkal kumar Baliyarsingh"},
{"rating": 4, "title": "Really Nice", "review": "Good product \nHighly recommended", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Oct, 2016", "reviewer": "Apurva  shepal "},
{"rating": 5, "title": "Very Good Performance", "review": "Pros: \n1) High data rate.(USB 3.0)\n2) Slim Design\n3) Attractive Color.\n4) Supports partitioning.\n\nCons:\n1) No detachable SATA connector.(Not very useful though)\n\nVERDICT: BEST BUY FOR ALL USERS. HIGHLY RECOMMENDED..!!", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2014", "reviewer": "Akash Pavate"},
{"rating": 5, "title": "great deal", "review": "Today morning I saw it 2tb@4599 couldn't believe rubbed my eye's and ordered two external drive's.it is yet to be delivered but i know I sealed a lightning deal.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Dec, 2016", "reviewer": "Shantanu Jha"},
{"rating": 5, "title": "Worth every penny", "review": "I bought it back a year ago from FlipKart , honestly sepaking I haven't expected such a great speed while transferring data to and from my MacBook Pro 2012 , I constantly use it as my primary memory unit , I just plug it to my Mac for an entire day to watch movies . I would definitely recommend it to anyone.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 May, 2017", "reviewer": "Yesvanth Sv"},
{"rating": 5, "title": "Neat little package", "review": "It is well built with 3 year warranty. I registered the warranty on Seagate India website without any problems. The product is genuine and was in a sealed condition (Seller is RetailNet). Transfer speeds are really good. I got it for ₹6500 on Flipkart with an additional 10% instant discount from SBI debit card offer a week ago. So the final price was ₹5850. I had been tracking the price of this particular item across online sellers for a month before I found the lowest price on Flipkart. The black one was available for ₹100 less but I liked this one better for its looks. But only the top portion is Silver, the back is still black.\n\nPair it with a hard drive protection case to insure against accidental drops. After all, it's 2TB of precious data. I bought Neopack's case (₹320) and it fits perfectly with just enough room for the USB cable end to fit in so that I don't have to remove the cable every time.\n\nGo for it.", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Dec, 2016", "reviewer": "Goutham M"},
{"rating": 5, "title": "Fantastic", "review": "Really awesome, looking slim and fast.Taken 2gb file in less than 10 sec to transfer\ngo for it .. i got for just 6k in big sale", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Mar, 2016", "reviewer": "srimaan p"},
{"rating": 1, "title": "very very bad experience :(", "review": "It is only one month after delivery, device is not detecting by any systems,", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Oct, 2016", "reviewer": "RAKESH  K P"},
{"rating": 5, "title": "Awesome,compact,No power cable jhanjat", "review": "This product is by far best by segate,\nIt's barely bigger than a smartphone and sleek and beautiful.\nGo for it,Also thanks for Flippy fastest delivery service.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Feb, 2015", "reviewer": "Dhawal"},
{"rating": 5, "title": "Awesome size", "review": "Absolutely brilliant in size smaller then my 1TB backup pro plus and working is also fine till now, have used it for almost 2 weeks now", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Dec, 2014", "reviewer": "Mrigank Rishivanshi"},
{"rating": 1, "title": "WORST PRODUCT EVER I PURCHASED FORM FLIPKART", "review": "BEFORE PURCHASING I CHECKED THE FEED BACK COMMENTS BUT CONSIDERING THE SEAGATE BRAND, I CHOOSEN THIS PRODUCT. \nTHE ROLL OF FLIPKART WAS VERY GOOD AND PROMPTLY I RECEIVED THE PRODUCT WITH IN 01 WEEK TIME. \n\nPACKING WAS ALSO GOOD.\n\nTO CLEAR MY LAPTOP DATA FOR LAPTOP FORMATING , I CUT ALL THE DATA AND PASTED IN THIS HARD DISK. WITHIN ONE DAY THIS HARD DISK GOT CRASSED ( NOT SENSING IN COMPUTER)\n\nSELF TALK TO SEAGATE CUSTOMER CARE BUT THEY ARE READY TO REPLACE BUT NOT RECOVERING THE DATA.\n\nHENCE DONT BUY FRIEND SUCH PRODUCTS.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jun, 2017", "reviewer": "R.K.BHARATI"},
{"rating": 4, "title": "Overall Good Product", "review": "1. I received the product one day before the promised date from flipkart.\n2. Good Transfer speed which is usb 3.0\n3. Very light weight than u assume.\n4. Easy to handle and carry anywhere and use it.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jul, 2016", "reviewer": "Raghu Varma"},
{"rating": 5, "title": "It's really good and fashionable too...", "review": "The external hard disk I bought 20 days ago is really good, the outlook is awesome, at a glance it looks like a cute little notebook, the usb cord is long enough to keep the hard disk at a distance from my laptop, data transfer is very smooth and fast, moreover I got 30% discount on this product without any delivery charge... Thanks flipkart to bring this product to us so that we can buy it so easily.... I am  happy with this product...", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jun, 2014", "reviewer": "Saikat Das"},
{"rating": 1, "title": "Don't Buy", "review": "guys,plz don't buy it i've been cheated recently my product was got damaged so i hav issued  for warranty and when they have checked the product the p/n number on the box and p/n number on the hdd was different they will claim warranty with the p/n number on the hdd the p/n number on the hdd when they hav checked for the warranty in seagate website the warranty status is showing unknown so they hav told we can't do anything you hav to return the product frm where u hav bought and waiting for the flipkart executive reply they response to is not good at all it's better to buy it outside with feww extra penny.....!", "verification": {}, "date": "21 Feb, 2015", "reviewer": "uzumaki"},
{"rating": 3, "title": "Good product from Seagate", "review": "Seller: WS Retail\nOrder Date: 23 June, 2014\nCost:  Rs. 4550\n\nTested it on my windows 7 laptop with usb3.0 .\nIt works fine with approx 50-70mbps transfer speed for a single large file (like any 7GB blue ray movie).\nTransfer Speed is 18-20mbps (bit low) for multiple files smaller in size (like multiple 800mb-900mb OR 1 gb movie files)\nHowever its quite light in weight and looks good. But need to be bit careful while carrying as it looks fragile(may be its not never tested that ;) \nNot too much heated while using for long hours.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Aug, 2014", "reviewer": "Saurabh Rawat"},
{"rating": 1, "title": "Stopped working after using it twice.", "review": "This  product stopped working the next day it arrived.I had only used it twice at that point.The third time i plugged in, It gave a message, \"the hard drive cannot be read on this computer.\" I tried reconnecting it several times, but it didn't' work. It is better to purchase this product from a store then to buy it here as this product cannot be returned or exchanged in case its defective as it is in this case. Highly disappointed with this product and the return policy of flipkart. This purchase deserves a negative star, not even one.", "verification": {"CERTIFIED_BUYER": true}, "date": "30 May, 2017", "reviewer": "Rishikesh  Parida"},
{"rating": 5, "title": "Is there any other 12mm Portable drives out there? Read on..", "review": "Hello World,\n\nI've Seagate Backup Plus slim 2TB two weeks before and thought of giving a video review. And it was not possible. I previously had a Samsung G2 320GB hence am little experienced how these portable drives perform, size factor, etc.\n\nI deeply checked all portable drives of storage capacity 2TB and found that, This is the ONLY drive of 12mm. WD Passport is wrongly mentioned of 15mm thickness in amazon.in and even in flipkart.com but Go to WD Site where it is specifically mentioned that 2TB version is of 20mm. All Adata, Samsung M3, etc. are of 20mm. I wanted a slimmest one hence went for this. Also I watched a Case opening video and found that, this drive had Internal SATA-USB Conversion and hence if drive goes bad, data recovery is possible through SATA Port. Surf YouTube for that info,\n\nMRP Mentioned on package is ?13990. On my purchase from \"Infiniti Retail Ltd\" seller in amazon.in, After SBI Card 10% discount, it costed ?6883.2 where in USA selling at $100, I had to give ?883 for country variation! Shipped from Mumbai on a Saturday and got product to Tamilnadu on Monday, with FedEx (amazon.in and FedEx rock!)\n\nAfter I ordered the product, I felt bad as price is very dynamic. Price went down for nearly ?50 for which I was able to able refund request. Instead crediting money back to Card, Folks at amazon.in sent me Cheque! And it’s of some Deutsche Bank where I don't have account hence to redeem that money, I have to spend more! (Due to Cheque collection fee from other bank!), (Cheque is collecting Dust ;-)). Then, after 10 days price fall was drastic to approx. ?7200 where I was safe only due to SBI Card Cash back\n\nPackage was Good (Seagate logo engraved is Superb cool!) and Drive as expected as thin (I felt thinner than my previous G2!) My Desktop just has USB 2.0 and drive performs Great with Avg. 34MBps on both Read/Write. CNET had reviewed this drive and found this drive performs the best on USB 3.0 with Fastest R/W Speeds. (Read it through Google-ing for it). However on a Laptop, I get Avg. 25MBps on USB 2.0.\n\nAs, many said USB 3.0 Cable is short but is exact to connect it to Laptop or Desktop's front USB. I don't worry of length, because as of now, I don't have USB 3.0 and hence it is POSSIBLE for me to use all EXISTING MICRO-USB Cables which generally connect my phone to PC. Try using those if you have such drive and have not tried it before (Surprise!)\n\nBit Techy (For Geeks): Drive when plugged recognizes to SCSI Interface and Installs to Normal Portable drive. Drive's hardware identification name is \"Seagate BUP Slim BK USB Device\". Natively Formatted as NTFS and contain propitiatory Seagate Tools and Warranty registration tool. I formatted again and got total space of 1.81TB aka 1907729MB exactly.\n\nAs if you've read above you'll be felt positive on drive. If I have list negative or disadvantage (with great difficulty),\n1. Data activity indication LED light a little different (It dims and glows as Non-intrusive instead Quick offs-ons). With Seagate Tools, it is possible to turn off this LED but I wonder why anyone would do this!\n2. LED is positioned in Top. I prefer it be located near the USB Port like it is done in WD Passport/Essentials, so that activity is visible from side.\n3. Least one. Pricey compared to Adata, Samsung, WD, etc. Eventually I expect this drive's price will reach near US price in future.\n4. Heating? Does anyone know HDD that doesn't heatup on working???\n\nVerdict is Best buy for ? I bought for and Keep going on checkout without any more confusion, as I've already done enough analysis and comparisons for you. (I've done such detailed review like on amazon.com so that people could buy with more clarity of true info and to inspire reader to write such depth reviews on products they buy).\n\nFinally for Info, HDD originally manufactured and assembled at China. So, NOT \"MADE IN INDIA\" Product :-(\n-Indian", "verification": {}, "date": "21 Oct, 2014", "reviewer": "aRvInD G.R."},
{"rating": 5, "title": "Thank you Flipkart for the discounted price", "review": "Good packing \nGenuine product\nOn time delivery\nI already had 1TB of the same type and purchased at the same price from local store,now at a discounted price got 2TB!!!!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Jan, 2018", "reviewer": "Dr. Gagan Thool"},
{"rating": 5, "title": "Wonderful", "review": "Exellent product", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Akshat Singh"},
{"rating": 1, "title": "Horrible", "review": "Waste", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Nov, 2017", "reviewer": "RAMAVATH GOPAL"},
{"rating": 1, "title": "Unsatisfactory", "review": "Don't buy it .... Worthless", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Gets the Work done", "review": "Size - 10/10\nDesign - 10/10\nSpeed -  9/10\nMore slimmer than WD variant.\nLarger Folder>10gigs, single multiple files will take more than 20 mins\nLarger Files>10gigs,  single multiple files will take less than 15 mins\nSpeed  totally depends upon your copied destination and file types and size. \nI've got Wd 2Tb and in compare to it, Its pretty accurate and similar @performance.\nBut seagate wins as its more compatible.\nBought it 6100 @ Flipkart summer sale 2017.\nIf you get better offer than this, don't you dare to skip it.\nNo worries for warranty claim as Flipkart invoice is legit.\nAlso you get data recovery option @ minimal price via Seagate. \nYou can check it out while registering your hard drive for warranty.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Oct, 2017", "reviewer": "GupteS"},
{"rating": 1, "title": "Don't waste your money", "review": "Not working friend please check .", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Oct, 2017", "reviewer": "sekh monsur ali"},
{"rating": 1, "title": "One Star", "review": "The hardrive is not working", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jul, 2017", "reviewer": "Manmohan Singh"},
{"rating": 1, "title": "Horrible", "review": "Deliberately cheated by flipkart. Got defective product and my return request was cancelled without prior intimation", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2016", "reviewer": "Avinash  reddy"},
{"rating": 5, "title": "Smaller than your smartphone", "review": "Product:\nPros:\nThis is a cute little thing, black, matt finish, 11cm x 7cm x 1.2 cm, it will easily fit into your jeans pocket without discomfort.\n\nTransfer speed - average 45 mbps to 85 mbps from the hard drive of your computer, average 30-35 mbps from another seagate external hard disc.\n\n931 GB available space.\nCon:\nThe only con is the USB connecting cable is short, a bigger cable would be better.\n\nFlipkart:\nThis was my first trial of - \"In-a-day Guarantee Delivery\".  I ordered the proudct from Kolkata on Friday around 5:30 using my mobile Flipkart App (a great app on its own) the product was delivered to me on Saturday around 8:00 PM - I would rather wear 10 hats to just take them off for Flipkart and bow.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Apr, 2014", "reviewer": "Santanu Ray"},
{"rating": 5, "title": "Very happy with the product!", "review": "Hard disk is very compact and the colour blue looks really good. I have been using portable hard disks for 8 years now (own 3 already) and i know how valuable this gadget can be. All in all, love the compact size and capacity of hard disk.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Aug, 2016", "reviewer": "Atanu Bagani"},
{"rating": 1, "title": "Worst experience ever!", "review": "This hard drive sucks as well as flipkart Return Policy.\n\n*Previously they had deleted my Whole review which was Negative about seller and flipkart to look product good positive, but hey, you can't stop everyone... So _|_   ('--')  _|_", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Mar, 2016", "reviewer": "Sandip Chauhan"},
{"rating": 5, "title": "Awesome Seagate - Auto Created Review by Flipkart", "review": "\"Awesome product and stellar deal at flippant. The cloud drive is like icing on cake.\" This was an auto review written in my name by Flipkart. Seriously, you have no right to use any content in my name without my permission. Top it up, they themselves pronounced it as \"Flippant\" instead of \"Flipkart\". LOL", "verification": {"CERTIFIED_BUYER": true}, "date": "24 May, 2016", "reviewer": "Vipul Singhal"},
{"rating": 5, "title": "Aswome Product.. :-)", "review": "1.Sexy Look..\n2.Very fast..\n3.USB 3.0\n4.Best Build\n5. No Heating\n6. Pocket-friendly\nAnd More....\n\nMore than satisfied.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Jan, 2015", "reviewer": "Ashu Singh"},
{"rating": 4, "title": "Worth the money", "review": "Design is good and it is easy to carry. Copying speed varies depending on the type of file but for videos copying speed is 100-130 MB/sec. Since, it's only week before I have purchased the product so more reviews I will give later on.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Aug, 2017", "reviewer": "Akshat Jain"},
{"rating": 5, "title": "Good Product", "review": "Have used this product till now. Brought this 2TB in last month after a lot of comparison with WD as I had 1TB from WD. This really fast in performance and slim enough to keep it most of the place...", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Jan, 2016", "reviewer": "Kunal Rout"},
{"rating": 5, "title": "awesome", "review": "it is the best ..... trully slim and trim :) .....compact in size,, fast and the color silver is also excellent", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Feb, 2015", "reviewer": "Shivanjali Bhoite"},
{"rating": 5, "title": "amazing performance", "review": "i just received my order before time and just started using it on the go my drive is almost full but it isn't slowing down at all m satisfied with the product its been 2 months using my drive", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Jul, 2014", "reviewer": "chandan singh"},
{"rating": 1, "title": "Don't waste your money", "review": "IT'S NOT SHOWING IN MY PC, LAPTOP win 8.1,2nd laptop win 10. It's showing that a drive is inserted in device and manager but not showing in my computer", "verification": {"CERTIFIED_BUYER": true}, "date": "24 May, 2017", "reviewer": "BIPLAB MISHRA"},
{"rating": 5, "title": "Believe Me U will not Regret After buying Any Seagate Hard-Disk", "review": "Awesome product...very slim...weight is also less...I have been using this for over 2-3 months..Must buy if u r planning to buy a 2TB HardDisk", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Aug, 2015", "reviewer": "Bilal"},
{"rating": 5, "title": "Compact & Light weight", "review": "Its very light weight and compact, which can be easily fitted in your pocket. Power of USB 3.0 makes data transfer super fast.\n\nI wanted to buy USB 3.0 pen-drive, but found this (500GB) more suitable for me to carry in pocket similar to mobile phone, because its length is smaller that Samsung Galaxy S3 and width & height are almost same.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jan, 2014", "reviewer": "Neeraj Tyagi"},
{"rating": 4, "title": "Awesome $ Compact hard drive for usb 3.0", "review": "its a nice hardrive i have ever purchased from flipkart . its size is perfect which will fit in your pocket perfectly . design wise it is very slim handy sleek $ cute hard drive . i had purchage it at 4800 rs. its usb cable is as long, you can connect to your device . i had got 931 gb of space  out of 1tb as well in my indernal 1tb hard drive of seagate. it gives average 25to 30 mbps writing speed  and  35 to 40mbps reding speed on usb2.0. in usb 3.0 it gives averagly 50 mbps  speed im not satisfied with this product . after some days its speed  goes straightly down the hill from 105 to 40 mbps in usb 3.0  and flipkart has not taken any action of my replacement so in the first time i fond this misbehaviour from flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Apr, 2014", "reviewer": "vivek kumar"},
{"rating": 5, "title": "Awesome Flipkart...Agian Flipkart Shows Excellence", "review": "I have purchased Seagate Backup Plus Slim 2 TB External Hard Disk.\n\nSpecifications : Usable Memory is 1.81 TB\nSlim and comfortable..\nSpeed : 50-60 Mbps write speed (USB 3.0)\n\nYou would also like to take it with you by simply putting in your pocket....!!!\n\n100% recommended........Keep it up flipkart \n\nIf you want 2 TB external Hard Drive.......Then rush for this one....!!!\n\nThanking u very much \"Flipkart\"...!!!", "verification": {}, "date": "16 Nov, 2015", "reviewer": "Dhruv Sharma"},
{"rating": 4, "title": "what to make some arrangements for mac users", "review": "At very first thanks to flipkart for fastest delivery.coming to the point this product is very awesome.My review mainly useful for macbook users that we want to make some changes in the settings for mac compatibility ,just open disk utilities after that click on seagate hard disk option than go to partition make 1 partition  and click on format  ExFat. This is one method to use the hard disk both in mac and windows or we can simple download the software called NTFS available in seagate website and install in macbook air.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Jan, 2015", "reviewer": "venkatesh daliparthi"},
{"rating": 5, "title": "If youre confuse between Seagate and WD ... just go for this one", "review": "I was really confuse between Seagate backup plus slim and Wd ultra passport .. and finally i bought this and it was my best decision. Speed is good, look is good, quality is good i didnt found any cons . while in WD 2 of my friends has problems regarding the cable .. dont think anything just go for it :)", "verification": {"CERTIFIED_BUYER": true}, "date": "10 May, 2015", "reviewer": "Smit Christian"},
{"rating": 2, "title": "Good Product but Major Oversight by Vendor", "review": "The Seagate External drive was delivered on time but to my surprise the product was black colored and not the silver one I had ordered. For me, this is extreme carelessness on the part of the vendor. My need for the drive was great, so it will only cause major inconvenience to return the product and wait for it to be replaced by a new silver colored drive. So, I have decided to start using it anyway. Drive looks slim, and is light-weight, and it took less than half an hour to transfer >100 GB into the drive. Happy with the functionality but cannot forgive the major oversight of Flipkart/vendor. Two stars.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Sep, 2015", "reviewer": "Lakshman K"},
{"rating": 5, "title": "Excellent Product", "review": "This External hard disc is really looking good. The size is very compact unlike it is displayed(looks big in advertisement) and easily fits into one's pocket. Speed of data transfer is amazing. \n\nRating this product with 5 Stars.\n\nThanks,\nRaghavan", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Jul, 2015", "reviewer": "Raghavan S"},
{"rating": 5, "title": "Cool design with fast performance", "review": "This is arguably the best looking drive on the market. The brushed aluminum face looks superb and makes a style statement sitting on your desk. Will look great with a mac. The speed is great too. I copied about 15GB of data using the USB 3.0 port and it took about 3-4 minutes. Very happy with the product. The seagate utility is an added bonus for backups etc.", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Jul, 2014", "reviewer": "Shubhro Mukerjee"},
{"rating": 5, "title": "Amazingly fast sexy little BEAST !", "review": "First of all don't care about the WIRED tag on the Flipkart page, this drive is internally powered. It's ridiculously fast and ridiculously thin for a 2TB drive. It's smaller in size than my OPO and just a bit thicker ! This drive has been rated among the best external storage devices on alomst all sites and is a real steal for the price. White one looks truly stellar. So hurry up, buy this piece of beauty !!\n\nps: Flipkart guyz remove the WIRED tag it's ambiguous", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Jun, 2015", "reviewer": "Rakesh"},
{"rating": 5, "title": "Wallet size - slim - fastest copy", "review": "Actual Space 931GB\n100 GB copied in 55 minutes with my HP Ultra sleek book Laptop (I3 Processor)\nSlim & wallet sized. Though its a 1TB HDD u might want more...", "verification": {"CERTIFIED_BUYER": true}, "date": "2 May, 2014", "reviewer": "Ajaykrishnan V"},
{"rating": 5, "title": "A Baby So Slim is Seldom Found!", "review": "Now this one from Seagate is worth a buy it comes with mesmerizing looks,slim and yes the slimmest! light weight,small in size and can easily slip in your pocket.The power light is sleek and bright which you can turn on or off from Seagate Dashboard! The back up software is good and user friendly,you can make backup plans for your removable devices or for your entire PC(takes quite a while though) also you can backup all your social media contents from Facebook,Twitter And Flickr by just signing in and all contents starts downloading right into your hard drive! USB 2.0 gives a sustained speed of about 26 Mbps and I guess USB 3.0 will give around 85 or somewhat like that,and this drives comes with exciting flavors(available on Flipkart),I mean colors :-P .... The USB cable is a short one but not much of a problem and dont forget to register your product via the Seagate Dashboard software... a 5/5 rating just go for it!", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2014", "reviewer": "ANUBRATA KHAN"},
{"rating": 2, "title": "Super!", "review": "My Hard disk was not detected after 7 months of usage. Even though I used for minimum times. Since it was in warranty period, I went to service centre for replacement. They checked and ready to provide new hardisk within 10 days. But for data recovery, asked ₹12500. Since I do not have any important data, i said a Big No. I also got the 1 TB in another color within 10 days BUT IT IS REFURBISHED condition.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Sep, 2016", "reviewer": "Sriram Sundar Subramanian"},
{"rating": 4, "title": "Great!!!", "review": "This one is  a nice hard disk. But don't get misguided that only this \"slim hdd\" could be used to back up your Mac data. You can even use a simple one which is not slim and 800-1000 rs cheaper. If you want to go for the look then this is a good choice otherwise both the models of HDD will work on your Mac or any other comp. Transfer speed of data is also nice.\nwhen i connected two of my HDD to my Mac and started transferring the data, 30GB got transferred in just 6-7 mins.\nI will not forget to mention the Flipkart service which is as awesome as it has always been.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 May, 2014", "reviewer": "Naushad Ansari Jaipur"},
{"rating": 1, "title": "Utterly Disappointed", "review": "I have checked after 20 days beacuse i am on tour and found defected piece with clicking sound", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Nov, 2016", "reviewer": "AMIT KUMAR VERMA"},
{"rating": 1, "title": "Bad Product", "review": "I got bad disk only after 5 months of purchase date. It is very fragile.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Nov, 2016", "reviewer": "ADARSH KUMAR"},
{"rating": 5, "title": "Best in business for backup solutions", "review": "If you are looking for a mass storage option then i would recommend to go for it. Seagate is the best and assured brand so it is better to to go with best than the rest. When i was looking for a hard disk drive I shortlisted 3 brands Dell, Western Digital and Seagate. These are the most trustworthy brands whose name is enough to convince the buyer. Dell is quite high priced though. Then you are left with two best priced brands seagate and WD. I leave the choice upto you but i would recommend seagate as it offers an extra 200gb onedrive data that is beneficiary. Talking about the delivery Flipkart was quick and safe in delivering the product. Also you won't find a better price range elsewhere. So go for it.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Oct, 2016", "reviewer": "Ajinkya Deshpande"},
{"rating": 5, "title": "how to get warranty!!!!!!!!! :)", "review": "you must go for it guys............it covers 3 years seagate india warranty!!!\n\nby reading previous reviews it was clear that a lot of guys having warranty registering issues..........so here is the right way to register -\n\nStep 1- plug your hard drive to your computers USB and turn ON your internet .\n\nStep 2- register your hard drive by the \"setup\" application provided in your hard drive already by seagate.\n\nStep 3- by opening \"setup\", a web browser window will pop out .(your internet connection must be on before this step),\n\nStep 4- now this browser would take you to a seagate registration page .\n\nStep 5- here you suppose to give your name and email address and check or skip 2 other steps , by completing these steps click done  and  vyollaa!!!!!! u r registered for 3 years seagate india warranty.\n\nStep 6- now you guys can check for your warranty validity on seagate india website, just enter  \"serial no.\"  and  \"seagate port no.\"  mentioned on your hard drive or on its packaging and after entering,  ur warranty validity will be displayed which is 3 years from the date of purchase.(here u suppose to enter port no. only because providing model no. didn't work for me)  \n\n                             so here's the thing guys....... no other brand provides as slim HD such as this, i think its the slimmest in it's category , very portable , great looking premium feel and on top of all reasons..............it covers you for 3 long years!!!!!!!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "31 May, 2016", "reviewer": "satish singh"},
{"rating": 4, "title": "Value-for-money", "review": "Read and write speeds are good in USB 2.0 . A noise/clattering sound is heard if the HDD is physically displaced while the data is being transferred. \nHowever , 200GB Onedrive Cloud Storage is not provided as mentioned.\nApart from that, the product is good.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Oct, 2017", "reviewer": "Pavan Aithal P N"},
{"rating": 1, "title": "Bad experiance", "review": "After 3 months of usage the product is not working now. When I'm connecting to the PC it's not even detecting.\nTried changing the cable and still it's the same issue. When I tried contacting the Seagate team, they informed that I have to give it somewhere else for the recovery, the'll give permission that the warranty won't be void. (They assured they  will be providing the warranty or replacement, but not recovery )The recovery charges outside are more than the price of the Hard disk. The sole purpose of the purchase of hard disk was Backup of files and now I have to pay again to get my backed up files,", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "VARUN VASUDEVAN"},
{"rating": 1, "title": "Terrible product", "review": "got defective product...just worked for two days... only can hear the sound frm the harddisk..computer not detecting the harddisk .....no light also..fed up with the flipkart products...most of the time getting defecgive product...3 years before i bought lumia 920...that was also defective...", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jun, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Utterly Disappointed", "review": "Product is not working..", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Sep, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "worst hard drive", "review": "it has gone dead after 5 months.I lost all my data.Dont buy this.. It produces very much sound.it is not worthy", "verification": {}, "date": "1 Sep, 2015", "reviewer": "Utkarsh Bansal"},
{"rating": 5, "title": "fastest 2tb HDD in the market", "review": "packing was good and delivery within one day....Plus you get 200GB free onedrive space for 2 years.. seagate is the best!!..", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Aug, 2015", "reviewer": "lookin"},
{"rating": 5, "title": "Its amazing...", "review": "I purchase it in starting of Feb-15.\nIts working well and fast.\nWeight & size are allow us to carry it in pocket too..", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2015", "reviewer": "Naresh Vohra"},
{"rating": 5, "title": "This Rocks", "review": "slim and useful cute and stylish product for my needs and backup space and speed is above my current limit of data this product is awesome and obviously Seagate is one of the best in hard disks...........good job flip kart...........!!!!!!", "verification": {}, "date": "3 Aug, 2014", "reviewer": "ismail asad ruknuddin"},
{"rating": 5, "title": "Seagate EHD......really slim", "review": "EHD is slim, lightweight, and faster than average so nice product.\n............................................................................................................................................................................................................................................................................................................", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2014", "reviewer": "CA Kamlesh Chauhan"},
{"rating": 1, "title": "Worthless", "review": "Never buy Seagate hardisk....", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Mar, 2018", "reviewer": "sabari krishnan"},
{"rating": 5, "title": "Simply awesome", "review": "Best product.It is compatible and good to be used.i received it after 2 days of ordering.My suggestion is sure go for it.Its worth the money..No probs whatsoever since buyin it.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Mar, 2018", "reviewer": "santhosh"},
{"rating": 4, "title": "Best product", "review": "Delivery on time packing was also good.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Mar, 2018", "reviewer": "Dayanand Surwase"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Nice", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Mar, 2018", "reviewer": "Suraj Mittal"},
{"rating": 5, "title": "Best in the market!", "review": "Awesome...\n\nAble to use both in mac and Linux with the software provided with hard disk.\nBig thumps up to that...", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2018", "reviewer": "Sumith  P"},
{"rating": 5, "title": "Great product", "review": "Nice istem", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "Ganesh Gani"},
{"rating": 5, "title": "Simply awesome", "review": "The product was delivered with the original sealed packing when we have so many roumers for online delivery . I am happy to receive it at much lower price from flipkart. Thanks flipkart for making it a very good experience.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Quick delivery but has heating problem", "review": "Excellent timing got in one day but the hard disk has heating problem it become hot after a connectivity of an hour .", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Just okay", "review": "Gud product", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Feb, 2018", "reviewer": "Mani K"},
{"rating": 1, "title": "Utterly Disappointed", "review": "I bought this product 20 days ago. But now it is not working. Total wastage of Rs 6000.flipkart return policy is only for 10 days. So Flipkart did not take any responsibility. \nSo I suggest to all not to buy any hard disk or electrical equipment from Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Jan, 2018", "reviewer": "Sudip  Mondal "}
]