[
{"rating": 4, "title": "Pretty good", "review": "My honest opinion about this device after 7 days of use \n\n\nPROS:-\n \n1) price - main pros is its price \n2) built - built quality is really nice \n3) display - it has 720p hd display which is very good at this price \n4) battery - battery is good easily. If u r very heavy user it will easily last for 1 day . Normal and medium user it will last to 1.5 to 2 days \n5) speaker - speaker is nice because of placement of speaker with dolby atmos which will givd u crisp sound\n6) charging - charging time is also good it charges 5000mah battery in almost 3 hrs which is good in my opinon\n7) processor - although it do not has poweful processor but found no lag ( i m not a gamer but a moderate user )\n8) memory - 3gb ram and 32 gb rom is very good deal in this price \n9) ram management - it has very good ram management at this price point \n10) fingerprint - finger print sensor is also good in my opinion \n\nCONS:- \n\ncamera - the only con is camera is not that good as expected but u can take some desent (average) pics but do not expect too much with camera\n\nSome other thing like i have faith in moto brand because earlier i used moto g3 which i loved a lot and moto has good reputation in the market and also flipkart service is also very good in my opinon. So if u found this review helpful do like this review :)", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Aug, 2017", "reviewer": "karan kukkar"},
{"rating": 5, "title": "THOSE PERSON BUDGET 10000 SHOULD BUY MOTO E4 PLUS", "review": "ALL GOOD ABOUT THIS PHONE\n1.GREAT 5000mAh BATTERY.\n2.EXCELLENT CAMERA BOTH REAR AND FRONT.\n3.LATEST ANDRIOID 7.1.1 NOUGAT .\n4.32GB STORAGE AND 3 GB RAM.\n5. FINGERPRINT SENSOR.\n6. SUPERB PERFORMANCE\n\nALL THIS IN 9,999.\n\nTHOSE PERSON BUDGET IS 10000. FOR NEW PHONE HE SHOULD GO FOR THIS PHONE MOTO E4 PLUS. 10 STARS..", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jul, 2017", "reviewer": "Prasad Patil"},
{"rating": 5, "title": "Excellent Product", "review": "Recieved delivery very fast before 48 hrs\nI write after 12hrs use\nBoth Camera is good\nBattery is as per specs 5000mAh\nBefore long back I purchased Moto X play, I feel like same\nDisplay is good\nSmooth lag free working \n\nRegds", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Ashok Patel"},
{"rating": 5, "title": "Awesome", "review": "Got it today \nAs expected nice product Moto never disappoints\nBattery is too good \nFingerprint works like charm\nSound is good after Dolby Atmos its too good \nRear camera is good \nFront is ok \nIron grey look nice \nCall quality is too good jio works without any problem\nEverything is nice \nOverall an awesome product", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Deepmani"},
{"rating": 5, "title": "Must buy!", "review": "Awesome phone\nThere is no problem in phone like other says negative about battery and camera.\nLook and finishing of phone great\nCamera is ok\nCharger working fast full charged in 1.5 hours\nBattery long lasting\nProcessor is little cheap but works fast\nBetter phone than Redmi note 4 and Redmi 4\n\nDefinitely buy phone blindly love in Moto", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jul, 2017", "reviewer": "Tanay Ghosh"},
{"rating": 2, "title": "Could be way better", "review": "Why not Snapdragon?\n\nSame phone launched in US with Snapdragon processor\nAnd India with MediaTek?\n\nMoto E 1 (Snapdragon 200)\nMoto E 2 (Snapdragon 410 LTE)\nMoto E 3 (MediaTek MT6735P)\nMoto E 4 (MediaTek MT6737P)\n\nWe expect Snapdragon Chipset from Motorola only because E series started with Snapdragon and reached so far with MediaTek.\n\nDisappointing..", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jul, 2017", "reviewer": "Akhil Kankonkar"},
{"rating": 5, "title": "Excellent product for the price!", "review": "Pros:\nGood camera\nbattery life - single charge will go for days.\nLow power consumption\nAndroid N\nSingle button which can be used for finger print and multiple operation. If you don't like the back & home button displayed on the screen and is taking up space then configure moto actions and display, this is very useful. Then you get the whole screen and you can use the single button for various things, explore it.\nLot of features added to this phone. I am impressed.\nDolby sound. Very good.\nHD display. I was watching a movie and display is clear.\nFlash for front and back camera which is useful.\nNo heating issues yet with multiple apps opened.\nDifferent display mode for night and day . You can set the time your day starts and ends.\nNo issues with Wi-Fi range. works well.\nLook and feel is good.\n\nCons:\nIt is difficult to open the back cover. I struggled to open it for putting the SIM and SD card. Moto should have done a better job on this.\n\nOverall good job Moto!", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "One Star", "review": "Not good very heavey and touch is not working properly when charging \nWhen ask to support regarding this they reply that do not use the phone while charging \nCamera was not as per Motorola phone", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Aug, 2017", "reviewer": "Dhawal Patel"},
{"rating": 5, "title": "Awesome product", "review": "Pros...\nBattery backup is good since it is 5000mah\nRapid charging is good it charges in 1-2hours\nRear camera is average\nNo heating issues but while charging it heats slightly\nFingerprint sensor is good \n5.5 inch screen but not full hd\n3gb ram\n32gb rom \nAndroid nougat 7.1.1 out of the box is great\nStock Android from Google is great\nMoto display is good we can see notifications\nSplit screen makes us use two apps at one time\nOne button navigation is awesome\nDedicated slot is which everyone wants\n\nCons...\nMediatek processor which makes the phone slow\n\nHeavy weight\nWiFi is bad which shows no internet \n\n\nI recommend it if your budget is less and I don't if your a selfie lover but it is good overall performance is awesome without internet any phone is nothing and for that I thanks jio which makes internet low costs if this are r any mistakes I'm sorry", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jul, 2017", "reviewer": "Sai sanketh Reddy"},
{"rating": 1, "title": "Bad Experience", "review": "CONS:\nTouch screen is not working properly while the phone is in charging.\nBack camera is not of good quality.\n\nPros:\nFront Camera is good\nBattery lasts more than a day.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Nice product", "review": "Well just with one day of usage I would like to comment -  it's a basic budget phone with few features added to gain attention and remain relevant in market. \n\nDisplay is bright, HD and does the job. \n\nCamera was disappointing in few indoors pics I tried,  maybe it's okay in outdoor. \n\nHandset speakers are good. \n\nMain compromise moto did is with  processor. Slight lag was evident from day one.  However,  it should be okay for basic usage like WhatsApp, Facebook, insta etc.  I personally felt moto should have put snapdragon even if prices increased by 1k.  It would have been a complete device then. \n\nThe hype about os,  I found bloatware present i.e unjustified memory blockage.  \n\nSo my verdict -  moto has huge fan Base and brand value,  those who want the  best of moto,  they can go for it,  it looks elegant,  slightly heavy owing to battery and overall good device for regular use.  I purchased it for my dad for mails and social media. \n\nBut those who are after performance and tech fanatics,  I would say this was moto's try to compete with Redmi Note 4 but choice of processor and excess loyalty to Google spoiled the fun.  \nSo, who should purchase? \n- first time 4G upgraders with limited usage,  govt/corporate people who need better back up,  moto fans and all those who need a decent  device under 10k.\n\nMobile photography enthusiasts,  Gamers,  tec savy guys, you won't be happy for sure! \n\nHowever, the biggest spoiler is,  Made In China  :P\n\nHope it helps :)", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Akashraj  Ghosh"},
{"rating": 5, "title": "Fabulous!", "review": "Just received motoe4 +, after using it for 1 day. Experience is awesome. Go for it. Highlights are..battery backup, looks awesome golden color, camera average, no lagging.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jul, 2017", "reviewer": "Aman Gupta"},
{"rating": 5, "title": "Highly recommended", "review": "Something above expectations\n\nI m satisfied with this product, it is not the best phone but it is very good\n\nPro's:-\n5.5 inch HD display under 10k\n\n5000 mah battery\n\nAndroid 7.1.1 nougat( stock android)\n\n3gb ram / 32gb ROM\n\nFingerprint sensor\n\nStunning design\n\nNo hybrid SIM slot\n\nExpandable memory upto 128gb i.e greater than just 32gb of Moto c plus\n\nGood camera\n\nCon's:-\nMediatek processor, even 1.2 quad core Snapdragon 410 would have been better\n\nWeight 198 grm\n\nFinal verdict:-\nGuys if you compare it redmi 4 i.e 3gb 32gb(rs8999) variant then i would recommend this product", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Swapnil Danke"},
{"rating": 3, "title": "Does the job", "review": "Good Phone .looks is awesome .\nFront camera is not so good.\n14 hrs battery backup on normal use of internet  .\nheating issue at the time of charging .\nmany a time finger sensor gets totally hang .\nwhile video calling front camera clearity is very very bad ,works as a vga camera .", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Aug, 2017", "reviewer": "Chandan Rout"},
{"rating": 1, "title": "Waste of money!", "review": "Please don't purchase this model?\nProcessor is 125 GHz only less than 1.3 GHz\nScreen Size is 5.46&quot; only less than 5.5&quot;\nBluetooth virson is 4.1 less than 4.2.\nHeating issues,\nPlease check it by App 'CPU Z'", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Oct, 2017", "reviewer": "Pankaj  Singh"},
{"rating": 5, "title": "Wonderful", "review": "After Using 3 days I am writing.\n1- Battery Backup 10/10\n2-Camera 8/10 \n3-Fingerprint 10/10 No lagging found\n4-Processor Not much into Gaming so 10/10\n5-RAm 10/10\n6-Sound 10/10\n7-Built-Heavy due to 5k battery can be ignored 10/10\n8-Display 10/10\n9-Headphone-8/10\n10- OS Nougat- 10/10\nOverall Must Buy for below 10k segment", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jul, 2017", "reviewer": "Amit Belwal"},
{"rating": 5, "title": "Packing the features in a limited budget.", "review": "I have written this comprehensive review keeping in mind that I have bought a phone which is within the Rs. 10K limit. So, there will be no grousing on Corning Gorilla Glass, NFC or Qualcomm Snapdragon processor in this review.\nThere are a bunch of unexpected Pros and Cons in the device. I will elaborate each striking feature so that it will help my fellow buyers in deciding if the product will suit them or not. \n\nPros: \n\n1. 2.5D Glass: This is exemplary for a phone in this budget. Together with its metal body design and embedded camera (similar to 5th Gen G-series), this phone gives an undoubted premium look. \n\n2. Dolby Atmos: The Moto E4 Plus is an audible delight. It outperforms Moto G5 and Moto X1 with its speakers as well as audio jack delivering one of the best sounds you can expect from a smartphone. \n\n3. Android 7.1.1 with 3GB RAM: There a quite a few Android Nougat phones in the market and owning the latest Android is something to brag. But it is essential to have sufficient RAM to utilize your smartphones to the fullest. My average RAM usage for 24 hours is 1.7 GB. Having a 2 GB RAM would be dreadful for both the product as well as the user. \n\n4. 32 GB ROM: The internal memory is sure to fulfil every user’s needs. With enough and more space for apps and multimedia, Moto has given a really good deal within 10K. It is commendable that Moto maintained a dedicated slot for expansion rather than a hybrid slot. \n\n5. 5000 mAH Battery: This striking feature at the product launch is efficacious. With rough usage, the battery ended the day at 33% which is indeed remarkable! Under fair usage, the battery may last 2-3 days. \n\nCons: \n\n1. Camera: Although the camera specifications look promising, it doesn’t perform as expected. The quality is average but not bad. If someone is looking for a great camera smartphone, this is not the one. \n\n2. Non-removable battery: For most users, the whole purpose of a removable battery is to shut down the mobile if it gets hanged. In case of a non-removable battery, you will have to wait till the charge drains completely. Considering a 5000 mAH battery, it would inconveniently take days till you run out of charge. Hopefully, Moto has designed a counter feature to prevent this occurrence. \n\n3. Moto gestures: Moto did a pretty good job by providing gesture operations for camera, flashlight, etc in higher models. Moto E4 plus is an incomplete smartphone without these features.\n\nNotable mentions: \n\n1. LED notification light: Many customers these days search for this feature. A cute little fancy dual colour notification light exists in this device to content the users. \n\n2. Performance: The MediaTek Quad Core isn’t really that big a disappointment! It runs Asphalt 8 and NFS No Limits without any lag though a certain lag is experienced while launching such games. \n\n3. Turbocharger: One must not be too keen on this feature as Moto E4 Plus is not equipped with USB type-C. The 10W charger just ensures that the mammoth battery charges quicker than conventional 4-6W chargers.\n\nI know this might be one of the longest reviews on Flipkart, but if you liked it please give a thumbs up.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jul, 2017", "reviewer": "Niall Miranda"},
{"rating": 2, "title": "Not good", "review": "battery - very gud, \nboth cameras - very bad\nHeadphones - very very cheapest quality\nSensor - gud\nProcessor - average\nLook wise - very gud\nPacking - totally cheap and damage box\nI gave 200rs for guarantee but Where's my guarantee card. It's not in box", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Jul, 2017", "reviewer": "Jaskirat Singh"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Front camera -6/10\nRear camera-7/10\nDisplay-8/10\nProcessor-7/10\nVideo call-6/10\nRAM-8/10\nSpeaker-9/10\nFingerprint-9/10\nAndroid-9/10\nBattery-10/10\nEarphone-6/10\nPremium look and best phone in this range.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "VIVEK KUMAR SINGH"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Forget REDMI .this is the best phone in this price .no issues at all .No hanging problem .No heating ,just perfect . JUST GO FOR IT", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "RAHUL Saini"},
{"rating": 1, "title": "Very Good", "review": "\" microphone isn't working well \" or else everything is good and coming to replacement process it's worst Flipkart should seriously consider it..", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jul, 2017", "reviewer": "Suraj varma"},
{"rating": 1, "title": "Absolute rubbish!", "review": "Only thing i can say wasted my entire money\nToaday i charged my phone 70% n on 6.30 its nil..\nGoogle apps hangs or stop working\nIncluds whatsapp but some time only\nI lost my entire collection of songs wich was cut n paste in thish device internal memory\nPlay gta for hours little heat issue..\nCamera is worst ..\nLenovo does this to all its device\nGood display\nEven some time touch did not work but its an rare case..\nHeavy device..\n40%more fatter then redmi 4\nU just cant hear video\nIn noice properly or in street a caller voice..", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jul, 2017", "reviewer": "Vinod Mantri"},
{"rating": 4, "title": "Good device for 10k with Moto Branding", "review": "Updated review after usage of 4 months. \n\nPros - \n-> Both Camera is ok (Good for this price range) + flash in front camera is advantage.\n->32GB STORAGE AND 3 GB RAM which is really great for this price.\n-> Battery backup is nice as it's 5000 mAh.\n-> Charging time - from 0 to 100 it took 2hr 38 min for me, which is good for 5000mAh battery. \n-> Before this i own Moto-g5 plus, it looks identical with minor changes.\n-> Display is good with 3d corning curve.\n-> Smooth lag free working tll now.\n-> Handset speakers are really good with loud sound. \n-> Looks ( Iron Grey). Looks superb just like a premium mobile. \nCONS - \n-> Most noticeable thing is - mediatek processor. so u can't expect very speed and performance so if you are into games and all I don't recommend this. \nSame phone launched in US with Snapdragon processor, this is sad part of it.\nHere is the other moto E series phones.\n\nMoto E 1 (Snapdragon 200)\nMoto E 2 (Snapdragon 410 LTE)\nMoto E 3 (MediaTek MT6735P)\nMoto E 4 (MediaTek MT6737P)\n\nWe expect Snapdragon Chipset from Motorola only because E series started with Snapdragon and reached so far with MediaTek.\n\nHit 'Like' if you like the review. Thanks", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jul, 2017", "reviewer": "Rahul verma"},
{"rating": 1, "title": "One Star", "review": "dedected piece , switch off and on automatically ,fingerprint scanner is not working properly also ,and hand too much need to off\nrequest for return /replace", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Good choice", "review": "Everything is nice about the phone except the following flaws:\n1) camera both rear and front is ordinary, below standard than of Moto G4 or G5 plus\n2) display and daylight visibility could have been much more better\n3) Battery is less functional than ASUS Zenfone Max\n4) ordinary MediaTek Quad Core processor\n5) touch is not smooth as Moto G4 or G5 plus", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jul, 2017", "reviewer": "Nitu Sen"},
{"rating": 4, "title": "Very Good", "review": "Best smartphone under 10K.\nAll these specifications you find in this device usually cost around 12k with other brands.\nMetal body gives a perfect look to the smartphone (Also, a bit heat up too)\nThe screen is 2.5D curve makes the smartphone even more stylish.\nCamera is decent as expected under a 10K smartphone.. no complaint.\nNo hybrid slot as Xiomi, dual sim + seperate slot for memory card\nNow, the main CON of the device, mediatek processor. You will notice the difference at the very first moment with the speed amd performance so if you are into games and all I don't recommend this.\nFingerprint sensor is average.\n\nOverall the smartphone is 4/5, great value of money.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Anshul  Saini"},
{"rating": 2, "title": "Not bad but also not good", "review": "The phone does not worth RS 10k.\nApps are not supporting\nIt's heat while charging and  using\nExternal memory card not supporting\nCamera is not of good quality\nSometime phone hangs \n\nGood things are\nBig screen size\nLong lasting battery\nHigh speed wifi and data\nSpeaker sound is much good exllent\n\nFinally the phone is not good n not also to bad...but it does not worth RS 10k", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Aug, 2017", "reviewer": "Shivkumar shah"},
{"rating": 1, "title": "Very poor", "review": "Please dont buy this phone,, I am using 2 days  it starts hang and automatically screen slide down and up..", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific", "review": "Simply one word about it.... It's awesome...Thank you Moto.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jul, 2017", "reviewer": "Vijay Kumar Msd"},
{"rating": 1, "title": "Utterly Disappointed", "review": "Camera quality is not good.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jul, 2017", "reviewer": "Vijay Bhaskar reddy"},
{"rating": 3, "title": "Does the job", "review": "Most tempting mobile of this year so far in this range. Bought this mobile only for the reasons - battery power, brand name and the camera quality.\nImpressed with battery, but very much disappointed with the camera. Camera is more or less same as redmi.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jul, 2017", "reviewer": "Lingareddy"},
{"rating": 4, "title": "Really Nice", "review": "Pros:- \n5000mah battery, awesome battery life\nRam 3gb\nInternal 32 gb lots of memory storage\nCamera 13/5 with led flash light,front & back\nQuadcore Mediatek processor,1.5ghz\nMetal body with good looks\nDual SIM slot,not like hybrid slot like redmi mi phones, with one memory card slot\nIps screen 5.5 inches with gorilla glass with 2.5D curved,\nLatest Android Nougat\nDolby Atmos sound\nGPS,Fingerprint sensor,OTG,4G LTE support\n\nALL OF THESE FEATURES AT JUST Rs 9999 AND VALUE FOR MONEY PHONE, MUST BUY!!!\n\nCONS:-\nHEATING PROBLEM IN REAR CASE LIKE HEAVY GAMING,CHARGING TIME,\nSOUND QUALITY BELOW AVERAGE WITH EARPHONES,\nHEAVY WEIGHT PHONE (198g)\nCAMERA QUALITY AVERAGE WITHOUT LED FLASH,\n\nSameer Srivastava\nThanks.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Aug, 2017", "reviewer": "SAMEER ANANT"},
{"rating": 5, "title": "Best in the market!", "review": "One of the gem and value for Money phone yet again by Motorola..\nFew highlights:\nPros:\n1. Attractive Price\n2. 3 GB RAM work smoothly\n3. Excellent battery 5000 mhz works full day with 4g network\n4. Dolby Atmos sound too good for any video and audio\n5. 5.5 screen size and awesome display with good touch screen.\n6. 7.1.1 latest Android stock version excellent\n7. Processor works nicely\n8. fingerprint works perfectly\n9. Front camera with flash too good.\n10. One key navigation feature\n11. Dual sim with dedicated memory slot\n\nCons:\n1. Battery makes phone heavy Weight and looks bulky, 199 gram is too much weight for any phone.\n2.Mediatek processor could have been snapdragon, same as USA version, if total installed apps goes beyond 70+ affects phone performance.\n3. Back camera not upto the mark, photo quality is questionable and photos are hazy.\n4. Back cover very difficult to open up and to remove SIM-1 is like hell.\n4. If something goes wrong in warranty period , quality of Motorola centre's and arrogancey of service centre's guy's.\n\nWill give 8.5 out of 10 for overall performance, and value for Money.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Aug, 2017", "reviewer": "Bhushan T"},
{"rating": 4, "title": "Feature rich mobile under 10k....", "review": "Got it today, 14th July and after 5 hours of usage, writing this review. Hope it helps fellow buyers to choose the best as per their convinience.\n1) Battery (10/10). Main USP of this mobile. Will update more in couple of days.\n2) Android N 7.1.1 (9/10). Stock android with no problems at all.\n3) Fingerprint (9/10). Works like charm.\n4) Sound (9/10 speakers, 8/10 headset). With dolby atmos, speaker sound is fanatstic but lacks with headset. May be a better headset enhace the sound.\n5) Looks (9/10, Iron Grey). Looks superb just like a premium mobile.\n6) Lock screen notifications handling (8/10). New feature in Moto handsets, quite useful for people who get larger volume of notifications.\n7) Weight, Bulkness (7/10). A bit bulky and heavy in comparison to latest mobiles in market, but that may attribute due to high capacity battery it contains. Not a problem for people who doesn't mind a little bulky phones.\n8) RAM (8/10). Handles multitasking easily, noticed a few loading issues here n there but that is mainly due to the processor it contains.\n9) Call Quality (9/10). No problems as such as of now.\n10) Processor (6/10). The biggest drawback for this mobile is the Mediatek processor it has, though most of the mobiles in this segment comes with snapdragon but Moto chose to go with Mediatek. There is no comparison between both of these. Snapdragon is way way ahead of Mediatek. But again, to accomodate the prices under 10k segment and giving a feature rich mobile, motorola compromised with the processor. The mobile operations are a little bit on a heavier side, but works well.\n11) Screen Display (8/10). HD display (1280 x 720 Pixels) not full hd. Viewing angles are good, display scores above average. \n12) Camera (7/10). Nothing to boast of. Both rear and front camera are for namesake. Don't buy this if you are looking for fantastic clicks,it won't give u that.\n\nDisclaimer: I declare that the above review is totally unbiased and not intended to hurt anyboy's sentiments :)\nHit 'Like' if you like the review. Thanks", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jul, 2017", "reviewer": "KV"},
{"rating": 5, "title": "Just wow!", "review": "Very good features  in such a low price.battery   back up is very good.speed is fast...only weight is a little heavy due to big size battery. ..overall very good phone incheap price..I love it..thanx moto....thanx flipcart", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jul, 2017", "reviewer": "Satarupa Das"},
{"rating": 4, "title": "Excellent with very few cons", "review": "The device is excellent for this price. 3 GB RAM and 32 GB Storage at this price is amazing. After a day of usage,\n\n1. Camera is not so good, but not a deal breaker though.\n2. Touch has some issues here and there when you flip to next page etc. That's slightly an issue till you get used to it.\n3. Battery is just wow!\n4. Fast in terms of performance.\n5. Of course, the weight bothers you if you are an \"always on mobile\" type of user. \n\nDefinitely worth the money. But as I compare it with my Moto G3, this is slightly below the standard.\n\nBuy it. You won't regret.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "VR"},
{"rating": 3, "title": "Nice", "review": "This product have two major cons 1- very very heavy n bigger in size so not handy .2 camera is worst even 2 mp of Nokia phone can take better pictures n record videos. U can not use camera .\nOtherwise everything is awesome performance,os , fingerprint scanner ,design , speaker ,display ,Moto action n display feature is worth.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jul, 2017", "reviewer": "Shivam Tiwari"},
{"rating": 5, "title": "Great product", "review": "Real value for money", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jul, 2017", "reviewer": "Sagar kadam"},
{"rating": 5, "title": "Awesome Mobile under 10k", "review": "Right Now Best Mobile under 10k.\nGood Camera\nGood Display\nAwesome Battery \nFinger sensor little bit slow but it's ok.\nBest sound quality because Dolby sound installed in this phone.\nRecommended to everyone.\nDon't Think just buy.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Istkar Ali"},
{"rating": 5, "title": "Solely impressive", "review": "As far as the built quality is considered Moto has done a great job yet again. But would have been much happier if there was a Snapdragon chipset instead of Mediatek at this price range. Overall the phone is great. A job well done by Moto aka Lenovo.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Sayantan Das"},
{"rating": 5, "title": "Simply awesome", "review": "One of the gem and value for Money phone yet again by Motorola..\nFew highlights:\nPros:\n1. Attractive Price\n2. 3 GB RAM work smoothly\n3. Excellent battery 5000 mhz works full day with 4g network\n4. Dolby Atmos sound too good for any video and audio\n5. 5.5 screen size and awesome display with good touch screen.\n6. 7.1.1 latest Android stock version excellent\n7. Processor works nicely\n8. fingerprint works perfectly\n9. Front camera with flash too good.\n10. One key navigation feature\n11. Dual sim with dedicated memory slot\n\nCons:\n1. Battery makes phone heavy Weight and looks bulky, 199 gram is too much weight for any phone.\n2.Mediatek processor could have been snapdragon, same as USA version, if total installed apps goes beyond 70+ affects phone performance.\n3. Back camera not upto the mark, photo quality is questionable and photos are hazy.\n4. Back cover very difficult to open up and to remove SIM-1 is like hell.\n4. If something goes wrong in warranty period , quality of Motorola centre's and arrogancey of service centre's guy's.\n\nWill give 8.5 out of 10 for overall performance, and value for Money.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Aug, 2017", "reviewer": "Bhushan T"},
{"rating": 1, "title": "after using 1 week", "review": "phone is not so good as u r thinking......heating up rapidly....hanging problem occurs continuosly.....fingerprint sensor is not working properly........performance is very very slow.....camera is not so good.....colour related problems occurs in camera......processor is lack behinding the phone....mediatek is a wrost processor. overall performance is very bad", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Value-for-money", "review": "Awesome really budget phone ..thanks to team Moto", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Simply awesome", "review": "Excellent superb...feedback after using for 2 days..it's a premium mobile at a very reasonable price ..superb battery ..camera is very good with dual flash ..Android 7 makes it very smooth operation ..excellent memory management..3 GB RAM ..32 GB ROM ..feels like cutting through a cake ..don't think ..just buy ..I have ordered another one for my wife..it's infectious ..", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Arit Kumar Das"},
{"rating": 1, "title": "One Star", "review": "There is a problem with charger and when we charging mobile mobile going hang. Sensor not working properly. Worst phone", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jul, 2017", "reviewer": "sudhakar reddy"},
{"rating": 4, "title": "Really Nice", "review": "Nice mobile.. Thanks flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jul, 2017", "reviewer": "Parthiban nataraj"},
{"rating": 1, "title": "Terrible product", "review": "heat up quickly....hangs several times..battery consume more power.,.simply say Don't buy", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jul, 2017", "reviewer": "Rajesh  Bose"},
{"rating": 5, "title": "Awesome", "review": "Hello moto\nSuper phone \nLook awesome \nStunning \nGraet\nM so happy \nChose write Mobile", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "deepak kumar"},
{"rating": 5, "title": "Simply awesome", "review": "Received the product. Looks really awesome with all great features but I didn't get any launch offers. I would like to know how to claim offers. I would be glad if someone could help me with this.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Shiva Manish Karepe"},
{"rating": 5, "title": "Terrific", "review": "I received this mobile yeterday\nIt is the one of the finest mobile among the before i used old mobiles\nGood camera quality nd superd battery\nThank u moto", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jul, 2017", "reviewer": "Govardhan Reddy"}
]