[
{"rating": 5, "title": "BEST SMARTPHONE UNDER 15K BUDGET - 8.5/10 OVERALL", "review": "This Product surely worth spending money on. It is 8.5/10 for money you spend.\nINSIDE BOX:\n1. Handset\n2. Charger (2A)\n3. Data Cable type C USB\n4. Tray Pin\n\nAbout Handset:\n1. Body(9/10)\n- It has the speaker at the left bottom edge and 3.5 mm jack at right bottom.\n- 2.5D Curved edges display Giving it a premium look.\n- Slim and sleek design.\n- IR blaster at top center.\n\nIR blaster:(10/10)\nDisplay :(9.5/10)\nSound:(10/10)\nRear Camera:(9/10) - FOR DAYLIGHT PHOTOGRAPHY (READ IMPORTANT NOTE BELOW)\nRear Camera:(7/10) - FOR LOWLIGHT PHOTOGRAPHY (READ IMPORTANT NOTE BELOW)\nFront Camera:(9/10) - FOR DAYLIGHT PHOTOGRAPHY (READ IMPORTANT NOTE BELOW)\nFront Camera:(7/10) - FOR LOWLIGHT PHOTOGRAPHY (READ IMPORTANT NOTE BELOW)\nBattery:(9/10)\nCall quality :(10/10)\nFingerprint sensor:(10/10)\n\nPros:\n+ Great DUAL CAMERA at this budget.(Click sharp images in DAYLIGHT with sharp edges with great depth - Better than Moto G5s Plus)\n+No processing lags\n+No heating issue at all. Even on heavy usage\n+Battery life is very impressive\n+Design is very premium\n+Dual sims/micro sd card\n+DUAL Rear camera is great in this price range\n+Google Android one UI is my favorite\n+Slim and sleek\n+Mettalic body finish.\n+The output from 3.5mm jack is really good, you can get best of it if you tune your equalizer.\n\nCons:\n-No fast charging \n-No IMAGE STABILIZAION for video recording/Image Capturing\n-Mobile is little slippery \n-LOW LIGHT PHOTOGRAPHY\n\nIf you are looking for a premium looking slim phone at the budget price tag that this one this the best device you can buy. The phone looks really classy. This phone is the best buy device at this price tag.\n\nIMPORTANT NOTE: \n1. You can get the best out of the camera if you know how to use manual mode.\n2. Image stabilization is a software feature so you may use other good camera apps other than the pre-install camera to improve image quality.\n3. UPDATE YOUR PHONE TO LATEST PATCH AFTER YOU RECEIVE IT TO GET BEST PERFORMANCE.\n\nIf you like my review please upvote :)", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Oct, 2017", "reviewer": "Sumeet kumar"},
{"rating": 5, "title": "Highly recommended", "review": "Awesome phone!!\nBeautifully crafted!!\nGreat audio quality...\nGreat stock android experience!!!\nLow light camera performance s not upto mark.\nBokeh mode. manual mode and 2x optical zooming are great!!\nGood for daylight photography...\nPerfect phone for android lovers..", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Sep, 2017", "reviewer": "Amal Santhosh"},
{"rating": 5, "title": "Perfect product!", "review": "Writing this review after 7 days of intense use of the mobile ...\nI bought a black colour variant\n🌟*-:Very important note:-\nbody of the mobile is little bit curved from the side of volume keys and power keys don't get panic if you see it and it is done for keeping the bulging camera lens in the body shape. Very few users notice this.*\n\nPros:-\n*There are no heating issues\n*Best camera in the price range but it's up to u that whose camera quality u like the most (Moto or Mi)\n*I did not face any heating issue.\n*Device does not support quick charging but believe me it will not take more than 1hr 15min from 0% to 100%.(this is the max to max time).\n*I can get a battery life of a full typical working day.\n*It's most awesome feature is it's stock Android experience it is really awesome believe me unless u r not a UI layering fan. (Personally I like stock Android)\n*U get an IR blaster in the device.\n*Xiaomi has said that they r giving 3 mi apps inbuilt - camera app, IR blaster app,Xiaomi feedback app . However I got only 2 . I didn't get IR blaster app.\n*There is no lagginess in the mobile and u can run heavy apps in the mobile without any problem. 4gb of RAM is more than sufficient.\n*You will be getting updates atleast for 2 years as Google has promised.(you may receive updates after 2 years too.)\n*Mobile has all the basic sensors.\n*It has the best audio output I all terms whether you are using its speaker or very high capacity headphones.\n*It's design is very premium.\n*It has a usb port of 3.0.\n\nCons:- \n*Mobile is little bit slippery.\n*Does not support quick charging.\n\nAt last if you liked the review please give a thumbs up to it if you don't then you know what to do.....\nI'll be posting the points if I have missed any.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Sep, 2017", "reviewer": "Ishan Pandey"},
{"rating": 3, "title": "Fair", "review": "I will devide my review into four parts\n1. Pros\n2. Cons\n3. Things I didn't liked\n4. Things I liked\n\n1. Pros:\n 1.1) Battery backup is very goot. Even it is 3000mAH battery, it is giving more than 6.5 hrs of screen on time.  \n 1.2) Performance is excellent. Compare to MiUI, it will open apps fast and the speed is also good\n 1.3) Back camera in day light conditions is working super. 2X optical zoom is capturing details clearly. Depth of field effect also too good. I can't post pictures here. But will provide you if you want :)\n 1.4) I am a moderate user. I will maximum use Facebook and browse some YouTube videos. I didn't face any heating issues\n  1.5) 3.5 audio jack is giving quality, loud output. 50% volume is enough to listen songs loudly. Speaker quality is also very good and loud\n 1.6) Full charge will take 1hr 40 mins. It is less compare to other mobiles which don't support fast charging\n  1.7) Touch buttons are having back LED. So you no need to suffer in night conditions\n\n2. Cons\n 2.1) Notification light is single color. So it will blink in white color for any notification. \n 2.2) IR blaster range is reduced. Previously my Mi5 works better. I am able to change the channels from anywhere in my room. But now it is working if I am in 2-2.5 meters range only\n 2.3) Fingerprint sensor is slow. It is taking almost 2 sec to unlock the Device.\n 2.4) Back camera in low light is taking poor quality images. Too much of noise in that\n 2.5) Front camera is below average. Shutter speed is not good so always giving blur photos. \n\n3. Things I didn't liked\n Since it is pure Android, most of the MiUi features will not be available. So read below points if you are a MiUI fan\n 3.1) No double tap wakeup. There are so many apps in playstore. I tried most of them but they are asking admistrative permissions. Fingerprint print unlock is not working if we allow these permissions to outside apps. This may be possible by rooting but I won't recommend rooting because it avoids warranty.\n 3.2) No quick ball. You have to use side button to lock device. Even screen lock apps are not working because of the reason mentioned in 3.1\n 3.3) No one hand mode. Phone is 5.5 inch and slippery.  So very difficult to use it with one hand without one hand mode\n\n4. Things I liked\n 4.1) Initially slow motion video is not working. But they fixed it yesterday (Sep 28th, 2017) by update. This one is good that they are responding quickly\n 4.2) I got September security patch also. You will be up tto date with this device.\n\nFinally this is my review after using it for 14 days. Hope you liked it :)", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Sep, 2017", "reviewer": "Hari Sai Raju Aitam"},
{"rating": 5, "title": "Super!", "review": "The Best! Well Finished... Great Fill... Nice Camera... Loved The Stock Android... It's Just Awesome If You Are Not Worried About MIUI... Just Little Bit Slow In Charging... Rest Everything Is Just Awesome...\n\nGreat MI Product....", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Sep, 2017", "reviewer": "Nirav Gohel"},
{"rating": 5, "title": "Super!", "review": "Awsm", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Jan, 2018", "reviewer": "Abhinav  Pathak"},
{"rating": 5, "title": "Awesome", "review": "Yesterday I received my A1. Exact 48 hours after order. It's great to see Flipkart delivery time even my area doesn't have fast delivery/one day delivery.\nNow comes to the phone.\nA super smooth OS with excellent hardware makes this phone great. I order the black colour and I recommend it.  It has a beautiful premium look and feel. The build quality of this phone is outstanding. Really nice to see a excellent set of dual camera because I think Tele+Wide is best combination (it's my own opinion).\nNow comes to pros and cons:\nPROS:\n1. Android One gives you smoother experience and guarantee for future update, current running on 7.1.2 but promised for Oreo and P. (Oreo will be before end of year and P will be in first batch)\n2. The superb built quality makes this phone an aye candy and Gorilla Glass 3 protect from scratches\n3. The Dual camera performe superb in good light conditions and Portrait Mode works like a charm. The tele photo lens has 2X optical zoom which work great.\n3. Even it has 3080 mah battery it will last for 1 day. It has a 14nm finfet based Snapdragon 625 chipset.\n4. Loudspeaker is loud enough actually pretty loud and clear.\n5. It has USB type C Charging port and seperate 3.5mm earphone jack which is very good. If you has a good quality earphone/headphone you'll fall in love with is superb sound.\n6. RAM management is excellent, keeps all the app in memory.\nCONS:\n1. Camera Struggle in low light conditions and it hasn't Auto HDR and EIS (hope Xiaomi can fix last two in future camera update).\n2. There is No FM Radio which I'll not miss much when you have Jio.\nI have a Redmi Note 4 and I this apart from battery it will beat Note 4 in every segment and biggest score will be in camera.\nAt this price range Moto G5S plus is almost identical but is has a promised update which is not going good with moto user. However Camera is a little bit better but not when comes to portrait mode.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Sep, 2017", "reviewer": "Prakash Jaiswal"},
{"rating": 4, "title": "Value-for-money", "review": "Awesome phone at this price .My impressions after 7 day usage...\nPros: 1) Great build quantity and design in this price...almost fell in love with it.\n2) stock Android no malwares or stupid apps.Guranteed Updates from Google .\n3) Dual camera portrait mode is awesome in day light.\n4) Battery backup decent , not as such like note 3/4 but considering stock Os even 3080mAh works fine.\n5) Guerilla Glass ...first phone from Xiaomi to have that  in mid range phones.\n6) Battery charging is decent ..no quick charge adapted provided but still only takes only 1.5 hrs to get full charged.\n7) Audio quality is really good and so does speaker.\n8) No heating as written in some reviews..Only time it gets slightly heated is during charging which is common in all smartphones.\n\nCons) \n1) Black model does comes with made in China tag. Now when the brand itself is already Chinese , does it really matter? \n2) Camera struggles in low light. Front camera is AVG and nothing new when compared to last generations of phone. Should have been better considering it a new 2017 model.Xiomi lost in this front and low light camera performance department when compared to other similar range phones.\n3)Hybrid sim slot whithough this is same in all smartphones dese days.\n4) Type-c charging -- Although 3.5 jack is provided for songs but one still need only a type -c cable for connecting this phone to adapted or pc. Surely U won't found these cables around u with it forms/family...so it's a must carry thing if u r travelling and phone needs charging .\n\nFinal words--- Overall a gud premium looking phone with decent performance. Take it if u want a cheap phone  with decent dual camera setup and love  stock Android.\n \nDon't take if u want a gr8 selfie phone or a phone with low light camera performance. \n\nGiven 4 stars coz the model delivered had loose volume keys ...though  I didn't replaced .\nDo like if this review helped!! \nAlso post it questions in comments.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Oct, 2017", "reviewer": "sachin saurabh"},
{"rating": 5, "title": "Terrific purchase", "review": "Stock Android + Xiaomi hardware = Best combo ever!\n\nAfter Usage of this Phone for Two Days \nI am writing the Pros And Cons\nNow \nLet's not talk about specification everyone already knows it \n1) This being a camera centric phone I can really assure you guys that this phone is one of the best in the market it's quality is premium well it's not upto level of IPhone 7 plus Or OP5 dual but in this price range it's one of the best \n*Low light photos are not so good but with sufficient light the telephoto lens takes an amazing images * \nThe Video Stabilization for 4K recording is not so good the Focus takes about a sec to adjust but the quality of the video is Premium comparable with mid ranges to high priced phones !\n-Selfie camera Is a Beast \nPure Beast ! \nXiaomi always been good at it and does justice with this phone too ! \n2) Sound Quality \n-The Speaker is Really really really really loud \nAnd I am mean it . It's one of the best speakers out there \n- Even after plugging in the headphones the voice quality is superb ! \n- If xiaomi would have advertised this phone as a music phone I swear it would be speaking the truth ! \n3) Gaming and Speed \nI haven't tested it much A few Days more and I will give a detail ! But the snapdragon is rocking hard as of now ! \n4) Has No NFC and NO Fm Radio \n5) The Best part now \nA Combination of Xiaomi Hardware and Google Software is the best possible the combination ever and I mean ever ! \nThe Experience of Pure stock android is amazing ! \nALSO GOOGLE HAS CONFIRMED OREO AND ANDROID P UPGRADES! \nThe Google software is running smooth and butter free no lag issues uptill now \n6) No heating issues I repeat no heating issues ! \nThis Product is definitely worth buying for 15 k and I say go for it without any hesitation ! \nI will update precise and more details within few days ! \nIf you found my review helpful then please leave a like !\nThank you for reading", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Sep, 2017", "reviewer": "Sudipta Choudhury"},
{"rating": 5, "title": "Must buy!", "review": "Got the device today, box was sealed and intact. \nThe phone looks nice and feels like a premium phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Sep, 2017", "reviewer": "Preetham Kumar DH"},
{"rating": 5, "title": "Simply awesome", "review": "Awesome phone", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Sep, 2017", "reviewer": "Pavan kumar"},
{"rating": 5, "title": "Brilliant, Simply Awesome", "review": "Awesome Mobile I've ever seen in this Budget. \nMust Buy.\n Camera quality is  Awesome.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Sep, 2017", "reviewer": "Khadeer Usman"},
{"rating": 5, "title": "Simply awesome", "review": "Pros (The Good) :\n1) Great Build and looks\n2) Great Battery life. Getting 7 hours of SOT on Wi-Fi\n3) Flagship level performance. No lag whatsoever\n4) Memory Management is superb\n5) Audio output from Speaker and Jack\n6) Camera Portrait Mode\n7) Stock Android optimized by Google\n8) IR blaster for controlling TV, AC\n9) Good Wi-Fi Reception\n10) Overall Fluid Experience\n11) 1080p Display\n\nCons (the Bad):\n1) Notification Light is only Single Colored \n2) Bit Slippery\n3) Hard to get this phone coz of Flash Sale", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Sep, 2017", "reviewer": "Ashish Chavan"},
{"rating": 5, "title": "Terrific purchase", "review": "Honest review.\nThere are 4 main problems in this phone:\n1. Camera in low light is very bad.\n2. Network strength not good.\n3. Battery not up to mark. I was using moto g5 plus having 3000 mah battery. But despite having 3080 in mi a1, it is not giving performance like moto.\n4. Phone heats up a little during charging. But that's okay if u r having a phone cover, u won't feel much.\n\nFingerprint sensor didn't work most of the times if there's sweaty hands in moto g5 plus.\nBut there is no such issue in this phone.\n\n\nRest everything is perfect. Looks like a premium phone. Seriously. Heard many customers are getting made in China product. But I got made in india.\n\nGiving 5 stars because no phone is perfect. But in this range this phone is awesome.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Sep, 2017", "reviewer": "Prashant Ranjan"},
{"rating": 5, "title": "Worth every penny", "review": "Nice product and beautiful mobile", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Sep, 2017", "reviewer": "Umba Mujahid"},
{"rating": 5, "title": "Fabulous!", "review": "Received the item in time...great battery life, good performance, camera is decent but yahh portrait mode  done a good job picture is clear and focus. And its a stock Android there are no bloatwares...this smartphone is worth for money...under 15k I think this is the best smartphone available in the market right now.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Sep, 2017", "reviewer": "Balu Shirsat"},
{"rating": 5, "title": "Stock Android + Xiaomi hardware = Best combo ever!", "review": "After Usage of this Phone for Two Days \nI am writing the Pros And Cons\nNow \nLet's not talk about specification everyone already knows it \n1) This being a camera centric phone I can really assure you guys that this phone is one of the best in the market it's quality is premium well it's not upto level of IPhone 7 plus  Or OP5 dual but in this price range it's one of the best \n*Low light photos are not so good but with sufficient light the telephoto lens takes an amazing images * \nThe Video Stabilization for 4K recording is not so good the Focus takes about a sec to adjust but the quality of the video is Premium comparable with mid ranges to high priced phones !\n-Selfie camera Is a Beast \nPure Beast ! \n Xiaomi always been good at it and does justice with this phone too ! \n2) Sound Quality \n -The Speaker is Really really really really loud \n  And I am mean it . It's one of the best speakers out there \n - Even after plugging in the headphones the voice quality is superb ! \n - If xiaomi would have advertised this phone as a music phone I swear it would be speaking the truth ! \n3) Gaming and Speed \n  I haven't tested it much A few Days more and I will give a detail ! But the snapdragon is rocking hard as of now ! \n4) Has No NFC and NO Fm Radio \n5) The Best part now \n     A Combination of Xiaomi Hardware and Google Software is the best possible the combination ever and I mean ever ! \n The Experience of Pure stock android is amazing ! \nALSO GOOGLE HAS CONFIRMED OREO AND ANDROID P UPGRADES! \n  The Google software is running smooth and butter free no lag issues uptill now \n6) No  heating issues I repeat no heating issues ! \nThis Product is definitely worth buying for 15 k and I say go for it without any hesitation ! \n I will update precise and more details within few days ! \n If you found my review helpful then please leave  a like !\n Thank you for reading \nA guy even copied this review -,- xD", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Sep, 2017", "reviewer": "Amey Shinde"},
{"rating": 5, "title": "Worth every penny", "review": "Product is good..  But disappointed bcoz yesterday night I bought 14999 rs and today it's price is 12999.. Within 20 HR I loss 2000rs", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Dec, 2017", "reviewer": "Rahul Gupta"},
{"rating": 4, "title": "Good quality product", "review": "Awesome phone..!!\nOnly issue is, camera quality in low light conditions is not good.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Sep, 2017", "reviewer": "Dinesh Kumar.G"},
{"rating": 5, "title": "A Perfect Blend of Hardware & Software.", "review": "It's a Beast. The best smartphone under this budget segment.\n\nPros-\n1-Good Build Quality.\n2-Great Camera, specially Portrait mode.\n3-Promise of Earliest Updates.\n4-Smooth Performance.\n a) Excellent RAM Management \n b) Plays heavy games without lagging\n c) Clean UI as it's stock android \n5-Sound Quality is Great especially     through headphone jack.\n6-Sharp Display.\n7-Includes almost all necessary sensors.\n8- Good Battery performance \n\nCons-\n1- Camera struggles in low light conditions.\n2- No NFC support.\n3- Doesn't supports Fast Charging. Although it full charges in 1.40 hrs.\n\nVerdict- Go for it. Without a doubt, it's the best deal you would get under this price tag.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Sep, 2017", "reviewer": "Rohit Ramchandani"},
{"rating": 5, "title": "Pretty good", "review": "Performance : 8\nPlayed games like war wings, modern combat, nfs and  it works perfectly without any lag\n\nCamera : 8\nAwesome camera quality . Pictures taken from rear camera is really amazing, very crisp and detailed. Front cam is good but nothing impressive. And there is a bug in the slomo feature which will be fixed I guess in the next update.\n\nDesign : 10\nVery slim. Very lightweight. Awesome finishing. Overall it looks good.\n\nStorage : 9\nIt says 64 gb but really you will have 50gb with you \n\nOS : 10\nwell Android stock is always the best. Being powered by google, you will receive all the latest updates of Android first before anyone else's . Phone's Android version is 7.1.2(nougat)\n\nBattery : 8\nWell I am disappointed with the battery backup. I was using redmi note 4 before and it had an awesome battery backup (4000+something mh) , but this one is downgraded to 3000 mh and I personally think it's not enough. When I charge it to 100 in the morning, the charge goes down to 20 by evening 5pm. When I use to charge the redmi note4 the same way, it would last a day n half.\n\nPoints to note:\n\nThere is no arriving early for this product if you are expecting it while ordering. It will be delivered on the scheduled delivery date.\n\nRedmi phones are not waterproof so be careful around water. \n\nFlipkart doesn't provide you this product with mi protect like in mi store. Insurance is a must to safegaurd your phone against any sort of damage and theft. MI has tieup with oneassist.in for mi protect. You guys can buy it seperately from there if you need. I would recommend it, given my experience.\n\n\n\nConclusion:\n\nOverall I think this phone is worth buying. Given the price range and product quality.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Sep, 2017", "reviewer": "Vishnuprasad Venugopal"},
{"rating": 4, "title": "Wonderful", "review": "#####REVIEW AFTER USING FOR 2 MONTHS#####\n\n1. UI : Fluidic Stock UI performance. Go for it if you a stock Android fan. Not recommended for MIUI fans but it is  worth noticing that the performance of Stock Android is better than MIUI 9. 5/5\n\n2. Camera : Dual Camera in the back is steal deal. It can capture some of the great shots in broad daylight. It really gives DSLR feel. In low light, bokeh effect can't be noticed. Also, the photo is grainy in low light conditions. Front camera is average. 4/5\n\n3. Built Quality : Complete mettalic body looks very premium. I have black edition which looks stunning but the problem is that a slight fall is enough to give dents on your mettalic finish. So, anyway you need a good case to protect the body. 4/5\n\n4. Updates : Android One ensures that you will keep geeting all the Security patches and major updates atleast till Android Oreo and N. Though, Oreo is yet to be rolled out but promised by the end of 2017.\n\n5. Battery : Battery life is okay. I get around screen time of 6-8 hrs with heavy use but it is decent considering 3000 mAh. Full charging time is not more than 75 mins. Not a fast charger but Type C port works decent enough.  4/5\n\n6. Screen : The 5'5 inch screen hits the sweet spot and it is bright enough for you to use A1 in daylight. \n\n7. Sound : Speakers are loud dand crisp. You won't feel that there is only one set of speakers in the bottom. Also, you will get clean sound with5/5\n\n8. Connectivity : No problem for 4G network. Works fine with both Jio and Airtel. 5/5\n\n9. IR Blaster : IR blaster works fine though range is not more than 3m. 4/5\n\nVERDICT\nOverall this is the best phone you can get in this segment. Great camera, 4GB ram, 64 GB storage with Stock Android can give you the best experience even though, there is trade-off between selfie camera and battery life that you have to make. 4/5.\n\nPlease like my review if it helped you in any way. Thanks!", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Dec, 2017", "reviewer": "Ayush Jain"},
{"rating": 2, "title": "Bad quality", "review": "Ur delvry boy is over smart and talking style is very bad n even don't know manner.\nHe thinks he is not dlvry boy he thinks he is the CEO of flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Pretty good", "review": "It's good phone in this budget.\nBut not too impreesive.\nDesign is good.\nBut the camera is true photography.\nI believed they give update to camera quality.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "Vikas kumar"},
{"rating": 5, "title": "Classy product", "review": "Suberbb phone...\nJust loving it!...over all very nice phone.\nCamera is just awesome but it struggles in low light conditions...other then that...ram management is perfect ,no issue with that, screen quality is also very good...\nWhen it comes to the built quality it's just unbelievable! Hats off to mi ...\nI was litter worried about the battery life but that's also good ...and the charging is also fast, it that's almost 1 hour and 40 mins for full charging...", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Sep, 2017", "reviewer": "Mohit Patwa"},
{"rating": 5, "title": "Great product", "review": "The Most Amazing Phone Ever", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Sep, 2017", "reviewer": "Anshul Garg"},
{"rating": 4, "title": "Decent product", "review": "Network issue, network fluctuate very often, very disappointed", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "Vivek Irabatti"},
{"rating": 5, "title": "just one word!!! BRILLIANT", "review": "pros 1.good battery backup\n         2.awesome speaker\n         3.awesome headphone sound\n         4.stock android😙\n         5.premium looking phone\n         6.faster updates \n         7.and many more to count\nIts been just a  day....will update more after some days", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific purchase", "review": "First of all thanks Flipkart for the fast delivery and timely updates. Now coming to the phone itself , its the best phone you would get for the 15000 price bracket. No phone has everything in it but considering the 15k price bracket you will get the full value for money. Moving to the important details about the phone, If someone is thinking to get their hands on a very good smartphone for the mentioned price, I would like to list out the matters regarding the phone\n\n1. Though the screen is a 5.52 inch (not 5.5 inch) full hd IPS LCD display with a ppi of 399, it is worth mentioning that Xiaomi this time has worked a bit more to bring to the users what I would say is a top notch hardware having the perfect blend of sharpness and colour reproduction. The display shows adequate balanced colours which are not too cool yet sufficiently warm. The screen brightness is amazing as my 2day usage states that only 75 to 80 percent brightness is enough under direct sunlight. I have previously used several phones including the company's own Redmi note 4 but I wasn't satisfied with the brightness and the screen appeared dull in bright sunlight even on full brightness. The last point to note is that it has stunning viewing angles.\n\n2. The camera setup is what which was being talked about immensely and is also highlighted by Xiaomi even. Frankly speaking when I thought of purchasing this smartphone after using two other Xiaomi phones in the past, I was expecting an average camera performance. But after testing the camera thoroughly, I would give a 9/10 rating to Xiaomi which is really nice for 15k smartphones. The rating is so because the camera really struggled in artificial or low light producing artificial colours but it produces real accurate colours in outdoor lighting conditions. Though I hope Xiaomi will come up with some software Tweeks for the camera to improve its performance. Even the portrait mode doesn't seem like artificial as in the case of several smartphones.\n\n3. Considering Xiaomi's battery backup in the past , I thought that the battery of 3080mAh would last only about half a day but I am getting a battery life of almost 22 to 23 hours on utterly heavy usage with a screen on time of almost 9.5 to 10 hours roughly. Great job Xiaomi for providing good battery management by the 625 chip and stock Android software.\n\n4. The phone provides a rich gaming performance thanks to the Snapdragon chipset supported by the adreno 506 GPU and 4gigs of onboard ram. The phone is surely a mammoth.\n\n5. Due to Google's crisp software the ram management is superb as each and every app is retained in memory and does not reload when you revisit them.\n\n6. Out of the provided 64 gigs of onboard storage we get roughly around 51 gigs for use which should be enough for even a mobile gamer. Unless you are a media lover and like storing movies on device.\n\n7. Though mentioned late in the review but the build quality provided is something very premium. The phone feels sturdy in hand and thanks to its excellent design and balancing by Xiaomi, the sleek giant is really a thing to adore while it's sleeping. The phone is 7.3mm thick weighing 165grams but the in hand feel is way less than that. It actually feels much lighter than the note 4 which weights the same.\n\n8. One more thing to highlight is the audio output via the headphone jack. Personally I am a person who loves listening to a whole lot of songs ranging from high base ones to the ones on the treble end. The phone manages it like a pro responding correctly to whatever you throw at it. The audio DAC provided is really of top standards.\n\nOverall it's a balanced smartphone. If you are a rough user then don't worry the phone is definitely for you due to some excellent build and mr. Corning in your confidence. Do give a thumbs up you found the review useful else give a thumbs down. Thank you.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Oct, 2017", "reviewer": "Chirantan Gupta"},
{"rating": 5, "title": "Just wow!", "review": "Very nice and beautiful MI is Rockstar", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Sep, 2017", "reviewer": "Anis shaikh"},
{"rating": 1, "title": "Worthless", "review": "Network issues with certain handsets is an issue", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Oct, 2017", "reviewer": "Vivek Krishnan"},
{"rating": 1, "title": "Useless product", "review": "I got a navratan oil pack inside the box in place of replacement with new mi a1 because 1st one is diamaged...", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Worth every penny", "review": "- Excellant product in this range, build quality, look and feel awesome.\npros;\n- Camera with depth effect looks truly professional in outdoor conditions.-camera is fast\n- fast and stock android UI \n\ncons-\n- Selfie camera and normal cam produces noise in indoor conditions even at decent lighting conditions.\n\nOverall, Considering with Nokia 6 and Moto G5S plus, I recommend to buy Mi A1phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Sep, 2017", "reviewer": "Krishna"},
{"rating": 1, "title": "Value-for-money", "review": "Overall Average Phone:\nPros: Telephoto lens, processor, potrait mode.\nCons: Low light photos having noise. Very bad photos in night.\nUpdate: After 12days use, phone has started restarting every 5 minutes. I'll try to fix this by contacting redmi store. Very poor from redmi. They compare it with iPhone, but the software is so cheap and horrible.\nUpdate: Went to Redmi service center, they rebooted the software. Told me to come again if restarting problem remains same. As of now restarting happened only once in last 24 hour. But I am very dissatisfied with this product.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Sep, 2017", "reviewer": "PRANABANANDA PAL"},
{"rating": 1, "title": "Did not meet expectations", "review": "Hanged 3 times in a week n technician visited but did not replaced till now", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Shivam  Mishra"},
{"rating": 4, "title": "Hated it!", "review": "Network problem", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "Excellent camera quality with best depth sense.....charges from 2% to 100% in exact 2 hrs....and the screen on time is approx 5 hr 20 mins......no lagging in extensive video gaming..........must buy......love this phone", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Sep, 2017", "reviewer": "Aditya Chaurasia"},
{"rating": 1, "title": "Worthless", "review": "Almost a defective piece, shame on u Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Sep, 2017", "reviewer": "RAJIV BEDI"},
{"rating": 1, "title": "Absolute rubbish!", "review": "Serious Network issue. Faulty Radios. Even after several tweaks Network fluctuates and often drops to zero. Switches to 3g while writing review. I'm not getting full 4G speed. Tested with Airtel, idea and jio however these SIMS works smoothly with my iPhone 7 and xaiomi note 3. while searching for the solution I found so many customers facing same problem even mi community acknowledge the fault. On paper, phone is amazing but it is literally defective. My friend has same phone and he face Network issue and he realized it after 15 days, now he can't even return... So guys check your phone performance and compare the speed with another phone..\nFlipkart service is slow and outdated, they promised me to call at 3 but after too long wait I got msg apologizing that they will call after 2 days.. I'm very old Flipkart customer. I used to be a Flipkart first customer but now their service is poor. I repent buying phone from them...\nUpdate... Flipkart guys rejected return request . I can prove it is a faulty phone. Technician visit is such a fake, illiterate technician, even a common person is more intelligent than him, they are taught to convince customer and rejecting return request is their main aim. Such a poorest service Flipkart, mouth of word either good or bad, thanks to my million followers I can use this example through video to make them aware about online thefts...", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Oct, 2017", "reviewer": "Himanshu Kashyap"},
{"rating": 1, "title": "Don't waste your money", "review": "It's been 20 days that I bought this phone. \nIt worked very well for first 10 days. But now this lags too much, apps stop responding,etc; \nI am disappointed with this. \nMi customer care people don't care too.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Nov, 2017", "reviewer": "Sai Surya Indraganti"},
{"rating": 1, "title": "Did not meet expectations", "review": "Network Problem frequent network flactuations.", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Sep, 2017", "reviewer": "Anbu R"},
{"rating": 5, "title": "Just wow!", "review": "Superb build quality\nExcellent camera in daylight\nSuperb sound quality in headphone\nOverall excellent", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Sep, 2017", "reviewer": "Rahul Mandal"},
{"rating": 5, "title": "Brilliant", "review": "Excellent...", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Sep, 2017", "reviewer": "rajiv kumar"},
{"rating": 1, "title": "Hated it!", "review": "Network strength very low", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Sep, 2017", "reviewer": "Biswajit Roul"},
{"rating": 5, "title": "Terrific purchase", "review": "Nice", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Rohit  Yadav "},
{"rating": 5, "title": "Excellent", "review": "Wow for this Budget", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Luduvick Garryson George"},
{"rating": 1, "title": "Bad quality", "review": "I am facing network issue since I bought this phone. I am experiencing frequent network flactuations . There is problem with headset port as well . I am really very disappointed.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Classy product", "review": "The beast in this price range..\nAll Pros and No cons at all...\n\n1. Awesome Build Quality\n2. Awesome Camera\n3. Stock Android\n4. 4 GB Ram so Fast loading of apps and Ram management is best\n5. Fingerprint Scanner is Fast after Aug. Patch update\n6. 2.5 D metal and fingerprint resistant.\n7. Premium quality\n8. Good battery life\n9. No heating Issues\n10. Charges from 20 to 100 in 1 hour..", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Sep, 2017", "reviewer": "Swapnil Karve"},
{"rating": 1, "title": "Absolute rubbish!", "review": "Network problem. Signal continuously fluctuates every time.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Oct, 2017", "reviewer": "Chetan Bonde"},
{"rating": 1, "title": "Utterly Disappointed", "review": "Flipkart is providing faulty product. Never buy any product from this online site. There support team is not providing any information on product return and not able to contact them after 7 days of continuous calling them.\nThe product has heating issues and you can not even hold phone when it heats up. The phone heating issue is so bad that nobody can hold it for a minutes also.\nNetwork fluctuations is very annoying and sound is very wired,  not clear. Colour reproduction is below average.\nFlipkart is not responding after providing defective product.\nShame flipkart.\nDon't buy any product if the response is so bad and not providing genuine product. They are cheating customers.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Oct, 2017", "reviewer": "Shalini Singh"}
]