[
{"rating": 5, "title": "Worth every penny", "review": "As my budget was tight so i reviewed many products and finalised this TV. Brought it on regular price which was 18000 at that time.\n\nTV was delivered in 3 days. I myself opened the box as there is no wall mount is given in package i attached the stands. It was easy to attach there are only 4 screws.\n\nSet up tv with videocon d2h normal connection and turned it on. I previously used my CRT monitor with Tv tuner card. And after watching channels on this tv i found the colors are over bright and clarity is somewhat unclear. After playing with color and other settings the clarity and brightness got perfect.\n\nThere are 3 most useful color settings \n\nDynamic- If you have seen samsung super Amoled screen phones then is is same to that. Punchy and more vibrant colors.\n\nStandard- Regular and soft colors\n\nMovie- Slightly yellowish effect \n\nI played 720p and 1080p videos and the clarity was awesome.\n1080p 60FPS videos lag sometimes but no one watch 60FPS because regular movies and videos are 30 fps.\n\nComing to the sound this TV has slightly low sound 10w but for small room it is not a problem. There are also sound settings like movie , vocals and other. And DTS surrounding which is not much effective.\n\nBut tjere is also and 3.5mm audio output so you can switch anytime with clicks to Tv autio to home theaters.\n\nOverall i found this Tv is a great deal.\n\nPros:- \nHigh contrast ratio\nVibrant colors\n2 years warranty\nMany modes like indian cinema, movie , game etc\nAmazing viewing angles\n\nCons:-\n\nThe colors are over saturated than SONY tv. They may look pleasant to eyes but they are not 100% accurate.\n\nThe hardware refresh rate is 50-60Hz. And samsung tells 100Hz which is software optimized rate and not real.\n\nYou may need extended usb cable if you mount this Tv on wall because the usb port is on back side. Not in side panel.\n\n\n\n\nIf you just want brand in budget then buy this TV. Bacause in same range or may be at cheaper rate you get VU FULL HD 32 inch and believe me no difference in screen quality. \nAnd if you want to see everything as it is same as real life like picture quality then buy SONY 29 IINCH led tv.\n\nThumbs up if you found it useful ?", "verification": {}, "date": "6 Nov, 2016", "reviewer": "Omkar Khele"},
{"rating": 3, "title": "Economic option. Don't expect a lot.", "review": "Positives:\n\n- Sound quality: Worth the money.\n- Picture quality: Worth the money.\n- Product weight: Very light weight. Can easily carry around while shifting houses.\n\nNegatives:\n\n- All integration points (input plug points like HDMI, USB) are facing the wall and not side ways. So you will have issues in easy plug-and-play if you are wall mounting it. Please beware. \n- Don't expect network connectivity at this price. Just plug a Chromecast and stream whatever you want or plug a USB and play what ever you want.\n\nBuy this TV if you have a 10-12 feet hall. If its more, you may have to go for bigger screen.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Apr, 2017", "reviewer": "Individual Person"},
{"rating": 5, "title": "Must buy!", "review": "Why I gavee 5 starts to this TV Samsung 32J4003 TV.\n\nReasons: \n1. Delivery\n2. TV features and Performance\n3. Samsung Free of cost TV Installation service.\n\nSo let's start in detail:\n\n1. Delivery: Flipkart delivery is very fast & safe. Delivery person was very good in nature.\n\n2. TV feature and Performance: I like this  TV because it have Cricket Mode, Indian Cinema mode and game mode too.\nPicture quality is very good and sound is enough for a wide room.\nI have Dish TV HD+ connection and it produce very good picture quality while watching HD TV channels.\nI also connect this TV with my laptop using HDMI cable.\nI bought this TV on No cost EMI for 17999.00 only.\n\n3. Samsung Free of cost TV Installation service: I got this TV without wall mount and got only table stand but thanks to Flipkart again after delivery of this TV I got a SMS from Flipkart that a Samsung engineer will install my TV within next 48 hours .\nA Samsung engineer call me next day and come with wall-mount and install the TV on the wall without any cost.\n\nRecommendation: Do not purchase any additional Wall-mount for this Samsung 32J4003 TV because Samsung engineer will carry your wallmount and install it without any cost.\n\nSo, thanks to Flipkart and Samsung for fast & safe delivery and also free of cost Installation and demo service.\n\nThanks,\nShailendra Singh.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jun, 2017", "reviewer": "Shailendra Singh Chauhan"},
{"rating": 5, "title": "Perfect product!", "review": "Best experience of online shopping on flipkart. One of the best & reliable online shopping website of India.\nI got an excellent television product.\nI love it.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Delightful", "review": "A Good Quality Product and Faster Delivery from Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Jan, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "I bought this tv Rs.16240 with free installation from Flipkart using  SBI debit card. It is worth for this price.Thank u Flipkart for fast delivery.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Oct, 2016", "reviewer": "SEENI SYED MUSTAFA S"},
{"rating": 1, "title": "Very poor", "review": "Sound is very bad. Don't buy this. We can't hear the sound. I purchased it then book for return Flipkart is not ready to return this product. It was not expected from Flipkart. Flipkart should be with customer not seller. I am a regular customer but Flipkart is behaving like first time customer. They send third party to test sound and that dumb said all is fine, even given feedback that all company now selling low sounds TV.\nFlipkart if you are not ready to do any action with your seller then you will loose you genuine customer like me.\nAgain I would say, guys don't buy this. I don't know how people are giving 4+ rating. I would recommend add 3K more and go for some good TV. But not this one.", "verification": {}, "date": "18 Apr, 2017", "reviewer": "Vikas Singh"},
{"rating": 5, "title": "Classy product", "review": "You can buy TV online...\nawesome service by flipkart \nOn time delivered and installation on same day..\n\nGood picture and sound quality\nI am happy with this product \n\n#keep_flipkartting", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "32J4003", "review": "Nice product, its slim and has very good clarity and sound.", "verification": {}, "date": "7 Sep, 2016", "reviewer": "Aniket Rawat"},
{"rating": 5, "title": "Slim Led tv", "review": "Probably the best TV which one cn get at this price, suberb clarity and sound.", "verification": {}, "date": "13 Sep, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Good Service from Flipkart", "review": "Good product at this price. Installation Service is good.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Oct, 2016", "reviewer": "Achyuth"},
{"rating": 5, "title": "", "review": "I bought this TV offline from a Electronics shop in a good price. Its worth for this price. Having good picture quality and 2 HDMI port.\nIts been 4 months and I am enjoying it.\nThe display is bright and the edges are proper to cover the LED panel. Checked LG but the picture quality is far far better in this price range.\n\nIn this range you can't get a SONY. so options left are LG or SAMSUNG so choose wisely.", "verification": {}, "date": "5 Jan, 2016", "reviewer": "Shoumyabrata Chanda"},
{"rating": 5, "title": "Excellent", "review": "It's good.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Sep, 2016", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Delightful", "review": "Good product at this price and  on time delivery from Flipkart.\nInstallation service is also good from Samsung.\nOverall satisfied.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Sep, 2016", "reviewer": "Mohan N"},
{"rating": 5, "title": "Just wow!", "review": "superB TV at this prize.. \nniCe Graphics..", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Sep, 2016", "reviewer": "AKSHAY Gohil"},
{"rating": 2, "title": "Expected a better product", "review": "Sound is very bat", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Above-average product", "review": "The installation isn't arranged by Flipkart as mentioned in the description. The CS even makes false promises and had to contact Samsung for the installation. Bad experience.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Sep, 2016", "reviewer": "Elangbam Ganin"},
{"rating": 4, "title": "Really Nice", "review": "Bought this at 16500 INR.Good product.Value for money", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Apr, 2017", "reviewer": "K DEEPAK KUMAR SUBUDHI"},
{"rating": 4, "title": "Nice product", "review": "Good range at this price", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Oct, 2016", "reviewer": "Karthick Chittirasenan"},
{"rating": 2, "title": "Could be way better", "review": "Not to nice", "verification": {}, "date": "19 Dec, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "AUDIO QUALITY IS VERY VERY POOR", "review": "AUDIO QUALITY OF THIS TV IS VERY THIN AND IT SOUNDS  LIKE A CHEAP RADIO. DUE TO INFERIOR  AUDIO QUALITY, IT IS VERY  DIFFICULT TO UNDERSTAND THE DIALOGUES OF ANY MOVIE/DRAMAS/NEWS ETC. THIS IS MY PERSONAL ADVICE, PLEASE CHECK AUDIO QUALITY IN NEAREST TV STORES, THEN DECIDE TO BUY IT FROM NEAREST TV STORE OR ONLINE.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Improper Design of TV", "review": "USB ports are useless, as they are on back pannel of tv. Samsung should know about the design of TV. I am unable to use ports because of very less distance between back pannel and wall. Samsung should know that if customer hang tv on wall, then how can anyone use these ports.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "overall good product", "review": "Tv comes with very nice display panel which detailed picture quality & multiple picture modes for different occasions. I must say at this price range.\n\nPros\n\n- good picture quality\n- so many options in the settings for picture adjustment\n- using this since 7 moths no issues at all\n- all options are there including a AUX out which is highly essential now a days\n\nCons\n\n- extremely poor sound quality\n- but it can eradicated by using a external speaker \n\nIf its helpful please give a thumbs up !!!", "verification": {"CERTIFIED_BUYER": true}, "date": "10 May, 2017", "reviewer": "dayananda acharya"},
{"rating": 5, "title": "Excellent Product & Service", "review": "Thank you flipkart and Samsung for make my diwali spacial with this LED TV.\n\nPicture and Sound Quality superb as expected.\n\nTV make in India.\n\nSamsung provide 2 year triple protection warranty with this TV .", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Oct, 2016", "reviewer": "Tapas"},
{"rating": 1, "title": "Hated it!", "review": "Picture/sound quality very bad and can not insert USB easily first you have remove TV from wall mount . after all no satisfactory solution & behave by flipkart and Samsung . so please don't purchase from Flipkart / Samsung", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Worth the money", "review": "Supr product picture and sound quality is good\nAnd service is also good 👌👌👌👌👌", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jan, 2018", "reviewer": "Randhir kumar"},
{"rating": 5, "title": "Excellent", "review": "Flipkart delivered product on time and samsung provided installation on time. Very good picture quality. I got this one at low price. I am happy with is product.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Nov, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Samsung LED 32J4003", "review": "Product- Very good product at very reasonable price by seller OmniTech Retail, good picture quality and sound.\nDelivery - Very fast service by Flipkart, delivered 8 days before schedule date.\nInstallation - Very fast and good service, Installation before scheduled date. \nSuggestion - Packing quality should improve. \nConclusion- Overall satisfactory", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2016", "reviewer": "Bharat  Singh"},
{"rating": 1, "title": "Mischievous information, warranty not as advertised.", "review": "Mischievous advertisement, Flipkart shows 1 yr standard +1 yr panel warranty on this product by Samsung. while Samsung denies this offer for this product. Both Seller & Flipkart are not able to answer the same, and keep disconnecting the calls after putting call on hold. called them at least 20 times but they do not respond. \nPoor customer service of flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Yogesh Tejwani"},
{"rating": 5, "title": "Just wow!", "review": "It good got cheep n best", "verification": {}, "date": "24 Sep, 2016", "reviewer": "Balachandra Rao"},
{"rating": 5, "title": "Classy product", "review": "Good deal", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Mar, 2017", "reviewer": "Shubham Gupta"},
{"rating": 5, "title": "Terrific", "review": "Great product.. ..sevice is perfect....thanks Flipkart..", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2017", "reviewer": "Ajay Singh"},
{"rating": 4, "title": "Pretty good", "review": "Good", "verification": {}, "date": "13 Sep, 2016", "reviewer": "GiYeong Gim"},
{"rating": 3, "title": "Fair", "review": "one thing is a big problem here is the USB accessability. It is given behind which is not accessible, the same would have been provided either side then it would have been best ever.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Sep, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent product", "review": "Excellent product. Good sound quality, picture quality, plays almost every video format and good value for money. Enjoying watching movies directly from Pen Drive. Just the right product.\nFlipkart  packs product well. Had doubts over delivery of fragile item like this but overall a Excellent buying experience.\nAlso saved money due to online purchase. Recommended.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Nov, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Must buy!", "review": "Good", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Monika Singh"},
{"rating": 5, "title": "Highly recommended", "review": "Deliveres in Odisha. Good for product.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jan, 2018", "reviewer": "subhalaxmi Behera"},
{"rating": 3, "title": "Good", "review": "I m really happy with my product....it's very quick service to... But with one thing I disappointed that  yesterday i brought this TV at 18499.. and today price got dropped to 16999... within one day price got dropped..I paid extra 1500....from next time  I will think twice before shop with flipkart ....", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific purchase", "review": "VERY NICE LED && VERY GOOD INSTALLATION SERVICE PROVIDED BY THE COMPANY", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Nov, 2017", "reviewer": "Shalu Garg"},
{"rating": 5, "title": "Terrific purchase", "review": "Super 📺", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Oct, 2017", "reviewer": "prajjwal dubey"},
{"rating": 4, "title": "Four Stars", "review": "Its a very good product keeping the price in Mind Just add additional 2 basic Speakers into the attachment provided in the back of the TV to avoid Basic Sound Issue", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Aug, 2017", "reviewer": "Rahul Upadhyay"},
{"rating": 2, "title": "Met some expectations", "review": "It's quality is not satisfied with name of brand samsung overall not bad but who want a good picture quality from Samsung they definitely disappointed", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Jan, 2017", "reviewer": "RUPAK SINGH"},
{"rating": 2, "title": "Perfect product!", "review": "Delivery is on date \nSound quality is not good .", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Oct, 2016", "reviewer": "Anudeep Antharasi"},
{"rating": 5, "title": "Brilliant", "review": "Excellent experience from Flipkart. Got the TV delivered on time and you know I got the Samsung technician details even before the TV got delivered. TV got installed within hours after the TV was delivered. \n\nComing to the TV aspect, worth every penny you spent. I exchanged my older LCD TV for 4500Rs and got this for 12 k. TV clarity is top notch. Sound is fine. Only problem is with accessibility of the HDMI and USB ports if you going to Wall mount. Otherwise, I am good with this TV.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Oct, 2016", "reviewer": "Jawahir A"},
{"rating": 5, "title": "Worth every penny", "review": "Writing review after 10 days of use. \nFirst about delivery.i had recieved this tv after 16 days and that also after taking follow up many times. Though i faced this issue first time from flilkart. \nRegarding product its value fir money.same spec in shop is around 22k.picture quality is very good so one can't find any difference between hd or full hd.sound is also good for 15x15 room.ports are easily accessible.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Nov, 2016", "reviewer": "Kamlesh Singh"},
{"rating": 4, "title": "Really Nice", "review": "Good", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "FLIPCART IS FRAUD...DONT BUY ANYTHING FROM HERE!!", "review": "They are thieves....they sent us a broken TV...the technician open the box to find that the TV was broken and it has been 5 days they have not replaced it yet or they are not giving any solution...3 times someone from the company has come to check the TV but are they not giving us answers...from where I'm standing, I don't think I will get a replaced TV...I will wait for this week otherwise I have no choice buy to give a police complaint\\consumer complaint. They are treating us like criminal here!! NEVER BUY ANYTHING FROM FLIPCART!!! I have never had such problems in Amazon.", "verification": {}, "date": "12 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Does the job", "review": "Product is no doubtly good as espected from samsung as I brought it in 16440. But one backdrop is usb port is on the back side which makes it impossible to insert usb when the tv is in wall mount. You can use an usb extention cable to solve that problem. Another is sound is not that much loud but ok for medium size room.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 May, 2017", "reviewer": "Sudhin Kundu"},
{"rating": 4, "title": "Installation Problem", "review": "Product is very nice but I am very unsatisfied from your installation, Because after wall mounting of TV there is no space for the mounting of Pen drive & HDMI cables. So its very serious issue & i need your help to solve this problem.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Aug, 2016", "reviewer": "Sunil Singh"},
{"rating": 3, "title": "Fair", "review": "I brought this TV in flipkart big billion day for 16K..\nPros:\n+Picture quality is decent \n+Supports all kind of formats with out any troubles\nCons:\n -only one USB port and also It not a Hdd USB port which means it doesn't support external hard disk of higher capacity.I tried with 1tb hardisk it's not recognizing, then I used 8gb pen drive it's working fine..I checked with Samsung support they told me it won't support Hard disk.Thts a big disappointment fa me. now days it's not fair if we don't have that option.\n- I felt that the sound quality it produces is poor below average. I should go fa speakers the inbuilt one sounds very low quality fa me..\n\nOverall with two years warranty and decent picture quality,good service, reasonable price  makes it okay to buy.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Oct, 2016", "reviewer": "Flipkart Customer"}
]