[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Still a very capable iPhone. Just get a case.", "worth buy", "Good phone if you need budget friendly ios device", "Duplicate I phone 6 pasted on the name of shopping festival", "... 6 space grey from your darshitha electronics phone is good but the front camera is not fixed correctly and ...", "Very disappointed", "Good not great in 2017", "Apple is love. ❤️", "Pin it Amazon...", "Sh*t product"], "review": ["Still a great iPhone in 2017, may lose some of its charm in 2018-19 only.  \nGrab at a deal price and do yourself a favor - get a very durable case and\nscreen guard as this is still haunted by bendgate!  \nAround 23GB storage is usable.  \nNo lags or issues on iOS 11.  \nEverything else is same as other iPhone 6 out there.  \nYou know the deal with them all, so I need not chatter.  \nAgain, try to grab at a deal price - I got this for 19999.  \n  \nP.S.: If you’re ok with an even smaller screen size (highly unlikely, as this\none is very handy), go for the iPhone SE at similar price, as it has some\nbetter specs than iPhone 6, particularly camera and performance.\n\n", "THANKS AMAZON WORTH BUY ONE THING PLZ IMPROVE PACKING OVER ALL GREAT\n\n", "This iPhone comes with apple warranty i already called apple and verified with\nthem. I bought this from darshita electronics seller. Thank tou darshita\nelectronics for genuine device. If you want a reasonable price ios device\niPhone 6 is a good choice. Don't expect same performance as iPhone 7. ios 10.3\ntakes around 5gb of space in this rest you get free to use.\n\n", "I am giving 5 🌟 because people can see my condition  \nIt's shocking to see new packed pieces is not working...it's duplicate\nmaterial pasted on the name of Great India shopping festival....\n\n", "I have bought an iPhone 6 space grey from your darshitha electronics phone is\ngood but the front camera is not fixed correctly and it is some what side to\nthe screen please call me  \n9866765603\n\n", "Recieved a defective product. Problems with hearing callers. When on speaker\nmode, caller can't hear me and on normal mode, caller voice is very feeble but\nthey can hear me ok.\n\n", "Buying a product that has been released in 2014 in 2017 doesn't make much\nsense... At this price point you can go for many feature rich Android phones\nand if screen size isn't an issue, then iPhone 5SE is a wise choice as it has\nmany features of 6s. BUT if you are looking for the prestigious apple\nbranding, screen size, the reliability of ios, updates for at least another\n2-3 years at a pocket friendly price.. then 6 is a wise choice... (Strongly\nrecommended to go for 32GB or 64GB variant)\n\n", "Apple been best from beginning. If you are bored from android just jump to ios\nor bbos. And its best. Enjoying using iPhone 6. 32gb is way alot storage for\nme. Camera is just awesome, focus is perfect. Low lighting mode is some what\nhazzy. But other else its best.\n\n", "It was very unfortunate to have such bad experience from Amazon for a niche\nproduct like iPhone 6. The phone came with a faulty earpiece. It was giving a\nhazzy sound while calling. I wasn't able to hear the person on call at all.\nAlso when using apple earphones, the same sound Crips into ears. It was so\nirritating that it spoiled my love for apple product which I dreamt of buying\none day. I really hope Amazon take it on serious note and work on their\nretailers before exposing them to customers. It was surely a faulty at\nretailers end. There is reason why people choose Amazon over Flipkart and\nAmazon should really maintain that trust factors.\n\n", "Not even single star! I got a defected piece...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 October 2017", "on 16 August 2017", "on 13 August 2017", "on 16 August 2017", "on 8 October 2017", "on 23 September 2017", "on 5 October 2017", "on 13 September 2017", "on 26 September 2017", "on 15 May 2017"], "reviewer": ["Sachin", "prem pal rana", "Jimmy", "Amit Bhalsod", "p.harish", "Amazon Customer", "Jeevan L.", "Amazon Customer", "Rahul Dhillon", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Still a best in 2017", "Great product and amazing service", "Good one👍", "I am very much disappointed with the set I received", "32 GB version is slower than the 16 GB version", "Don’t buy online", "Damage", "Neat and well designed phone with an exceptionally good RAM handling better than devices who claim 4 GB ...", "Got I bad conditioned phone", "Received defective piece"], "review": ["Iphone 6 in mid 2017 sounds bit old.  \nBut this phone preformes like a beast.  \nIphone doesn't need 6gb or 8gb rams bcoz the ram management is so good.  \nThe camera is still the same from iphone 5s but great than lots of phones in\nsame price range. Good phone go for it.  \nThumbs up to Amazon for great service and genuine products.\n\n", "Amazing service by Amazon and the vendor. Initially it was stated that\ndelivery will be made within 4 days. But, to my surprise, it was delivered the\nvery next day. Got this on Amazon grand sale at a good price. Therefore,\nexpected a phone which was manufactured last year. Was glad to see that the\nphone which was delivered was manufactured in July only. Absolutely new phone\nwith all the valid documents. Pretty impressive.\n\n", "Really good, I bought it for my brother. it's very handy for everyone and\nlight weight. And thank to Amazon customer care service really helpful.\n\n", "Hi All, I am very much disappointed with the set I received, I purchased it in\nlast week of september 2017, and since this first week of December 2017 its\ngetting so much pain, I dont know I have not downloaded much of apps, not even\n1 mp3 or vedio songs, then too its getting freez while using simply, I am also\nunable to pick up the call at one go, and once I press power button, then call\ngets disconnected.  \nplease AMAZON, if you can do something with my handset. As this is ust 2\nmonths and I am not supposed to get soo many issues.\n\n", "Well, this might sound a bit weird, but the 32 GB version is noticeably slower\nthan the 16 GB version ! I had been using the 16 GB version of iPhone 6 since\na year and the less capacity of 16 GB made my phone memory full most of the\ntime. Thats when apple released the 32 GB version for around 28k and I was\nattracted to that. I gave off my 16 GB iPhone to my mother and I started using\nthe 32 GB one. Its been around 7 months of using the new 32 GB iphone, but one\nthing i found out was my old 16 GB version is much faster that than 32 GB\nversion ! The difference is easily noticeable when I use my new 32 GB and my\nold 16 GB phone back to back. The 16 GB one opens the apps very fast and is\nvery quick to respond. But my new 32 GB phone has a lag when opening apps and\nswitching apps. I thought this was an issue with my specific phone. Last month\nmy wife also bought a 32 GB gold iphone 6 and it also is slower. I think apple\nhas made some compromises in the hardware to bring the cost down in the new 32\nGB versions. Im disappointed with this.\n\n", "I wouldn’t advise anyone to buy a i phone online. Better buy it through an\nAuthorized Premium Dealer over the counter, even its for a higher price.\nBought this phone in exchange to my old I phone 6. It’s been giving problems\nfrom day one. Intermittently the touch doesn’t respond, message through the\ncontacts doesn’t function properly and many more. I got to know that the\nlatest I phone bought online have many issues. Looks like the dealers are\nselling us some second defective tested piece which probably after some\ninitial repair is been kept to be sold to countries like India.\n\n", "Head phone port is not working. I have to return it\n\n", "Neat and well designed phone with an exceptionally good RAM handling better\nthan devices who claim 4 GB RAM and die on performance when you do multi-\ntasking. Battery back up is awesome last for almost 2 days, charge super fast.\nHeadphone quality is good as well. This is my second purchase of iphone6\nwithin 6 month - i plan to purchase after seeing performance of first one!\nCamera and it modes are good, flawless. Will recommend to buy this one if you\nwant to have a taste of iPhone\n\n", "The delivered iPhone 6, is not in good condition.  \nThe display seems to be not in good conditions, looks like there is some\nmanufacturing defect or it might be an refurbished product. I want to send\nback this product and have this replaced with brand new iPhone 6.\n\n", "The phone is okay. But I think I may have received a defective piece. It's day\nthree of me using this phone and I am not able to hear anything on a phone\ncall. When I keep the call on the hands-free mode (loudspeaker) the other\nperson can not hear me at all. It's a speaker and mic issue. I am thinking of\nexchanging it. But apart from this very fundamental feature of a phone, this\nphone is pretty neat. Got it for Rs. 25,125\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 August 2017", "on 25 September 2017", "on 9 August 2017", "on 26 December 2017", "on 20 November 2017", "on 6 November 2017", "on 28 July 2017", "on 28 August 2017", "on 29 September 2017", "on 12 January 2018"], "reviewer": ["jenil dave", "Amazon Customer", "Pgtm", "Amazon Customer", "anand", "Preetham Poojary", "POORNIMA", "Amit J", "Harsha", "Amazon Customer"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Cheating, Not new product as mentioned in the listing", "Damage product & Very bad service", "iPhone 6(32GB), during normal operation, it's heating up ...", "Please don't buy iPhone from amazon. Buy iPhone from ...", "My wife of 50 years, who has recently developed ...", "Flagship of 2014 is still a flagship", "Amazon is best but battery back up not upto that mark.", "Defective handset", "within 7 days of buying the phone, I faced ...", "thnks & regards Austin HAPPY NEW YEAR"], "review": ["It is not a new phone as mentioned in the listing, no sealed packing, display\nglass has not fixed properly (might be after refurbishing), it is shaking up\nand down.\n\n", "I purchase I phone 6 32GB silent button not working & Amazon service is very\nbad my last purchasing product from this side\n\n", "iPhone 6(32GB) , during normal operation, it's heating up. Battery performance\nwith 50% brightness is also not as per expectation. Overall not meeting the\nApple expectation. While comparing with Mi phone with apple, Apple is heating\nup immediately, I don't know may be it is unique case.\n\n", "Please don't buy iPhone from amazon. Buy iPhone from showroom or Flipkart. I\ngot a defective product and it was not replaced. There was problem with audio\n,speaker and picture quality. I was trying for return or replacement. As per\nAmazon's policy iPhone could not be returned in case when defect encountered.\n\n", "My wife of 50 years, who has recently developed interest for mobile phones, is\nectasic to receive this. ! appreciate your promptness.\n\n", "Awesome product .  \nBlazing fast even after 10.3.3 updation .  \nExcellent quality in both hardware and software.  \nCamera is pretty good for a 3 year old device and couldn't make up with 2017\nflagship phones.  \nMore over it's gonna have software up date till ios 12 is damm sure.\n\n", "This is my first iphone and I m very excited to buy this product. The only\nthing that makes me disappointed that battery back up. It drains very quick. I\ncharge it many times a day. Full charged last for 4 hurs of app usage only. I\nm not sure if I should show it to Apple Service Center.\n\n", "Headphones jack is not working in brand new hand set what a piece of crape you\nguys sell me and I'm not in India for upcoming weeks so i can't exchange\neither its such a irresponsible job you guys done .\n\n", "within 7 days of buying the phone, I faced network problem in the device.\nNetwork bar was showing searching. I had to give the device to service center\nbut its 12 days I didn't get back my device\n\n", "The phone received, malfunctions often just as a customer review check the\nproduct before delivery.  \n  \nthnks & regards  \nAustin  \n  \nHAPPY NEW YEAR\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 February 2018", "on 17 August 2017", "on 30 September 2017", "on 29 September 2017", "on 20 July 2017", "on 23 August 2017", "on 13 October 2017", "on 2 September 2017", "on 18 September 2017", "on 1 January 2018"], "reviewer": ["Amazon Customer", "sanjay dhanjal", "Dharmendra Patel", "archana", "Ajoy Bhattacharjya", "jose john", "Arbind C.", "divesh goel", "Amazon Customer", "austin"]},
{"rating": ["1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Awesome phone", "I choose this IPhone because the less problems and good life, I got Phone on last week but ...", "One Star", "One Star", "This phone is refurbished", "Loose screen from day it arrived - continues to work though", "I like the product however after using for a few days ...", "Four Stars", "Ofcourse you buy it- if you are interested and well funded. its apple and worth to buy.", "Hi i bought this product a month back but i ..."], "review": ["Amazon has cheated royally I got used product bought it September 22 2017 but\nwhen I checked warranty it’s activated from July didn’t expected this from\namazon\n\n", "I choose this IPhone because the less problems and good life , I got Phone on\nlast week but am facing issue with less volume on calls. Its very low am not\nable to listen too .. Worst Experience .\n\n", "PRODUCT IS DELIVERED DEFECTIVE JUST IN 2MONTHS STOPPED WORKING PHONE IS\nHEATING\n\n", "Not functioning properly\n\n", "This mobile phone is refurbish volume & silent vibration button is loose. Not\nsatisfied\n\n", "I love the iphone. I dropped my original phone way too many times and ordered\nthis one. While the phone works as well as expected, the phone has loose\nscreen from the day it arrived. I have also noticed that it heats up quite\noften.\n\n", "I like the product however after using for a few days I noticed that the\nbattery drains out rapidly, I found it little strange as I have been using the\nit's predecessor for quite a long time and initially it's battery life was\ngood and later it's gone worse after a usage of about 2 years However I just\nbought an iPhone 6 and I am really disappointed with the battery life.\n\n", "It's good\n\n", "Nicely packed, and well dilivred.  \n  \nProduct is just as its brand name. No more lines needed to discribe when it\ncomes to brand like this.\n\n", "Hi i bought this product a month back but i am getting problem in touch\nsurface it is not working well i go and touch aome app it will open some other\napp , sonething weird happeing . Is it possible to replace the product or let\nme know what j can do\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 December 2017", "on 23 August 2017", "on 5 September 2017", "on 19 September 2017", "on 24 September 2017", "on 9 October 2017", "on 17 October 2017", "on 1 October 2017", "on 9 February 2018", "on 4 November 2017"], "reviewer": ["Shashi Kumar K", "Venugopal", "ASHOK KUMAR AGRAWAL", "pruddvii", "gaurav", "Abhijit Kolhatkar", "Prateek Prabhakar", "Amazon Customer", "Ghanshyam", "gaurav"]}
]