[
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Good!!", "Product details", "Pixel 2 excels!!!", "Google pixel 2 >> Great hardware and a fantastic software >>  A new benchmark in smartphone photography 👍", "This is an awesome device.", "Best phone I have ever used", "Initially worked great for a week", "Pure Android and Imaging Boss", "Superb android phone.", "🏅4/64🏅Oreo 8.0.1🏅SD 835🏅12.2 Rear/8.0 Front🏅Water Resistance🏅READ FULL REVIEW TO KNOW MAJOR PROS AND CONS OF PIXEL 2"], "review": ["I quite liked the phone. The video and photo quality is amazibg. I find the\nGoogle assistant sometimes confusing. For eg it will not answer calls for you\nwhen you are driving with navigation. Am yet to explore other features though.\nMay be it has far too many\n\n", "Fantastic device it's have 2 year onsite warranty that is really good  \nProduct quality is much better . Performance is mind-blowing\n\n", "I received the Pixel 2 (Just Black - 64 GB) well on time and have been using\nit for 2 weeks now.  \nThe phone speaks for itself and is already proven to be a top of the line\nsmartphone.  \n  \nBut just to mention some pros and cons from my perspective:  \nPros  \n\\- The main USP of this phone is the pure Android experience which is so fluid\nto use. It also remains up to date on the latest available version of Android.\nThe phone is always a breeze to use.  \n\\- Another USP of this phone is the great camera which gives you amazing\nphotos with high detail and dynamic range thanks to HDR+. Also stabilization\nusing OIS results in smooth videos and blur free photos.  \n\\- Now with the phone receiving Android Oreo 8.1 update, it has become even\nbetter. Things like AR stickers are so much fun to use. The Pixel Visual Core\nSoC has also been enabled, allowing third party apps to use HDR+ for\nprocessing photos. The Visual Core also adds more machine learning\ncapabilities to keep making the phone smarter day by day.  \n\\- Unlimited storage for photos (at least till 2020)  \n\\- Rich sounding front facing stereo speakers for which one can pardon the big\nbezels  \n\\- Waterproof with IP67 rating (good enough for splashes and dunks up to 1\nmeter depth for 30 minutes)  \n\\- One handed use  \n\\- Fast charging using the provided power adapter  \n\\- 2 years warranty  \n  \nCons  \n\\- Big bezels which is already outdated on most flagships  \n\\- No headphone jack. USB C to 3.5 mm adapter is provided but carrying it\naround everywhere is not always feasible  \n\\- Though you get unlimited online storage for Photos and Videos, the internal\nstorage is limited to 64 GB or 128 GB based on which you buy. So you can't\nstore tons of WhatsApp media and other such data. Long term users should\nprobably go for the 128 GB version. An expandable storage would have been\nnice.  \n  \nApart from the above pros and cons, here are few other mentions:  \n\\- The overall design is good especially the back which has a dual finish  \n\\- The buttons including the fingerprint scanner are tactile and intuitively\nplaced. The fingerprint scanner is fast to unlock.  \n\\- The battery is good for a full day of medium use  \n\\- Always on display is a nice touch and is useful to see the time and any\nnotifications by just lifting the phone or double tapping it.  \n\\- Active edge squeeze is a nice fancy addition to launch Google Assistant but\nnot something you would use much. Its currently useful when you need to launch\nAssistant half a second faster than long pressing the on screen Home button.\nIt would be more useful if it can be programmed to launch other apps or snap\nphotos or change the sound profile. You get the gist.  \nTo sum it up, the Pixel 2 is a great flagship all rounder which functions the\nway a smartphone was meant to and comes with some class leading features\nbacked by a great brand.  \nWith more budget the Pixel 2 XL is probably the better phone to own. But who's\ncomplaining :)\n\n", "Google is back with the second-generation of Pixel smartphones. Google pixel 2\nand Google pixel 2 XL are the latest offerings from google. Except the screen\nsize, bezels and XL's pOLED display and higher price, rest everything is\nsimilar in both the phones  \n  \nEdit >> The new Google Pixel 2 has bumped the iPhone 8 Plus and Galaxy Note 8\noff the number one spot to become the top performing smartphone camera in\nmobile photography tests.  \n  \nMajor Pros >> 👍  \n  \nPure and latest android software for the next three years  \nClean interface  \nThe best camera  \nUser friendly  \nPower efficient internals  \nGood battery life and fast recharging  \n  \nMajor cons >> 👎  \n  \nBig bezels in 2017  \n5 inch Small screen.  \nAs nearly borderless screens become common on flagship smartphones, the Pixel\n2’s thick frames make the phone look outdated.  \nNo 3.5 mm headphone jack ( but headphone adapter is included)  \nNo expandable storage - There’s no microSD card slot.  \nNo facial recognition or iris scanning  \nExpensive  \n  \nNow let's get on to the review in detail  \n  \nDesign >>  \nIt has a likeable design and divisive two-tone glass and metal rear .  \nThe circular fingerprint reader is on the back, along with a solitary USB\nType-C port on the bottom for charging. On the left-hand edge sits both the\npower button and volume rocker.  \n  \nDisplay >>  \n  \nIt has a 5-inch, 1920 X 1080 pixel AMOLED display with bezels  \nStandard 16:9 aspect ratio.  \nYou can choose from either “standard” or “vibrant” display profiles in the\nphone’s settings. The former produces more accurate-looking colours, while the\nlatter has a tendency to oversaturate colours – but not by much.  \nIt is reasonably readable in sunlight but for very bright conditions some\nscreen shading is required.  \nMovies and photos have a pop and vibrancy in colours.  \n  \nPerformance >>  \nThe latest Snapdragon 835 processor teams up with 4GB of RAM and a choice of\neither 64GB or 128GB of storage to give a Superlative performance >> smooth,\nlightning fast and snappy.  \n  \nIts graphics performance is more than good enough to handle anything you can\ndownload from Google Play.  \n  \nSoftware and Features >>  \n  \nYou get user friendly, top notch latest Android (Oreo 8.0.1) experience  \n  \nThere is a option to go for 64 GB or 128 GB in this variant .  \n  \nActive edge feature rocks >> Just squeeze the phone to silence an incoming\ncall or as a shortcut to launch google assistant  \n  \nAlways-on display >> Convenient feature that shows the date, time and\nnotification icon even when the phone sleeps  \n  \nThe coolest display feature is Now Playing , which can identify any music\nplaying in the surroundings.  \n  \nRegular updates will keep you ahead always :)  \n  \nCan upload unlimited photos and videos till 2020  \n  \nIt will get the upcoming Android P and Q and R updates before any other phone.  \n  \nPicture in picture mode >> is a feature focused on multitasking that lets you\nkeep one app, for example YouTube, in a small floating window while checking\nyour email or Google maps full-screen.  \n  \nSmart Text Select >> This automatically recognises items such as phone\nnumbers, place names and addresses, making it easier to select what you need\nquickly with a single tap and makes cut and paste much easier.  \n  \nGoogle Pixel 2 owners also get an exclusive bonus feature called Google Lens\n>> that turns your camera into a realtime object-identification tool. Just tap\nthe Lens icon when looking at a photo, and Google will identify the subject\nand provide useful information. For example, Google was able not only to\nidentify my pet as a dog , but also got the breed right !  \n  \nCamera >>  \n  \n* Rear: 12.2-megapixel, f/1.8, OIS, phase detection & laser autofocus, dual-LED flash  \n* Front: 8-megapixel, f/2.4  \n  \nIt has both optical and electronic image stabilisation for seriously stable\nshots.  \n  \nThe best ever ever to give you stunning pictures with superb dynamic range and\ncolour saturation . Gives better results than the dual lens camera of\ncompetitors.  \n  \nIt has set a new benchmark in smartphone photography.  \n  \nIt has fancy new features, like the ability to capture a few seconds of\nfootage around a still photo to create images that move.  \n  \nThere is Portrait mode in front facing camera also apart from rear camera.  \n  \nYou get stunning details in all lighting conditions.  \n  \nIf you like to post regularly on lnstagram then this is one handy weapon to\nget wow pics.  \n  \nVideos >> 4K shooting is crisp and with fine details, but the Pixel 2 suffers\nfrom some very super saturated colours  \n  \nIP 67 certification >>  \n  \nIt is completely protected from dust and dirt and if you accidentally drop it\ninto the bath tub while texting, no worries, it would survive the soak up. In\nfact it can survive in up to 1 meter deep water for 30 minutes.  \n  \nBattery life >>  \n  \nThe 2700 mAh battery is small but super efficient and it will last you a day\nbetween moderate to heavy usage plus fast charging will refill the juice in an\nhour and twenty minutes.  \n  \nDual Front facing speakers emit loud and clear sound and the bass is\nsufficient as well.That's rare and what I call functionality over fashion.\nMost phones have a mono at the bottom with sound quality compromised  \n  \nConnectivity options >>  \n  \nIt includes an E-SIM and a single nano-SIM slot that lets you latch on to 4G\nLTE radios. Then there’s the usual flagship options like Dual-Band Wi-Fi\n802.11 a/b/g/n/ac, Bluetooth v5.0 with LE, NFC, GPS and USB 2.0 Type-C port\nwith a reversible connector.  \n  \nComes with 2 year warranty  \n  \nClosest competitors >>  \n  \nYou have the iPhone 8, which has a 4.7 in screen and costs Rs 58,880 ( when\nwriting the review) the Sony Xperia XZ premium with a 5.5 in display for Rs\n55949, the Samsung Galaxy S8's screen is larger at 5.8 in, at Rs 58880,\ncurrently.  \n  \nWHO SHOULD BUY THIS  \n  \nIf you are an android fan and appreciate clean software and great camera above\neverything else.  \nIf you value functionality over fashion and substance over style  \nIf you want a phone that's smart, fast and compact .  \nIf you care for the pure and latest android  \nIf you want an AI buddy ( Google Assistant) to answer your queries and plan\nyour day with just a squeeze  \n  \nThen what's a bit of bezel to come in the way of your picking this gem?  \n  \nAND WHY SHOULD YOU AVOID PIXEL 2 XL ?  \n  \nThe 6 inch big brother has many issues like burn in , muted colours, greenish\ntinge on the poled screen..... etc cropping up ever since it was launched.  \nThe pixel 2 has had minimal issues which get fixed with software updates and\ncompared to the big brother it only has two minuses - small size and battery.  \n  \nVERDICT  \n  \nGoogle pixel 2 has a lot many things going for it but it's bezels and a bit\nsmaller screen seem to have overshadowed all the goodness.  \nWith the price dropping ( It was launched with price tag of 61000 for the 64\nGB variant) , If you buy it, you won't regret it at all.  \n  \nHope this is helpful to you :)\n\n", "This is an awesome device.. no app crashes unlike other Android devices.. the\nmain reason I switched to iPhone few years back was Android lags.. but this\none is perfect .. came with it's portrait feature is ultra cool.. OS fluidity\nis good.. being able to shoot unlimited photos and videos is cool but is\navailable just for three more  \nYears.. but for now this mobile is really good.. I got it for 51k in an\nspecial offer .. for 61k I think it's a bit too much\n\n", "Best phone I have ever used. Top class camera quality. I would say better than\niPhone's all series so far.\n\n", "Bought this handset on dec 25th. Initially worked great for a week, now not\nreceiving any incoming calls. Sim working fine with other handsets, but not on\nthis one. Tried with other SIM cards, unable to receive calls. Din’t expect\nthis from a google phone after paying 50k.\n\n", "Buy it for the unparalleled camera, Machine-learning and AI assisted\nexperience, and pure android experience\n\n", "I got this one over the XL because of the small form factor and the fact that\nit's been made by HTC. The camera is simply awesome. Battery lasts me over a\nday. But my usage is not too heavy. Charging takes about an hour from 10% to\nfull! Screen looks good too. Performance is fluid. Google assistant works\nflawlessly; much better than Siri (was a loyal Apple customer; but 92,000 for\nthe X forced me to look for options). Have ordered a Spigen thin cover for\nthis one since I don't want it to get too bulky. Love the stock android -\nclean and fast.  \n  \nSpeakers are not that loud even though they're front-facing. iPhone 8 is much\nbetter in terms of loudness. Sometimes I miss message notifications coz\nthey're too soft (even with volume turned up to full).\n\n", "Note:- Your Smart Buyer if your Reading this Review before buying Pixel 2.\nAlways read Reviews before buying anything Online. If your planing to buy\nPixel 2 , then do read my Review. Rather making a long review , i made it\nshort , i mentioned major Pros and Cons of Pixel 2. I Hope my Review Helps.  \n  \n●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●  \n  \nGoogle's first Pixel smartphonesweren't just smartphones; they were a\nproclamation that Google was more than just a software giant. They were proof\nthat it could craft first-class devices that showed off what Android was\nreally capable of. The new Pixel 2 and 2 XL continue that new tradition and\noffer some major changes to the Pixel formula. They're also among the first\ndevices to highlight what's new and notable in Android 8.0 Oreo. While they\ndon't get absolutely everything right, Google's new phones have still managed\nto further the Pixel's reputation for Android excellence.  \n  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \nBelow are the major Pros and Cons of Pixel 2  \n⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟  \n⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️  \n  \n✔️✔️✔️✔️✔️✔️✔️✔️✔️  \nPros/Likable/Advantages  \n✔️✔️✔️✔️✔️✔️✔️✔️✔️  \n  \n🏅Includes the latest Android stock operating system – Android Oreo.  \n  \n🏅Charging is USB Type-C with support for quick charging.  \n  \n🏅There is a finger print sensor, unlike Apple’s iPhone X.  \n  \n🏅It is water resistant up to IP68.  \n  \n🏅Highest rated smartphone camera (on the rear).  \n  \n🏅Squeezable frame to open Google Assistant.  \n  \n🏅Entry model has 64GB of storage.  \n  \n🏅Specs inside are the latest, with a Qualcomm Snapdragon 835 and a Adreno 540\nGPU.  \n  \n🏅It has a 5.6 inch full HD display.  \n  \n🏅A large 3,220 mAh battery, along with optimized software, for a long battery\nlife.  \n  \n🏅Amazing performance.  \n  \n🏅No camera bump on the rear.  \n  \n🏅A great quality premium-feeling phone.  \n  \n🏅Operating system updates always come to Pixel phones first.  \n  \n🏅4GB of RAM.  \n  \n❌❌❌❌❌❌❌❌❌❌❌  \nCons/Unlikable/Disadvantages  \n❌❌❌❌❌❌❌❌❌❌❌  \n  \n👎A very ‘2016’ design for a smartphone.  \n  \n👎No wireless charging, unlike the new iPhones and Samsungs.  \n  \n👎The front chins are still incredibly large, even for 2015/6!  \n  \n👎Quite expensive.  \n  \n👎The finger print sensor, being on the back, may annoy some users.  \n  \n👎There is no option to expand storage.  \n  \n👎There is no headphone jack (which is ironic considering Google made a big\ndeal out of keeping the headphone jack on the original Pixel last year)!  \n  \n👎Single SIM, unlike the likes of the OnePlus 5.  \n  \n👎There are still side-bezels around the screen, unlike most of 2017’s\nsmartphones.  \n  \n➕➖➕➖  \nFinal Words  \n➕➖➕➖  \n  \nThe main USP to Google smartphones comes with the operating system, where the\nconsumer can expect to always have the latest and greatest software from\nGoogle, with it always being stock Android. For many, this is enough to buy\nthe newest Pixel every year.  \n  \nHowever, Google ditched the Nexus line up, which targeted mid-range\nsmartphones, and opted for the high-end premium segment to target the likes of\nApple and Samsung. The problem is that, to do this, the smartphones they\nrelease need to also have the designs that compete against Apple and Samsung.  \n  \nYes, the Pixel 2 is squeezable. However, the front chin on the Pixel 2 is\nalmost criminal to have in 2017. Will people still buy it? Yes. But, I can\nimagine more people would rather pay a little more for the Pixel 2 XL ‘2017’\ndesign than the Pixel 2.  \n  \nUltimately, forgetting the design, the Pixel 2 is a brilliant smartphone. The\ncamera is the best ever on a smartphone. If you can get over the bezels on the\nfront of the phone, then Google might be onto another winner of a smartphone.  \n  \n●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●  \n  \nIf you have any Doubt regarding this Review or this Product, then Feel Free to\nContact me or Comment Below. Thank You for Reading this Review. I Hope my\nReview was Helpful.  \n  \n➽Regards,  \n➽Keerthi Kanth.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 January 2018", "on 9 December 2017", "on 21 December 2017", "on 27 November 2017", "on 16 December 2017", "on 7 December 2017", "on 7 January 2018", "on 20 November 2017", "on 2 January 2018", "on 8 December 2017"], "reviewer": ["Roopa", "Ravi", "Amazon Customer", "Karmic Voice", "Amazon Customer", "Asha", "Rahul", "Jason Samuel", "Farhad Tarapore", "🏅Keerthi Kanth Varma🏅"]},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["STOP THE HATE", "Silky smooth experience.", "Whole new level of android experience", "2017 High end Android mobile", "Five Stars", "Great", "Five Stars", "Zero rating for the design"], "review": ["People will say it's got bezels.. it has screen issues, It has no headphone\njack!  \nBut what they don't get it's that! It's the best ANDROID PHONE Till date and\nit's camera is the highest rated ever, not to forget the squeeze functionality\nto launch Google assistant. Google is a software inherited company and is\ndoing as promised and expected by it! Best phone indeed\n\n", "Warning! These are just first impressions on day two.  \n  \nI particularly dislike spending an obscene amount of money on a phone. But\nafter getting thoroughly frustrated using the Redmi note 3 (bad camera), and\nthe Motorola G4 plus (great camera that stutters and kills the battery, 'ghost\ntouch' and a ton of repairs in the first four months itself) I decided to\nspend hard earned money to take refuge in the Google ecosystem that I love. I\ntook a leap of faith and bought it online without holding one in hand at a\nshowroom.  \n  \nAs expected, the camera performance is great and the phone is quick. The\nstereo speakers at the front are very powerful. I am still exploring the phone\nbut I must say that first impression is good. That I can upload an unlimited\namount of photo and videos from its exceptional camera at full resolution to\nGoogle photos till 2020 is what tilted the balance in favor of this phone from\nthe I-phone 8 plus which is a worthy competitor. This phone is sleeker\ncompared to pixel XL and does not have screen issues that seem to plague the\nXL.  \n  \nI wish the fingerprint scanner was on the front though.\n\n", "Best Android smartphone of 2017 ,pixel series bring user the ultimate android\nexperience ,even though OnePlus 5t has similar specs and priced lower ,but it\nis not as optimised as pixel series ,Pixel 2 has the best smartphone camera of\nall ,overall the best Android smartphone even for its price ,but the better\nchoice is this  \nhttps://www.amazon.in/gp/product/B0756VRJ1N/ref=as_li_tl?ie=UTF8&camp=3638&creative=24630&creativeASIN=B0756VRJ1N&linkCode=as2&tag=amazon0d2be-21&linkId=2140ac3f3894189f36d881413f7393d5\n\n", "Better than IPhone 8, 8Plus and X at low price. That's smart Google\n\n", "Very good phone as compare iphoneX also. Camera is really dreat. The camera\nclearity is more then dslr.\n\n", "Great phone awam\n\n", "This phone is awesome\n\n", "This phone is not worth 61k. The design of the phone is very poor. It looks\nlike a matchbox.You can also see their ads they display their phone from back\nonly because from the front it looks like a china phone. You know they are\ngoogle -they are the makers of android but their is no unique feature for\ntheir phone. The camera quality is good but not good as the iphone 8 .They\nonly have limited camera features like potrait mode, photo sphere\n,panorama,slow motion thats it.No pro mode or raw image features.They invested\na lot of money on advertising and marketing of it against apple, but they\nforgot to invest on their design.I will prefer iphone 8 matt black over this\n\"just black\" phone.\n\n"], "verification": ["Verified Purchase"], "date": ["on 15 November 2017", "on 17 December 2017", "on 16 December 2017", "on 18 November 2017", "on 20 November 2017", "on 16 November 2017", "on 26 November 2017", "on 29 November 2017"], "reviewer": ["Shiv Jethi", "M.S. Gopalakrishnan", "Tech review", "Amazon Customer", "MEHUL KULKARNI", "Nk", "MyselfRules", "shravan"]},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []}
]