[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["A Real Masterpiece at Very low  Reasonable Price..!!", "Feeling grateful after get this phone", "Good phone but some minor cons", "Five Stars", "Best budget phone with 6 inch large screen", "Great Phone but Need some Tweaks to Get Better", "Bestest Phone in its category", "I loved it", "Honor 7x is the best!!", "No problem in the average price of 13 k"], "review": ["Incredible.. It's working like anything. Hats off Honor.. It's a Beast at very\nmuch reasonable price. Fully satisfied. For me Performance is primary and\nCamera is secondary. Degraded myself from galaxy note 4 to this masterpiece.\nNo Repent and really happy. Samsung mobile really pathetic..!\n\n", "In 13,000 price segment  \nHonor 7x is the king  \n  \nI am confused between mi a1 vs honor 7x before buying and now i think, i am\ntake the decision  \n  \nI love the phone  \nBig screen  \nGood battery life  \nGood processer  \nEverything is good in this phone  \n  \nIf someone looking to buy the phone ,go for honor 7x\n\n", "Phone is good in performance and looking .Emui is fine not aatract the user\nbut some features are good like eye protection and customization in nav keys\nand other main features.Come to camera i am disappointed as comparison mia1,\nthe main reason buy for a dual camera is portrait mode and mia1 gets an\nadvantage than honor7x but front 📷 is awesome and portrait mode is good in\nterms of front camera.. and phone is so big and company also giving a\ntransparent cover for back protection..but if anyone confused between honor 7x\nand mia1 go for 2nd one mia1 sure.\n\n", "Honor is best brand ....superb mobile.. .everything superb.. Display is top of\nthe chart.. Camera is too good...processor also good no lag... Looks awesome\n2.5d curved glass which is impressive... Best smartphone till date for\nme....I'm previously used vivo y66..  \n  \nOnly battery is bad.... Gives 4-5 hours screen play.... I'm cut 1 star for\nbattery... Charging time is 2. 15 hours... 0 to 100 percent....\n\n", "Best budget phone with 6 inch large screen. I am using it form last 40 days\nand never find any issue.  \nPros:  \nExcellent performance, software and build quality.  \nCons:  \nThe big thing I can miss is android Oreo. It launched in Dec 2017 with Android\nN but after few days Honor launched few other phone launched with Android O.  \nBattery back up is average which can last up to only one day if you are a\nmoderate user.  \nBrightness is bit low in sun light.\n\n", "Great phone with the new 18:9 aspect ratio. No lags so far, great screen\nresolution, eye pleasing UI skin over android nougat. Fingerprint scanner is\nvery fast. There was an issue of screen glitching experienced with youtube but\ncompletely curable ( I coordinated with the huawei customer care with live\nchat feature on there official website ), I didn't experienced it once I did\nall the steps they asked for. Camera wise it is somewhere above average, the\nbokah effect need some software tweaks to get better, low light imaging is not\nvery good, camera has loads of settings and modes to play with. It misses the\nfast charging in 16K price range, I guess they can provide that feature as\nmany companies in this price range are providing that in there phones so one\nless star.\n\n", "One of the best decision in terms of phone. I have waited to buy this phone\nsince its launch. Missed several opportunities while it went on sale. However\nfinally succeeded in grabbing it. All praised for its 4GB RAM & excellent\ncamera quality. A very handy phone which comes with free rubber cover which is\na blessing.\n\n", "The delivery of this mobile in 3 days as expected from amazon.  \n.  \nThe mobile was very sexy look.  \n.  \nOut of the box we got 3 gb ram free to use and 1 gb for system and in32 gb\nstorage we got 21 gb free to use.  \n.  \nAt this prise i love this mobile.  \n.  \nThe full hd display was awesome....the ui is free to use.  \n.  \nThe mobile is awesome buyed a premium mobie at this prise rang I'm satisfied\n\n", "Touch screen is better than my one plus 3t... Dosplay is good... Phone\nfeatures are good specially notebook can be opened while taking a call,\nwithout going back: so one can write something during call very easily. ..\nBattery back up is decent... Much better phone than MI and motorola... Looks\nlike it will be good companion for a long run... No heating issue!! Most\namazingly its looks are very nice and neat... Few people complained that\nYoutube app does not work and that is true but youtube is easily accessible\nthrough crome so no hard feeling... I disabled youtube and using crome\ninstead... Saved data as well, as youtube always neex to be updated while\ncrome is not so much frequently needed to be updated...\n\n", "Yeah awesome featured phone but the camera quality is not good as we others\nare giving in this amount. Speed is too good but the option of huawei cloud is\njust a formality and no update is there and still a major problem no option\nfor call record if we need something to record we have to download another\npackage for it that is a little bit trouble please provide a call record\noption in the next update because that is needed and if the update is launched\nin china then what is the problem in india make tit launch here\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 February 2018", "on 8 February 2018", "on 4 January 2018", "on 31 January 2018", "on 19 January 2018", "on 22 February 2018", "on 22 January 2018", "on 7 February 2018", "on 26 February 2018", "on 25 February 2018"], "reviewer": ["Alok Kumar", "Jo", "NITESH PAL", "bhavesh chamar", "Suresh Das", "Ayush Manral", "Arpit Jain", "raja vardhan", "deepak singh", "Dheeraj Kumar Verma"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["IMRESSED", "Just speechless......!!!!!!! 👌✌️👍", "Loved it!", "Bokeh master in 16 K budget", "not amazing but not bad either", "One of the best smart phone", "Best phone in this range", "Excellent phone, Great value for money", "Worth the money", "Very Nice phone"], "review": ["Used it for 3 weeks till now i have not faced any lagging, battery problem or\nany other problem. Till now i can say it is the best smartphone in this price\nrange\n\n", "Amazing.....!!!!! The only word to explain it...  \nSuperb speed in each aspects...  \nHad some doubt about charging speed as it has a 5v/2A charger but now fully\nsatisfied with the charging speed (in just 35 minutes from 37% to 99%) ;but\njust missing a front flash.....\n\n", "Buy this if cameras aren't your highest priority else buy mi a1. So far i am\nvery happy with honor 7x  \nPros-  \n1-Display  \n2-performance  \n3-rear and front cameras(rear-mi a1, front honor7x) . Sometimes portrait mode\nlooks artificial so i hope honor gives an ota update to improve portrait mode.  \n4-battery life(not as good as redmi note 4 but gets me through the day with\nnormal or moderate usage)  \n5-design(comes down to personal preference)  \n  \nCons!  \n1-no gyroscope sensor. I don't use vr so i don't have any problems with that  \n2-doesn't support wifi @5ghz or wifi ac. Still i have no problems since i have\njio .  \nSmall features i like in honor 7x  \n1- it has iPhone Ike spotlight search which comes in very handy when u have a\nlot of apps installed  \n2- using fingerprint sensor u can pull down notification panel which could be\nvery useful since 7x has 5.9\" inch screen  \n  \nOverall a great phone at 13k\n\n", "If you are looking for a budget phone with good bokeh effect , then you can go\nfor it. In Rs12,999 Redmi A1 can provide you the bokeh but its bokeh is not\ngood as this phone. I will recommend honor 7x. Have been using this from 1st\nJan, till no issue.\n\n", "apart from the 18:9 aspect ratio and the price there is nothing outstanding.\nsomehow it doesn't look as impressive as in the images and videos.  \nwaiting for good cases to become available online.\n\n", "Honor 7x is the best phone in this price (12,999) if you want to buy a smart\nPhone in this Price Range honor 7x is the best option. 10 out of 10\n\n", "Best phone in this range.  \nCompare with honor 6x.  \nBetter backup is not good.  \nDrain fastly in normal use.  \nSome time hang in writing text.  \nIn looking is phone is awesome  \nYou have to spend time to be in handy.\n\n", "Great looks, build quality and finish. Battery last for well over a day even\nwith moderate usage. Camera is excellent in day light however low light photos\nquality in auto mode is not that great. The edge to edge display quality is\nexcellent, be it for watching 1080p videos or for scrolling through the camera\nroll. Overall, it's a great package and a lot of stuff for what you pay.\n\n", "The phone feels great in hand and the 18:9 ratio really givess it a classy\nlook.  \nPros:  \nDisplay  \nCamera except the bokeh mode which is not as good as u expect but apart from\nthat a lovely camera  \nNo lag whatsoever and can handle ram very nicely  \nCons  \nAverage battery life and comparatively slow charging  \nP. S - after the very recent update u have the gyroscope sensor even.\n\n", "Very nice phone. Very satisfied with it.  \nThe only problem is that no tempered glass fits it. I tried fixing 2 different\nproducts of tempered glass but the sticking gum comes off after few days.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 January 2018", "on 4 January 2018", "on 9 January 2018", "on 16 January 2018", "on 29 January 2018", "on 14 January 2018", "on 20 January 2018", "on 15 January 2018", "on 17 January 2018", "on 13 January 2018"], "reviewer": ["Amazon Customer", "Amazon Customer", "Amazon Customer", "sanjeev", "rkrm", "Amit Kumar", "AJAY K.", "Paul Z.", "Swetaki_chatterjee", "Salvador Furtado"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Partially happy", "I picked 7x over MI A1", "Complete satisfaction", "Honor 7x good one, value for money", "Must Buy", "Almost  perfect", "EMI/Cash back game....", "Good Quality and Great Features", "After one month use 🌹", "Best under 13k"], "review": ["Only two things that could have been there. First is u can't put two simple\ncards and a micro SD card at the same time which is do inconvenient. Secondly,\nheadphones should have been provided.  \nApart from this.. the phone is very good. Good performance so far. Camera is\ngood\n\n", "I dare to buy this smartphone keeping Mi A1 in mind !! But i am Totally\nsatisfied with HONOR 7X !!  \nthe reason why i brought this is...  \n1) according to me in the year 2018 all new smartphones will be launching with\nthe 18:9 ratios and the magistic bezel less displays so buying the phone with\nTHICK forehead and THICK chin would be a Badest idea ! also the side bezels\nare not enough slim compared to the 7x..  \n2) Its okay to not having a stock android skin and android one for updates,\nyou will be getting bored after a week after using it cause it lakes\ncustomizations.  \n3) Mi A1 is a superb when it comes with a camera performance and it is\ncertified \"Gareebon kaa DSLR\" too and i appreciate that ! but u just dont get\nany extra features in the camera interface too !\n\n", "Very beautiful phone in 13000 lovely smooth screen clear loud sound super\ncamera both , good 4 gb ram good battery backup . I love honor 7x. I bought\nalso honor tablet t3 8 inch after this phone honor quality is so good.\nComplete satisfaction .\n\n", "Super build quality, good finishing, curved edge, metal body, full screen\ndisplay is the USP of this phone. Picture quality is very good. Front and rear\ncamera works good even in low light. Good phone to buy in this price range.\n\n", "Fabulous Phone. Feels like a high end device in hand will beat some 50 60 k\nphones in looks, Screen quality 5 stars  \nUser Interface 5 starts  \nCamera 4.5 stars  \nFinger sensor 5 stars.  \nThe only little con is you get 50 aprz gb in 64 gb variant and 20 aprx ijn 32\ngb variant.  \nI would suggest go fir this phone in this range. You won't be disappointed.\n\n", "If you are looking at good looking device with great build quality then honor\n7x is for you  \nPoints to be noted here is the screen quality it's amazing you will get the\nbest in quality you have ever used  \n*Performance is excellent its to Snappy but one thing that to be noted is you will face some login is in games like asphalt 8 but all other games will run smoothly  \n* selfie camera is excellent  \n*Rear camera is also great, having lot more modes quality is good  \n*except the , it is wrost ,every time it takes about 8 sec and photos gets blurry  \nSpeakers are OK, it is satisfactory  \n*Emui 5.1 is good and snappy  \nScreen is smooth  \n  \nCons  \n*Portrait mode is not that accurate in edges  \n*many bloatwares  \nSome time it may misbehave But it is software problem and I got a update of\nthat  \n  \nSo that's all  \nThanks for reading\n\n", "Product is ok but a blunder game played with me by Amazon by not converting my\npayment to EMI. I just came to know when my credit card bill generated and\nfull payment 12999/- has been deducted, eventhough I opted for EMI option\nduring final confirmation of my payment...\n\n", "My experience with the phone has been great up to now. I have been using the\nphone for more than a month now without any heating or hanging issues at all.\nThe display is too good with decent sound quality. The Honor UI is also very\nuser friendly and has many user friendly features to make your phone usage\nexperience a delight. I hope this phone would stay the same for at least 2\nyears. All in all great product from HONOR.\n\n", "Reviewing after one month use :  \nFirst thanks to honor for its awesome looks and beautiful camera. My friends\nwho are not aware about honor and only belived in samsung/moto are surprised\nafter seeing its gorgeous looks and cristal clean camera quality. Pics like\nDSLR. Very strong network magnetism. Now smoothly net surfing in regular train\njourny is not a problem. Battery stay easily for a full long day. Full charge\nin 2hours. FHD disply. And strongly built outer case. Front camera also very\nwell & takes nice pis even in very low lights. In one month no hanging or\nlagging created.  \n  \nCons: 1)- **hybrid sim slot is its main problem to me . 2)- No fast charger.\n3)- No frontal flash light. 4)- battery is ok for a moderate user but not for\na heavy gamer.  \nOverall : its true I am in love with this device. In my advice \"brother go for\nit\"\n\n", "For 13k it's a beast..  \nFull HD display.  \nWith 5.93 inches display it's perfect..  \nThough it have some cons by its kk.  \nWhat u need more in 13k..  \nAmazon rocks..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 January 2018", "on 16 February 2018", "on 19 January 2018", "on 22 January 2018", "on 11 January 2018", "on 9 February 2018", "on 9 January 2018", "on 29 January 2018", "on 17 February 2018", "on 11 February 2018"], "reviewer": ["Aditya Mandrekar", "Amazon Customer", "Ravi gupta", "Amazon Customer", "Kunal", "Suraj", "JYOTISH NATH", "Nachiket", "Amazon Customer", "Aman"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["perfect phone in this price range", "Great quality for the price", "Honor 7x a great product by honor in its price range Let me ...", "product is awsum as per given in the photo. ...", "Value for money", "First of all for this budget honor has provided a very good camera. Some people who feel that the phone ...", "Great value. But lighter EMUI required.", "Good... Great as well", "Worth purchasing at this price range", "Absolutely Beautiful. Design is sleek and feel is smooth"], "review": ["perfect phone in this price range.  \npros- big and bright screen  \n16 and 2 megapixel camera  \nfront camera  \nandroid 8 oreo will bring much better change in it.  \nsound is good  \ncons-2 megapixel back camera is not so good it can be made better  \nsometimes feels heavy  \nsometimes i wished i could have a smaller phone bcoz they are more convinient\nto carry\n\n", "Great quality for the price. Got two of them - when a friend of mine saw it,\nalso she wanted one. Screen quality is superb, as is the processor. For normal\nuse, without gaming it is really excellent. Camera works great too, with a\nfirm and calm hand. Sound is loud and clear. Connection in many different\nlocations is top.\n\n", "Honor 7x a great product by honor in its price range  \nLet me talk about some key points to help you choose  \nBattery backup is very good it lasts a day even with extreme usage  \nCamera daylight better than even mi a1 but low light average not bad but not\ngood as compared to mi a1  \nOn the performance front a great device for running every game on playstore.  \nIt looks awesome feels awesome and has got a protective case what else you\nneed.... Go for it\n\n", "product is awsum as per given in the photo.just go for it its really awsum nd\nbattery back up just fab.\n\n", "It's a value for money phone. Only con is no gyroscope sensor. But the Price\ndifference btn 32GB N 64GB is too high, it should be reduced\n\n", "It's been one month since i bought this phone. I really wanted to brake some\nmyth revolving around this phone.  \n1 Low light photography : First of all for this budget honor has provided a\nvery good camera . Some people who feel that the phone is dull in low light\nshould change their settings and its a gem.  \n2\\. Not good for gaming: Honor 7x comes with Mali Gpu which is old but not a\nbad one and they often compare with Adreno Gpu . Of course, Adreno is powerful\nbut Mali is only slightly below par . Reviewers often play Alsphalt Airbone 8\nto compare gaming performance which has lot of graphics and eats a RAM. At one\npoint any budget phone in the market will definitely have some nags when you\nplay such a high quality game.  \n3\\. Phone is not corning gorilla : Come on guys 2.5 D glass is same as corning\ngorilla which protects your screen from scratch and breakage.  \nPros :  \n1 . Extraordinary camera  \n2\\. Elegant screen display  \n3\\. Beautiful Design  \n4\\. Classy blue color  \n5\\. Smooth EMUI 5.1(Waiting for face unlock in next update EMUI 8.0 Oreo)  \n5\\. Powerful performance  \n6\\. Duplicating apps.  \n7\\. Honor cloud storage  \n8\\. 3400mAH battery.  \n  \nCons :  \n1 .Only cons is no fast charging.  \nOverall you can go it if you are looking for a long lasting, stylish, budget\neasy, better build and full screen display!\n\n", "Looks and performance is best-in-class. However the EMUI has some bloatware\nwhich is completely avoidable. Infact the UI makes the classy hardware look\ncheap in many aspects. Hope Huawei learns the art of clean Android from\nOnePlus. Then they'll be the best-in-class by a very large margin.\n\n", "There are lots of tech heads out there to get you of this product. It's good,\ndon't be too choosiee, if looking for a better display, go for it, as it has\ngot noticeable thin bezel and great display. I prefer 32 gb version. Go for\nit, comparing it from its rivals, mi a1 could have Android 1 but not this much\ngreat looks, moto g5s plus, one I've has better built quality but yep, not a\n18:9 display.  \n7x also outstands in terms of performance... So it's you... Your choice\n\n", "One of the best phone i have purchased.  \nIt has good built and very nice screen. Hery handy in using and not at all\nbulky. Till date date no problem ib using the phobe except few glitches in\ncontact no. That may be due to truecaller app.  \nBut yes missing the fast charging facility and little bit more battery\npower,.... May be 4000mh.  \nOverall paisa wasool.\n\n", "Absolutely Beautiful. Design is sleek and feel is smooth, an eye catcher.\nPerformance is great for its price tag. You won't regret it especially with\nits update to ore which is due soon. I'd recommend\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 January 2018", "on 10 February 2018", "on 31 December 2017", "on 24 December 2017", "on 9 January 2018", "on 26 February 2018", "on 16 February 2018", "on 15 February 2018", "on 6 January 2018", "on 2 February 2018"], "reviewer": ["prajjuwal", "Prema", "Piyush chaudhary", "Timothy Beero", "Amazon Customer", "vinoth", "Utsav Chaudhuri", "Pulkit Garhwal", "Amazon Customer", "Shashi N"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Simply Amizing", "Mast hai jabardast hai ,agr MI(kyuki ye sasta hai).  ke phone nhin pasand hai to isse behtr koi nhin", "Best in segment. Under 15k", "Value for money.", "Awesome phone in 13k range with amazing display and camera", "Excellent..", "Superb!!! Happy with the phone!", "Overall a good experience.", "Five Stars", "I am not happy to use internet in Honor 7x"], "review": ["Awesome look  \nCamera fabulous  \nStylish body outlook  \nFast prosessor  \nNo hang and all  \nLong lasting battery  \nBetter then MI phones  \nWorth for money  \nJust adorable.....  \nGo for it guys......\n\n", "Excellent battery life, ram space is approx. 2.9 gb, a lot of features with\ngood camera phone, in its price ,handling is eas,no heating issues.  \nCons-  \n1\\. Front camera didn't come with light  \n2\\. For video call third party app. Is necessary ( direct video calling is not\navailable).  \n  \nThank u  \nNo other issues .\n\n", "Straightforward: a very decent and feature loaded phone. Mia1 only recommend\nif u love stock android. Else 7x is better in all aspects.  \nBetter battery, better cameras, equivalent performance. Better SCREEN.\n\n", "An excellent phone with a full value for money. The screen is awesome and the\ncamera quality is also good. Sound quality is also very decent. There is a\nvery little lag in spite of multiple apps being opened simultaneously.  \nOnly con is  \nThe firmware eats away almost 10gb of your total space of 32 GB. Now I uses 2\nSims so , the sim slot being hybrid with memory card, I will be struggling\nwith space.  \nOtherwise a very good phone. Go for it.\n\n", "Very nyc phone in 13k price. Value for money  \nThe best part of this phone is its display and camera. 18:9 aspect ratio is\nbang on and the phone has an amazing camera. Battery life is super cool. Phone\ncharges from 5-100%in 2hrs 10 mins approx. 4gb ram and the processor works\nvery smooth. Hoping to receive the emui version 8 and android oreo update\nsoon.  \nCompared to other phones in this price range like MI A1, Moto G5s plus etc.\nthis is the best phone amongst all\n\n", "Excellent ....Honor 7X ..Iam using this mobile from past 15 days...It's looks\nstylish,touch also working very smoothly..battery backup coming easily 1 to 1\n1/2 day...so there is no prob with charging..call quality also good....its\nprocessing multiple apps in same time..there is no lag issue..  \nBut in some reviews i saw screen flickering issue while using youtube and\nwhile watching some hd videos...But for me no problem ...may be they fixed\nwith latest patch recently i did update..  \nFinally mobile was good..\n\n", "Stylish looks and lightweight, smooth and fast processing speed, great camera\nesp. the front camera, rich display and plenty of customize-able options! In\nshort, full paisa vasool!\n\n", "The look and feel of this phone is really beautiful, you actually won't feel\nthe extra burden of a big screen phone. Display quality really good. Processor\nis quite fast.  \nNot really happy with the secondary rear camera, in normal mode it takes\nreally good pic, but if you select dual camera mode it won't give you a proper\nDOF image output as its been done in software level and not in proper hardware\nlevel.  \nLastly not good for long time usage as the battery is really not that big, can\nrun for around a day with moderate usage.\n\n", "Have used it for 2 weeks so far all good...  \nCamera is superb ...  \nDisplay owsom....  \nTouch response and finger print great...\n\n", "I like the design of mobile. It's look very cool. I like all the features of\nmobile. But I am very very DISAPPOINTED with the parfomantion of this mobile.  \nInternet is working very very slow if I comper with my Motorola G5S PLUS.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 January 2018", "on 19 January 2018", "on 17 January 2018", "on 12 February 2018", "on 13 February 2018", "on 5 February 2018", "on 21 January 2018", "on 7 February 2018", "on 25 December 2017", "on 20 January 2018"], "reviewer": ["Vikram G.", "Amazon Customer", "Prashant", "ANIRBAN DUTTA CHOUDHURY", "Sandeep Mehra", "Amazon Customer", "Abhishek", "Saunak Banerjee", "Amazon Customer", "Amazon Customer"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Since I have purchased this phone (Honor 7), I ...", "Worth to buy..", "Product is awesome guys.", "9 display and Premium feel metal design nice UI and many features like lock screen wallpapers changed ...", "Good n decent mobile", "It too 3 to 4 days to......", "Superb  loved it", "Best in its segment!", "good Display  mobile performance very smoothly", "Excellent mobile, feeling reach"], "review": ["Since I have purchased this phone (Honor 7), I am making rounds of the service\ncentres and service provider. Please don\"t purchase this phone. I have\npurchased this phone on 28th Jan, 2018, not even one month back. The numbers\ndialled on the phone (tried with different SIM cards) is not going through to\nthe right number. Some times I am getting the message that \"you are not\nauthorised to call this number\". On certain numbers the call goes through to a\nwrong number. On majority of the dialled numbers I am getting the above\nmessage. On a few numbers the calls don't go through and on some the call\nlands on a wrong number. However, on a few numbers the calls go through\nproperly.  \n  \nK A. Bangera\n\n", "Wow..I bought after lot of analyse.  \nPros. Wonder dispaly&design. Good build quality. Amazing Front camera w\nPortrait mode. Back camera is Satisfactory. Battery life is very good.  \nCons: Little disappoit UI. Lower user memory as low 19gb in 32gb Variant.\n\n", "Product is awesome guys .. amazon even delivered it before specified time, to\nbe honest camera is good, battery performance is too good, great build design,\nlooks very stylish and attractive ,overall its a worth for 13000 .. you must\ngrab this phone. Amazing\n\n", "Worth for Money Just Go for it.5.9-inch Bezel-less full screen with Vibrant\n18:9 display and Premium feel metal design nice UI and many features like lock\nscreen wallpapers changed automatically and default data speed meter memory\ncleaner optimized storage.and many...i love honor 7X .  \nFront Camera quality is Average in low light. back cam is good, especially in\npro mode..Overall worth..\n\n", "Display is super  \nAudio via earphones is excellent  \nBattery life is ok  \nWeight is little heavy  \nWaiting for Oreo update  \nAmazing express delivery by***** Amazon*****\n\n", "4.5 out of 5. 5 less because of camera front is not upto the mark also compare\nto my last phone Asus zenphone 2 laser camera quality is good when you see\npicture on PC.  \n  \nAmazing looks and screen size, handy phone and sleek design.  \n  \nSound is good.  \nIt took 3-4 days to get satisfied by using this phone, you won't like it\ninstantly.  \n7 days no issues yes.  \nRecommended for game users and people who watch movies.  \nIf you are looking this phone for camera, I would suggest go for Asus series.  \n  \nCharger is quite good.  \n  \nAdded pictures for close photography so that you can check picture quality.\n\n", "Awesome product and I just love this mobile phone.....\n\n", "The latest huawei product honor 7x is the best in its class. Its the best u\ncan get in the budget segment with unique and attractive features. The large\ndisplay of 5.93 inches with 18:9 aspect ratio is the best part of 7x. Its also\nvery fast and efficient in dual tasking and with kirin 659 processor the phone\nworks very fast and theres no ponint of laging in operations being done on\nthis phone.\n\n", "honor 7x mobile review  \n1)Display 10/10  \n2)camera 8/10  \n3)battery 8/10  \n4)fingerprint 10/10  \n5)performance 9/10  \n6)music 8/10\n\n", "Excellent mobile, feeling reach.  \n  \nAll parameters are ok. I like this phone, buying one more for my family\nmember.  \n  \nPlease go ahead for this phone , value for money.  \n  \nDesign and look is compared with one plus and I phone.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 February 2018", "on 7 January 2018", "on 16 January 2018", "on 9 February 2018", "on 24 January 2018", "on 21 February 2018", "on 29 January 2018", "on 13 January 2018", "on 5 January 2018", "on 14 January 2018"], "reviewer": ["Karunakar A. Bangera", "Thirumurthy N A", "Rahul Negi", "Rajasathish", "krishnaphani", "ABHYANT", "Salman ali", "raghubir singh", "challa madhu", "Mayur Dagadoo Madhavi"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Genuine customers", "Perfect phone under 15k", "Best pick in the price range", "technically updated and good looking phone within this price", "Best mid range smartphone", "Superb", "Best Honor mobile under 13k", "Ideal for this price", "Some special features like when call is connected there is Notepad option so ...", "It is an awesome phone. No complaints at all"], "review": ["i am used the honor 7x as genuine 7 days  \ntwo major defects  \nfirst one battery backup not good very fast discharging  \nsecond one after the system update camera quality very poor(because i used two\ndays after it asked to system update. i updated after that only problem\nstarted, i have taken photos color batches are there while zooming. the same\nway i done the factory reset after the photographs are amazing Wonderful !!!\nand i like it dual camera depth focus not good.\n\n", "I'm using this phone since a month. Some Pros and Cons I observed...  \n  \nPROS -  \n1\\. Great Camera! I compared it with one plus 5, iPhone 7plus, and if not\nbetter, it gives quite comparable results. Also, with loads of camera features\nit stands tall compared to all mid range phones.  \n  \n2\\. Awesome looks,display and build quality.  \n  \n3\\. With the gyroscope update, the phone feels even more premium as you can\nenjoy 360 degree videos. Good for VR lovers.  \n  \n4\\. In the power saving mode, it can fully charge the phone under 3 hours.  \n  \nCONS -  \n1\\. The only reason I'm not rating it as 5 star is because of its performance\nlag at times. It doesn't hangs but takes more time to open an app. That's very\nrare but I think honor should fix this issue with its update.\n\n", "Im using honor 7x since 8th January.Honor 7x is a good phone in the price\nrange.but company should work more on the bokeh mode(sometimes pictures look\nartificial).  \nIt got many options in its camera section. And are useful.apart from this the\nphone is very fluid  \nUI is good.it is about to get the oreo(8) update and face recognition.I got an\nupdate(EMUI) on 14th january and since then gyroscope is working.battery is\naverage(one day).videos playback and sound is good enough.\n\n", "After seeing reviews here, I planned to buy this (Honor 7x). Yesterday I\nreceived it and from today I started using.  \nIf you're looking for a bigger display, technically updated and good looking\nphone within this price, then it is a perfect one.  \nDon't compare with other phones with same category as this is unique in its\ndisplay (I have done it earlier:-)).\n\n", "Awesome phone.... Go for it.I upgraded from honor 4x.The best thing is the\ncustomization of the phone.  \n*custamizable fingerprint and every other feature u know if ur a old honor user  \nPros  \n*display is great the display glass is protected by gorilla glass  \n*fluid performance  \n*camera is superb good low light pictures  \nUninstall all bloatware games  \nCons  \n*take too much time to charge  \n*hybrid slot\n\n", "Cons  \nOutdated ui  \nAverage rear camera performance  \nAnd many applications comes already with in the phone  \nPros  \nLooks very stylish  \nLighting fast fingerprint sensor  \nFront camera is superb  \nScreen is very big  \nAnd it can be handled with single hand  \nProcessor is good  \n  \nIt is the best phone under 15000 rs believe me I had also used mi a1.but it is\nquite better than mi a1\n\n", "Best mobile of Honor in budget 13k.  \nVideo quality amazing 18:9 display make it more awesome for full hd videos.  \nAlso have gorrila Corning glass which made its touch smothy.  \nSuper fast fingerprint sanser.  \nAlso camera features good.  \nNd battery backup full day in raguler uses.  \nAmazing looking like iPhone x.  \nSo anyone have 13k budget for mob.who should to buy it.\n\n", "Excellent smartphone for this price. Easy to use. Excellent camera. Good\nmemory and speed.👍👍👍👍👍\n\n", "It is not only a mobile but it is a complete package for our daily life. Some\nspecial features like when call is connected there is Notepad option so that\nwe can write number or any other information during call. Health application\nis also here. It track exactly exercise with calories burn and heart beat.\nWith fingerprint sensor we can change photos in gallery. Camera and battery\nare awesome. No matter of hang. Looking gorgeous. No option to reject it.\n\n", "It is an awesome phone. No complaints at all. Don't think twice. This is best\nphone for the 12K range in the market. It is sturdy and screen doesn't get\ndamaged even after multiple falls. I experience around 8-10 falls per day.\nCamera quality is very good and specially wide aperture mode will give DSLR\ntype effects\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 February 2018", "on 24 February 2018", "on 17 January 2018", "on 9 February 2018", "on 31 December 2017", "on 7 January 2018", "on 16 January 2018", "on 26 January 2018", "on 7 January 2018", "on 5 January 2018"], "reviewer": ["Sanjay Ramasamy", "Rahul", "navaneeth", "$ohail Kh@n", "SHYJO JOSE", "aditya", "Mr. Mnnt", "Subhash Mehta", "LALIT ", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Nice phone. But internal memory is very low", "Superb phone I m using this from 2 months. There is no issues with performance of phone", "A little less than perfect", "The phone is amazing. As some users said the flickering screen i ...", "Great Phone despite some flaws", "Does everything right.", "just buy this phone .. bahut badiya fone h iski look to katil h, touch smmoth h..value for money h.", "Best option at this range with top notch performance", "Good and decent phone for the price with the latest features", "Great Buy! No heating"], "review": ["Awesome phone. Have been using huawei P8 lite for a long time. But honor 7 x\nfeels light in the hands and amazingly fast. But internal memory is very low\nin the 32 gb variant. I should have gotten the 64 gb product.\n\n", "The phone is just awesome . The performance of honour is great. Look wise and\nprice wise it is better than mi A1 and yaa performance by too. The\ndisappointing thing is that it take. 1hrs 30-40min to charge completely from\n15%. But it last for a day. But if u are a heavy user then you have to charge\nit again. So overall the phone is very well . People doesn't like it by camera\nwise but.... Trust me it takes superb pics but front is little disappointing\nin dark but in light it also.....takes such a cool Nd beautiful pics . Soo go\nahead and buy this without any hesitation...\n\n", "Awesome phone  \nJust rear dual camera doesn't work very well and bokeh effect looks\nbad(background blur don't work nicely) and gyroscope absent  \nSome features will come with ota update like face unlock but till then wait  \nOther than those it has everything perfect  \nBest thing is the performance and display with more than average battery\nbackup.\n\n", "The phone is amazing. As some users said the flickering screen i too have\nfaced it for one time. Thats what made me dissappoint but with an software\nupdate it went away.  \nThe camera is good but rear potrait mode, dual camera are nof satisfactory.\nOverall i liked the phone. The battery back is okk eith me.\n\n", "Great Phone despite a few flaws like the artificial bokeh effect (wide\naperture mode). The recent update enabled the Gyroscope sensor so now you can\nenjoy VR content.  \n  \nA beautiful infinity display with dual camera setup and decent performance at\nthat price is pretty sweet.\n\n", "This phone looks absolutely stunning! Does everything right and then some. I\nloved the feature loaded camera too. I'm upgrading from my 4 year old Moto G,\nso maybe my expectations weren't too high and the 7x has definitely surpassed\nthem. I'd be very happy if this phone turns out to be even half as durable as\nmy Moto G.\n\n", "very good phone with awsome look .. go for this..i have bought this phone in\n21 dec 2017. before purchasing this phone i have only two negative review .1.\nslow charging .... but i have honor 6 charger from which i can charge it from\n0 to 100 in 1:20 min max. 2.Gyroscoe but this is not a major issue. overall\nvery good phone\n\n", "Best option at this range with top notch performance. However rear cameras are\nnot upto mi A1 but front camera is way far better than mi A1. Most attraction\npoint is the bezeless display itself. With decent battery backup also heating\nis less while compared to miA1.Speakers are pretty good.finger print sensor\nworks just fine. Comes with a jelly case so no problems while attaching\ntemperd glass.  \nIn this range i would recommend 7x than any other phone at this price.  \n  \nPs:this is my opinion what i felt no offense\n\n", "Good and decent phone for the price with the latest features . A 18:9 ratio\ndisplay pritty good . But not water proof . Though it's not not water proof\natlest for the price it must at least have a water resistant feature . Camer\nis quite decent . But the camer features 16+2 Mp at the back why not at least\n16+5or8mp . Even at the front the selfi camer a it's pritty good but the front\nflash is missing. Though all this problem it's a good choice for those who are\nsearching for a mid-range phone with a good processor\n\n", "Great Buy !  \n  \nNo heating , Good Multi Tasking , Better Camera after last update . Good Ram\nManagement . Build quality great ! Cover provided with phone fits well. 16k\nnearly for 64 gb is not value for money anyway.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 December 2017", "on 26 February 2018", "on 12 January 2018", "on 21 January 2018", "on 13 January 2018", "on 8 January 2018", "on 23 January 2018", "on 4 February 2018", "on 18 February 2018", "on 1 February 2018"], "reviewer": ["Amazon Customer", "Neha Patel", "Samar", "Anitha kumari B", "ram", "Anirudha", "monu", "soorajsatheesan", "Helper", "Nirmal Raj"]},
{"rating": ["3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["OK type... Not great", "Always looking good phone in budget price", "Awesome power packed phone", "Well over all it's good device. Hope Honor giving orea update with Jio ...", "Amazing camera, I chose blue coloured handset and it ...", "Four Stars", "Very good phone in this price...works faster and smooth", "I strongly recommend you for purchasing this product.", "Superb", "Excellent phone in the price range. Battery life is wonderful."], "review": ["It's a OK type cellphone not great. User interface could have been better what\nI felt after using lenovoK3 K3 note for 3 years before using it. Camera is\nalso OK type and not great. Lot of issues I am facing regarding jio vedio call\nwhich is not yet sorted. Also after connecting to laptop for some reasons data\ncan't be transferred from one to other.. May be some options may be there\nwhich I could not find... With lenovoK3 all automatically used to happen. For\nsome one like me who is not very good in all these it's tough to operate.....\n\n", "Phone is awesome, gyroscope cencer is available in new update, but audio\nquality is not up to the mark coz i m using skull candy n the sound quality is\nnot up to the mark otherwise itzz awesome in this price range\n\n", "This phone is awesome.Perfect i every manner.  \nVery much impressed by its performance and looks.  \nI have used it more than a week so i can present my views on it.  \nPerformance-9/10  \nCamera-8/10  \nRam Management-9/10  \nLooks-9/10  \nBattery-9/10  \nOverall-9/10  \nMain point is it didnt lag any where smooth control and interface.  \n4GB RAM makes Gaming awesome  \nBut still you are confused with MI A1 then you should go with this phone it\nwill not let you down.\n\n", "Decent look with display but camera out put not ok as mentioned by Honor. Well\nover all it's good device. Hope Honor giving orea update with Jio video call\noption and camera out put.\n\n", "Amazing camera, I chose blue coloured handset and it came with a transparent\nback cover, it is sleek and finish is excellent and display is also superb,\nvery happy with the product, performance so far has been great.\n\n", "Nice product.... Worth mobile... Nice camera quality.. Feeling awesome....\nCompare vivo and oppo.. Honor best price....\n\n", "Phone is very nice....looks wise is very good...working smoothly and\nfast...very good product withing this range...  \nBut once it falls down it get damaged whole screen.\n\n", "I would like to give 5 star to this mobile  \n  \nSuperb phone......it's feel rich look when we used.... Everything is really\ngud at price. 13000  \nAs compared to other phones....this device is best.....No need to fast\ncharging....  \nBattery back up is very gud....  \n18:9 ratio full HD display... Looks great.  \nExcellent Display  \nAmazing performance with No hanging No Heating,\n\n", "Mind blowing phone, i have been using this phone since last 15 days, it\nperforms excellent, battery also good, it has not take so many time to full\ncharge and backup very good, I love this device,  \nI think it is the best phone in this price range, u can buy it without any\ndoubt\n\n", "Very good phone with excellent display, good sound also battery life is very\ngood and lasted for about 2 days with videos, fb, watsap and other apps in the\nbackground\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 February 2018", "on 26 January 2018", "on 11 February 2018", "on 22 January 2018", "on 15 January 2018", "on 30 December 2017", "on 23 January 2018", "on 8 February 2018", "on 12 January 2018", "on 3 January 2018"], "reviewer": ["Rhythyma", "Chandan kumar", "Toyesh Gour", "Amazon Customer", "VC", "Hemanth", "Ranjit Gupta", "Bhavin", "Faizul h.", "Sanjit"]}
]