[
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Kirin 950 is still a great performer compared to the budget chips", "Bad product - not recommended", "must go through it .. complete observation & review of honor 8 . ( my experience )", "for 14999 its absolutely must buy verry good phone. camera quality is amazing", "HONOR 8@ bellow Rs15000 ..le lo..Socho mat guys..", "Five Stars", "Good phone, spoiled by bad software features.", "The beast under Rs.25000", "one of the best camera in this price range I have ever used", "A little brief review"], "review": ["Although honor 8 is a bit old now its checks all the boxes. You won't be\ngetting a 18:9 display and latest android but the device is fast and\nresponsive. Kirin 950 is still a great performer compared to the budget chips.\nI really like the glass back of this phone and fingerprint reader is fast and\nresponsive. Camera is great, it has a usb type-c port, the screen is also\ngorgeous for a 1080p display with nice viewing angles and sunlight\nreadability.  \nIt might not make sense to buy a phone with big bezels and older android\nversions right now but if you look past them honor 8 is a superb phone.\n\n", "Wifi not working. Network signal not getting connected. Heats up like an iron\nbox. Poor battery performance. Good camera and design.\n\n", "great smartphone with monstrous spec. just it has single sim only , charged\nfast but drains too quickly, heats up .. after discharging below 20 % it\nstarts lagging , though there is 100% charging we can use 98 % of it , when it\nreaches to 2 % it switch off automatically . though it has shiny look but it\nis too much delicate to handle , scratches can be viewed on side edges clearly\nand it is irritating, it is extremely slippery as it has glass coating on back\n, better to use back cover , it catches fingerprint so better to buy pearl\nwhite color if you are going to buy honor 8 . we don't get earphones with the\npackage .. color reproduction is amazing on this phone , camera is good ,\ninternal memory available is only 26-28 GB . one has to handle this smartphone\nwith care more than his Girlfriend n he deserves that too !\n\n", "for 14999 its absolutely must buy verry good phone. camera quality is\namazing.getting screen on time of 4 hours with 1 hours talktime.phone is verry\nslippery back cover is must.sound quality of speakers are also good\n\n", "I have already used Samsung j series and lecco le 1 s smartphone..now first\ntime used honor brand ie Honor 8..I bought it only Rs 1500O on Amazon diwali\ndeal.. on 15 Oct 2017.My honestly review on Honor 8 approx 100 days after\nuse... DISPLAY..it amazing display with FHD. picture quality is amazing and\nbrightness is very well on sun light. It is compact in size. I like 5.5\ndisplay but I compromise with us by other great feature.. I watch download\nmovie see on night with eye comfort move..it is very useful for eye\nprotection.. CAMERA..camera quality are supperrr .me and my wife's and other\nfriends are surprised by camera... Rear camera are supperrr and front camera\nwith moonlight selfi in night are very smart picture.. both camera quality are\namazing and surprised me and other friends..my 2 nephews says...chachu is\ncamera bahut bahut accha h..they clicks more and more photos by difference\npauses..my wife is completely fidddaa on it camera and pictures quality .she\nask me given its model but I promised her when I got govt job..I given own\nhonor 8 model .that is my economical problem. BATTERY...it's battery given one\nday backup with moderate use..my device fully charged in1.5 hour around. Ultra\nbattery saving mode is very useful on low battery condition.. FINGERPRINT\nSCANNER... It accuracy 99.99. % .I am impressed by its accuracy. It is more\nfast scanner. SMART kEy.IMPLANTATION...it work various functions.i. e1. photo\ncapture,2.locking device.,3 photo and video album movement ( slide).4\nNotification window opening,5.receiving call, 5.please set many more smart key\nfunction which need you... SOFTWARE.. it naught update .volte support.faster\nbrowing. Very very smooth running . BUILD QUALITY... It is very compact in\nsize that is no large and no small..one handed grip, comfort for handling and\ntaking long duration call period. IT IS VERY THIN.O only 7.4 mm thickness..\nfinishing very very well and attractive .back portion made by art of\nglass..which is jhakkkass.. SAPPHIRE BLUE.. it is unique colour. And very very\nattractive.. I say with you confidently..you purchase blue.in your hand.. your\nfriends and other say you...kya colour h.. ekdum mast bindass.. wo log ek baar\nisko jarur hath me lekar dekhangey.. and says wahhhh.. SINGLE SIM...I lack\nonly one point (NEGATIVE) that is single Sim device..I compromisd it by its\nits colour ( BLUE) price 50% discount and smart key function,build back by\nglass AND dual 12+12 rear CAMERA 8 M.P moonlight selfi also.  \nIf my honestly review..is useful plz like it.thanks guys ....\n\n", "excellent phne decent camera loved it ... bought in deal price ... thanks to\namazon\n\n", "The phone is very good hardware wise, although it's completely covered with\nglass, so it's incredibly slippery even for usually safe hands. You'll\ndefinitely want a case - if you want to retain the look, gp for a transparent\ncase.  \n  \nThe software (Android with EMUI) is where things fall apart - EMUI is badly\ndesigned. It can't decide whether it wants to keep an andeoid feel or rip off\niOS look, and ends up doing neither. Probably it combines the worst of both\nworlds. After spending some time uninstalling bloated apps and disabling a lot\nof huwaei \"features\", the phone became a little useable. Also, I'm not sure\ntheir \"battery optimizations\" are not just a way to keep users from using\nbetter third party apps.\n\n", "This flagship from honor is a beast! It is superfast in processing and ram\nmanagement. I am writing its review after 6 months of purchase. It has a good\nset of cameras for photography. It has an ergonomic design. The fingerprint\nsensor is the best among any device! Even after 6 months use, this device has\nnot slowed down!  \nPROS:  \n1\\. The cameras both front and rear.(photography)  \n2\\. The speed. It is beast in terms of processing.  \nAt a price range of under 25000 phones, you can surely go for this phone in\nterms of processing speeds and cameras. The cameras capture better and real ti\nlife colours. It is better than iphone 6s in terms of colour capture.  \n3\\. The build quality is excellent. It is surely the most beautiful phone\nunder Rs.30000 category.  \n4\\. The EMUI. It is a very powerful UI. Gives access to a lot of\nfunctionality.  \n5\\. The fingerprint sensor. Honor might have the most customisable fingerprint\nsensor. It very fast and a lot of features are embedded in it.  \n6\\. Its Full HD display is crisp.  \n7\\. The IR blaster. You can control a huge amount of devices.  \n  \nCONS:  \n1\\. There is no gorilla glass.  \n2\\. The videography is not good.  \n3\\. No earphones provided by honor.  \n4\\. No larger storage variant available.  \n5\\. The display's brightness is less than other phones. This creates a problem\nwhen using phone in sunlight.  \n6\\. Has an hybrid sim slot.  \n  \nIts pros obviously overcome its cons. You can blindly purchase this device.\n\n", "one of the best camera in this price range I have ever used...  \ngo for it without any hesitation  \nno lags  \n4gb ram is enough  \ndesign 10/10  \nlittle bit slippery but it's ok.  \none year more warranty included... what else....\n\n", "The phone is worth buying it, I would like to share each and every experience\nwith the phone.  \nDESIGN: The phone uses one of the best designs in the market, the 15 layer\nglass back adds more credits to its design.  \nCAMERA: The camera is just awesome, at this price range, it can compete even\nwith the iPhone 7 plus, in most areas the Honor 8 leads the battle, but in low\nlight and no light conditions more noise is found, better to use manual\ncontrols at night, lack of OIS is an drawback.  \nBATTERY: Takes nearly 1.30 - 2.00 hrs to get fully charged, battery lasts upto\na day and a half on normal usage, for hard users it will last upto 8-10 hrs.  \nSOFTWARE: The EMUI software isn't a best software in the market, even though\nthey have certain features which are not in others, the interface a little bit\nclumsy and ugly.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 January 2018", "on 18 October 2017", "on 1 January 2018", "on 20 October 2017", "on 4 February 2018", "on 9 October 2017", "on 21 January 2018", "on 22 December 2017", "on 17 October 2017", "on 16 November 2017"], "reviewer": ["vijay gopal", "Sabir Rahim", "Durvesh Patil", "Rajendra F.", "Dr.PRAMOD KUMAR PAL", "hari", "Harsh", "Amazon Customer", "Iqbal Afzal", "Xavier"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Five Stars", "Nice mobile, butter smooth OS", "Thanks", "Four Stars", "camera is awesome..", "very smart phone. looking very fabulous", "i bought this phone only 12600 , and believe me you this price you can't buy any other in this features phone", "Awesome phone", "awesome product,dont wait buy it.", "Heats alot.. Not good producf"], "review": ["Really a premium mobile phone it's comfortable in hand and performance is good\nand battery also good\n\n", "Initially bit hesitant to buy this mobile. But for 14k I thought it's a good\ndeal. So now I think my decision was correct. Premium look and UI is very\nsmooth, camera is decent. Phone is slippery , cover is a must. Battery is\nsurprisingly good, lasts a full day with full charge.\n\n", "Thanks\n\n", "phone is going to high temperature after two days temperature down\n\n", "Ultimate phone...camera is awesome...camera works great in low light\nalso...this pic is taken from this phone...bt they wont gave earphone thats a\nproblem\n\n", "very smart phone.looking very fabulous. all features are good. camera quality,\nscreen quality is awsome. some addirional features are there in thia phone.its\nworth in 15k.there is one thing is missing that headfone not comes with set.\nit should be . but anyways phone is very nice.\n\n", "beautiful phone and outstanding camera on this price please go for it\n\n", "The phone is really good. If you are heavy user the battery will last about\n10-12 hrs easily. On normal usage , It will last around 1-2days. Camera is\nsuperb, both front and back. Sapphire blue is the best colour. The only thing\nI don't like about the phone is it's single sim.\n\n", "awesome product.  \ncamera clearity good.  \nbattery back up well.  \nlooking good.  \nover all perfomance awesome.  \nlove huawei for this product.\n\n", "Heats alot.. Camera is nice.. Lags a bit sometimes.. Heats while charging as\nwell gaming.. Feels premium.. Service is not good.. They don't have anything\nwith them.. They require 4-5 days for any small things... You can't get back\ncover and glass anywhere in local shops\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 October 2017", "on 20 October 2017", "on 6 January 2018", "on 11 October 2017", "on 21 November 2017", "on 26 October 2017", "on 2 February 2018", "on 17 October 2017", "on 30 December 2017", "on 28 October 2017"], "reviewer": ["manikanta", "ARai", "RKP ENTERPRISES", "Amazon Customer", "Amazon Customer", "Asif k.", "yogesh kumar sharma", "Shardhanand", "jigar vaidya", "Ankit"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Spectacular product. Reckless seller.", "great mobile under this range", "Best buy for 15k no compition in camera segment under 15k", "Go for it without any hesitation,no doubt u will be very happy😄", "**4 months later**", "HONOR - For the brave", "ALL IN ONE REVIEW FOR HONOR 8", "EXCELLENT PHONE", "Under-rated.", "Beast for the price which u pay..😎"], "review": ["Display - Good quality and sunlight legibility is average.  \n  \nProcessor - Fast, efficient and battery saving.  \n  \nRam - Didn't expect this. But nougat rom consumes about 2gb memory without any\napps running.  \n  \nBattery - Given all the hardware-software optimisation. A stellar performance\nat 3000mah.  \n  \nCamera - Bashes all other phones in this price range and many others far more\ncostlier than this.  \n  \nNetwork - Absolutely brilliant performance. No WiFi or call issues faced.\nHuawei given their background with networking, has achieved something really\npraiseworthy.  \n  \nAudio - Speaker and earpiece are satisfactory performers. But being an\naudiophile, it fails miserably to my standards.  \n  \nSoftware - The best part of the phone. Tons of nitty-gritty features that make\nthis phone truly smart. I am stunned so see such an optimised software to\nhardware relationship. Doesn't feel like stock, much smoother and zippy.\nAbsolutely custom tailored.  \n  \nTHE ONLY NEGATIVE.  \n  \nPackaging - I do not know what's wrong with this seller. They sent my phone\nwithout any bubble wrap or protection of any sort. They simply put my phone in\nan carton and shipped it to me. Outrageous. Exasperating.\n\n", "best smart phone and camera is excellent it is so slim .its fingerprint can do\nmany more features\n\n", "Simply amazing phone...  \nPros:-  \n1) lovely looking  \n2) Best RAM management  \n3) No lag  \n4) Awesome Camera Bokhey effect is best  \n5) Smooth Gaming No lag  \n6) Crisp nd clear Display  \n7) Value for money  \n8) Decent battery backup  \n9) Fast charging  \nCons :-  \n1) Headphone quality average  \n2) Single Sim  \n3) always worry about slip from hand Back Cover recommended.\n\n", "Go for it without any hesitation,no doubt u will be very happy😄.it's butter\nlike processor makes everything possible no matter how many tasks u want to do\nsimultaneously.its very much delight after using this. First time I used Honor\nmobile and I am fully impressed.its camera is awesome, battery is much decent.\nFast charging. Looks very awesome.\n\n", "No BS  \nPros  \nAmazing camrea- Manual mode is the highlight you can change exposure for upto\n30secs. ISO as low as 50. Since it uses both sensor while taking photos you\nget good contrast and details. (Good for astro photography even though you\nhave f2.2)  \nGood processor- Kirin 950 has never let me down. I never had any lagg or frame\ndrops while playing games. Yet.  \nLooks- The Sapphire blue varient (only) has that amazing trippy flash finish\nwhich turns a lot of heads. The gold varient has a more brushed glass\nfinished.  \n  \nCons  \nBattery life - Well it's hard for me(heavy user) to get through a day with\nsingle charge. My brother has the same phone but doesn't use much and has no\nproblem.(it loses 1-2% if kept overnight).  \nOS- EMUI is nothing to brag about. They are trying to copy IOS but I would\nrecommend you to change the launcher as soon as you get this phone.  \nHeating- It gets warm sometimes too warm for my linking. Never lags like I\nmentioned before but if you are paying money to buy something so beautiful you\nwouldn't want it to do this.  \nDouble glass=brittle- I never dropped it but I already have few minor\nscratches. If you ever drop it I am sure it will crack the beautiful rear\nglass.  \n  \nSomething's which people keep asking.  \nVolte= √  \nFast charging= √ (54% in 30mins)  \nCamrea Stabilization= √  \nKirin 950> Snapdragon 821  \nHeadphone jack=√  \nVerdict I would be happier if I got any other device in this price bracket.\nStill better than any phone under 20k by a long margin.\n\n", "It's awesome mobile.  \nIf u want a best dual camera, best battery life, best screen, best slim and\nglass body mobile, then u close ur eyes and buy this mobile.  \nIt's a single hand user mobile. So, it fits comfortably in ur hand. Due to\nglass back it's slippery, but in my opinion it's not slippery. It's a too much\nfingerprint magnet on back side.  \nNot included fast charger. If u want fast charger. U want buy it separately.  \nIts a camera centric mobile. So if ur interested in photography u go for it.\n\n", "Used for about a month and bought for 14999 under honor sale. Read the\ncomplete review for better understanding of this smartphone.  \n  \n##Display##📱  \nThe display is quite gud, A 5.2inch LED screen with 443ppi pixel density gives\nu fab colors.  \nRich color phenomenon and also neutral temperature screen.  \n  \n##Battery##🔋  \nLittle disappointing since it gives only about 6-7Hrs Screen On Time with\nmedium usage.  \nAnd for heavy usage it gives about 4-5Hrs SOT.  \nIn simple terms, you'll be getting about a half day of heavy usage with this.  \n  \n##Processor##💻  \nThis smartphone uses a huawei made SoC, kirin.  \nNow from prospective of a gamer, the octa core processor with 16nm\narchitecture and a 4GB RAM it's a beast that needs to be unleashed.  \nYou'll feel no lag either with multitasking or playing games.  \n  \n##Camera## 📷  \nWhat can u say about a rear Dual camera of (12+12mp). Well that's correct it\nproved that it's still the best under \"Top smartphones with good camera under\n20k\". U get good options like monocolor, moving picture, time lapse, document\nand a lot more.  \nIt features a dual temperature LED flash.  \nThe front camera is decent of 8MP still gives a tough fight to Mi A1.  \nU can also use your voice to capture pics ;)  \n  \n##Design##📱  \nThis is a superlight smartphone if u compare it with the others in this price\nsegment including MI A1.  \nGiving a super sleek 7.6mm thickness and an aluminum coating on the edges. It\nfeels gud to hold the phone.  \nThe back glass can get fingerprint smudged easily but u can swipe it believe\nme and it still looks new.  \nIt's a little slippery so try a case(Go for Flipkart Smartbuy cases rough and\ntough and cheap as well)  \n  \n##Updates##📲  \nIf u buy this smartphone you'll get Nougat Update Android 7.0 with EMUI 5.1\nINSTANTLY  \nAlso in the forums it's mentioned that Honor 8 will get Oreo Update after\nrolling updates for Honor flagships smartphones.  \n  \n##Music and Audio quality##🎧🎶  \nComing from a Sony smartphone I dont get something extra ordinary from this.\nBut still you'll get used to it soon.  \nThe ringtone comes loud enough so that u can hear it from sitting in another\nroom as well.  \n  \n##Security##📵  \nWhat u need when u have a fingerprint scanner right? Well this uses a 0.4s\nunlocking ability,  \nthats just in a blink of an eye.  \nIt has new and a cool applock feature installed in it. You can also use A SAFE\nfor hiding files.  \n  \n##Warranty##🔄  \n2years of manufacturer warranty along with 90days of screen replacement\nwarranty with VIP service.  \n  \n##Charging##🔌🔋  \nThe charger given in the box is a 5V/2A USB type C fast charger. This will\ntake 2hrs to charge honor 8 from 0% to 100%  \nU can also use qualcomm charger for smart and fast charging.  \n  \n##MAIN CONS U WILL NOTICE IN A WEEK##📈  \n1.The honor 8 heats up near the camera portion when u use the camera for 2-3\nmins.  \n2.Also when u play heavy games it'll heat up a little bit.  \n3.Battery discharging rate is not appreciated. 50% battery gone in 2-3hrs\nonly.  \n4\\. Less bass and more of trebble when using earphones (Even in senheisser\ncx180)  \n5\\. Nowadays when most people are having a sim for calling and one jio sim\ncard for data.  \nIt provides a single sim functionality which is disappointing.  \n6\\. Internal memory is only 32GB whereas other smartphones are giving 64GB in\nthis price segment.  \n  \n###OVERALL VERDICT###  \nOfcourse A coin has two sides. So if there is something gud with honor 8,\nthere are some glitches as well.  \nBut its a really gud option comparing to Redmi.  \nBelieve me you won't be disappointed much using this. It's a beast you just\nhave to learn to control it. 😉 👍  \n  \nIf u lyk my review then hit the LIKE button and\n\n", "Rear Camera is just Superb!!  \nGreat night photos  \nDay photos are like dslr quality  \nUpdated to nougat immediately  \ncrystal clear sound both receiver as well as speaker  \nGreat Gaming experience  \nFluidic Ram Management  \nNo hanging issues  \nBattery Charges fully in just 2.5hrs  \nlasts 1 day even on Jio 4g  \nFront Camera is also great  \nGreat Colour  \nProblem is one sim only but its fine  \nSmooth and Fluidic Classic Phone\n\n", "Have never used an android phone apart from the major brands - samsung, lg ,\nmotorolla etc, so was a little hesitant before i purchasing. Been using it for\na couple of weeks now and I must say the phone is decent.  \n  \nLooks different, has internals which gave the S7 a run for it's money.  \nThe camera could have been better, there's no dual SIM and some may not like\nthe screen - LCD / 1080p / 5.2\".  \n  \nBut when you factor in the price - the equation changes. Seriously feel this\nphone is under-rated and worth a look if you want a good phone without the\nhefty price tag.\n\n", "Best u can get under 20k budget.. Fells awesome to have this phone in hands..\nLooks are amazing.. Touch is good...speed is just mind blowing...having great\ntime with this device...doesn't lag anywhere and u can open as much apps u\nwanna use without any hiccups or lags.. Its doesn't affect the performance of\nthe device... The kirin chipset is great and with this i get a day of my work\ndone with 30 percent juice left...it's my best phone till now.. Forget to tell\nthe main thing about camera it's great for this price..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 October 2017", "on 9 October 2017", "on 18 October 2017", "on 7 October 2017", "on 27 December 2017", "on 10 November 2017", "on 20 December 2017", "on 10 November 2017", "on 2 November 2017", "on 8 November 2017"], "reviewer": ["Mrityunjoy Samajpati", "rajev kumar", "Vishal Patil", "excellent product", "siddarth", "Karthi", "Rv", "Amazon Customer", "Rony George", "Akshay jadhav"]},
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Kick ass product", "battery drains very fast", "The Future Proof Performer!!!", "Buy this without thinking.", "Honor 8 the silent flagship killer", "Be Brave", "Best phone at 16k", "Satisfied", "AWESOME", "Four Stars"], "review": ["what should I say, beautiful phone and it works amazing smooth. no lags\nwhatsoever  \nWish camera has OIS. still I give 5 star for performance and build quality.  \nGood Job Honor. My wife just loves this device\n\n", "Nice phone. good camera, display and speed.  \nNot happy with the battery .\n\n", "Superb future proof product from the brand that I don't trust them in some\nother way but quality of the product brand unbeatable as always...The Flagship\nKiller Product Line From Huawei Honor!!!!🏁🎌🏁😎😍👌🤚👍\n\n", "Lovely phone. Small heating issue but I'm sure it'll get fixed with an update.  \nOnly con- SINGLE SIM.  \nIf you have no probs with that, buy this phone for the price it's being sold\ncurrently (it's 15k when I'm posting my review). The phone is super lagfree\nand handles big games like a beast!\n\n", "This product is one complete package.  \nSuperb cam,gorgeous look.  \nExcellent colour reproduction on screen.  \nKirin 950 is one of the most powerful chip.  \nCompact size.  \nAnd the cherry on the top is 2 yr warranty.  \n  \nCons.  \nSingle sim.  \nAvg battery life.  \nAnd slippery as hell\n\n", "Honor for the brave, If you want to be brave go for it. What a features really\nawesome. Great phone. Thanks you so much of you both Honor and Amazon. Now\nonwards I recommend Honor only..... Because we can't go further after using\nHonor smart phone... Thanks Amazon with alots of smiles...\n\n", "Fav phone still using it, but always buy case cover as phone is made of glass\nmaterial n slips from hand\n\n", "Apart frm heating while taking photos and supprt nly single sim, overall\nsatisfied with the product.. bt the SAR value is 1.40W/kg whch means the\nradiation level is quite high\n\n", "now it's been 5 days since i am using this mobile, no overheating except if u\nuse camera for more than 5-10 minutes there is slight heat(no overheating)\naround the camera portion...but it cools itself very fast.....camera is\noutstanding, getting 6-7hrs SOT, and the looks are just astonishing....  \ni would like to suggest this device to everyone who is looking for an all\nrounder device...and is best in class under 20K, no phone can beat it under\nthis price segment.\n\n", "I'm not getting naugat update 😥😥\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 November 2017", "on 12 October 2017", "on 28 November 2017", "on 5 November 2017", "on 13 December 2017", "on 11 November 2017", "on 15 January 2018", "on 22 December 2017", "on 11 February 2018", "on 6 October 2017"], "reviewer": ["Karthik", "Ravi S", "Leon", "Badabing", "Rohit pal", "Sriram", "Amazon Customer", "Bhavin PV", "Ashish", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Slow motion video capture issue in low light", "Stunner", "Five Stars", "Wow.....Awesome", "like an aa i phone", "It's a pretty good phone with good finishing", "Best smartphone under 18k..", "Four Stars", "Flagship is on steal deals...", "Great phone on 15k.."], "review": ["Heat issue can be obeserved in this phone. When we change the mode from normal\nto slow motion video. The brightness level goes down. Low light slow motion\ndoesn't work in this phone. Even I couldn't find any resolution on the honor\nsite as well. Overall other features are good.\n\n", "Looks very premium when you hold in the hands. Glass finish and white\nbackground super.\n\n", "Great phone..performances and battery back up superb\n\n", "Its my dream come true fully awesome feels like you have iPhone having\nandroid.I am loving it\n\n", "Ramesh bidar.........  \nAwsome mobile....like an aa i phone....many features....faster\n......smooth....design is gud ....camera is one of the best in range\n.......only 1 problem...i faced that it could not support dual sim ...only 1\nsim supported\n\n", "It's a pretty good phone with good finishing. Built quality is excellent.\nBattery life is not upto the expectation. Phone is nice to handle.\n\n", "Great phone... Amazing camera, excellent screen, very beautiful sakura pink\ncolour... Best phone in this price range.. Without any doubt\n\n", "Great phone under 15k, looks premium and can be upgraded to nougat....\n\n", "For price around 15k is a steal for this phone... even below 20k is an awesome\ndeal... If ok with single sim, just go for it... Performance comparable with\nflagships and camera is one of the best amongst flagships...\n\n", "Good phone on 15k....but little bit heating problem while normal use...but the\nshape and performance is Excellent... I liked it all except heating problem\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 August 2017", "on 9 November 2017", "on 26 October 2017", "on 4 December 2017", "on 10 October 2017", "on 13 January 2018", "on 29 January 2018", "on 10 November 2017", "on 1 November 2017", "on 11 October 2017"], "reviewer": ["Vinay", "Krishnan", "Harikrishnan", "Gulam Rabbani", "RAMESH", "Amazon Customer", "KS", "lokesh", "Amazon Customer", "Muhammad Jazar"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "great look and performance", "Works good. Looks cute", "I mean not ultimate but too good.", "Amazing phone with great looks & performance", "Honor - great Android buy", "A good phone for photography enthusiasts", "Camrea 12.12", "Everything in this phone is better instead of some functions like mirror casting doesn't work", "nice.....  phone.... good condition....."], "review": ["Super product by honor every phone is very good good display quality\n\n", "I use this phone since last one month and there is no issues for phone\nheating, camera is decent, front and back both are pretty good and phone is so\npretty, blue colour favourite one\n\n", "It is there in the market for more than a year. But see the specifications.\nIt's alternative to many flagships still. Works good. Looks cute. Love a lot\n\n", "Design is just mind blowing.  \nDisplay quality stunning.  \nPerformance very fast because of 4 GB DDR4 ram.  \nBut as hype created by honor camera is not ultimate.  \nI mean not ultimate but too good.  \nI bought it for 15k at this price it is unbeatable go for it blindly.\n\n", "Pros - Powerful high end CPU for performance  \nAmazing Looks  \nGreat camera  \nLoud & clear speaker  \nQuick charge support  \n  \nCons  \n32gb internal  \nSingle sim\n\n", "Very sleek and super quality phone. Upgradable to Android 7.0 now. Good\ncamera, processor and overall quality for 14K\n\n", "A good phone for photography enthusiasts.Takes really good pictures in\ndaylight conditions.However the battery backup is not that great and the phone\noften heats up.\n\n", "Best camera ph in 15000\n\n", "Everything in this phone is better instead of some functions like mirror\ncasting doesn't work,heating problem while watching movies,front cam lil bit\nnoisy. Rest of all functions are good.\n\n", "nice..... phone.... good condition..... reasonable price/.....\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 October 2017", "on 10 November 2017", "on 16 December 2017", "on 20 October 2017", "on 12 November 2017", "on 29 October 2017", "on 11 October 2017", "on 18 October 2017", "on 11 November 2017", "on 19 January 2018"], "reviewer": ["Amazon Customer", "Yashwant dewangan", "Aneeb Abdulla", "Amazon Customer", "sagar wani", "Rohit Sarkar", "Amazon Customer", "Rahul Kr Mandal", "Sameer maurya", "Fredy V Alias"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best.", "Exelent camera.....", "Excellent phone, but battery can be an issue", "Cute phone", "Five Stars", "Amazing!", "Looks wow!", "so far excellent. Camera is brilliant", "... This phone is a BEAST with maintaining it's BEAUTY awesome craftsmanship, awesome performance", "Best at 15k though this is worth more"], "review": ["This phone is really best for this price.It has good quality, perfect look,\ngood spec, double camera at budget price. Honor is very very best for the\npeople who want all specs in everybody's​ Budget.Honor is really a people's​\nbrand.Thank you.\n\n", "Mindblowing camera quality amazing phone sexy looks fast delivered by amazon\nthankss amazon..........\n\n", "This is a very nice phone to look at. At first it was good, but slowly the\nbattery life shortens. 4G will drain the battery very fast. The phone looks\namazing and the features are very good. Everyone likes this phone and I really\nenjoy using it.\n\n", "Pros: Phon looks awesome.good front and rear camera and display.  \nCons: battery back up,heating prblm while open camera and streaming videos\nonline,\n\n", "Awosme camera battry life very good excellent phone and Amazon very fast same\nday deliver my package\n\n", "If possible,i would give it a 1000 stars. It was a total steal deal.Offered at\nsuch an amazing price.The looks are to die for and it is a total stunner!\n\n", "Amazon delivered it in a day and the phone is just looks awesome. It's slim\nand light weighted. The camera and performance is very good as of now. The\nheating resolved after the system update.\n\n", "Got my handset on 10th, so far excellent.  \nCamera is brilliant, both primary and front. Speed is very good with 4 GB RAM,\nthough need to test it against heavy games yet. at 14,999 i think its the best\nbuy. cheers :)\n\n", "(after 3 months)  \nThis phone is a BEAST with maintaining it's BEAUTY  \nawesome craftsmanship, awesome performance, no heating issue, and of course\none of the best cameras at this price range\n\n", "Best phone at the price ! Worth it and its a killer flagship and the seller\nGreenMobiles delivered a proper product before time !\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 January 2018", "on 8 October 2017", "on 30 November 2017", "on 11 October 2017", "on 25 December 2017", "on 24 October 2017", "on 9 October 2017", "on 13 November 2017", "on 23 January 2018", "on 12 October 2017"], "reviewer": ["Jashik s.", "ramprasad", "H2982", "swaraj p t", "mohd quasim", "Mary Sindhu", "Amazon Customer", "Saurabh", "Amazon Customer", "Brandon Dantes"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Better then other phone this price", "Display is also not good..", "Honor 8!", "Used fr over 1 month.", "Best buy for 15k!", "Four Stars", "Awesome product camera comparable to Apple and Samsung high end ...", "It is a phone with excellent look.", "I tnk the battery is week. sometimes I may ...", "Best smart phone"], "review": ["Best phone ever used mobile loock osm feel happy to used this phone\n\n", "Bought the honor 8 on 15 days back... The speakers is producing faulty\nsound... Display is also not good... Really bad quality...\n\n", "A very good smartphone. Looks great and performs day-to-day operations so\nefficiently.\n\n", "It's just the best I could have got for just INR 15K, best camera and the\nlooks....nothing can beat this thing when it comes to looks.\n\n", "Best camera phone. Bought it for 14,999/-. Good phone with awesome specs and\nperformance. Only problem is that it gets heated while charging.\n\n", "8/10\n\n", "Awesome product camera comparable to Apple and Samsung high end phones. Does\nnot come with ear phones\n\n", "It is a phone with excellent look... has powerful processor.wide aperture mode\nin back camera is awesome that it blurs background.not only in marshmallow it\nalso works well in android 7 ota update.\n\n", "I tnk the battery is week.sometimes I may have to replce it . First I will\nchek it and will do replace request\n\n", "Good product under this budget camera quality is too good and this phn has\nmany motion sensors ,this phn has type c fast charging\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 October 2017", "on 29 January 2018", "on 18 July 2017", "on 30 November 2017", "on 15 October 2017", "on 2 July 2017", "on 8 October 2017", "on 28 October 2017", "on 24 January 2018", "on 12 October 2017"], "reviewer": ["jahangir Ali", "Amazon Customer", "Ashik", "ashwani kumar sharma", "Ronit Raj", "vasu kolla", "Rishabh Prime", "M.Nabil", "pranav.p.a", "Fahad"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["The best mid range phone", "Far better than anything under 20000 range", "Four Stars", "... this for 14999/- Everything about this product is just awesome except single sim functionality", "Five Stars", "Awesome product by honor timely delivery of amazon", "Completely satisfied", "Superb phone at best price.", "Five Stars", "Great phone"], "review": ["Have been using this device for 3 weeks  \nNo complaints whatsoever. Awesome device  \nBest in this price bracket ... A must buy.\n\n", "Ultimate day to day device..Enough battery and gud utility ..Sheer pleasure to\nhold ...Music speaker and earphone output are fine but I used htc with\nboomsound for last 4 years that is normal to feel I think..\n\n", "Good piece, no issues at all. Delivered as stated. Thank you Amazon\n\n", "Got this for 14999/-  \n  \nEverything about this product is just awesome except single sim functionality.\n\n", "Beautiful phone for 15k. Wish I got the blue. Great midrange phone, would even\nrecommend over redmi.\n\n", "Impressed with phones performance still in 2017 it compete with flagships,\nother then heat issues every thing worth a penny\n\n", "Awesome phone for the price ...In love with it 😍 better than anyother latest\nmidrangers in this segment..\n\n", "It is really awesome, I bought it at 15k and I'm fully satisfied with it's\ncamera, nd its performance.\n\n", "Best phone as per quality\n\n", "A good phone even in the year 2017.  \nHad initial software issues but was solved by the OTA updates.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 August 2017", "on 25 October 2017", "on 29 August 2017", "on 3 November 2017", "on 18 December 2017", "on 9 August 2017", "on 12 October 2017", "on 16 November 2017", "on 12 January 2018", "on 11 November 2017"], "reviewer": ["Amazon Customer", "deep", "Virginia", "nandit gupta", "Sumo", "s.srivatsan", "Aswin Boopathy", "Amazon Customer", "SUPRATIM CHAKRABARTI", "Joel Yohannan"]}
]