[
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["... First of all the look of the phone is amazing in venom black", "Issue with the battery", "Good buy. BUT CAN BE BETTER", "Not as per expectations", "Not up to mark..needs improvement", "Don't worry about the negative reviews on Amazon", "Stock Android with Basic features", "2 star below average phone", "Pros - good feel on hand", "WiFi doesn't work properly. It connects to WiFi but ..."], "review": ["I have been using this phone for about a week now and these are the pros and\ncons according to me-  \npros-  \n1) First of all the look of the phone is amazing in venom black.  \n2) All the sensors works fine except the proximity sensors, sometimes there\nwould be some random tapping from your ear on the screen while taking calls  \n3) No lags at all while heavy gaming too.  \n4)Dedicated slot for SD card  \n5)Good camera for the money you are paying.(A lot better than expected)  \n6)Water proof(I haven't tested it myself but only watched videos on youtube).  \n7)Gorilla glass which improves the look of the phones and also makes it\nscratch resistant.  \n8)Finger print sensor is very fast in unlocking the phone.  \n  \ncons-  \n1) Turbo charger is pretty slow for a \"TURBO CHARGER\".  \n2) The volume button decreases volume to very low after tapping it just 2-3\ntimes.  \n3) Depth mode can be improved but for this price it's fine.  \n4) Video recording in 4k not available though its capable of 4k video\nrecording(Don't quote me on this)  \n5) heats up while playing heavy games.  \n  \nSome other things....  \n1) if you are a heavy user you may have to charge it twice a day.  \n2) Heats up while charging, which is common in turbo chargers.  \n3) Adaptive brightness is not that good.  \n4) The back cover you get with the phone is a scratch magnet, you will need to\nbuy a new cover.  \n  \noverall 4/5 stars\n\n", "Great phone  \n(with first it's was the battery issue and with the replacement well it didn't\neven starred)  \nWith the dirt I was having an issue with the battery as when it reaches 15%  \nIt's goes to zero within 1 or 2 minutes straight.  \nHappening continuesly though  \nAnd now the replacement phone well  \nIt didn't even started its just like a brick.  \nIt's all due to bad seller which makes amazon looks even worse  \n  \nWhy can't you deliver a product which works just fine  \n..... seller made my new year\n\n", "Well, one month usage and here is the review.  \n  \n1\\. Battery backup: Not good. But not bad either. Goes 12hrs on high usage.\nScreen and data seemed to be the most consuming. And battery drain when idle\nis also another issue. Fast charge is only fast when you are not using your\nphone. Else it becomes like normal charger. However with the last update this\ncharging seems to have been improved. No conclusive results though.  \n2\\. Camera: Great in well lit conditions. Not so great in low light. However\ndual camera blur mode seems to be lacking in clarity and effetiveness.  \n3\\. Processor: Great but sometimes I face lags. Dont know what is the reason\nbehind it. But its not that the game stops for a few seconds. Its just for a\nfraction of a second. But you will be able to notice it.  \n4\\. RAM: Multitasking has no hindrance. Switching between apps is very fast.  \n  \nOverall I like the phone. And I expect that most of the issues we are facing\ncan and probably will be removed with software updates. So.. am satisfied with\nthe product.  \nIf you wish for longer battery life. Just use Greenify. And give it all the\npermissions that you can. It works like a charm.\n\n", "Not satisfied by this phone. Not as per expectations.  \n\\- Heats a lot (curtosy: Mediatek processor)  \n\\- battery life isn't great (doesn't even last a complete day on average\nusage, keeps draining quickly even on standby - I don't have many power\nintensive apps)  \n\\- not very ergnomic to hold. The corners are very sharp.  \n\\- camera is ok-ok. Dual camera (depth mode) isn't precise. While recording\nvideos, I have noticed the lens is focusing multiple times.. and as a result\nit keeps blurring and focusing giving a poor outcome video when u see the\nvideo again later.  \n\\- visibility under sunlight is not that great. Brightness is generally less.\nIf u increase brightness means it consumes more power.  \n\\- takes a long long time to charge. Wonder why they call turbo charging.  \n\\- I noticed some issue with my handset, not sure if it's common across Lenovo\nK8 note. Although there are 2 speakers, left ones is very weak. The right\nspeaker is strong and loud.  \n  \nI wouldn't recommend this phone, especially when there are good phones in\nprice bracket. Moto g5s plus is much better choice - even if it means spending\nfew bucks extra.\n\n", "Phone ok..  \nPros  \n4gb ram 64gb internal space both camera s are also good..selfie with flash  \nCons  \nDifficult to get tempered glass 2.5d screen  \nBrightness is little less  \nBluetooth play back music stucks if we use multiple apps same time also mobile\ndata on  \nSome moments phone hangs so i restart it..  \nEar piece volume for calling is less specialy if outdoor its difficult to\nhear..  \nPhone is ok..\n\n", "I am using this phone and didn't see any issue with it.  \nFast charging  \nBattery backup is nice.  \nBack camera is good in good light. Takes average photo in night.  \nFrom camera is great.  \nProcessor is good.  \nHeating is not much.  \nPhone is really like Samsung note in size.  \nFingerprint sensor is fast.  \nIPS screen is smooth.  \nDidn't see any issue mentioned by others in reviews.  \nSo go for it.\n\n", "Lenovo K8 note is above from any other sub15k range smartphones from lenovo\nbut average in overall ratings. And little bit of heavy .  \n  \nlill bit of heating with continues usage .  \n  \ncamera department is above of any other smartphones of this range but\nexception is it's dual camera setup which is only a hardware setup in\nsmartphone but software is not that much supportive wuth dual camera setup.\nFront flash is soft and quite good.  \n  \nStock android is impressive with it.  \n  \nProcessor is not battery efficient as 4000mah not last long for a day. 4000mah\nbattery is good on paper but in day to day life it is somewhere 3200mah.  \n  \nBuild and looks are impressive.  \n  \nLED notification light is point to consider.  \n  \nConsidering K8 note as a multimedia smartphone is fare ti rate it. Sound\nQuality is good display experience is also good as well.  \n  \nDual Sim and dedicated SD card slot is nice effort with the fone.  \n  \nDedicated music key is Good to have and ability to enable it for various\noperations is appreciabl.  \n  \nFingerprint security is only upto lock unlock but you can't let it to secure\nany of your apps without any 3rd party apps. yes it works in capturing\npictures through camera.  \n  \nStock android is that much basic that even you can't hide apps in app drawer.\nIt looks good but feels little less that even yiu can't hide unnecessary apps.\n\n", "After 2 month use found some problems  \n1\\. Brightness shaken like some time gets low and high (not running under auto\nbrightness)  \n2\\. During calls sometimes screen not locked other functions are getting\nclicked.  \n3\\. Bockeh effect is not good as expected . Can not judge the subject. Get\nbulr the subject also.  \n4\\. Heating problem is there while using Bluetooth and internet\nsimultaneously.  \n5\\. No gallary other playstore gallery's are too good.  \n6\\. Not a gaming phone sometimes hangs.  \n7\\. Hanging issues while starting and running applications also. Cannot do\nanything because battery is fixed non removable.  \n8\\. Many functions not working like screen casting cannot detect my smart TV\nand usb cable not detected in PC.  \n9\\. Automatic voice call recorder not works in this phone . only one app works\nwhich is paid rs. 650.  \n  \nOverall 3 stars as per price and fuctions\n\n", "Pros - good feel on hand ,screen 5.5inc.good and bright , battery changes in\naround 2hrs. Selfie flash and camera good.  \nCons -primary camera (dual camera) takes decent picture but depth enable\noption ON makes things bad .  \n  \nCompared with Redmi 4 note - for camera and K8 not able to match.  \nK4 - old product had dual speaker but this have 2 slots but only single\nspeaker. I wished when Lenovo go up in series that should keep old goodies and\nadd new.\n\n", "WiFi doesn't work properly. It connects to WiFi but you cannot use\nInternet(Yeah I checked every other device). Phone is slow as compared to my\nprevious one (Vibe S1). Dual camera is ok.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 October 2017", "on 2 January 2018", "on 16 October 2017", "on 11 October 2017", "on 10 November 2017", "on 28 January 2018", "on 16 September 2017", "on 22 October 2017", "on 28 October 2017", "on 28 August 2017"], "reviewer": ["Sahil Mishra", "Manpreet", "Avirup Das", "Amazon Customer", "Subin K Subramanian", "Kuldeep chouhan", "Bhanu Prakash", "Sanjeev Kumar", "Sanjeet Dutta", "Kaustubh Mahajan"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Best mid-range smartphone..", "BIG value for money - Review after one month", "Poor battery back up", "One of the Best Phones of 2017😎", "Fraud mobile from Amazon", "True value for money", "Don't Buy", "Posting review after two months of use Good display 1080p Nice speaker Stock android is fast but ...", "Totally Worst Mobile..... These are those snapshot that I have captured when it show me those msgs...", "Not happy with K8 note"], "review": ["Honest review after using this phone for more than one month  \n1\\. The build quality is nice..though it weighs 180 gms it's not that much\nheavy.. adds a premium feel to the phone  \n2\\. The 2.5 curved glass + Corning gorilla glass 3 looks stunning..no\nscratches so far..the display of this phone impressed me a lot  \n3\\. The power and volume buttons are placed nicely + a dedicated music button\nworks brilliantly..since we can customize the music key  \n4.Fingerprint sensor is very quick also you can add up to 5 finger\nsamples..that's nice  \n5\\. The front camera is superb with flash..infact best front camera in this\nsegment  \n6\\. Rear camera is good but the bokeh mode is not good..bokeh looks\nartificial..when comparing with xiaomi mi a1's depth mode this phone is\nnothing but there is a depth mode editor where you can adjust the blur amount\nand many more..slow motion recording is pathetic..the rear camera is ok but\ndepth mode is horrible  \n7\\. Meditek hello x23 is very powerful when opening heavy apps..it can beat\nSnapdragon 625 but when opening light apps it loses out .The GPU Mali T880\nperforms well  \n8.The 4000 mah battery is the other con of this device..it won't last long if\nyou are a heavy user..the deca core cpu consume a lot.. for heavy user it will\nlast up to. 6hrs  \n9.The 15 W turbocharger can charge the phone in about 1 hr 45 min..which is\ngood  \n10\\. The stock Android is nice..but you cannot set additional ringtones or\ncannot see the battery percentage or call recording feature but you can set\nthem using various other apps and by using developer option.  \n11.Like lenovo's other phones this phone also gets heated up quickly..\nespecially when data turned on.. while using camera and hotspot..my phone's\nmax temp is around 44 degree  \n12\\. The Dolby Atmos is fabulous when using earphones..this phone is having\nmonospeaker  \nThe Lenovo k8 note is a great phone..it's having pros and cons when comparing\nwith other competitors.. comparing with mi a1 ..this phone loses out in the\ncamera department and timely updates from google , IR blaster, no heating\nwhereas this phone leads in many segments such as ..13 mp front camera with\nflash..Dolby Atmos..theatermax ..15w turbocharging..deca core processor..\ndedicated music button..and about 1000 rupees cheaper  \nThe camera problems of this phone can be fixed by an update  \nThus if you want these features go for it otherwise if you need a great back\ncamera choose mi a1\n\n", "First of all, don't compare this mobile with higher model. I'm sure it's far\nmore better than many other mobiles which are in same price category. I've\ndecided to write a review after using it for some days.  \nPros:  \nPrice of this mobile.  \nNo lag at all.  \nCamera is awesome if we've some patience. Even with DSLR we can't point &\nshoot the pictures instantly. If you are ready to spend some time to focus we\ncan get some gorgeous pictures to rock. Editing options are good for depth\nenabled photos. Front camera also gives good pictures.  \nScreen display quality improved over Lenovo K4 Note.  \n4GB RAM + 64GB ROM + Dedicated microSD card slot 👍option. It's better to use\nnew or formatted SD card for optimum results.  \nHeat is acceptable ( not overheated ) - 4000Mah Battery 👍.  \n  \nCons:  \nMobile is switched off while charging. It's a major issue to be solved in next\nupdate.  \nCPU management can be improved. Because it's a deca core.  \nFile management is some how difficult to pickup.  \n  \nGO FOR IT. LEARN IT. ENJOY MORE  \nIt's a best option for those who wanna buy a dual camera mobile first time.\n\n", "Revising my earlier review written about 4 months ago in which I gave 5 stars.  \nThe biggest problem is battery, which is getting worse with each system\nupdate. Its 4000 mah battery is worse than a contemporary similar phone with\n3000 mah battery. Something seriously wrong and the irony is no serious effort\nby Lenovo to rectify it. Barely after 4 months of the purchase, I have to\nrecharge the phone twice every day. It now seems the problem is beyond\nredemption.  \nSecondly, I am not able to send the image from Photos to a folder (on\nselecting the image), without being online.\n\n", "This phone is undoubtedly one of the best phones of 2017😍!\n\n", "I have purchased it in First flash sale on August 18, 2017. Till now no issue\narised. Suddenly now the mobile got blank. When I took it to Lenovo center,\nthey shown me directly that it was already a used one and it has plaster's,\nand tampering on mother board.  \nSuch a fraud product was given to me for a value of 13998/- when I bought it.  \nIam providing the pictures also.  \nIam going to take Legal action about this Fraud product on Amazon services.  \n14000/- bucks is not ignorable.\n\n", "Outstanding product. This is a quality product from lenovo.  \nProcessor - 10/10  \nBattery - 8/10  \nDisplay - 8.5/10  \nBack camera - 9/10  \nFront camera with flash - 10/10 (at the best)  \nDeft mode- 7/10(in this price segments)  \nPhone looking wise - 10/10  \nFast charger - 7.5/10  \nDolby atmos-10/10.  \nValue for money - 9/10  \nVolt calling - 9/10  \nOnly cons- you can't take pictures with the fingerprint sensor.  \nThis phone better than Redmi note 4 in all aspects. Except battery life. But\nit has fast charger.  \nJust go for it. The best value for money phone. In october 2017. This is a\nhonest review. Any questions call me at 8013830411.\n\n", "Screen Broken within 20 days just a normal fall from hand....Very poor quality\ndisplay.... Don't buy this phone....\n\n", "Posting review after two months of use  \nGood display 1080p  \nNice speaker  \nStock android is fast but I still like nova launcher rather than the default\none  \nGood camera nice selfies and photos and 1080p video recording although the\ndepth mode is not that good it works good in sunlight but indoors has trouble\nwith the blur processing  \nGood battery life can get through a day easily although u should use the turbo\ncharger only as normal chargers would take a lot of time to charge it  \nThe problem with lenovo is updates I havent received any updates since 2\nmonths now and the security patch is still of September  \nThe software has bugs like complete freezing sometimes fixable with a restart\nand camera doesnt start at times which also needs a restart  \nThe phone can get very hot in direct sunlight and if used while charging\n\n", "Totally Worst Mobile......  \n  \nIt has hanging issue and app crashed are normal in this mobile. Even this\nmobile have Deca Core Processor.  \n  \nGo to Redmi mobile that are cheaper than it and have better hardware\noption.....\n\n", "This is a genuine review: 1: heating issue, 2: no option for call recording,3:\nno option for how to show your contacts 4: 3.5 jack and charging options are\nin top and bottom not in a good placement, 5: storage data from SD card also\nnot proper; 5: no shortcut key for vibration and location on/off and to take\nscreenshot... camera quality also not good... unhappy with k8 note...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 October 2017", "on 24 October 2017", "on 3 September 2017", "on 15 September 2017", "on 7 September 2017", "on 12 October 2017", "on 17 September 2017", "on 12 December 2017", "on 16 November 2017", "on 8 October 2017"], "reviewer": ["Shambu", "Amazon Customer", "Amazon Customer", "Pratik", "Vijay", "Bikram Samanta", "abhishek", "Prince H.", "Sikander Uppal", "sri"]},
{"rating": ["3.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Seriously need to be improved Will not recommend to buy", "Else this phone is good.", "Don't buy.", "Better aware of the drawbacks before you decide to buy", "Say no to K8 note", "Good phone in 10k to 15k range, JIO and everything 100% works after installing updates.", "Four Stars", "This is awesome beast in world of smartphones", "Good Phone", "Dont go for it."], "review": ["Build quality , processor speed , storage options and game play are impressive  \nAverage camera ... Seriously need to be improved  \nWill not recommend to buy\n\n", "No call recorder in this phone nor any other app of call recorder is\nperforming in this phone.  \nLenovo K3 Note was having inbuild call recorder please upgrade software with\ncall recorder.  \nElse this phone is good.\n\n", "Third class phone. I bought this phone Rs 13999/- because of its dual camera.\nCamera is too poor even my old intex aqua power HD phone has good camera. In\nlow light condition this phone capture low quality photos/videos. Approx 200g\nweight too heavy. Battery is 3900 mAh but sucks in 8-10 hours. Only good thing\nis large phone storage.Dont buy at all\n\n", "After 15 days of use below are my review  \n  \nOverall - 7/10  \n  \nDisplay - awesome, 9.5/ 10  \nSound - Ok, 6/10  \nNetwork coverage - Ok, 6/10  \nCamera - not as per hype give to it. Ok, 7/10  \nBokey effort is not as per expectation. Hoping update will resolve it.  \nPerformance - No hanging but sometime app processing lag can be seen. Good\n7/10  \nFinger scanner - good 8.5/10  \nBattery - Hardly withstand 1 day after full charge. No turbo charging feature\njust for name sake. Charging takes 2 hr 15 mins to complete charge from 0.\nCan't believe it's 4000mah. 5/10.  \n  \nOther problems:  \nHeating while charging, After opening some simple apps and camera, while\nspeaking for abt 15 mins. Not expected like this.  \nMobile cannot identify casting nearby devices. Basic feature with flaw.  \nAlways want to choose Usb mode for file transfers.  \nCannot able to find screen protector since corners are 2.5d  \n  \nSome problems can be rectified with OTA update but not sure whether Lenovo\nwill take action or not. Customer care service and forum are pathetic. No\nunderstand and giving solutions to resolve problems.\n\n", "After using the phone for 1 week found these serious problems...  \nBattery drains very quickly even if you keep the phone in idle it still loses\n10-15% battery from 100% (it drains 10-13% overnight)  \n  \nSignal bar continously fluctuating up and down. Even i am standing on a cell\nphone tower ( Cell tower is 50 meters from my house) there is still not full\nnetwork on my phone.  \nSignal bar changes continuously which results on poor battery life.  \n  \nEarpiece volume is too low i can't hear the caller's voice clearly and call\nquality is also poor.  \n  \nNotification light doesn't work properly.  \n  \nCamera depth enabled option have issue in taking photos. Blur is not perfect\nin edges.  \n  \nHeats up too much during browsing or video playback.  \n  \nMusic quality is not good even it has Dolby Atmos the sound is too low in\nearphone (tried in 2-3 earphones)  \nIncoming Calls Not Working in VOLTE(LTE) When the phone is in idle mode for\n5min.\n\n", "I will give 4 star. Lenovo should give description to ask users to do system\nupdate after the purchase. –1 star for unstable firmware or ROM and now its\nfixed.  \n  \nReally good phone for 9999rs range, don’t get confused from –ve comments, do\nthe system updates and it will work fine. It has 5 updates of each 100MB, be\npatients and it will take 1 hours to complete. Once you are done it’s a Killer\nsmartphone.  \n  \nWith 3GB of RAM and Deca core processor, multi-processing is killer. Battery\nholds for 1 day, starting from 100% to 25%, on regular videos, music, youtube,\nwhatsapp, calling etc. So this will last for 3 years, coz new apps, ROM and\nsoftware updates giving death sentence for older mobiles.  \n  \nFor 10000 to 15000 this is what we will get. If you need more, go for\nsnapdragon 800 series smartphone.  \n  \nCamera and video recording is good.  \n  \nCall quality is good.  \n  \nJio voice and Video calling is super after installing the updates. 1st I got\nshocked only data works, after updating everything works fine. Download speed\ngoes upto 8MB per second. On both slots.  \n  \nBattery good.  \n  \nBuild quality is good.  \n  \nFinger print scanner is good.  \n  \nDisplay is good and touch screen is very smooth.  \n  \nLittle bulky and slippery on holding.  \n  \nNo Hang and No Lagging.  \n  \nExternal memory card works fine.  \n  \nSpeaker quality is soo good and clear. Headphone with dolby atmos is again a\nkiller.  \n  \nScreen casting not working. But Youtube casting linking with smart TV and\nMobile app is 100% working(Chrome cast).  \nNot much heating on regular usage.  \n  \nWeb page browsing is good and smooth, mobile only heats on displaying ads and\ntracker, please use adblocker like DNS66 app for blocking ads. This will save\nbattery and your data.  \n  \nThis mobile is good to pay 10000 for Helio x23 processor rather than VIVO and\nOPPO with snapdragon 400 series which is charging 15000 and above.  \n  \nIf you are Lenovo K3 note lover you can blindly buy this phone.\n\n", "Call recorder is not available when used other call recorder app I heard only\nmy own voice. Worst mobile, my Lenovo vibe K5 is better than this device,\ngorilla glass screen has broken, it has less feature than vibe K5 note. I want\nte return it pls let me know if I could return it, I bought it on lanch. Also\nit has network issue, only 1.5 GB ram available for user, it is unable to open\nFacebook lite .\n\n", "This is awesome beast in world of smartphones . The camera quality is out\nstanding . The depth enabled mode in camera of the phone is very great . You\ncan recieve a perfect blur in depth enabled mode in camera. Front camera is\nexcellent in clicking selfies. Overall performance is very good of this beast\n. I am also using this mobile since 2-3 months.\n\n", "Review after using for 10 days  \n  \n1\\. Camera is good in well lit conditions. Front cam is also good under decent\nlight conditions.  \n2\\. No lags. Performance is good. Heats up while playing heavy graphic games.\nNoticeable lag is observed after it.  \n3\\. Vr works flawless. This phone paired with irusu mini vr is excellent for\nthe VR experience :)  \n4.Battery department however fails in delivering the needed power. Could last\nfor one day on moderate usage. Quick charging is a plus :)\n\n", "1.takes 4 hours to charge,also battery drains fast.(charging just trough usb\nin pc,just forget about it,with usb connected for charging battery drains dono\nwhy.)  \n  \n2.Slow booting up with senseless graphics while mobile is turning ON.  \n  \n3.Can't lock apps with finger print or password/pattern.  \n  \n4.Camera is not up to the mark,and the dual camera option is stupid.  \n  \n5.Hardware is awesome just needs tweaking around in the software department.  \n  \n6.Phone slips a lot with the backcover which is provided in the box.I broke 2\ntemper glass in just 15days on purchasing the mobile.  \n  \n7.Navigation keys are not illuminated with light,Difficult to use in the dark\nuntil you get used to it.  \n  \n8.Network reception is very weak,slow data speeds are common.  \n  \n9.Wifi and Bluetooth gets automatically turned off every now and then.  \n  \n10.Auto brightness is not good,Cant use mobile in sun with auto brightness\nset.(brightness does not adapt properly.)  \n  \nThere you go thats my honest review.After exchanging my Redmi note 3 to lenovo\nk8 note.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 August 2017", "on 14 September 2017", "on 24 January 2018", "on 5 September 2017", "on 13 September 2017", "on 26 January 2018", "on 28 August 2017", "on 27 December 2017", "on 14 September 2017", "on 9 February 2018"], "reviewer": ["Rajeev Remo", "Divyanshu G.", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Lucid Raja", "Vikas agrawal", "Nikhil Attri", "Abenav", "Santhosh"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["At this, this phone is not recommended to anyone.", "Great specifications under this price range Lenovo again comes with ...", "#TheKillerNote #BudgetbutFlagship", "Basic things are good and some things could or should have been better", "Great value for money", "Outstanding phone! Ex-Honor 6X user", "Phone is awesome but Lack of features", "... this phone from 10th of jan it is not happy with performance of phone", "Good phone for the price.", "It's A Good product at this price"], "review": ["The phone is not worth the price. Besides lenovo is very slow u. Providing\nupgrades. It will provide Oreo update byJuly next year. Rest all smartphones\nwill be upgraded by the end of this year. Shame on Lenovo for calling itself\neven a brand. Even MI is much better than Lenovo.\n\n", "Great specifications under this price range Lenovo again comes with a bang the\ncamera is the best part of the phone it's just awesome picture quality is\nreally good on comparison with other devices game experience is also good no\nlag if playing heavy games battery is also good turbo charger is average not\nthat much fast but i think under this price range yu will get more than that.\nSurely a value for money product.\n\n", "Using it for past two days!  \nPros:  \n1\\. Display is way vibrant and better  \n2\\. Speaker is much audible, thanks to Dolby Atmos also  \n3\\. Camera both rear and front are Value for Money, while the depth field\ncamera is trickier sometimes ( Lenovo need to improve software to correct\nthese bugs )  \n4\\. Stock Android - Volaaaa!! Pretty much slick, faster!! No unnecessary apps.  \n5\\. Not faced heating use that other mentioned while using ( though not a\ngamer )  \n6\\. Turbo Charging - Best part for my case!  \n7\\. SD card option gives you more advantage than to compromise as hybrid SIM  \nCONS:  \n1\\. Its damn heavy - 180grams, pain on palm sometimes for myself!  \n2\\. Warms up a bit while charging alone ( i think maybe due to that turbo\ncharging )  \n3\\. Other Cons not yet identified, will Updage soon\n\n", "there was some jam or tightness in SD card slot  \nthe camera zoom is bit insufficient and low light is an issue  \nthe headphones jack and audio are sure not neat at all  \nthe day-light still camera, HD screen, WiFi reception, VoLTE Call Audio,  \nDolbyAtmos speaker, Android 7 Slim and Private, TV and Movie streaming,  \nFinger-print locks are all fine to good with me. Thanks to deca-core.  \nHad to use an app download for video recording - was good too.  \nNo regrets as the 10th day moves.\n\n", "Really nice product with all the specifications those we need in current days.  \n4GB/64GB, deca core, Android nougat  \n  \nRear dual Camera quality- is good but in comparison with Samsung's 13MP camera\nit is not that much.  \nFront camera is in acceptable level.  \nProcessing speed is brilliant by deca core.  \nDisplay quality, touch and figer print sensor are very good and fast.  \nDolby atmos makes multimedia experience very interesting.  \nBattery back up is sufficient for one and half days with moderate usage.  \nDisplay quality is excellent.  \nGorilla glass, splash proof and fast charging makes it value for money\nproduct.  \n  \nOrdered during great festival sale and amazon delivered this within 24 hrs...\n\"Amazon like Amazing\"\n\n", "My prev phone was Honor 6X and I was in love with that phone. Somehow I broke\nthat phone at home when I was in extreme anger, the new phone I ordered was an\nHonor 8 lite with an exchange offer. The order was cancelled coz my old Lenovo\nK3 note for exchange was not is a great condition. I am glad this happened and\nI finally ordered a Lenovo K8 note. I did not expect a Lenovo phone to be this\ngood! Smooth touch and swiping experience! Performance really great!\nAudio/Camera is great. Battery seems long lasting. Build quality is pretty\ngood.  \nEdit: Some good features like dedicated sd card slot, 4g+3g sims, Gorilla\nglass, music key, good external speakers.  \nI have installed Go launcher now which makes the touch experience as smooth as\nRedmi phones.\n\n", "Phone is awesome...  \nPerformance is also very good  \nCamera quality is good....  \nBattery is good..  \nBt phone has lack of function and features  \nLike we can't take long screenshot..  \nIt has no dual apps function like xiaomi devices  \nThere is no app locker given in the phone like Xiaomi devices  \nWe can't turn the phone silent easily...  \nWe can't change the theme of the phone\n\n", "I using this phone from 10th of jan it is not happy with performance of phone\n,it is getting hang every time ,amazone has arranged technician he has factory\nreset after also the phone is not working properly ,technician has committed\nthat if it not working properly then you will get new phone ,call center team\nis refusing that they have got a feedback that phone is working properly ,i\nhave ask for new phone the lady from call center said we cant replace the\nphone ,it is 18 to 20 days gone but phone is not working properly , i am\nunsatisfied customer of amazon on their commitment\n\n", "The phone is good for the price. Finger print reconginition us instant. You\ncan play games without any lag. Charges very quickly. Phone doesn't hang. The\ncamera is just ok. The selfie camera is decent. The only issue is that it\nheats up a bit during Charing but I think it is normal as it support fast\ncharging. Battery lasts 1.5 days will moderate usage. The back cover provide\nalong with the phone is slippery. Better to buy a proper cover.\n\n", "It's A Good product at this price.  \nOn first day I realised it has battery issues n phone is not getting charged\nbut since I charged with turbo charger it's like Wow n good charging n No\nheating issues as of now.  \nPhone is pretty smooth n Black looks classy.  \nLet's talk about Camera I was thinking to buy OP5 just bcz of Camera but\nbought this one so I thought it's good one if you know how to Click\nphotos.Depth mode has good options of Splash & Change Focus.  \nLow lights camera is Ok.  \n  \nI would be great If there were few features like night mode , slow motion ,\ntime lapse as honor 6X provides.  \n  \nIf these additional Camera functions would have added than this would be a Wow\nPhone. But at this range it's not a Bad Choice.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 October 2017", "on 24 September 2017", "on 6 September 2017", "on 30 August 2017", "on 28 September 2017", "on 29 September 2017", "on 17 September 2017", "on 30 January 2018", "on 27 August 2017", "on 13 September 2017"], "reviewer": ["Abhishek", "Pankaj", "Arun Ravi", "AK", "CA Jainendra Sahu", "Amazon Customer", "Rohit Sinha", "Maninder", "vinod", "Hitesh Sukhwani"]}
]