[
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Good Mobile", "Not worth 16000", "By far the best android i have owned !!!", "Please do not waste your hard money for this cheap product", "Awesome classy & Reliable", "Good phone. Value for your money.", "Exelent mobile.........", "Satisfied", "Overall a great phone!", "Five Stars"], "review": ["Good Mobile and received as per advt\n\n", "Not a Good phone. Many performance lags and issues while working.\n\n", "Have been using the phone for littlebover a month now. Following are my\nobservations :  \n  \n1\\. Easy to hold and type  \n2\\. Sturdy & well built  \n3\\. Hasn't hung even once yet  \n4\\. External storage support comes in handy  \n5\\. Very decent battery performance  \n6\\. Feels like a business phone  \n7\\. Slim and light weight  \n8\\. The only grouse i have is about the stylus... Or probably i haven't\nexplored it thoroughly yet  \n  \nExtreme value for money product. LG has done it again.\n\n", "Don't buy this mobile. Within 6month i spent 3000 rs additionally for this\nmobile for it's mother board. Please do not waste ur hard money. Company is\nsaying gorilla screen but it does not resist minimum damage. My mobile fallen\ndown from Tea table and now screen is almost 2 pieces. I believed LG band and\npuchased from a show room with higher price than online. But quality of this\nproduct is very bad especially build quality. Please do not buy it with high\nprice. Better mobile will get cheap rate than this stylus. With my own\nexperience I suggest you guys do not opt this mobile.\n\n", "I had an option of buying from countless Chinese phones in less money. But I\nchoose to buy LG because it is reliable, no or seldom heating, no hanging,\nbeautiful pictures and front cam without any flash captures better images than\nmany other phones with front flash. the phone is very light and easy to handle\n& grip. I got many compliments that the phone looks classy. If you don't mind\ngiving up a little extra money for good value, this phone is for you.\n\n", "I am using this phone for last 6 months. Good battery. Camera quality is too\ngood on HDR. No hang. I played 4k video from Bahubali movie. Both sim slot\nsupports 4g volte. And also removable battery and dedicated SD card slot.\nUnfortunately no screen mirroring. Only 16gb internal but you can expand upto\n2tb. Knock unlock is a good feature. And also it supports finger print lock.\n\n", "After 1 month use super mobile.exlent battery backup i am always play games\nasphalt 8.morden combact 5. gunship battle. Candy crush sega.and much more .no\nheating issues .decent camera back and front. i am totally satisfied\n\n", "Have few suggestions for LG team in terms of software features but this is not\nthe right forum for it. But overall I'm quite satisfied with my LG Stylus 3.\n\n", "Overall a great phone !! First time I am using LG and pretty satisfied with\nthis all rounder Stylus3......fabulous !!\n\n", "This phone is the best choice to buy.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 December 2017", "on 2 January 2018", "on 6 August 2017", "on 21 November 2017", "on 9 June 2017", "on 25 November 2017", "on 12 September 2017", "on 31 August 2017", "on 11 October 2017", "on 10 April 2017"], "reviewer": ["Asif Y. Mulla", "Amazon Customer", "Giyer", "jammy", "Amazon Customer", "Sarath", "ramprasad", "Amazon Customer", "Rajeev Pai", "Atul Bairagi"]},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": ["2.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Average Phone", "No 5GHZ Wifi support", "Great phone", "Five Stars", "G6,v20 and stylus 3-2017's been already good for you LG", "Five Stars", "Not worh the price. poor battery, audio", "Five Stars", "Amazing", "Worthy update to stylus 2"], "review": ["I bought this phone form local vendor. It is average phone with good features\nlike double click to lock and open phone, stylus etc. but negative includes\nvery poor battery even without any heavy app battery only lasts for half day,\nCamera is ok not that good. Avoid this phone if you can.\n\n", "The phone is value for money. One disappointment is , the wifi does not\nsupport 5ghz frequency :(.. While the lesser priced models in other brands do\nsupport this 5ghz frequency..\n\n", "Great phone.  \nNot many apps for the stylus. You may not end up using the stylus too much.  \n  \nCan get better hardware without stylus for same price.\n\n", "Very good Phone.. Absolute clarity... Camera is very good & good battery\nbackup.\n\n", "After complaining so much about the 720p resolution and the 16gb internal\nstorage,i finally decided to go with the LG stylus 3..Got my phone yesterday..  \n  \nHere are a few things to be noted-  \n  \n1.the 720p lcd panel has definitely exceeded all my expectations,i had a hard\ntime believing it's just a 720p panel..Awesome work LG  \n  \n2.No,it doesn't come with NFC but has USB OTG support  \n  \n3.internal storage is around 10-11 GB user usable..And LG has restricted the\n'adoptive storage' which means, NO..you cannot set up your micro SD card as\nthe internal storage... However apps can be moved to SD card , the Google's\nones dont move..While at least more than half of the others do..So some kind\nof redemption there  \nEdit-90% of all the apps can be moved to SD card..I have 138 apps in total on\nmy phone in total including all system apps and installed apps and still have\nabout 1.2 GB odd free(so you can have an idea)  \n  \n4.the double tap to sleep and double tap to wake up is the best feature\never...Why doesn't google implement it into its android O.S???!!!  \n  \n5.even though the phone has an all plastic build,it still manages to look\npremium and feels sturdy.and it's a pretty sleek phone even with the 3200 mah\npowered battery and is surprisingly light too  \nThe bundled cover which comes in-box is unfortunately ugly..I mean..Whats an\nelephant doing on the front of my cover??!!!  \n  \n6.if stylus is your primary reason to get a phone and you are on a budget..LG\nstylus 3 is near PERFECT  \n  \nEdit- after a month of usage..I should say I'm in love with the LG stylus 3\neven though I'm coming from the legendary Redmi note 3 I have no complaints, I\nthink I'm satisfied (btw LG stylus 3 PLUS is around the corner)..and as for\nother phones with better specs in the same price range..they don't have an\nactive stylus (it costs more) so obviously they'll have better specs...and\nMotorola has already proved with their G and E series that specs is not\neverything,it's the experience that counts...and please don't compare to the\nSamsung Notes ..Samsung Note is a flagship device..this is a mid range budget\nphone.\n\n", "Awesome phone....\n\n", "more than six months since bought. here goes my honest opinion  \n  \nBattery usage- I leave my data on always and listens to youtube for an hour or\ntwo. phone calls minimal. 30m of browsing..End of the day battery is almost\nexhausted. 2-3stars rating only. LG listen!!!  \n  \nAudio- the speaker sound output is poor. while you are driving even if speaker\nis turned on the audio is very low. cant hear under normal outdoor noisy\ncondition. While watching movies or you tube sound is just enough for a small\nroom. Worth 2 to 3 star max. LG listen!!!  \n  \nScreen resolution is alright - 5 stars  \n  \nOutdoor screen visibility - in proper sunlight the phone is useless. Even with\nfull brightness cannot read the contents.. LG listen!!! 2 star.  \n  \nSupplied headset is poor quality- 3 stars  \n  \nOne fall with the supplied case from about 70cm I got a permanent yellow mark\nfull length on the screen.:(  \n  \nNow the plus points:  \ntwo window screen is a good choice. can watch you tube while browsing with\nhalf screen. 4 stars  \n  \nOverall - 2 star.  \nFrom a non Chinese established Phone maker I expect more solid phone and more\nfeatures.\n\n", "Amazing phone in medium price Good features  \n1-Camera quality but not best in night  \n2-Android 7.0  \n3-3Gb ram,phone not hanged  \n4-Stylus pen,fingerprint sensor  \n5-3200 mah powerful battery  \n6-big 5.7 inch screen,screen resolution good  \n7-3 Home option and you changed themes  \nBad features  \n1-Not led front flash  \nEverything good,I am very satisfied this phone\n\n", "It is wonderful phone. The screen clarity is very nice, though not FHD. Camera\nquality is good, in night or low light the image is not so clear. The battery\nback may last long for whole day with full usage. The performance of the phone\nis excellent and it never hangs. Pop Scanner and Quick Memo facility with pen\nmake this phone awsome and much much useful for those who go for business\npurpose. Qslide is very useful feature with this phone where you can play\nvideo, open phone screen and at the same time other apps also continue to\nwork. The look of the phone is elegant and quite slim. Overall, superb phone.\n\n", "Am thinking of buying this so went to brandstore. As per my Hands on\nexperience Stylus 3 was an awesome mobile and worthy upgrade to stylus 2.\nCamera & stylus is the main USP for this mobile. Camera is very good in my\nopinion. LG upgraded the stylus and ram management too is good(1.8 GB free).\nGo for it.  \nHD display is huge disappointment but believe me it's better than that cheap\nvivo model at 20000 rupees. Better viewing angles. If u still have any doubts\nor won't believe me go for LG brandstore and experience it. Better LG release\nPlus varient at 16000 and this price should be down to 14500.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 June 2017", "on 9 July 2017", "on 22 September 2017", "on 8 April 2017", "on 23 April 2017", "on 20 July 2017", "on 3 November 2017", "on 2 April 2017", "on 8 April 2017", "on 3 April 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "Prithwiraj Jadhav", "Sridhar Swaminathan", "Jeson", "Raymond Anthony", "Santhakumar", "charu singh", "Samir Bhuptani", "Akhil sreegiri"]},
{"rating": ["3.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Everything else is good, only that is holding me back", "now there's this yellow line on the screen that won't go away I still do recommend this phone but just be", "Phone having best features​ nd look also very 5n", "Amazing Stylus!", "Five Stars", "Not worthy phone", "Not worth what you pay for", "One Star"], "review": ["I haven't bought this phone yet but writing this opinion just to say that I\nwould have bought this phone surely if only it had a *call recording* feature!\nEverything else is good, only that is holding me back.\n\n", "I dropped this phone onec !! now there's this yellow line on the screen that\nwon't go away  \nI still do recommend this phone but just be careful\n\n", "Phone having best features​ nd look also 5n. But cost is too much. It's came\nunder 15k in lg brand stores. Tq Amazon.\n\n", "Superb phone !!! Amazing Stylus !!!\n\n", "Good product at affordable price\n\n", "Not a worthy phone  \nHeats up a lot  \ncharging device takes tooo long(lg calls it charge pump technology )  \nDischarges quickly  \nCamera average  \nFingerprint super  \nNo gorilla glass or any other display protection and also u cant put tampered\nglass because screen is not flat like other phones u will get big air gap on\ntop and bottom of display which makes phone look ugly  \nBeing mediatek processorit should not heat but it heats up a lot  \nI strongly recommend to go to other smartphones otherthan this this phone is\nnot worthy at all.\n\n", "I've been using this mobile for 3 days. Please find below my review:  \n  \nDisplay:  \n  \nAt first, it strained my due to low pixel density. But my eyes got used to it\nin one day and now I feel the display is fine.  \n  \nAudio Quality:  \n  \nNot good both via speaker and headset. There is no depth and dynamism in\naudio. I couldn't enjoy songs thro headphone.  \n  \nCamera:  \n  \nIf camera is important to you, then don't buy this one. Clarity is not there\nin both images and videos. Low light images and videos are utterly useless.  \n  \nStylus:  \n  \nOkay. But a lot of features are missing.  \n  \nGeneral performance:  \n  \nVery smooth. Didn't encounter any lags at all. But I haven't tested games\nperformance.  \n  \nBattery:  \n  \nVery poor. Charged to 99% at 7am but It died down by 5 pm for the last 3 days.\nReally unhappy.  \n  \nGeneral features:  \n  \nA lot are missing. For example, Long press to select or share are missing. A\nlot of notification block features are missing compared to basic Samsung\nsmartphone. Qslide doesn't have calculator. So much more are missing.  \n  \nFingerprint scanner:  \n  \nSuperb.  \n  \nSmart cover:  \n  \nThe box says it is a smart cover. But it is not a smart cover at all. Just a\nnormal flip cover.  \n  \nCall quality:  \n  \nAverage.  \n  \nTo sum up, this is not a value for money phone. Not worth what u pay for.\n\n", "Worst phone at this price\n\n"], "verification": ["Verified Purchase"], "date": ["on 4 August 2017", "on 25 May 2017", "on 12 April 2017", "on 10 April 2017", "on 10 April 2017", "on 21 July 2017", "on 27 April 2017", "on 27 April 2017"], "reviewer": ["Raghavendra. N.G", "Amazon Customer", "DDastagiri D.", "ANURAG", "pankaj", "Yeshwanth", "Stalin", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Glad that I bought it.", "Four Stars", "Nice", "SLIM AND NICE", "Five Stars", "Best brand mobile in this segment and far better than chinese brands", "Just go for it. Took 6 months back still ...", "Five Stars", "Coll phone", "Average phone."], "review": ["Lots of options in the market, some cheaper than this phone which boast of\nhigher specs. Still I chose this after a month of research. Straight to the\npros:  \n  \n1\\. Stunning looks  \n2\\. Large display though not fhd but it's awesome nonetheless.  \n3\\. Magnificent battery. 1 full charge gave me a day and half with continuous\nusage of 4g.  \n4\\. NO heating up I repeat NO heating up at all.  \n5\\. Stylus is a big plus for business people like me. Makes the Life Good. :)  \n6\\. Nougat out of the box.  \n7\\. Excellent finger print scanner.  \n8\\. Exclusive features like double tap sleep\\wakeup function.  \n9\\. VoLTE support.  \n10\\. Dedicated memory card slot upto 2 tb.  \n11\\. OTG compatibilty.  \n12\\. Removable battery.  \n13\\. A respectable Korean brand instead of dime-a-dozen Chinese ones. After-\nsales support matters. :)  \n14\\. Front cam is pretty decent. Though I am neutral on rear cam. But it's\nstill better than other \"13 mp\" cams. I was using Panasonic Eluga before it\nand the difference between both the 13 mp cams is distinctly noticiable.  \n15\\. Sound output is pretty decent as well.  \n  \nAnd now some cons :  \n  \n1\\. 16 gb storage. Though personally I am comfortable with it because cheap 4g\ndata is all around and it's cloud storage age anyway. Google gave me 100gb\nfree drive space with this phone.  \n  \n2\\. A screen guard would have been nice as I can't find it anywhere.  \n  \n3\\. Can't mirror it on the smart TV. Though DLNA is there so phone media can\nbe played on the smart TVs which have DLNA .  \n  \nThat's it.:)\n\n", "Everything is okay except camera\n\n", "Good set the only problem with LG sets is Battery.\n\n", "Very slim and nice to handle. The S-Pen matches the performance of Samsung\nGalaxy Notes . Free flip cover provided is of very very good quality may be\nworth at least Rs 400-450 . If the flip cover bears the LG symbol instead of\nthe elephant design the appearance of the mobile will look royal. The response\nof the touch screen is better and perfect than many other mobiles including\nSamsung Galaxy Notes with S-Pen.The response is also very very smooth and\nquick .LG Stylus 3 M400DK (Titanium) . I think LG should popularise the model\nto sell more of them. Please buy LG Stylus 3 which is better than Stylus 1,2,\n& 4.\n\n", "I love my phone...just that sometimes the finger print unlock system doesnt\nwork\n\n", "I have been using this phone for a period of2 months and i think it's the best\nphone at this segment with no heating experience  \nThe main reason too buy this phone is it doesnt hang at all with 1.2 gb ram\nalways free  \nPros:  \n1.Slim &sleek design  \n2.Rich look with a black matte case cover  \n3.Touch responsive at its best  \n4.6months screen protection warranty(not there for any mobile)  \n5.Unique features like Gesture ✋ controlled camera and burst shots.  \n  \nCons:  \n1.Fast charging not available(2hrs to charge 0-100%)  \n2.Availability of accessories are bit less  \n3.a bit high price than others but a great mobile in this segment\n\n", "Just go for it.  \n  \nTook 6 months back still no problem.  \nSuperb!\n\n", "Have been using for the past one month, no complaints yet.\n\n", "Nice phone in this range\n\n", "Phone is a bit overpriced as compared to the spec offered by its competitors.  \n  \n1\\. It gets unbearably hot wen internet is used or game is played.  \n2\\. As mediatek processor , preformance is average.  \n3\\. Most of the time u can see the laggy performance wen swiping notification,\nor closing minimised apps. Or opening big apps ie animation are laggy.  \n4.Takes too much time to charge.  \n5\\. Would have loved to have marshmallow stock android look in this phone.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 April 2017", "on 14 November 2017", "on 31 October 2017", "on 23 October 2017", "on 26 September 2017", "on 17 July 2017", "on 12 November 2017", "on 16 September 2017", "on 27 September 2017", "on 10 August 2017"], "reviewer": ["Pankaj Chopra", "pramod", "Atanu_voodoochild", "SELVA", "MKW", "Pavan kumar Maganti", "syedNaveed21", "Avirup", "Amazon Customer", "Amazon Customer"]},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []}
]