[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Excellent, battery easily lasts for 2 days of heavy usage", "Review post a month of usage", "Better than Redmi Note 4", "Mi Max 2 good choice to buy", "Nice product and Value for money", "Tooo gud go for it", "Best Phone in 6+ Inches", "Mi Mumbaikar (max2)", "Lasts long.. Very long", "Kudos to Amazon"], "review": ["Beautiful phone, best battery you can have, lasts easily for 2 days of heavy\nuse. Camera & speed best at the price. Only thing not so good is that it's\nnotification light has only one colour 'white'\n\n", "I bought this phone last month in the amazon sale on discounted price. Got a\nvery nice deal.  \n  \nRegarding the product:  \n  \nIts the best value for money phone you can buy if you like really big screen\nphones.  \nI wont talk about specs because you can already find them in the prouduct\ndespription. That said, specs are very good for the price in my opinion.  \n. Amazon delivery was very fast  \n.the phone is fast and fluid, no lags  \n.display is pretty awesome, media consumption is such a treat  \n.Battery is a BIG plus, backup is awesome and battery charges very fast  \n.Lots of customization options offered by MI UI which I really like  \n.Sound is awesome. Dual speakers.  \n.Camera is above average to good depending on lighting conditions. Should\nsuffice all your general photography needs.  \n.the phone has metallic built, feels very premium. One point to note here is\nthat the phone is sleek and doesn't feel bulky at all to me. Thats very nice\ndesign by Xiomi on such a big phone.  \n  \nJust remember, its a big phone, so dont expect it to be as handy as a small\none.\n\n", "Better than Redmi Note 4 .I was having a Redmi Note 4 and I accidentally broke\nit so I bought this and is much better than Redmi Note 4 in every aspect.it\nlike a better and refined Redmi Note 4 go for it if screen is not an issue.And\nyou will get used to it after using it for 1 week.Thank you\n\n", "Good Phone. Performs task without lagging. 4Gb RAM and 64Gb Internal is good\ncombination.  \nCharging cable has \"C\" type mobile connector. Charging cable quality is little\npoor compared to other brands.\n\n", "Just loved it and phone is working like a rockstar.  \n2 days battery with 1 time full charge. My usage is high but it is nice and no\nneed to worry for charging daily.  \nWorking fine.  \nCamera is not so good.  \nScreen resolution is awesome.  \nsleek designed phone and budgeted phone.  \nBook reading is just like kindle.\n\n", "I have been using mine max from more than one year I fell in love with it then\nbought MI max 2 has all the most amazing features  \nFeatures I love the most are  \nAmbient light sensor  \nStereo speakers surround sound  \nBattery one of the major feature too too good  \nAnd the display so colorfull  \nSpace ram rom  \nAnd the color  \nBest mobiles I've ever used if your lukin for a best battery best display best\nperformance and luks go for it mi max 2 bigger is better\n\n", "I bought this Mi Max 2 - 64GB, during Diwali offers and got the best deals and\nnow after using this phone for one month now I’m giving the feddback with few\npictures taken from my previous phone Redmi Note 3.  \n  \nBest Features:  \n  \nBig Screen with better wide-angle giving best viewing experience while reading\nor watching video.  \n  \nDual speakers with stereo effect give a good surround sound music experience\nin landscape mode.  \n  \nSplit screen mode is very useful for various apps (It works only when updated\nwith MIUI 9).  \n  \nTwo-day battery life despite use with all-day mobile data on, Bluetooth keep\nconnected with  Mi Fit Band, 1-3 hours YouTube play and 1-hour song listening.  \n  \nCamera Quality is good thanks to Sony IMX386 sensor with better lens. Though,\nin low-light picture quality is not satisfying but still better than Redmi\nNote 3 & 4.  \n  \nWith 4GB RAM and 2 GHz Octa-core processer I have not yet faced any issues of\nslow performance or hanging while using multiple apps at a time.  \n  \nDownsides:  \n  \nThe drawback is when you protect phone with a back cover it becomes difficult\nto hold in hand especially while talking on voice call for longer time, hence\nit is not for small hands. But when becomes habitual it is easy to handle and\nyou will don’t like other smaller screen size phones.  \n  \nAnd one thing more, after updating to MIUI 9 I’m getting an unknown error\nmessage for reporting, but I hope within next updates it will be fixed by MIUI\ndeveloper team.\n\n", "Purchase the mi max2 after going through the reviews of previous purchasers\nand thought of laying my hand on the beast and found it very outstanding true\nto its standard. I have been using lenovo phab2 a bodily beast and in\ncomparison mi max2 is both bodily as well as performance beast. Thanks amazon.\n\n", "Pros:  \nBattery life- Lasts more than 2 days easily.  \nScreen- Big screen. A joy to watch football matches, movies & for playing\ngames.  \n  \nCons:  \nScreen- Really bad viewing angles. Shouldn't bother you unless two or more\npeople are watching movie on its screen.  \n  \nCamera- Didn't expect it to be better than my MI5 and I was right. Camera is\nmediocre. Go for maybe MI A1 if you want good camera but compromise on screen\nsize n battery life. Tough question, I went ahead with max 2 though.  \n  \nLoudspeaker- Expected better from a stereo loudspeaker but the sound from\nearpiece is neither bassy nor loud. So not better than a mono loudspeakers on\nother phones.  \n  \nOther than pros n cons. Some important things to note are:  \nSize- It's a huge device. I have a MI5 and wanted to have another phone whose\nbattery life is great and on which I can watch my football matches\n(hotstar/jioTv). So as a secondary phone, it's great. Doesn't fit in all of my\njeans. So sometimes I keep it in my office bag. If you know what you're\ngetting, you'll be fine.  \n  \nGiven around 13-15k, I'd make this choice again and buy max 2 just for the\nawesome battery life. I mean you can do whatever you want and not worry about\nthe battery getting empty. That's a big plus. So 5 star for me. Cheers\n\n", "Bought this for my wife. And boy isn't she glad to have it. Just love the\nclarity,speed ,camera quality and best of all super battery back up. Extremely\nhappy with the product and Amazon as usual ensured timely delivery. Thanks\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 September 2017", "on 19 October 2017", "on 17 January 2018", "on 27 January 2018", "on 6 November 2017", "on 18 December 2017", "on 18 November 2017", "on 31 January 2018", "on 12 November 2017", "on 22 August 2017"], "reviewer": ["Taqee Ur Rahman", "Vipul Jain", "Joseph", "Aniket", "Gurpreet Singh", "Shaji", "Vikram Singh", "Mohan.A.Kewalramani", "Chirag Sharma", "Deepak"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Beauty and the beast", "Awesome mobile..Battery king", "5 stars for Mobile. 0 Star for amazon.", "Xiomi Rocks .....Awesome Product", "... make up to my expectations but it is very good phone Nice speaker Nice battery Nice camera But storage ...", "Perfect Review", "Beast :)", "truly best smartphone in the market at its price", "Excellent but huge", "Mi u impressed me"], "review": ["After using for 5 days iam giving 5 stars is a real beast weighs less than\nanother smart phones I used my friends lenovo 5 inch mobile with 4000 mah\nbattery it weighs more than mi max 4 and coming to the point  \n• battery backup 100/100  \n• display 100/100 I fell in love with curved edges  \n• audio mini boom box with 2 stereo speakers  \n• camera not so good as expected  \nIam happy with my mi max 2\n\n", "It is an awesome mobile with reasonable price , I got it in only ₹ 13400 with\nmy Hdfc Credit card offer , It is looking so smart & attractive ,The main\nadvantage of this mobile is Big battery it stands upto 36 hrs if charge full &\nused with 4g internet continuously , smart touch & faster mobile, memory is 55\ngb for use so advising to all my friends to purchase this mobile if ur\ncompatible for 6.4\" size mobile . My side it's 5 star rated😃\n\n", "I wud like to say that i got my phone after 19 days! Yes bcoz when the first\ntym i made online payment my payment got declined due to some errors in amazon\nserver so technically i shud get my refund in record tym but it took a hell\nlot of tym! Pathetic service.  \n  \nBtw Max 2 is really good. Great screen and camera quality is also good due to\nthe Sony Sensor. Big screen and metal back looks very good but not for ppl\nwith small hands.  \nBest part is battery,FHD display, processor and gpu.\n\n", "Awesome Mobile with new era of young Generation of Have Some more of 6.44 Inch\nscreen.  \nAbsolute 2.0Ghz Processor With Bullet Speed of 4 GB & Loads of storage.  \n  \nConsiderably Smart move by MI.  \nFull HD Screen with Huge Display.  \nNo lags & Hanging of phone eva.  \n  \nOverall Awesome product .....\n\n", "As I have mi max  \nSo I buy it also  \nI thought with low storage it can't make up to my expectations but it is very\ngood phone  \nNice speaker  \nNice battery  \nNice camera  \nBut storage is low  \nI needed 128 GB perhaps  \nBut overall phone is very great  \nI can suggest this phone for buying  \nAt a low cost with high specs  \nGreat build quality\n\n", "Its an AWESOME phone at the price point.  \nWhat's good is the huge display-long batter life-quick charge-back camera-loud\nspeakers.  \nWhat's not so good is the REALLY HUGE DISPLAY that it's very unsafe to put in\non the pocket and ride off in a two wheller-front camera-Slow motion and time\nlapse feature in back camera.  \nPro Tip- Buy a tampered glass-A back case-A ring holder to utilise the phone\nhassle free.  \nPeace Out✌️\n\n", "Hi friends,  \nToday got this phone and trust me it's amazing....earlier i used MI Max and\nbought this by returning the old one.  \n  \nAmazing display and batter back up. Little heating issue while using internet\nbut hopefully will resolve.  \n  \nDon't wait just buy it\n\n", "After using the phone I can say one thing,,, truly best smartphone in the\nmarket at its price... User-friendly phone and very good gadget for reading\nbooks and viewing.  \nI got the phone for around 13500 for the 64 GB one... Thanks Xaomi, Amazon and\nthe dealer.\n\n", "It's a big phablet.  \nNot the phone you can keep in pocket and roam around.  \nLooks absurd while you're on call holding this giant.  \nOtherwise it's good if you wanna keep it as a secondary phone.  \nRAM is good, its fast, battery life is excellent.\n\n", "Excellent. This is my first Mi phone and I'm impressed. Superb build quality\nand design. The MIUI is new and refreshing. There are some bugs such as Google\nAssist does not respond most of the times and I had a issue where in an\napplication required 6 character password but the MIUI won't allow more than 5\ncharacter, SMS sometimes throws a bug message that yellow pages has crashed\netc and they should address these ASAP. The battery management is wonderful.\nGot 2 full days for such a big phone. Can buy without second thought at this\nprice. A real champion and big brother phone in this range.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 October 2017", "on 4 February 2018", "on 19 February 2018", "on 14 October 2017", "on 14 November 2017", "on 17 December 2017", "on 7 October 2017", "on 22 November 2017", "on 23 January 2018", "on 1 December 2017"], "reviewer": ["nagarjun", "amol suryawanshi", "Nishant J.", "Ashik", "MR.MAD", "P R Balasubramanian ", "Dinesh Bansal", "MR.Human", "Keshav", "Ironman"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["This is absolutely the best phone in this range hands down. Must buy. Highly recommended.", "Fabulously Phenomenal Love it", "It can fit easily in jeans pocket", "This is the Ultimate.", "Fantastic (y)", "My Great purchase for this Diwali is Mi Max 2 Bought it on Amazon Great Indian festival", "A decent uograde", "Thumbs Up for Xiaomi Mi Max 2", "Amazon technical services need to upgrade", "Technically the phone is cool can't ask much from a smartphone"], "review": ["This is the most amazing phone for under 16,000/-  \n  \nTo start with it has a full metal body, a unibody in fact and despite the\nlarge 6.44 inch screen, this rounded edge phone is designed for one hand\noperation.  \n  \nIt has a full HD 1920 x 1080 screen resolution and flawlessly watched full HD\nmovies without skipping or jerks. I used my Amazon Prime account to stream\nvideo through my WiFi connection.  \n  \nIt has a non-removable massive 5300 mAh battery that I can personally say\nlasts about three days of normal use. This massive battery has a quick charge\nfeature which can charge it from 2% to 100%. I did that and can vouch for it.  \n  \nIts primary OS is Android 7.1.1 (Nougat) with a Qualcomm MSM8953 Snapdragon\n625 Chipset. The CPU is Octa-core 2.0 GHz Cortex-A53 and its graphics\nprocessor is the powerful Adreno 506. All cutting edge here.  \n  \nThe camera features, though not very great, are pretty impressive. The primary\ncamera is 12 MP, f/2.2, phase detection with autofocus and dual-LED (dual\ntone) flash. Additional features include the 1/2.9\" sensor size, 1.25 µm pixel\nsize, geo-tagging, touch focus, face detection, HDR, panorama capebilities.  \n  \nOther Sensors include a fingerprint scanner in the back, an accelerometer, a\ngyro, a proximity sensor, a compass.  \n  \nLast but not least, it comes with Corning Gorilla glass-3 screen guard already\ninstalled for extra durability.  \n  \nAll in all, this is the best phone at this price. There is nothing else that\ncomes even close. I recommend this totally.\n\n", "Its Perfect Phone for Big Screen Lovers... and let me tell you one thing very\nclearly.. though it is 6.44' screen but is not that too much big... you can\neasily place in your Pocket I just love this phone... i bought it for My Mumma\nB'day Gift... she love it too becuz its easy to navigate in bigger screen for\nladies and persons who is not regular users of smartphone... apart from Big is\nBetter.... functioning is also awesome very fast 625 processor and 4 gb of ram\nand 506 Gpu make more convenient to use .... Overall Nice Phone For use and if\nu r going to buy it go for 4gb+64gb Variant...\n\n", "It can fit easily in jeans pocket...wont seem big after 2day of use..wortg\nevery penny..its fast ..slim and best mobile ..buy 64gb 15000rs on sale..its\nworth every penny..you open box and big surprise will be waiting for you..a\nmust buy\n\n", "Reviewing after 15 days of usage.  \n1\\. The phone did not have for a single time, no matter how many apps were\nrunning.  \n2\\. The colours and contrast are super awesome, the video quality and image\nwill not disappoint you, also taking into account the most argued part of this\nphone, the selfie camera.  \n3\\. Storage and UI smooth working of this phone and all my past phones of\nXiaomi is one of the primary factors which has made me brand loyal.  \n4\\. Once the phone is in your hand, you'll feel how premium the operating\nsystem is, for the price you are paying.  \n5\\. Video quality is super excellent.  \n6\\. Talking about the built, it's excellent. The size serves both as an\nadvantage and disadvantage to this model, but if you opting for this phone,\nyou'll have a wonderful experience.  \n7\\. Battery life is commendable. I charged my phone whole night, and it lasted\nfor straight 2.5 days with WiFi and mobile data services continuously switched\non, normal gaming, and a all social media apps usage.  \n8\\. The speakers. 👌👌👌👌 You'll love it if you are a avid movie watcher. Works\nbest with Mi headphones.  \n9\\. Although it has type-C port, but the quick charger is seriously really\nquick and the average charging speed is 3%/minute.  \n10\\. IR Blaster and The finger print scanner, and all other sensors in this\nphone are really good, responses really fast.  \n  \nIf you are taking this phone, you won't regret it, as I'm not, and it is a\nblessing for me, specially after using phones like Moto G4 Plus, Lenovo K4\nNote, so called \"Branded\" phones, which stands no where in front of this\nmammoth.\n\n", "Wowww fantastic mobile..... Big screen N lots f best features...... I'm very\nhappy.\n\n", "Recieved my mi max 2 today the mobile is amazing  \n  \nGreat camera performance  \nMassive battery back up (recieved time 3pm till now not charged 6.00 pm\n8.10.2017)  \nRuns many Android games without lag tested modern combat, galaxy on fire 3\nruns smoothly.  \nMi mui 8 and nougat 7.1.1 open box we get.  \n  \nGreat value for money better bigger and best smart phone under 15k go for it.\n\n", "I was upgrading from the Mi Max to the Mi Max 2. The large screen has always\nbeen a prime requirement, since I use this as a substitute for a tab.  \n  \nThe plus points are that this is a worthy upgrade. The phone itself is\nslimmer, feels better and more comfortable to hold (thanks to the rounded\nedges), the performance gets a boost with 4GB RAM in place of 3 in the older\nmodel and an even larger battery, and the pricing is even more attractive.  \n  \nOn the flip side, I could only get the black colour option; Dark Grey and Gold\nwould have been worthy options.\n\n", "Sleek Design.  \nSmooth operation.  \nI love the display size, brightness and clarity.  \n4GB RAM / 32 GB ROM/ 5300 mAh Battery.  \nFast charging.  \nExcellent Video and Audio quality.  \nValue for money.  \nHighly recommended.  \nEarphone set should be included in the package. It is a BIG missing part.  \nIt must have been look handy if color options are available other than default\nblack.\n\n", "Phone is good but having heating issue during return period Amazon has do the\nsome online testing but I am not satisfied with that as how you predict and\ntest the product online  \n  \nSo phone experience is not so good and Amazon technical service is very poor.\n\n", "This will blow any smartphone away guys one of the beast in its segment. You\ncan just blindly go for it if u Wanna churn out real power from a smartphone.\nTechnically the phone is cool can't ask much from a smartphone. Love my max\nand this is my second buy.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 October 2017", "on 23 September 2017", "on 4 October 2017", "on 14 November 2017", "on 22 September 2017", "on 8 October 2017", "on 23 January 2018", "on 20 January 2018", "on 29 October 2017", "on 1 September 2017"], "reviewer": ["amit sharma", "Ankur Shrivastava", "Nishith", "Zuby A.", "Suku'N", "Mani (gk downloads)", "Vipin K.", "ROSHAN DE SILVA", "dipak", "Amazon Customer"]},
{"rating": ["3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["They are like contact details merging and contact name swaping", "Great battery phone but poor front camera", "If you're a fan of large screen phone,  go for it..", "Ultimate mobile. Large screen, slim mobile and light ...", "Amazing phone...", "Amazing phone.", "Just go for it if you like big screen pure entertainment and INFINITE BATTERY", "Superb phone", "A good budget phone with its pros and cons", "Super battrey backup up to 9 days"], "review": ["Xiaomi MI Max2 has started showing few bugs related defects.  \nThey are like contact details merging and contact name swaping.  \n  \nThere is no prompt action by the company yet.\n\n", "It is a very nice mobile at this price range as it's battery will last upto\n2-3 days for normal usage. And it is difficult to us to carry the mobile for\ncost 2 days but after that we feel very comfortable with it. But the only\ndisadvantage is it's front camera it is very poor especially in this price\nrange I.e why I am giving 4 if it had a good camera at front then it would be\nthe best phone\n\n", "It's a super product.. Fast, sleek, elegant.. And above all - THE BATTERY\nLIFE.. It lasts for 1.5 days with mobile hot spot running almost 10 hours a\nday.. Only constraint is the size.. But when you know that it's a bigger\nphone, you can't complain about it.. Better to use with cover as the edges are\nslippery.. Overall, great product.. Strictly for people looking for large\nscreen phones...\n\n", "Ultimate mobile. Large screen, slim mobile and light weight in comparison to\nscreen & battery size. Mi Max 2 rocks.\n\n", "Guys I am using Sony t2 ultra since 2014 and want to upgrade just like my old\nphone big display and better battery life after losts of search I saw this\nbeast and fall in love with it  \nSaw many many reviews on YouTube and finally brought it on 23 September  \nIt's really nice phone  \nLots of reviews say that it's camer is average but in my opinion camera is\ngood  \nOverall phone is really nice and am happy with it  \nThank you Amazon for fast shipping\n\n", "Amazing phone I have purchased it from Amazon and got right time delivery.  \nThe battery of the phone is amazing and lasts for 2 to 3 days.  \nAny one looking for a bigger screen phone at reasonable cost can go for this.\n\n", "You will get used to the large screen.. Later you'll find all others screens\nsmaller lol.. Everything's awesome in the phone.. Battery back up is\ninfinity..14-15 hours screen on time..2 GB free RAM.. Fast phone,, no chance\nof heating.. Only sunlight legibility is not like amoled.. Sleek phone..\nCamera awesome.. Night time you had use manual controls works well\n\n", "After using one and half hour, it is super battery backup, sound and calling\nsound is clear, loud. Camera is ok , fast processor , what else you need . I\nam very happy i love u mi. Previously i used mi note 4 . It is far better\nmodel\n\n", "Its a very good phone to have in its price range. Have been using it for a\ncouple of days now. So reviewing basis that:  \n  \nPros: Good screen quality, great battery life, good fingerprint scanner,\namazing for gameplay.  \nCons: Below par camera, its too big in size so not for everyone.  \n  \nBut it is a great buy for 17k. If size is not an issue and you are fine with\naverage camera quality go for it.\n\n", "Good battery life  \n9 days run without sim card\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 January 2018", "on 19 January 2018", "on 25 December 2017", "on 4 December 2017", "on 25 September 2017", "on 31 January 2018", "on 27 September 2017", "on 25 October 2017", "on 25 October 2017", "on 24 October 2017"], "reviewer": ["Abhisekh mahapatra", "shreekanth", "Amazon Customer", "js", "saurabh Abasaheb Gunjal", "Vinayak", "Faraaz", "Jagai acharya", "Utkarsh Tripathi", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Awesome phone! Recommend to all!", "Size Matters", "I would not hesitate to hail its superb in all aspect with reali commendabel screen size with butterlike smooth function throughout any one wishes to but it pl go blindly n u will found a wonder at this price in smart mobile category at the same time u will not ...", "A great buy ...", "It’s a huge sized phone Best screen dpi and clarity", "Love it !!!", "So far so good.. Pros", "Excellent phone. The battery on this will get you ...", "Mi max review", "Five Stars"], "review": ["After 15 days of usage of this awesome phone I would like to leave this\nfeedback!  \n1\\. Delivery: Amazon has left me scrambling to get the delivery of this phone\nand since I did exchange it made things worse. So one star less.  \n2\\. Unboxing and usage: first usage was really nice.. To switch from mi max to\nmi max 2 was only slightly different due to ram increase.  \n3\\. Gaming: I am casual gamer but play most of the time but still battery\nholds for one and a half days. And no heating issue even with using a rugged\ncase.  \n4\\. Overall : the phone is nice to hold in hand. The look is what make it\ndifferent from mi max. Ram usage by miui is frustrating so probably I will\nchange to a custom Rom like RR.That will change my phone to a beast.  \nIf it comes below rs. 15000 I would suggest anyone to go for this phone.\n\n", "Just 1 thing to say. Size matters the most to me, so, folks who'll like a\nbiggie monster in their pocket this is the best option...\n\n", "ha ha ha cheers maja aa gaya diwali festival bonanja off rs 2000/- n waiting\nfor more from sbi card of 10 % cash back by 17 Jan 18. I would not hesitate to\nhail its superb in all aspect with reali commendabel screen size with\nbutterlike smooth function throughout any one wishes to but it pl go blindly n\nu will found a wonder at this price in smart mobile category at the same time\nu will not forget to curse the apple n samsung flagship cell with so costly\nwith single sim a bad dream in specially in indian territory. thanks amazon\ncheers for giving so nice festival bonanza to all indian on eve of diwali\nagain hip hip hurrah for AMAZON\n\n", "Having used several brands in the past, I finally got something really great -\none feature being the battery which lasts for two days inspite of heavy\ninternet usage. Charging takes just over an hour from 0 to 100. Since it is\njust a week of use, I shall come back with further review later.\n\n", "It’s a huge sized phone  \nBest screen dpi and clarity. Comparable to iPhones.  \nGood battery life, very premium looking.  \n  \nCamera is slightly on poor side but, we won’t get everything for the price\nthis phone has been offered upon.\n\n", "Got it for ₹8500 with exchange during the Diwali Sale. Awesome phone with a\nbetter camera experience. I have used MI since the very first phone. But the\ncamera always let me down.  \nThis phone solves that.  \n  \nPros:  \n1\\. Great Battery Life with SOT of 10+ hours  \n2\\. Better Back Camera than all previous MI phones in this price range. Front\ncamera also better than before.  \n3\\. Stereo Speakers are great and loud  \n4\\. Performance is smooth with minimal heating.  \n5\\. Also, it supports Quick Charging. 0-100 in 1:46 hours for a 5300 Mah\nbattery is admirable.  \n  \nCons:  \nNone really except the size for some people but not for me.  \n  \nThank you Amazon for quick delivery and MI for such a fantastic product.\n\n", "Just today got the phone. So far so good..  \nPros:  \ngood display.  \nProcessing speed is good.  \nBattery life is excellent.  \nCamera night pics good compare to my Moto g5 plus.  \n  \nCons:  \nToo slippery.\n\n", "Excellent phone. The battery on this will get you through 30 hrs .. even if\nyour watching videos or playing games . It's a steal for the buck. It's\ndefinitely big and and one hand use is too difficult. However while watching\nmovies or YouTube it's a delight. Perhaps with a larger hand it will be a bit\neasier. However sometimes the phone is not reachable even while there is full\nreception. And call quality is not great. And the user interface is not\nandroid so it will talk a while to getting used you. But at the price point\nit's the best one can buy if size is a concern but the Lenovo P2 or with for\nthe p3 that had similar spec at 5.5 inch screen. Cheers\n\n", "Very good product. Both camera, speaker, battery, features are very good. This\nphone is not for everyone. Only who able to handle big size. Thanks to\nAmazons.\n\n", "best phone for batttery, best for screen  \nlacks camera, could have been even better\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 October 2017", "on 15 October 2017", "on 24 October 2017", "on 27 September 2017", "on 25 January 2018", "on 9 October 2017", "on 23 September 2017", "on 21 October 2017", "on 12 October 2017", "on 13 September 2017"], "reviewer": ["Megan David", "Archisman Pal", "Arun Singh", "Harry", "Vikas soni", "Pankit Bhadola", "Umesh", "charles", "Amazon Customer", "vipul"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Sheer brilliance", "A sound buy", "Beast Phone", "Excellent device with superb battery life!", "Customer Looking For A Complete Feature Package Mobile.", "But after using it i am so satisfied about the phone", "Good! Not the best!", "Excellent phone. My last phone was the Samsung J7", "Love it.......love it... Simply love it.", "Best Budget Phone below 15K Mi Max 2"], "review": ["Awesome fone, so big yet so handy to use and light on ur hands . It's sleek\nand trendy . Amazingly fast and a cool multitasked . Ni heating prob at all.\nBattery lasts 2 days easily .  \n  \nOnly concern is , wd have loved a separate memory card slot , especially\nhoarders like me. Only 50 gb out of d 64 is available for use\n\n", "A perfect mobile with all the goodness.pros;adamant build quality,incredible\nbattery backup,above average display,ear catching stereo sound from duel front\nmounted speakers,IR blaster,all most all sensors,good touch response,gorilla\nglass 3 protection,aesthatically crafted machine,nougat 7.1.1,MIUI9.0.1.0,2.5\ncurved glass which enhances beauty, cons; Average cameras.\n\n", "I have been using this phone for almost 1 month and i am really impressed by\nthe built quality and the performance of this phone , the massive screen look\nbeautiful specially when watching videos on the phone , the camera is just\nfine for this price , batter backup is so good as i play heavy games and still\ni can use this phone for straight 2 days with only once charge and if i\ncompare this with my S6 edge which is 3x the price of this phone the battery\non s6 is poor if compared with this mi max 2 beast .  \n  \ni will recommend everyone if you got a budget of 15k then go for mi max 2\n\n", "Xiaomi created and excellent gadget. My prime requirement of mobile phone was\ninternal storage and battery life. Both these purposes are well served by Mi\nMax 2. The big screen is awesome for gaming, video, social media and reading.\nThe resolution is also great. SD625 processor along with 4GB RAM and 64GB\nstorage is an excellent combination which provides great performance for\ngaming as well as productivity purposes. I usually play casual games, but it\ncan handle most of the high end games without hassle.  \nThe 5300mAh battery is the real jewel of this device. I got almost 20 hours of\nscreen-on time on moderate use, including extensive web browsing and video\nplayback with 4G LTE continuous on. Even if you play high end games, you can\nget more than 12 hours of screen-on time. Fast charging is also excellent. It\ncharges from 60% to 100% in less than 20 minutes. Although I haven't tested,\nbut it can charge from 0% to 100% within 1.5 hours.  \nThe build quality is excellent with unibody metal design. The size is really\nbig. It may be difficult pocketing if you have tight jeans, but mostly it is\nmanageable. Also it is difficult to use it with one hand, specially when\ntyping, but one-handed-mode can be helpful in that case.  \nFingerprint scanner works great with almost no delay and great accuracy.\nScreen brightness and sunlight legibility is also excellent. Sound quality is\nalso superb, on both speakers and headphones via 3.5mm jack. However, it is\nnot bundled with headphones, but you can use any standard 3.5mm headphones.  \nCamera is above average. Daylight photos are excellent with great clarity and\ncolors, but indoor and low-light photos are little noisy. Front camera is also\ngood, it takes great selfie if lighting is adequate, but low light performance\nis just average. Video recording is also great for this price range, as it can\nrecord 4K videos, but it doesn't have OIS, so videos will have shaking effects\nif you don't have stable hands. I do not use mobile device for photography\nsignificantly, so camera cons are not a problem for me. But believe me, at\nthis price range, camera performance is more than good.  \nOverall, I fell in love with it in just a week of usage! If size is not a\nproblem for you, just grab it, you won't be disappointed!\n\n", "I had booked Mi Max2 on 1st December and got it delivered on 4th december\nbecause of Sunday I got it one day delay in delivery.I m using this mobile\nfrom last two days and I have just once charged it because of its big battery\nof 5300mah and to be honest it lives to its expectation.The camera quality is\ndecent not too good nor too bad and it gives decent result in natural light\nboth in image and video mode.The big screen is good and gives nice resolution\nand is visible in sunlight decently.The heating issue in this mobile is not\nfelt while charging,gaming,mobile hotspot or while screen mirroring as\ncompared to previous mobile like redmi 4a ,redmi4 or redmi note4. Its decent\nbuy for a customer who is looking for all features in this price bracket.\n\n", "Just received this phone 3 days ago. So writing the review of my experience\nabout the phone. I was very confused about to buy this phone. Because so many\nconfusing reviews were there about the phone. But after using it i am so\nsatisfied about the phone. The 16.4 cm (6.44) immersive display is really\nvibrant and huge. And that is the reason i bought it. Picture quality of\ncamera is awesome. Some reviews are there that camera is not so good. But i am\nnot agree with that opinion. Yes, camera is problematic in low light. There is\na need of betterment. Battery is also very good. This is second day of\ncharging and 62% battery is still remaining. I dont play game so cant say what\nshould be position of battery after playing games. Only thing I found bad, the\nquality of sound. Sound is loud but when i am increasing it, i think it's\ncracking. Back side of the phone is so smooth and slippery that you hardly can\nhold it in the palm. Otherwise the phone quality is overall superb.\n\n", "Phone looks good. Camera is fine. 64GB is great. Price is great.  \n  \nIt has micro and Nano SIM slots only. You can use one SIM only at a time if\nyou use micro SD. This is disappointing for me as it was not explained in\ndescription. Settings were too complicated as you can't find them easily. Not\nso simple like branded phones. Can't find software update in settings at all.\nI'm in two minds to keep it or not. I guess I get use to it. Overall good for\nthe price. Not the best.\n\n", "Excellent phone.  \nMy last phone was the Samsung J7, to which this phone is infinitely superior.  \nThe case is fully sealed with only a tray for the sim n SD card.  \nScreen size is large. Interface is excellent n easy to use.  \nBattery power is the best in the biz:5300mAH.  \nAll volumes r effective, which is a major improvement over the J7.  \nStrongly recommend this phone.\n\n", "Love it.......love it... Simply love it.  \nPros  \nBig screen (don't hesitate of it size will love it after some time.  \nBig battery: 5200 mah means big and in practical is also big so u will enjoy\nfor whole day of heavy use.  \nSound. 2 speakers awesome....  \nSpeed :fast and haven't lag  \nCons not able to fit in pockets of some pants otherwise ok  \nP. S: as soon as got your phone go to market and put cover as well as temper\nbefore using as there is no grip in phone without over  \nDon't hesitate from buying this phone bcoz of size as after 10-15 days u will\nget habitated to this phone.\n\n", "Reviewing the phone post a month of extensive usage. Bought from Amazon after\nhours of research, deliberation, and comparing the best budget mobile sections\nI came upon this gem of a phone. Prompt delivery but had an issue with double\ndebits while making payments which was reversed in a week after speaking to\nthe customer care. Mi Max 2 is bulky and makes it awkward for calls, but that\nis its only drawback. Excellent performance, good audio quality. Display is\nalso really crisp. Camera is a bit of a let down however, takes really good\nselfies & images. Browsing, downloading and on the go net speeds are\nexcellent. Works better than a laptop or pc. It's not a phone for everyone but\nthe best buy for all. Feature rich, great value and lots of optimization and\ncustomisation options. Excellent for watching videos and the big screen space\nadds to its value and makes typing easier. Currently its the best buy with 4GB\nRAM, 64GB storage, Android Nougat and well priced. The phone comes without\nheadphones, lacks extra storage expansion slot in case the user has 2 sims\ncards. It doesn't come with a screen guard or a phone cover however, it can be\neasily accessorised. Excellent Buy!!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 November 2017", "on 17 November 2017", "on 4 October 2017", "on 30 September 2017", "on 6 December 2017", "on 31 October 2017", "on 18 December 2017", "on 28 September 2017", "on 30 November 2017", "on 24 October 2017"], "reviewer": ["sanghamitra", "jayachandran nair", "Sarfraz Ali ", "Rahul Acharya", "Shakir Chhipa", "pubali chatterjee", "Madhava K. Pasupuleti", "R.V.Raghavan", "Gaurav G.", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Awesome product (Very slim, Huge screen, Execellent battery backup, 4GB RAM)", "Bigger is better.", "one would fall in love with such a package", "Worth to buy with exchange at rs. 11000", "Super power mobile", "Unbelievable battery backup", "Looks and feels super premium. It's not THAT big", "Big screen, Big battery life, Amazing camera", "Battery Problem", "Love the way amazon treats you as priority"], "review": ["I just got it delivered on 15-Nov-2017 and I am just in love with this mobile.  \n  \nPros:  \n1\\. Very slim (it may slip anytime from hand and hence advisable to put back\ncase cover). Its very slimmer than Redmi note3/4  \n2\\. Very huge screen  \n3\\. Excellent battery backup where I have been using since it had 64% (from\nthe time I opened the product from box) and with usage of 15 hrs it had\ndropped to less than 10% which is awesome.  \n2\\. No heating issues were identified  \n  \nCons:  \n1\\. Camera quality is not that great  \n  \nBut I think its too early for me to write a review but still I am satisfied\nvery much.\n\n", "Awesome phone. Is a big one but no hassles about carrying it in my jeans\npocket unlike what some reviews said. Keypad is nice n big so typing is a\npiece of cake. Superb battery which makes all flagship phone batteries look\nordinary. Nice camera. Sturdy phone. No problems even after dropping it a few\ntimes. Love watching movies on it. Equaliser for music is great. Has different\noptions for Mi earphones. I'm sure this phone will last me a long time n after\nthat I'll have to go for a phone of this size only cause after u use this one,\nother phones seem too small.\n\n", "This one is not for everyone because of its size but I bet, after using this,\none would fall in love with such a package. Considering the price when reduced\nby rs 2000/-, this gives a serious competition to many flagships. More pros\nthan cons...This is a lovable beast.\n\n", "Got it rs 11000 with exchange 64gb variant... Size is little big.... If u want\nread books, watch videos than it is great.... Using lastly more than 2 hours,\nlittle bit heat while data transfer from SD card to phone..... Working\nsmoothly....and it's early to say about anything about.... Battery\nperformance, display is awesome.... Camera is not best..... And lastly size is\nlittle big..... Thanks for reading.... I will write further after a week\nuse.... Thanks\n\n", "Finally beats come today..Thanks Amazon to great delivery..super power\nmobile..comfertable to hold...size doesn't matter.. Excellent camera and\nbattery backup..\n\n", "I phone is nothing in front of this phone.  \n2 days full battery backup, camera clarity is good, large screen super\nclarity, using quick charge battery charges within just 2 hours.  \nNot just a smart phone it's a super smart phone.\n\n", "The design is splendid. Looks and feels super premium. It's not THAT big.\nEasily fits into my waist size 36\" trousers and jeans. And within a couple of\ndays, you'll get used to with the size.  \nGaming experience is really very smooth and great. I played Dream League\nSoccer and it works super smooth and dropped no frames. The video quality is\nvery good. Camera is decent. Sound is really loud - both from speaker\n(ringtones, normal media etc.) and earpiece. I don't have to use loudspeaker\nat times. The earpiece is that loud.  \nLastly, the battery is a beast and it charges quickly when compared to the\nbattery size. Took me exactly 2 hours to charge from 10% to 100%.  \nThe screen could've been brighter and sharper. But nevertheless, I'm\noverwhelmed with my phone as of now.\n\n", "Camera lacks in low lighting but in good natural or artficial lighting works\nas good as a 25k budget dslr and image focusing.  \nNote Big screen can mind you because it half tab with screen sze of 6.44 inch.  \nBattry life is amazing  \nProcessor is good is SD625\n\n", "This is my second MI Max 2 phone, but this phone is draining fastly as\ncompared previous one. My first MI Max 2 was purchased from another site and\nthat was really Good against this phone as compared to battery usage. The\ncurrent phone has fewer apps and even in standby mode, it drains moderately\nmore.\n\n", "Love the way amazon treats you as priority. Love the mimax2. Its love at first\nsight.  \nThank you Amazon.in. 💝\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 November 2017", "on 10 December 2017", "on 8 October 2017", "on 11 October 2017", "on 23 September 2017", "on 17 September 2017", "on 26 December 2017", "on 24 November 2017", "on 26 December 2017", "on 22 January 2018"], "reviewer": ["Dhanesh S", "Neil Dcruz", "SL", "RAKESH KUMAR", "Manish Gohil", "Vaibhav", "Smit D.", "Abhyuday S.", "RANDHIR  MEHER", "kashana"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Amazing Paisa Vasul", "Love my beast!", "Good product. Size is not an issue.", "Exhorbitant repair cost within Warranty.", "Best In Class", "Camera I am very happy with its result too", "Perfect Price for the Perfect Phone", "Awesome phone no second thoughts about it...", "Biggest Beast in the Market :)", "Really big screen smartphone at just the right price point"], "review": ["big battery life bigest screen powerful processors large storage with decent\ncamera amazing flagship phone make a perfect in price segment... no compromise\n\n", "The phone is a beast. Battery last ages, taking you to nokia days. Viewing\nvideos is a fantastic experience, considering the size. I would have preferred\nbetter camera, but the camera is manageable. The back cover is slippery, so\nuse a back cover and a tempered glass. But because the phone is so big, and\nwith the additional weight of the back cover, I started getting wrist pain on\nmy right hand. Scrolling with one hand is easy, but typing, not so much. You\nneed one hand to hold the phone and another to type.\n\n", "First of all size will not be an issue.  \nAfter using the phone for about 6 days i was not much affected by the size\nthat much even though i came frm a 5inch phone.  \nI could use the phone with one had fr typing (not in one handed mode )\noccasionally whenever needed.  \nIt fits in the pocket easily. Even with the case not much problem but it takes\nthe whole space of the pocket but in my experience that was not such a huge\nproblem or deal breaker for me.  \n  \nI would like to tell that when my phone arrived and as i saw a new update was\navailable on the phone so i updated to miui 8.8.5 from 8.5.8 (or something)\n,so before the update everything was perfect after the update when the device\nbooted some apps where running fine but suddenly the stock dialer app started\ncrashing and some other apps too crashed without any reason so i did a factory\nreset and it fixed the problem.  \n  \nEverything abt this phone is good except the down speaker audio level they\ndefinitely have a punch in the quality but i often felt it could be much more\nlouder kept pressing the volume button even though it was at max.  \n  \nTaking abt the battery. Its simply excellent both the sot and the charging\nspeed.  \n  \nI played many casual and few heavy games like bully anniversary edition nfs\netc. While playing bully the phone did become warm which is normal and i\nplayed fr odd 1 hr or so and battery discharge was less abt 20 %.  \n  \nLastly miui can be a bit trouble but u'll be through it in ono time.  \nI've rated it 4 star because the audio could be much louder (considering it as\na media centric phone) and miui is a very heavy rom hence it has poor ram\nmanagement.  \n  \nIt's a beautiful phone i will recommend anyone to buy if u watch Media a lot\non smartphone itself or you just wanted a big screen phone.\n\n", "Mi Max 2 is good phone.  \nBut there is some design issue with the screen, Within a month of purchase,\ndespite having a Corning Gorilla Glass protection the screen got broken after\nit fell while it was inside a ladies purse.  \nAs usual service centre said \"No Warranty for screen damage\" & cost of\nreplacement is about 6k. Phone itself was bought at 11.7k.  \n  \nTotally unsatisfied.....!!!\n\n", "Nothing Better then This @12999/-  \n  \n5300 mah batter-Quick Charge 3.0  \nUSB C-Type  \nLarge Less Bezel Display.  \nIts Mi Branding  \nMIUI9  \nOne of the best Power Efficient Processor SD 625 Octacore  \nIR Blaster(Other brand Don't have)  \n4GB RAM 32GB ROM  \nIn Build App Lock  \nSony IMX386 Camera Sensor(Best Kind)  \nBest Clear Loud Sound OutPut  \n  \nIts Slippery\n\n", "Lion among the herd of sheep.  \n  \nPure Beast.  \n  \nDon't misjudge it by price... It's performance is far beyond any 25000 Rs\nphone.  \n  \nBattery  \nGrip  \nBody  \nRam function  \nDisplay  \nInternal storage....  \n  \nAll the features top loaded.  \n  \nCamera I am very happy with its result too.  \n  \nMuch much much recommended. Enjoy Mi Max 2. Best phone for me. Love you Mi\n\n", "Bought it for 13000rs (4GB|32GB) in Republic Day sale this year. The Mi Max 2\nboasts of great specifications and excellent consumer feedback.  \nPROS:-  \n1\\. Solid Build Quality(full metal unibody)  \n2\\. Best in class FULL HD 6.44\" display with minimum bezel.  \n3\\. Very Light weight for its size.  \n4\\. Humungous battery of 5300mAh Li-Ion Polymer. In real conditions. In\nextensive used wth 8 hrs of downtime while sleeping, use includes continuous\n4G Data, medium screen brightness, 20% gaming time, 50% time listening music,\n20% time watching youtube, with simultaenously using Tethering, ran for 2\ncomplete days, i.e. 48 hours.  \n5.Power packed processor and ram, never lags, never stutters, smooth\ntransitions.  \n6\\. MIUI9, if you want split screen, then update to MIUI 9 in settings. Rest\nif you love a plethora of themes and wallpapers, MIUI is the one for you. I\nfind it very intituative and it optimizes battery usage in background.  \n7\\. One of the loudest in-class down firing loudspeakers.  \n8\\. 0 to 100% in 2.5 hrs using TYPE-C fast charger  \nCONS:-  \n1\\. Camera is really bad, not even average. Daylight photos are good but\nslight lack of light and noise is clearly visible. Although MI Camera app is\ngood when it comes to filters.  \n2\\. Hybrid SIM Slot. 1 sim only, so many might be forced to go towards 64gb\nversion if they need 2 sims.  \n3\\. The fingerprint scanner is sometimes stuttery but i wouldnt consider this\na bad point.  \n4\\. USB Charging cable provided in box is quite small.  \nVerdict:-  \nA power packed phone which is recently launched(September 2017) which boasts\nof a huge display and a solid phablet look, flaunt it in style or use it for\nmultimedia streaming, choices is yours. You wnt a proper price vs feature\ncurve, this is it. Buy it, dont think twice, you will love it.  \nP.S, :- Would not recommend for people with small hands especially young girls\nand also not for elderly people. If you have average hands.(heres a tip, try\nto lift a regular a4 size notebook in your hand and balance it in your palm,\ntilt it slightly left and right, if it doesn't slip, you'r good to go), no\nproblem in using, officially debunk all theories about needing big hands for\nit\n\n", "Really fantastic product...was really hesitant to buy at first...thought for\nover a week than finally went for it...and also I got very good exchange offer\nso it only costed me 8599.. really great cell in this price segment.. very\ngood feel in hand .....who ever is thinking for buying this product just go\nfor it u won't be disappointed believe me... battery backup is really good and\nthe screen is just awesome... finally forget about the negative review thats\nonly 5% by that only u can know that the phone is really good....\n\n", "When i saw Mi Max i Liked it, But as soon as i got the Mi Max 2 I Loved it :)\nBelive me you will praise the device at so Stunning price :)  \nYou wont find device better then this at 25k level. my dad use vivo 7 and its\nfar more better then it.  \nIts a Beast of the Cell Phone, Killer at 25k segment  \nDont think if you wanna buy under 20k just go for it.\n\n", "This is a mind mind bogglingly value for money smartphone of 2017 for just the\nright price. I had been using Mi Max for 11 months and was in no mood to\nchange it till Mi Max 2 was launched this festive season. With 2K discount\nupfront plus handsome exchange discount, this phone was a real steal for price\nI paid.  \n  \nPros: Very good screen quality, 5300mAh battery - terrific battery life with\nultra fast charging, massive 4GB RAM, Android v7.1.1 Nougat, Sony IMX386\nCamera - Wow!.. what a quality even in low light, dual speakers with stereo\neffect, excellent call receiving voice quality.  \n  \nCons: Silky smooth at back - without some rough back cover this phone would\nsimply slip out of your hands.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 November 2017", "on 16 November 2017", "on 27 September 2017", "on 22 November 2017", "on 20 December 2017", "on 29 November 2017", "on 13 February 2018", "on 11 October 2017", "on 6 October 2017", "on 25 October 2017"], "reviewer": ["Himanshu Asher", "Ahalya Natarajan", "Somesh mk", "Netrafter", "Rakesh Shetty", "neha", "Umang Duggal", "Amazon Customer", "Michael", "Kiran Pal"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Absolutely amazing phone...", "Wow phone", "Too good if price comparison is considered", "A MUST BUY PRODUCT", "Excellent phone ...", "44 inch) looks great. On other hand it is hard to operate ...", "Best value for money", "The phone seems to work fine but today I had an unexpected reboot", "Excellent product-Made in India", "Owsum phn..."], "review": ["Absolutely amazing phone for the price... Been using it for a month now n it\nis just amazing.  \nPros:  \n1\\. Battery life is just Gr8. With almost full day moderate usage it goes on\nfor 3 days n with continuous gaming or videos it will still go on for 2 days  \n2\\. Camera clarity is Gr8 compared to other mi phones in same price range.\nCompared with red note 4 and redmi 4. Mi max 2 is way better  \n3\\. Storage space is gr8... And the phone does not hv a lot of built in apps\nthat just clutter around. N there is option 2 u install the ones that r\nthere...  \n4\\. Ram speed is superb... J hv had multiple apps opened and left them like\nthat for hrs... Once you go bk it still has everything on the app as u left\nit... No delay in anything.  \n5\\. Touchscreen is absolutely Gr8... It has a curved design which is\nequivalent to higher end models of Samsung or even apple  \n6\\. It is very sleek... Compared to even redmi note 4... Beautiful design...  \n7\\. Fingerprint scanning is very accurate and opens up the phone quickly  \n8\\. Mi phones have a setting option to stop using internet for some apps... So\nthis quite advantages to mk the battery last longer... This option in not seen\non other phones i hv seen n used so far...  \n9\\. Sound and picture quality both are Gr8... It does hv 4k video recording as\nwell... So Gr8 in clarity and quality...  \n10\\. Charges very fast... In an hr it charges the phone completely... So even\na 15 min charge or half an hr charge will last u a day...  \n11\\. Gaming support is gud... N all the apps n high end games r supported...\nAlthough it does tk a little time 2 load these games... But a Gr8 viewing and\ngaming experience...  \n12\\. Screen size is amazing for videos, movies and gaming purpose...  \n  \nCons:  \n1\\. Can be the screen size for some but I absolutely love it... U get used 2 d\nsize in a day or 2... While taking selfie pictures also I don't find it a\nproblem coz the design is sleek and the pics can b taken with your fingerprint\non the bk... So the size is not an issue for me personally... But for some\npeople this could b a con...  \n2\\. Contacts list or phone list does not hv the option of seeing the\nfrequently called numbers like it did in my moto phone... So I miss that...\nBut it is not a big drawback...  \n  \nI can't think of any other cons... This phone is just amazing... Go for it...\nYou will not regret it...\n\n", "Very good phone for this rate. Thin and elegant. Once start using does not\nfeel big and to watch videos very good screen with clarity and pleasant. Xiomi\nis rocking. Amazon delivery was superb as usual.\n\n", "Above average product in performance. Too good if price comparison is\nconsidered, there is no better smartphone in the market of the same category\nand price range. Camera is not the cause of concern for normal user. Experts\ncan opt for costlier ones.But this is best on screen size, battery etc. A mini\nsd card slot would have been made as enough space available.\n\n", "I am taking out time to write review about this product because this phone has\nactually forced me to do so.  \n1\\. The EXCEPTIONAL Battery which lasts for 1.5 day with fair high usage.\nServers my purpose.  \n2\\. In this range of phones i must say it gives real good pictures to make you\nfall in love with yourself.  \n3\\. The big screen makes the vedios so attractive.  \n4\\. In built apps keep you away from unnecessary apps with lots of adds or\nbuying option to get rid of apps.  \n5\\. It has strong antenna which keeps to connected with your world even in low\ncoverage area.  \n6\\. Awesome look with so light weight metallic body.  \n7\\. Dual apps option for those who keep dual apps like WhatsApp.\n\n", "Packing was poor again by seller . Phone is excellent in some aspects .\nBattery life is INSANE. Fast charging is also a plus point . Performance is\nsmooth no heating issue as of now . Camera is average not good not bad . Some\ntimes it captures excellent image some time garbage ... Ram management is\nexcellent again... Very heavy UI takes almost 2.2GB of RAM (56%) . MIUI 9 IS\nfast as expected. Speakers are excellent screen quality is good viewing angle\ncould be better. Overall good value for money if u are not a camera centric\nuser ... If u need a good camera then avoid buying it.\n\n", "Screen is larger (6.44 inch) looks great. On other hand it is hard to operate\nwith one hand. But still its fine.  \n  \nIt has 5300mah battery. Last for 24-30 hours. If continuously work on wifi or\ninternet. Camera is fine great design, really fast.  \n  \n1 think i didn't like is.. it has hybrid sim. I cant use my mmc here because\nof second sim.\n\n", "Best value for money. Looks so cute. Other than camera quality problems, this\nis the best buy for every thing else. I bought mi Max and now max2. This is\nmore beautiful than earlier version\n\n", "The review is written after a month of usage. The phone seems to work fine but\ntoday I had an unexpected reboot. So, that is a little bothering.  \n  \nThe phone seems to run most apps smoothly (I have not tried the high end\ngames)  \n  \nThe size is something I wanted to be large and trust me, it is too big for a\nsingle hand usage.  \n  \nThe sounds and display are working well. The winning feature remains to be the\nbattery backup(almost two days)  \n  \nThe camera zoom and low light pictures are simply pathetic.\n\n", "Iam using mi max 2 for last 4 days, I am happy with the features available in\nthe mobile, All the mobiles like moto, lenovo, micromax are manufactured in\nChina but Chinese company xiaomi manufacturing all the mobiles in Sri city,in\nthe Tamil nadu- Andhra pradesh border but surprisingly my mobile is\nmanufactured in sriperumbudur near Chennai,I am very happy to use Indian\nproduct...\n\n", "Amazing phn.. Amazing batter backup.. Bit big bt easily fit in to jeans\npocket... Front Camera is disappointing... Bt watching movie, playing game or\noffic work is pleasure.. Ram is very fast and charging by typ c cable gives u\n1.30hours for full charge.. Display is owsum.. Jst bye it... U will luv once u\nget it... N battery is just suparb... Dnt think twice just buy it...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 October 2017", "on 13 December 2017", "on 26 December 2017", "on 5 February 2018", "on 11 December 2017", "on 19 November 2017", "on 8 September 2017", "on 31 January 2018", "on 27 October 2017", "on 1 October 2017"], "reviewer": ["Palak Thakkar", "basheer", "Samir Samanta", "Amazon Customer", "gaurav khulbe", "vishal94kumar", "Jagan Reddy", "HIMANSHU", "G Vinoth Kumar", "Kunal sengupta, guwahati"]}
]