[
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Great Package for a Great Deal!", "Good specs, got it really cheap", "-) One of the best affordable phones given the price range and product range", "dont by this phone", "Nice part is it's Battery 2", "Awesome phone, love you amazon.", "Nice Budget Phone with some great features", "Stunning Look but lots of missing features", "A Perfect Budget Phone", "SOME SURPRISES AND SOME DISAPPOINTMENTS."], "review": ["Product is as expected, Fast delivery by Amazon.  \n  \nPerformance:-  \n  \nGreat performance as expected from the Mi family. Powered by the Qualcomm\nSnapdragon 435 Octa-core processor clocked at 1.4GHz and coupled with Adreno\n505 GPU, this phone comes in three memory variants:  \n  \n1) 2 GB RAM along with 16 GB internal storage  \n2) 3 GB RAM along with 32 GB internal storage  \n3) 4 GB RAM along with 64 GB internal storage.  \n  \nI haven’t really encountered any sluggishness or lags using the second\nvariant. Smooth performance is delivered. The top spec's variant offers just\nthe right balance of performance at the price range.  \n  \nCamera:-  \n  \nOutdoor in daylight, the phone really gives us with details it manages to\ncapture and overall clarity.  \n  \nIn low light, the camera clicks some decent shots, but there’s a lot of noise\nin the pictures.  \n  \nDisplay:-  \n  \nIt has a 5-inch HD display with a 1280 x 720 resolution. The images and text\nlooks sharp. In this price range its a great display although you will be\nmissing the Gorilla Glass.  \n  \nBattery:-  \n  \nA day and a half on a single charge is easily manageable on a normal use and a\nday of charge on a moderate to higher usage.  \n  \nSoftware:-  \n  \nIt runs MIUI 8 on top of Android Marshmallow out of the box. It's totally\ndifferent UI altogether than stock Android but you will get used to it after\nusing it for a while.  \n  \nXiaomi delivers another promising phone with a top spot in terms of sales at\nthis price range. If you’re planning to pick up a budget smartphone right now,\nit’s hard to look further than Redmi 4. Just go for it.  \n  \nI was tight on budget and hence bought the second variant, but if you can up\nyour budget by ₹1000, the top spec's variant at ₹9,499 is the best pick of the\nthree since it offers just the right balance of performance and price.  \n  \nProduct Rating:- 4.5/5 (Cannot select 4.5 stars though)\n\n", "Got this phone for an effective price of Rs.6750 during Amazon festival sale\n(exchanged old . Motorola 3g phone + cash back + discount). Phone has really\ngood specs for the price - 4 gb RAM and 64 gb storage.  \n  \nWhat I like about it :-  \n1) good ram and storage  \n2) features like Infrared sensor (works well as remote with my Sony smart TV\nand Hathway settop box) and wireless display.  \n3) manageable size - not too big for pocket  \n4) features like automatic call recording means one doesn't have to install\nseparate call recorder  \n  \nWhat I didn't like :-  \n1) over -heating especially when charging with data transfer or watching\nvideos  \n2) MIUI is unnecessarily complicated and one has to struggle a lot to figure\nout how to do some tasks like disabling some types of Notifications. Long time\nMotorola users like me will find it really difficult to learn for first few\ndays.  \n3) camera and audio quality are average, so don't expect magical pictures or\nsounds.  \nHowever, even with all the cons, it's worth buying this phone.  \n4) biggest minus is that capacitative buttons are not backlit and notification\nlight is of single color only.\n\n", "As usual Amazon.... have praised enough about their services..I think it is\nnot required to re-write it again :-)  \n  \nOne of the best affordable phones given the price range and product range.\nOnly problem is with MI, they restrict lot of the functions forcing you to\nbecome MI User (create a user account in MI maintained server) which I hate\n(probably most will do it willingly)..  \nAlready lot of best reviews have been provided by professionals about this\nmobile and hence I am only writing on the CONS.  \n\\- Camera / pictures taken during non sun light hours are noisy.  \n\\- Full volume call quality makes additional irritating noise which is not\npleasant.  \n\\- MI forcing users to become a member...\n\n", "very very bad , heating & battery problem , poor camera dont buy this phone\namzon is cheeting  \nnot hanging but heating problem , battery just one day camera poor\n\n", "1\\. Nice part is it's Battery  \n2\\. It's Price.  \n3\\. Display.  \n4\\. LTE (VoLTE)  \n5\\. Handy size.  \n  \nCons.  \n1\\. Heats quickly.  \n2\\. Drains battery.  \n3\\. Average Camera Quality ( But on the positive side it's PRICE so can be\nadjusted)  \n4\\. No headphone by CHINESE BRANDS. (Don't know what's the secret but, I guess\nCOST cutting)  \n  \nFinal Verdict: If you want a phone with all the features with lesser price and\na great battery life, you need to defiantly try this.  \n  \nAll the above-mentioned details are my views and thoughts. May change to\nperson to person.  \n  \nBut price keeping the price point it's a great phone.\n\n", "I got my Redmi, a day late than the delivery date but amazon gave me 100/-INR\nfor the delay, although didn't required it, but thank you so much for this\ngesture. Amazon you really made me think that I am your privilege customer.\nThanking you again. About product, its working absolutely fine!!! It's a gem\nof a pearl product!!!! I got 4gb Ram, 64gb internal memory, touch is superb,\nno lag whatsoever!!! you can't get better than this at this price!!! Worth the\nmoney!!! Go for it!!!Amazon thank you!!! You made my day!!!\n\n", "As Expected the Phone is working fine and Received the latest OTA updates.\nFurther I got good discount on the Exchange of Xiaomi Redmi 1s. Feeling good\nand hope it works great as it's predecessor s.\n\n", "Here is my complete report review after using it for two days extensively  \n1\\. It is quite heavy phone for 5 inch screen phones. I had earlier Redmi 4A,\nwhich was quite lighter than this.  \n2\\. It does not have complete aluminium body. Back of the Phone is divided\ninto 3 parts out of which one part is aluminium only. Others seem to be\nplastic only.  \n3\\. It does not have backlight for navigation keys - Recent button, Home\nButton and Back Button. So you may find difficult to use it in night because\nyou have to go by idea only to tap these three buttons.  \n4\\. There is no tap to wake and sleep feature which is generally available in\nother phones of MI.  \n5\\. Battery Backup is normal. Nothing extra ordinary if compared to my\nprevious phone Redmi 4A.  \n6\\. Most importantly it has 4GB ram, but you will never get more than 2.1GB\nram free.  \n50% of ram is used by system only and you will get only 2gb ram only.  \n7\\. It is 64gb storage phone. But you will get only 54gb only. 10gb storage is\nused by system itself. If you update your phone as it shows updates when you\nconnect to Internet, you will loose 2gb more internal storage. So you will end\nup with only 52gb ram.  \n  \nI am still testing it's sensors and will update my review once again\n\n", "I am using the 3/32Gb variant of the Redmi 4. For about a Month Now. The phone\nso far is great  \nPros..  \n1.bettry backup is awesome goes for about 2 days without any hassel.  \n2.screen is bright and good  \n3.no lags and mi theme and wallpaper also preety and nice  \n4.camera is super quality at this price  \n5.speaker loud and clear mic and speaker both are found in iphone atyle  \n6.and other mi features auto call recording, seconds space, dual account and\nmany more is so cool.  \n7.and last metal body is also good  \n  \nCons..  \n  \n1.heating when wether is hit and while charging 70% to 90%  \n2\\. some minor bugs but its not problem every time and google smart assistant.\nVoice recognition stops functions.  \n3\\. Heating issue solved post latest update.\n\n", "Just got this Mobile 2 days before the scheduled delivery which was Wednesday.\nThat was a surprise. Most of the features of this Mobile is okay but NOT\nPROVIDING A EAR PHONE is not appreciated. Can you send one free of cost.\nSecondly the TYPE of USB should have been properly explained. So I put a\nquestion regarding this particularly enquiring whether this Mobile has C TYPE\nUSB PORT I got answers from some customers that it has C type. Since the\nSupplier and/or manufacturer did not give a clear picture, I depended on the\nviews of customers and ordered this item. This was another surprise that I\nfound that it has usual USB port. I feel that a clear picture should have been\nprovided by those responsible. Secondly some part of this Mobile is made of\nflimsy material for instance the SIM TRAY. Even after using the SIM CARD TRAY\nREMOVING PIN, the edge of this tray where there is a hole for inserting the\nPin broke. In normal case just for the USB PORT i WOULD HAVE RETURNED THIS\nPRODUCT. But whicheverway the hole provided in the SIM TRAY broke from my\nhands for not fault of mine, I don't think I should return the whole Mobile.\nIf AMAZON or the manufacturer/supplier thinks that they should take this\nmobile back and provide a replacement or atleast replace the SIM TRAY , I will\nbe very happy .  \nThanks.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 October 2017", "on 14 October 2017", "on 1 January 2018", "on 7 September 2017", "on 5 September 2017", "on 13 October 2017", "on 5 January 2018", "on 27 September 2017", "on 7 August 2017", "on 24 December 2017"], "reviewer": ["Anoop", "Satish Dubey", "Amazon Customer", "sarath gishi", "Ranadheer Reddy Keesari", "Nash Avi", "POPO", "JatinderPalSingh", "Rajnikant Dubey", "GOPALAKRISHNAN"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Beast under 10k,  no competition", "Writing this review after 2 month usage", "Please read my review carefully before buying, i guaranty you will not need to read all reviews.", "Dual Sim is a diappoinment", "A complete and unbiased review... Everything that  you wants to know", "Five Stars", "Redmi's One of Best product !!", "A total bang for your buck!", "Everything you want in a stable phone", "Great phone"], "review": ["Was thinking for the phone after my mistake to buy a samsung phone... Used a\nlot of mi and redmi phones, so thought earlier to change, so bought a samsung\ngalaxy j5 6 phone from flipkart, for couple of months it worked very fine...\nBut samsung has always issues of hanging and out of space problem, xiaomi dont\ngive memory card dedicated slot as it decrease performance of the device, i\nbetter suggest you to buy redmi or mi phones with big internal storage... Dnt\nbuy from dealers, it wil cost u more and they are fake too....  \nProduct opinion:-  \nDiplay :- 9/10  \nRear Camera:-9/10 better than redmi note 4 in colour reproduction  \nFront camera:- 10/10  \nBattery :- 9/10 use only greenify app to increase battery life backup and\nperformance.  \nSouund:- 10/10 speaker problem sorted this time by providing speaker at the\nbottom...  \nSensors:- 10/10  \nDesign:- 10/10  \nRam:- 10/10  \nCpu performance:- 8/10  \nHandling:- 10/10\n\n", "I'm glad to say that my choice was absolutely right, this mobile phone is\ngreat in terms of performance and reliability. Till now I performed various\ntype of tasks like gaming, multitasking and camera, and I personally think\nthat it performs very well in all 3 terms. It took 2hr 20min from 0% to 100%\nin charging, it gives me almost all day long battery. Display is nice and\ncrisp however in direct sunlight I find it bit difficult. Speaker is enough\nloud. Touch screen is smooth and fluid. Fingerprint sensor works well. And\nlast but not the least camera my favourite part of this mobile its just\nawesome I'm sharing some of the pictures(non edited) I took from my redmi 4. I\nhope my review will help someone :)\n\n", "very good product as compared to other devices like oppo vivo and in fact more\ncomfortable than Redmi Note 4.  \nhere i will tell you pros and cons this will surely help you to decide whether\nto buy or not.  \n  \nPros.  \n1.Perfect size for one hand use.  \n2.Not too much slim so better protection from bending issues like iPhones.  \n3.The overall design is similar to iPhone 7 from the bottom side.  \n4.A Huge battery of 4000MAH which last a whole day with heavy internet usage.  \n5.The camera has perfect HDR.  \n6.The display is IPS so better colors and vibrance.  \n7.MIUI is plus point over other mobiles out in the market.  \n8.No heating issue faced.  \n9.heavy games run smoothly.  \n  \nCons.  \n1.Poor front Camera.(it is 5 megapixel but not so good)  \n2.Games more than 2 GB lags sometimes just a minor issue.  \n3.Display resolution is only 1280*720 HD.  \n4.No earphones are given like rest of the XIOMI phones.  \n  \nApart from all of these pros and cons, there is something based on my personal\nexperience.  \n1.Size is perfect for me.  \n2.Sound quality is good.  \n3.You will not believe but you can play music while on phone.  \n4.Black color is professional just my opinion but you can go for gold.  \n  \nSo, overall if you want to buy any android phone under 10,000 it is for you.\n\n", "my rating is very specifically based on \"dual sim\" feature.  \nA dual sim phone,for all intents and purposes,unless otherwise highlighted,\nshould work with any country sim.  \nI purchased the phone as i travel regularly and need a phone which would\nsupport my Indian sim as also the sim of the country I travel too.  \nHowever, I realised only after reaching the USA that the Redmi4 does not work\nwith any USA SIM (I tried more than 1 network provider). In todays global\nscenario the company should very clearly share this information with the\nbuyer.\n\n", "Hi buyers and my friends... 🙂  \nHope you all are good...now lets come on the phone review. Every phone has pro\nand cons. This phone has too. After using redmi 4 for around 5 months, i found\nthese results:-  \nPRO:-  \n1\\. Price- Its price is just can't beatable by any phone company. As xiaomi is\nknown for its good smart phones with in budgeted price.  \n2.Camera- I will put camera factor in both category, in pro as well as in\ncons. Because camera quality is better than other phones of xiaomi like redmi\n3s, redmi note 3 and all other older varients but if we compare it with other\ncompany phones,then it will not satisfying.  \n3.processor- Qualcomm Snapdragon 435. Its very good processor if we consider\nit for mid range phones and provides good performance.you can play heavy games\nwithout seeing any lagging.  \n4.Battery- It contains a huge battery in it.,4100 mah. Just Wow.  \n5.Sensors- you will get all types of sensors including IR blaster(for remote\ncontrol) and fingerprint sensor.  \n6.Operating system- It comes with miui 8(marhsmallow 6.0.1 ) and its miui 9\nupdate with android 7 nougat is on its way. It will get in all the phones by\nthe end of november.  \n7.Metallic body- its build quality is very good and feels good in the hand.\nIts grip is awesome. It also has gorrila glass which gives your phone an extra\nprotection.  \n  \nThe list is long but space is less...  \n  \nCONS:-  \n1.Heating problem- you will face heating problem while heavy usage of device.\nIt will work fine if use it normally.  \n2.camera- camera quality is not so good as compared to other phones.  \n3.No stock android- I think its not the con, but many people wants to go with\nstock android. So i am putting it in this category.  \n4.Oreo update- no oreo update will come on this device.  \n  \nRecommendation:- you can consider this phone in budgeted range. I recommend to\nbuy 3gb of ram and 32gb of storage varient. Although 2gb of ram and 16 gb of\nstorage varient is also considerable over redmi 4a.  \n  \nThats all from my side... If you like this review, please vote this review a\nhelpful.  \nThankyou...  \nHappy shopping🙂\n\n", "Nice phone in this price\n\n", "As per Usage of 2Months:  \n1) Camera Quality is Awsm: 9/10 both rear and front.  \n2)Sound Quality Is a bit Low!! 7/10  \n3) Design ...Awsm: 10/10  \n4)Battery: 4100Mah .... greatest pro.. Extreme usage = 1day😘😘:10/10  \n5) Processor and Ram: Not Upto Expectation after 2 months Usage because....a\nbit Hitch in clash of clans and a bit bug! 7/10  \n6)Storage: 32Gb variant @this price is Really good but available 25.8Gb: 8/10  \n7) Features Like Fingerprint, IR Blaster, Second Space, Dual apps....are\nExtraordinary!!😘😘  \n#Finally, I could recommend this Mobile For all....which is Better than every\nPhone @this price.\n\n", "I am very happy with the device. It's fast, it's reliable, battery life is\namazing, camera is awesome. Touch is wonderful even with a tempered glass.\n(I've used phones that slow down on touch with tempered glass) but this one\nruns like a horse. I charge it once in two days with my regular usage, earlier\nI had an iPhone and I had to charge it twice a day. I love the connectivity\nthat the phone offers, I can even control my TV with the IR blaster! In all,\nvery happy that I switched from iPhone. The ability to send files from my\nlaptop to phone via bluetooth is something so simple, but god damn, I missed\nthese simple things on iOS.\n\n", "Ever wondered that \"I wish my phone had this feature then it would have been\nsomething more\" Well Redmi 4 got everything you would wish for a stable phone,  \n> better camera,  \n> fingerprint sensor,  \n> ir blaster,  \n> gyroscope,  \n> ambient light sensor,  \n> led notification customization,  \n> Both Sim slots supports volTE, 3 gigs of RAM, 32 gigs of storage,  \n> metal body with 2.5 D curved glass which gives a much premium look than any\nother phone even higher than this price range,  \n> 5 gigs free of MI cloud storage  \n> No heating issues at all (stay away from hoaxes)  \n> Can play heavy games and 1080p videos without any lag  \n> Can easily purchase original glass protector from mi.com @Rs 129 only  \n> Only one con as far that it has hybrid sim slots, Either 2 sims or 1 sim & a\nmemory card however they tried to nullify it by providing OTG support so yes\nit does support OTG  \nXiaomi nails it again  \nBest phone in the price range\n\n", "What a product man what a product. Mi does something like this and all other\nare left gasping . Good phone in budget . Perfect mid range config. Runs every\nthinks very fine. Good battery backup of 2 days in moderate usage. And\nsurprisingly regularly updated OS didn't expect this from min though. Overall\na very good buy for my mom.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 October 2017", "on 14 September 2017", "on 13 November 2017", "on 14 October 2017", "on 6 November 2017", "on 17 July 2017", "on 5 October 2017", "on 14 October 2017", "on 17 August 2017", "on 14 January 2018"], "reviewer": ["MOHAMMAD FAHAD", "MYM", "Harsh", "Naila Ibrahim", "Rajat Garg", "amit kumar", "Poornesh B", "Pallav", "Jainendra Singh", "Rajiv Paudel"]},
{"rating": ["1.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Complete waste of money. Never buy Redmi/ Mi phones", "I love u Amazon. ...... Sadly handset is not soooooooooooooo good. It is OK OK", "ok", "Hii alll ye product tho bhot aacha hai toch and ...", "Thanks for cheating.", "Better options are available now.", "Redmi 4...pathetic product.", "Great Smartphone at under ₹10000", "Very Bad experience (2nd time) with Redmi phones", "easy to handle"], "review": ["Worst camera quality. It seems it's rear camera is 2 Mp . Cons 1) very slow\ncharging 4 to 7 hours  \n2) Unexpectedly reboot..  \n3) charging USB point moves on inserting cable.  \n4) 12 hour battery backup.  \n5) worst camera  \n6)problem with third party application. Device works very slow.  \n7) Hanging issue.  \n8) only 1 speaker works. Other doesn't work  \nConclusion-. Not up to mark. Quality is very poor. Go for Samsung , Motorola\netc. Redmi 4 is very disappointing.  \n  \nAmazon is very hostile in return / replacement policy. Customer care doesn't\ncare really .\n\n", "Firstly BIG BIG BIG thanks to AMAZON for replacing my defected handset that i\nreceived within 3-4 day. I love you AMAZON ....  \n  \nI am happy with the handset but not satisfied .....I was expecting a lots of\nimprovement over Red Mi 3s which I was using from past 1 year but sadly it is\nnot up-to the mark. I wanted to you use it without #Temper glass because the\nscreen is sooooooooo nice to touch and use while chatting and browsing but my\nfriend dropped his handset ( Not a big drop) and his phone's screen just\ncrushed so badly,,,,,,, that's y i used a temper glass but with that the\nsmoothness is gone... which i didn't wanted.  \nDevice is hanging a little bit sometimes. Mine is 32 GB and almost half of it\nis empty plus RAM is also empty , i don't know why.. Anyways waiting for MIUI\n9 Update ... let' see what comes next :)  \n  \nPros: ( FOR ME )  \nNice display ( without temper the bestttttttt)  \nbattery is good  \nCamera is decent and sometimes is sooooooo goooooood :) :)  \nMIUI interface is nice ( a lot better then samsung or oppo or vivo)  \nFingerprint is so dammmm quick and accurate  \n  \nCons:  \nHandset hangs a lot sometimes. ( I never expected )  \nWhen it got hangs then it heat a lot.  \nNO GORILLA GLASS ( that was worst as it is so so so sensitive , if we drop it\nover an feet, it will damage completely ,,)  \n  \nI bought 3GB RAM variant just for 32GB storage, I am not a big user these days\nbut still i don't want my handset to stop working when I receive a call.  \nI hope Red MI will do something in MIUI 9 Update  \n  \nI just received a Red Mi Y1 Lite for my dad. let see how that performs :D .  \nThank god Red MI given Gorilla Glass in that because my dad always drop his\nhandset :P :P  \n  \nwill write a review of that later .. may be 10-15 days later.. .. it is\nimpossible to judge any electronic device in just one day. . . at least for me\n:D\n\n", "Good phone  \nCamera is worst. Not suitable for low light pictures.  \nNoticing Mic issue: Other side can't hear sometimes, but not regular issue.  \nThere is a network issue with this phone. While i see a weak signal on my\nphone other phones nearby have better signal and call quality, i also need\nspeak keeping phone nearer. Everything else is good except the call quality\nand camera\n\n", "Hii alll ye product tho bhot aacha hai toch and all apps is goood par iss may\n1k porbalm hai ye 16 gb nhi hai 10gb ka phone hai iss may 8gb he use keliye\nmilte hai ab aap ke uapr hai kharid na ya nhi kharid na wo ek chiz say naraz\nhu ke jo battaya wo nhi hai iss may 16gb har ek phone may 16gb ke jaga aapnay\nko 14ya12 gb milta hai par iss may nhi hai wo.......\n\n", "Feels like throwing away this phone.  \nCons :  \n1\\. Camera - Low light photos terrible, daylight photos are average. Video\nrecording is also average but the recorded audio is terrible. My 1 year old\nXolo era 4G has better camera quality which I bought it at ₹4444.  \n2\\. Calling - There is a problem with MIC noise cancelation the person on the\nother side cannot hear us clearly most of the times and this is not because of\nnetwork issue.  \n3\\. Gaming - Phone heats up while playing mobile legend and several other\nonline games if you play it for more than an hour.  \n4\\. Gallery - It feels like you are in 2013. The gallery does not have the\noption wherein we can set whatsapp dp directly. You do not even have enough\noptions to edit photos in gallery unlike other smart phones which are\navailable at ₹5000.  \n5\\. UI - not user friendly at all, if you encounter any error on the\nnotification toggle then you will surely need to Google the solution. Settings\nare really too deep.  \n6\\. Sound and notification - Ringtone volume automatically decreases day by\nday. Ghost works inside.  \n7\\. Display - wake up screen on double tap not available. Mi should be ashamed\nof calling it a software company.  \n8\\. Notification light - single color on redmi 4 why???  \n9\\. Charger also heats up sometimes just after 10 to 20 minutes of charging.  \n10\\. Fingerprint sensor- doesn't recognize your finger after you restart your\ndevice. You'll need to enter the password once.  \nPros :  \n1\\. Battery backup is good  \n2\\. Phone looks premium.  \nI have bought Redmi 4 64 GB, 32GB and Redmi 4A 32 GB and I think Redmi 4A is\nbetter than Redmi 4 because all three of them are same but 4A is well priced\nand it at least has the colored notification light.  \nGuys just think again before you buy this phone. I bought the 64 GB variant at\n₹11000 and 32 GB variant at ₹9000 and the 4A 32 GB variant at ₹7000. I have\nincurred a loss of 2000 due to the recent fall in its price. If the phone is\nthat good why would anyone give a discount of around ₹1500?\n\n", "Xiaomi's commitment towards value for money is unquestionable. Needless to say\nthat they have lived up to the expectation with Redmi 4 too. The gold variant\nlooks good, the touch feels good and the phone is running smoothly on moderate\nusage.  \n  \nHowever, the new launch from a competitor like coolpad, price drop of an\nexcellent handset like honor 6x, aggressive pricing by Lenovo makes me rethink\nwhether Redmi 4 is the best bet in the budget range now (Aug. 13, 2017).  \n  \nVerdict- if you prefer a recognised processor (Snapdragon) and a superior user\ninterface (MIUI) opt for Redmi 4. Else, try honor and/or coolpad for awesome\ncamera quality (dual rear camera).  \n  \nNote: this analysis comes after descent usage of all the devices mentioned\ndirectly/indirectly in this review. [...]\n\n", "Pathetic product and service.  \nPurchased a new redmi 4 phone on 09- september, from Amazon, and exactly one\nmonth later, phone got switched off automatically and not getting switched on.\nVisited service center, they told me to replace the mother board, costing 5000\nrupees.  \nWould not recommend this phone.  \nVery very poor service and product quality.\n\n", "I Purchased Redmi 4 64GB Black variant in The Great Indian Festival Sale for\n₹8500. The smartphone is awesome for this price and really love the overall\nform factor of the phone it is so good to hold in the hand. Now I am dividing\nmy review into Pros and Cons.  \nPros:-  \n1\\. Pricing:- At ₹8500 you are getting 4 GB ram and 64 GB storage which is\nreally great. And even if you get this variant @ ₹10000 it's still good to\nbuy.  \n2\\. Battery:- The 4100 mAh battery is savage it can give you 2 days of battery\nlife without any hassel.  \n3\\. Performance:- This phone performance is top notch the snapdragon processor\nand 4Gb of ram combo really shines and makes the overall experience lag free.  \n4\\. Camera:- The 13 megapixels camera captures some great shot in good\nlighting condition and 5 megapixels selfie shooter is adequate for facebook\nand insta posts.  \n5\\. Build Quality:- I must say this black variant really looks wicked in\nperson and really good to hold in the hands the overall fit and finish is\nfirst class and looks expensive than it really is.  \nCons:-  \n1\\. Display:- Although the quality of display is superb and bright for 8500.\nBut at it's original price i.e ₹10999 this 720p panel is not something to\nwrite home about Xiaomi should provide 1080p panel for atleast 4Gb variant\nbecause at this price no other manufacturer is providing 720p display for\ntheir smartphones.  \n2\\. Non backlit capacitive keys:- It is real pain to use the phone without\nbacklit keys although you will get use to it after sometimes but the point is\nif you can provide notification LED light then why can't you provide a LED\nunder the capacitive touch panel.  \n3\\. No Protection for the Display:- Xiaomi has a history of not providing any\nprotection for their smartphones which is not good for the consumers as the\ndisplay is the most delicate part of the phone it gets broken really easily\nand 2.5D glass which is curved at the edges are susceptible to break real\neasy.  \n4\\. Charging Time:- Charging time is really long it takes more than 3 hours to\ncharge the device. The phone is fast charging enabled but Xiaomi hasn't\nprovided any fast charger out of the box.\n\n", "This is my second bad experience with Redmi phones. I bought this phone in\nJune last year(2017) getting convinced at the ratings (above 4). For the first\n6 months it ran flawlessly. The display was great and performance was amazing\nat the given price point. But to my utter disappointment, the phone battery\nstarted failing from January this year. The battery drains out completely\nwithin 2 hours after doing a full recharge. When I took my phone to the MI\nservice centre, they examined it and said that the battery has 'swollen' and\nneeds to be replaced. Phone battery warranty is for 6 months only and my phone\nhad just touched the 7th month. This is the first time I am hearing a phone\nbattery getting swollen. To make matters worse, this swelling has pushed the\nfront display panel and has caused it to bend slightly. The service centre\nstaff also advised to replace the front display panel as well. The total bill\n- almost 3700/- It will not even get exchanged. Now I have to again buy a new\nphone within 7 months of buying this one.\n\n", "Phone looks absolutely superb, easy to handle, perfect dimensions for my\nliking. I don't have heavy usage, for my use performance seems perfect so far,\nno lags. Finger print sensor also works reasonably fast. Display is good, but\nFHD wud have been perfect. Camera is average, for a pricing of 8.5k it looks\ndecent. Only let off I felt is the battery, even with 4000 mah, I got only 7.5\nhrs usage and 30 hours standby, which is terrible. It will take exactly 3\nhours and 15 minutes to get fully charged which also I felt a bit\ndisappointed. Phone gets heated while charging in between 35-85%, except for\nthat I didn't find much heating issues. Overall except for the battery\neverything looks good.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 August 2017", "on 28 November 2017", "on 9 August 2017", "on 29 May 2017", "on 10 September 2017", "on 13 August 2017", "on 10 October 2017", "on 28 September 2017", "on 24 January 2018", "on 16 October 2017"], "reviewer": ["CHAITANYA", "JaSs SinGH", "Krishna Murty Ryali", "Sunil B.", "Rafique Talukdar", "SK007", "Neelesh Bhandari", "akash", "Prantik Sarkar", "NJ"]},
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["MASTER PIECE OF XIAOMI IN BUDGET OF 11000 INR.", "Paisa Vasool", "Phone is good in terms of speed...", "Value for money", "AWESOME MUST HAVE", "Camera quality is good for the price tag", "It is very cheap phone along with quality also very cheap , typical example of Chinese Products", "A good replacement of room heater and a great toy", "... a month and i have to say its an amazing device. The performance of this device cannot be ...", "Its most premium looking & performing phone in this price tag."], "review": ["With the Redmi 4, Xiaomi takes the design of the Redmi line to the next level,\nin terms of looks, ergonomics and general build quality. It is an astoundingly\nwell-designed phone. Taking cues from the superlative Redmi Note 4, Xiaomi has\nfurther refined that design and shrunken it to the 5-inch form factor of the\nRedmi 4 and the results are glorious. It is 8.65mm thick, which is equitable\nconsidering the monstrous 4,100mAh battery. It is also perfectly balanced at\n150 grams which makes it neither too light, nor too heavy.  \n  \nThe important thing is that it feels great in the hand. The sides are nicely\nrounded from the back and it is thick enough that it snugly nestles in one's\npalm. It is also not a large phone which enables one hand usage with utter\nease.  \n  \nIt also helps that it looks great. Make no mistake, its design might be bland\nas it follows the age-old mantra that Apple devised for the iPhone and still\nretains in the iPhone 7, but this looks like a really nice phone which\nshouldn't be less than Rs 10,000, but it is. And in the black finish it looks\nmajestic and kind of like the iPhone 7 in matte black, but again that will\nonly win it brownie points.  \n  \nThe other aspect of the design that one needs to touch upon is that the\ndisplay has a 2.5D curved cover glass which makes swiping across the Android\nuser interface all the merrier. Also, that display even if it’s just 5-inches\nand 720p, is brighter and more vivid than the one on the Redmi 3S which means\nit is better for viewing content. Overall, it is a good display and something,\nthat will please most users.\n\n", "Best in 9k.  \nSuperb battery back up  \nSlim. Design  \nSpeakers are good  \nGreat sound in ear piece  \nMany other awesome features  \n  \nThe only con is manufacturer has provided a short USB cable with the charger.\nAlso fast charging is not there.  \nBut in 9k it's full paisa vasool  \n  \nEdit Feb 2018  \nThe screen is very low quality. Corning gorilla or AGC not used. My phone\ndropped from a mere 1 feet height and the screen broke. Highly disappointed\nwith xiaomi.\n\n", "Review based on 1 week use:  \n  \n1) phone is good in terms of speed.  \n2) look wise is good.  \n3) 2.5 d making phone sometimes hard to handle although it's only 5 inch.  \n4) facing trouble with call quality in terms of hearing other side voice,\nwhich I never faced with any of my previous phone  \n5) within one week, charge pin loose contact and charging is headache due to\nthis.  \n6) phone heat up while charging at room temperature within 15 minutes.  \n  \nRating is for headache but it's a good bang for the buck...\n\n", "Value for money.. Amazon delivered it within 24 hrs (with a prime membership).\nBought during Mi anniversary so got the 5% cashback for SBI card payment..\nHere is my review after using for a month..  \n  \nPros:  \n\\- Made in India  \n\\- 5 inch phone  \n\\- Finger print sensor  \n\\- light weight  \n\\- 4100 mah battery lasts more than 2 days  \n\\- Nice look for this price  \n\\- infrared booster remote  \n\\- Expandable Memory  \n\\- and many more..  \n  \nCons:  \n\\- Screen casting (but its OK for this price)\n\n", "AWESOME MUST HAVE  \nUSING SINCE AUGUST 17 more than 5 months now.  \nTILL NOW NOT EVEN SINGLE ISSUE  \n  \nMI 64  \n(A) Hazzle free Performances  \nGaming with heavy games didn't lag once thanks to 4 gb ram  \nCan handle plenty of Apps at a time without any issues.  \n(B) Usage battery backup completely satisfied  \nBattery screen on Time 6:30 Heavy usage  \nNormally would give 9 to 10 hours a day screen on time  \nFor basic usage would last for more than a day or more.  \n(C) Miui is bonus Happy  \n(D) Getting Regular updates Got latest nougat, & miui 9.1  \n(E) Fingerprint scanner works extremely fine  \n(F) Just one drawback dose not have Gorilla glass protection  \nSo handle with extreme care otherwise screen would be broken.  \n  \nMUST HAVE RECOMMENDED TO EVERYONE VERY HAPPY.\n\n", "I have been using the phone for past four days as my primary handset. Till now\nno heating issues I would rather say this gets cold in Ac due to a metal back\n.Camera quality is good for the price tag.front cam is exceptional.design vise\nthis phone is more premium than it looks in the pics,due to the 2.5d glass .\nThe metal back however needs some improvement in design. Speakers are good\nmaybe better but not the best.ram management is the point where you will feel\nyou are using a mid to high price range device.adreno cpu makes multitasking\nmore quick and easy. And at last the battery , this lasts almost 30 to 35\nhours in heavy light usage and around 20 hours of continue heavy usage.  \nThe fingerprint is so quick I hv never seen a quicker one. All in all a great\ndevice . Go for it!  \nRequest you to go for the 3 gb 32 gb version  \nNot the 2 gb 16 gb northern 4 gb 64 gb\n\n", "Amzon Service.  \nAmazon Service is pathetic. they wont return the product whatever the case. so\nbe careful.First time i have fade up with Amazon  \n  \nAbout the Phone  \nCons :-  \n1\\. Severely heating issue. if you talk for more than half and hour , it will\nbe fire place same as when you charging the phone.  \n2\\. Very brittle screen . if it falls from 3/4 ft screen will be broken and to\nreplace it will take 2/3 k backs.  \n3\\. Radiation(SAR) is very high.though them mentioned 0.75 but i feel it is\nmuch above that.  \n4\\. Not having power charging. so it takes lot of time to full recharge (\nProbably 4/5 hours).  \n5\\. Voice clarity is not good.  \nPros :-  \nLook wise it superb- it is like iPhone  \nlot of feature , though not are much useful.  \nprocessing is fast\n\n", "Well I must say, this product is very useful for cold regions, you won't feel\nthe necessity of a heater. The Redmi 4 is enough to heat your room up. It\nfeels like the hot radiator of a big Diseal locomotive engine. Worst phone I\nhave ever bought. The new phone is restarting again and againjust after\nunboxing. Even I haven't seen the home screen for a single time. Also, the\ninterface looks threatening to your personal data. Don't know what China is\nplanning. Mi is fooling people with fake flash sale. I am sure this product\nwill still remain on flash sale even if 1.3 cores Indians already have this on\ntheir hand. My message to those who are running after this handset just Handel\nyour curiosity and move to other options, otherwise you will be in a great\ndisappointment. I am returning it. Totally lost my control. Very disappointed.\n\n", "I have been using this phone for more than a month and i have to say its an\namazing device. The performance of this device cannot be compared to any other\n7k phone. I have seen some reviews where they complaint about camera but its\nrather satisfying by my opinion. The battery life is awesome i only charge\nthis phone once a day and i am more than satisfied i don't have to worry about\nbattery any more. The only down side is that it have heating issue but not\nthat much comparing to other devices i hope it got fixed with nogut update\nsoon.\n\n", "Impressed with Amazons fast delivery.  \nNow about phone,  \nIte awesome.  \nIt looks like sort of i phone, black color is so much beautifull.  \nBlack color glass and matt black aluminium body construction appears like\nunibody construction, which makes phone look premium.  \nBuild quality is superb, trust me, it is 2nd mi4 handset in my home, my mom\nhad dropped it meny times, but not single thing happened like cracking of\ndisplay, or popping up aluminium body, or big dent, nothing...  \nBuild quality is superp, gorilla glass serve its purpose, dosent get scratched\nwith regular usage.  \nCamera is good, power efficient processor is also good in power performance\nlike games. Battery backup is awesome.  \nIts rocking handset in such a low price.  \nI am fan of mi products. Mi gives you paisa vasool quality goods.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 October 2017", "on 3 November 2017", "on 22 August 2017", "on 10 August 2017", "on 22 January 2018", "on 6 November 2017", "on 29 August 2017", "on 22 November 2017", "on 16 August 2017", "on 14 October 2017"], "reviewer": ["kunj patel", "MALiK KHaN", "Manikandan", "Ashwin Bhagwat", "KUSH THAKKAR", "sai", "Amazon customers", "Sankar D.", "Kanav Plah", "mayur"]}
]