[
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Pretty Nice!", "Worst product dont buy ever", "Kindly help or replace the device", "Absolutely in luv with this product", "Four Stars", "Not Accurate - Driving Car is converted in to Steps Taken and calories Burned :-(", "Fitbit Bad Product", "The product is good, but syncing with your mobile APP is a biggest Problem.", "Defective Charger.", "Not recommended - Useless product with many errors"], "review": ["The motivation you get from its constant nagging to get up and exercise, the\nconstant Heartbeat & Steps count & the other stuff like their amazon app is\nwhat makes a Fitbit product great!  \n  \nAnd this is one of them!  \n  \nOh and get the bigger option if you're tall like me (6'2).\n\n", "Worst product ever as data is anaccurate. Whenever travel in car or on bike\nsteps keep on inclreasing and totally inaccurate data. Rather should have\nbought 2000 rs health band as data here is also inaccurate\n\n", "The fitbit is not tracking sleep properly.everyday the sleep time is just one\nto two hours inspire of sleep time being 8-10 hours.and not showing stages of\nsleep. day time (noon) sleep it is not even recognising.have changed from\nautomatic detection to set sleep time.still it is not picking up.kindly help\nor replace the device\n\n", "I just received this prod. I have Fitbit Charge.. wanted a upgrade. It's\namazing.. tracks every steps. Food..even sleeping..battery is awesome. I used\nfitbit charge about 2 years..still working excellent.. highly recommend.\n\n", "Superb product\n\n", "I just observed that when I drive my car, it converts that into number of\nsteps I Walked and The calories I burned.  \n  \nAlso I i just shake my hand , it calculates it as steps taken. So my concerns\nhere is that the accuracy is very bad and something needs to be done in it.\n\n", "Very bad product not showing proper calories, steps and stopping again and\nagain. I was so excited for Fitbit watch but it really disappoints me. The\nscreen has not proper touch. The watch is not telling proper calories burned.\nThis is really bad product. I request to seller to give my money back. My\nmobile number is 7974405989\n\n", "I don't have a problem with the product, but trust me you will have a problem\nsyncing it to your mobile APP. For the past week, I have tried all the\ntroubleshooting techniques stated in the forum and website of FITBIT. It just\ndoes not work.!!! The servicing as usual in India is bad as any other company.\nJust be totally sure before you buy the product. The beats are +-8 during\nworkouts. During high intensive workouts, you may not get the most accurate\nheart rate. Apart from that, I am not sure if it gives the value for money\nthat it promises. I am giving it five as the analysis is excellent and I can\ntrack my lifestyle better. I feel, there is a lot of scope for improvement\nwith the bands, heart rate technology and in particular with the syncing.\nDuring the sync it will blame the Bluetooth or the server will always be busy.\n\n", "Came with a defective charger. The battery died while setting up the device.\nTried charging but the charger doesn't seems to work. Have emailed Fitbit\nsupport and all I am getting is some troubleshooting steps which are available\non their forums too. The device is now lying completely dead with no progress\non the charging complaint.\n\n", "Very high cost with very very least features and having so many errors. Total\nwrong calculations Everytime. I hate this product. As a whole useless product\nwith many bugs. I have been using this product since 6 to 7 months.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 May 2017", "on 22 October 2016", "on 25 October 2017", "on 12 July 2017", "on 22 October 2017", "on 23 October 2017", "on 13 October 2017", "on 9 October 2016", "on 16 October 2017", "on 20 December 2017"], "reviewer": ["Kritin Kapoor", "Amazon Customer", "Amazon Customer", "Amazon Customer", "PS", "Arun Prakash R", "Gokul Dave", "Abhishek", "Amazon Customer", "Koushik"]},
{"rating": ["1.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Absolutely pathetic customer service for a ridiculously over priced piece of junk", "Fitbit Charge 2 review: a promising fitness tracker, plagued by bugs", "Band Peeling, Synching issues make it a major disappointment.", "Fitbit ... Never again!", "🔴#1 HONEST(Unbiased) REVIEW of Fitbit Charge 2 [after using it for 2 weeks] [Full Review]", "Very bad quality of the band", "Awesome tracker - beauty and brains combined!", "It is the best fitness tracker to be launched by fitbit till date", "The tracker works fine and the interface on the app provides enough data ...", "Step count is not accurate."], "review": ["When you look at a Fitbit tracker perhaps you like me think that considering\nthe price point this would be a superior device with amazing tracking and\nawesome customer service. It is my duty to disillusion you.  \nI recently purchased a Mi Band 2 and since the Charge 2 was on sale I thought,\nwhy not? I could give the Mi Band away as a gift and use this one myself. Boy\nam I glad I didn't give the Mi Band away.  \nThe Mi Band had a tendency of under-counting my steps. The Charge 2 on the\nother hand over counted my steps by a far far greater margin. For instance 2\nkilometer walk showed up as 3.3 kms. What's more the feature that pulled GPS\ndata from the phone didn't work for my device, at all. Pairing with my phone\n(a Galaxy Note 3) was fairly spotty as well. The process could take anywhere\nfrom 2 minutes to 15 depending it seemed completely on luck and the\ntemperament of the tracker. I was of course more than willing to put it down\nto one faulty device so I called up Fitbit and asked for help, naively hoping\nthat their vaunted claims of customer service would be true.  \nIn the beginning it did indeed seem to be so. They very politely asked my\nproblems. But the follow up was slow. Still I plodded on and some 3 phone\ncalls, 5 email and 4 days later wrote to me that they would send me a\nreplacement. That is where things started going downhill and rapidly. Their\ncustomer service in reality is worse than a third rate e-commerce website.\nFirst off the associates who handle the phones have no authority whatsoever.\nAll serious problems are transferred onward and you might have to wait\nanywhere from 24 hours to more than 4 days, since the senior 'team' does not\nwork on Fridays or Saturdays or Sundays. Also regardless of where you live,\nany warranty claims that require a replacement tracker to be sent by them,\nwill first require you to have the faulty tracker shipped to them at your own\nexpense. The liability during transit is entirely yours so if the package is\nlost by the courier company or in some way damaged, you're out your money and\nthey won't send you the replacement.  \nConsidering that the device was brand new and this is the kind of service they\noffered (one of the reps I spoke to actually used the phrase 'appeasing the\ncustomer', meaning they do the bare minimum to keep you from flipping off,\nwhen they can), I shudder to think what might have happened had I used it for\na few months.  \nAlso if someone gives the tracker to you as a gift or if the name on the\npurchase receipt isn't your own, you'll find yourself in an even more adverse\nsituation. Apparently they put in lesser effort to 'appease' you if you didn't\npay for the tracker and got it as a gift.  \nSo to sum up, if you're thinking of getting a Fitbit, in India, don't. The\nXiaomi tracker is one sixth the price and gives you the same basic\ninformation. The only thing that could've made this tracker worth it would\nhave been some great support in case of problems which Xiaomi lacks. But\nFitbit buried that hope six feet under and IMO their reputation with it.  \nSo, buyer beware. Or better, don't buy.  \nUpdate:  \nCherry on top. Once you get fed up Fitbit support and decide to give up and\njust delete your account, what you won't be told (unless you ask) is that\nwhile the majority of your data that Fitbit stores on their servers and backup\nservers will be removed 'in a while' (They won't specify when), an unspecified\namount of 'de-identified' data they gather about you is theirs to keep once\nyou make that account and agree to their terms and conditions. They will not\nspecify how exactly they de-identify this data or what it includes about your\nhealth and conditions. You just have to take their word for it. And they're\nfree to use this data as they see fit.....  \nUpdate 2:  \nIt bears worth mentioning that with the latest update to Mifit app the\ndifference in features being offered by Charge 2 and Mi Band 2 has narrowed\ndown even further. Just like Charge 2 and Fitbit app, the Mifit app now lets\nyour band track runs using the phone's GPS as long as the phone is with you\nwhile running, it also has continuous HR monitoring as an option during this\nmode.\n\n", "People really love their Fitbits. This is evidenced by sales numbers alone:\nFitbit sells more activity trackers than anyone else. Anecdotally, Fitbits\nabound: walk through any airport, hike any trail, jog through your\nneighborhood streets, and you will likely see someone wearing a Fitbit.  \n  \nSo it’s not surprising that so many people have asked me about the new Fitbit\nCharge 2 when they’ve spied it on my wrist recently. The midrange Charge 2 is\nthe successor to (and replacement of) the Charge HR activity-tracking\nwristband. The $149 Charge HR, with its optical heart rate sensors and its\nability to automatically recognize exercise activities, really hit the sweet\nspot for a lot of people when it came out in 2015 — so much so that it’s still\nFitbit’s best seller more than 18 months later. The Charge 2 aims to do all of\nthis plus more, and for the same price.  \n  \nWhat more could it possibly do, you ask? For one, it has a bigger display than\nthe Charge HR. Four times bigger, to be exact. It’s a tap-sensitive, OLED\ndisplay. The Charge 2 most definitely looks like a fitness tracker, not a\nbracelet or anything suggestive of a \"fashion\" wearable. But this key design\nchange enables a multi-sport mode: tap on the display once for running, tap on\nit again for biking, and so on. Fitbit has also added \"connected GPS\" to the\nCharge 2: the wristband will pull GPS data from the phone while you’re\nwalking, running, or hiking outdoors.  \n  \nFitbit-Charge-2  \nFitbit-Charge-2  \nTHE PROMISE IS GREAT, THE REALITY IS DIFFERENT  \nThe promise is great. It’s a Charge HR on steroids, a Charge HR that pushes\nyou to do more beyond just basic step-counting and sleep-tracking.  \n  \nBut it didn’t fulfill that promise for me. I found notable discrepancies in\ndistances tracked with the Charge 2 compared to GPS sport watches (something\nFitbit said was due to bugs after multiple attempts to troubleshoot the\nissues).  \n  \nFirst, at the most basic level, the Fitbit Charge 2 does what many other\nactivity trackers do. It records your daily step count, stairs climbed,\ncalories burned, distance traveled, heart rate, and sleep patterns. It will\nshow notifications from your smartphone, like incoming phone calls and\ncalendar alerts.  \n  \nThe Charge 2 also has dedicated functions for recording workouts, something\nthat the Charge HR didn’t have. These include running, walking, hiking,\nbiking, and elliptical workouts. There’s even an interval mode, in which the\nFitbit pulses on your wrist to tell you when to stop and start an activity; I\nreally liked this. And it will record weight-lifting sessions.  \n  \nThere's also a new feature called Cardio Fitness Score. It’s a combo hardware-\nsoftware feature: Fitbit uses your resting heart rate, recorded with the\nwristband; some of your exercise data; and your profile information, to assign\na heart-health score, found in the heart rate section of the mobile app.\nAnything over 44.9 is \"excellent\" for my age and gender, according to Fitbit.  \n  \nBut of the half-dozen distance tests I did in either Run, Walk, or Hike mode,\nthe Charge 2 only accurately recorded one event, a 5K run (3.11 miles).\nOtherwise, distances were off, whether I used Fitbit’s connected GPS feature\nor not. A 1-mile walk was recorded as 0.71 mile on the Charge 2. A 3-mile run\nwas recorded as 2.13 miles. A 3.6-mile hike was recorded as 3.3 miles.  \n  \nFitbit-Charge-2  \nTo try to solve this, and partly at Fitbit’s request, I switched from a new\niPhone 7 back to an older iPhone, since the iPhone 7 just came out and it was\nsuggested that there may have been compatibility issues. Fitbit also sent me a\nnew Charge 2 wristband. I tried that, too.  \nDISTANCES WERE OFF IN ALMOST EVERY TEST  \nStill, the distance-tracking was disappointing. Just this past weekend, a\n4.28-mile hike was recorded as a 3.83-mile hike on the Charge 2 (without GPS),\nand it measured a 3.02-mile run as a 2.82-mile run, even while using connected\nGPS. Seems I’m not alone, either; some other Fitbit users have reported\ninaccurate distances in Fitbit’s online forums.  \n  \nFitbit initially suggested it may have been my stride length or the fact that\nI was pausing to walk during runs that may have been causing this. Eventually,\nthe company said they've identified a bug in the software on Charge 2 that\ncauses inaccurate distance estimates when using Connected GPS to track the\nWalk and Hike activities. With regards to some of the other discrepancies,\nFitbit says the company is continuing to investigate it.  \n  \nThere was another software bug as well that showed an outdated distance on the\ndisplay when I would first raise my wrist during a run. After lowering my\nwrist and raising it back up again, sometimes more than once, the reading\nwould adjust itself.  \n  \nFitbit-Charge-2  \nIt’s not just the inaccurate distances that befuddled me, though that has been\nby far my biggest problem with the Charge 2. Fitbit added a big display and\nmultiple-sport modes to the wristband… but didn’t add a pause function. No\nbutton, no tap-to-pause option, nothing. So if you need to stop during a\nworkout — to tie your shoe, wait for a friend, or catch your breath — you\ncan’t. It’s also not waterproof.  \n  \nThen there’s the Charge 2’s Relax feature, which guides you through deep\nbreathing exercises. Apple introduced a similar feature called Breathe in its\nnew Apple Watch software; though Fitbit has said its Relax app is more\npersonalized, because it uses your heart rate to gauge your breathing rate.  \n  \nBut when you launch into Relax mode, which lasts either two or five minutes,\nthe Charge 2 doesn’t offer you any kind of haptic feedback to guide you\nthrough it. You actually have to stare at your Fitbit’s display for two to\nfive minutes to see a digital representation of your breathing, a circle\nswelling and shrinking in size. I don’t really meditate, but I’m certain most\nmediation exercises don’t begin with \"Hold your gaze on your activity\ntracker.\"  \n  \nFitbit-Charge-2  \nOf course, you’re also buying into some good features when you buy a Fitbit,\notherwise it wouldn't be so popular. The first is the software. Fitbit’s\nmobile app is free to use, but the fact that it’s complimentary isn’t what\nmakes it good. It’s good because it’s agnostic. The Fitbit app works with iOS,\nAndroid, hell, even Windows Phone phones, and it runs on desktops, too, a nice\ninclusion of people who still don’t have or can’t be bothered with\nsmartphones.  \n  \nThe Fitbit app, which was recently redesigned, has a user-friendly interface.\nAt the top of your dashboard you’ll see your steps for the day, with arrows on\neither side to jump a day before or forward again; below that are snapshots of\nfloors climbed, miles traveled, calories burned, and minutes of exercise. All\nof this sits on top of a series of customizable tiles that show things like\nheart rate, sleep data, even how much water you’ve consumed that day. (Some of\nthis requires manual entry on the part of the user.)  \n  \nFitbit-Charge-2  \nFitbit still doesn’t share its data with Google Fit or Apple Health, which not\nonly act as repositories for health data but also share the data with other\napps. Instead, Fitbit has direct data-sharing partnerships with a bunch of\nhealth and fitness apps, including Strava, RunKeeper, MapMyRun, MyFitnessPal,\nWeight Watchers, Lost It!, even Amazon’s Alexa app.  \n  \nBut to its credit, Fitbit has almost perfected the art of subtle motivation,\nif you could just get past how demotivating the accuracy issues are.\n\"Overachiever!\" the app practically shouts if you’ve far surpassed your daily\nstep goal. You can also set weekly exercise goals in the app. While I was\nlargely inspired by the need to test — and test again, and again — the Fitbit,\nit was nice to get that five-day exercise badge.  \n  \nFITBIT HAS ALMOST PERFECTED THE ART OF SUBTLE MOTIVATION  \n  \nThese slaps on the back, these virtual nudges, aren’t limited to the mobile\napp; they happen on the Fitbit itself, too. \"Take me for a walk?\" the Charge 2\npleads, in scrolling text across the display, if you haven’t moved in a while.\nOther times, it’s more specific with its requests: \"Feed me 250 steps.\" Sure,\nI could do 250 steps, you think. That’s not much. When you hit your daily step\ngoal, little pixelated fireworks light up the display.  \n  \nThe Charge 2 automatically tracks your more vigorous activities, too, even if\nyou don’t bother to put it into multi-sport mode. (This \"smart track\" feature\nis available on a few different Fitbits now, and a lot of competing wristbands\ndo this, too.) My bike rides to appointments or a coffee meeting showed up in\nthe app as exercise completed, even though I didn’t \"tell\" the Fitbit I was\ndoing it.  \n  \nFinally, the Fitbit Charge 2 will last nearly a week on a single charge, even\nwith its larger display and multi-sport features. That’s not as impressive as\nthe months-long battery life you’ll get with a Garmin Vivofit or a display-\nfree Misfit tracker, but it’s a lot better than the one-day battery life of an\nApple Watch.  \n  \nFitbit Charge 2  \nStill, it’s hard not to feel as though Fitbit’s approach to product releases\nthis year has been more about volume than about innovation. The company has\nreleased four new wearables since the winter: the bracelet-like Alta (which I\nliked), the smartwatch-like Blaze, the entry-level Flex 2, and this one, the\nCharge 2, all of which come with a new aesthetic but improve on preexisting\ntechnology in iterative ways. The step-counting and sleep-tracking are the\nsame. The heart rate sensors are the same, though Fitbit says it is constantly\nimproving its heart rate sensing technology. Two of these wristbands now have\n\"connected GPS,\" but in my experience with the Charge 2, that didn’t mean it\nwas more accurate.  \n  \nIS AN ACCURATE TRACKER TOO MUCH TO ASK FOR?  \n  \nFitbit says bug fixes are coming to the Charge 2, which just started shipping,\nand that those bug fixes will help it do one of the basic things it’s supposed\nto do, which is track your distances traveled. And therein lies the rub: in\nthe world of constant software updates, firmware updates, and bug fixes,\nyou’re supposed to be patient and wait it out (and give more of your personal\ndata over, while you’re at it). Call me crazy, but that seems like an unfair\nbargain.\n\n", "The Charge 2 Fitbit tracker has problem synching and the wireless firmware\nupgrades are anything but smooth. For firmware upgrades, I miss the wired\nconnection to the laptop that the old fitbit flex used to have.The band\noffered with the tracker is a major disappointment. It peels over a period of\ntime and the replacements sent also peel within a matter of months. In spite\nof repeated complaints from the customers, the issue has not been fixed,\nalthough Fitbit has acknowledged long back that this is a problem and they are\naware of it. Google \"Charge 2 band peeling\" for more info.The biggest question\nis the design life of the fitbit trackers. The fitbit trackers have built-in,\nnon-replaceable rechargeable battery, and in my experience it completely fails\nwithin 2 years time. By that time, the 1 year warranty has lapsed, and there\nhence no replacement is offered. So think of spending all this money for just\n2 years of product life: That sucks!\n\n", "Horrible experience buying the first and definitely the last Fitbit product.\nWhen I bought the Charge 2, I was confused between two devices, Apple Watch S1\nand this dreadful Charge 2. I decided to save Rs. 9,000 and buy the latter.\nAnd that was undoubtedly one of my life's biggest mistakes.  \n  \nThe device is good when you just bought it, in fact, great on day 1 or 2. But\nthen you start noticing how easily the device gets scratched. Not just the\nscreen but also the body. In my case, it happened in just two weeks!!! In two\nweeks I found out that Rs.10,000 have gone down to complete waste. I regret\nnot going for Apple Watch now!  \n  \nI have worn many mid-range (Priced 10k to 20k) watches, apart from that\nMotorola Moto 360 Smartwatch and several wearables including Xioami and GOQii.\nI know how to handle and care for my wrist-wear and still, the Charge 2\nsustained scratches easily. Not that I have mindfully bumped into something or\nbrushed against the wall or something, which I would notice.  \n  \nTo my surprise when I checked the web for screen's reputation, I found out\n80-90% of the people reported screen damage (Scrateches, dents, and breaking)\nwithin the first 2 months!!!  \n  \nSo to summarize, the device is great for fitness and gives you detailed\nanalysis, so technically it is capable. But .... it won't last more than few\nmonths. And if you buy it prepare yourself to find scratches on it within the\nfirst month, unless you baby the device 24/7.\n\n", "👉PROS  \nInterchangeable bands  \nLarge display for at-a-glance information  \nComfortable to wear  \nConsistent tracking  \nCardio Fitness score is a useful metric  \n5-day battery life  \nUpdated with Sleep Stages and Sleep Insights  \n👉CONS  \nNo GPS (GPS Connected mode requires your smartphone)  \nGesture recognition is ropey  \nBasic notifications  \n👉KEY FEATURES  \nReview Price: £129.99  \nAll-day activity tracking  \nSleep tracking and silent alarm  \nCardio Fitness Level score  \nMulti-sport with automatic tracking  \nBreathing exercises  \nNew customisable bands  \nNotifications  \n🔴B.O.T'S OVERALL SCORE - 4.5/5  \n👉What is the Fitbit Charge 2?  \nFitbit says that its original Charge and Charge HR were its best-selling\nfitness tracker. So it’s not surprising Fitbit has taken everything that\nproved popular on the original and used this as a basis for the Charge 2,\nwhich was recently introduced alongside the new entry-level Fitbit Flex 2.  \n  \nFirst off, the heart rate monitoring of the Charge HR now comes as standard,\nso there’s just one model of Charge 2. This helps bring down the sheer number\nof Fitbit trackers available, which was becoming confusing. The PurePulse\nheart rate monitor of the original makes a return, and brings with it\ncontinuous and resting heart rate monitoring.  \n  \nPacked with everything you could want, except GPS, the Charge 2 covers all of\nthe basics. You can consider this device more of an evolution than a\nreinvention, but by correcting many of the shortcomings of the original, the\nCharge 2 proves to be a great all-rounder.  \n  \n👉Fitbit Charge 2 – Design and Setup  \nThe main change with the Fitbit Charge 2 is its more sizeable display – it’s\nfour times larger, in fact. This means significantly more at-a-glance\ninformation and better handling of notifications from your connected\nsmartphone. The original Charge had only a tiny slither of a screen,\ndisplaying one metric at a time.  \n  \nIt uses a black-and-white OLED, and you can adjust the brightness; I never\nexperienced any problems reading the screen outdoors. The display turns on\nwhen you rotate your wrist to look at it, helping to conserve battery life.  \n  \nAnnoyingly, maybe one in four times the display failed to turn on\nautomatically. There is a button on the side to manually turn it on and toggle\nthrough the different displays, but for times when your other hand is\noccupied, the finicky display is a frustration.  \n  \nEach of the menus has a number of sub-menus that you access by tapping the\nscreen. Again, this was occasionally a little hit and miss. You need quite a\nfirm rapping of the display to get it to trigger.  \n  \nOtherwise, the Charge 2 isn’t a great departure from its original design,\naside from being slightly more slender. The elastomer strap is comfortable to\nwear and since it uses a standard watch buckle, putting it on isn’t fiddly –\nunlike some previous Fitbit trackers that used difficult clasps. I didn’t\nencounter any discomfort with it on, even when I became particularly sweaty\nduring a run.  \n  \nWhere the Charge 2 does deviate from previous models is in its potential for\ncustomisation. Much like the new Flex 2, you now have the ability to change\nthe bands. Fitbit has Classic, Luxe leather and Special Edition options.\nThere’s an array of colours available, too, and the Special Edition versions\nhave rose gold and gunmetal finishes for the tracker itself to add another\nlayer of class and sophistication. These cost a little more (£149.99) than the\nstandard editions, though.  \n  \nI was sent the standard black elastomer band version for review. I definitely\nprefer some of the more vibrant colour options I saw in the flesh at IFA.\nSwapping out the bands is incredibly easy thanks to release clasps on the\nunderside. You can swap them out within seconds. The Fitbit Charge 2 is\navailable in three different strap sizes; small, large and XL. It’s important\nto choose the right size for your wrist for reasons I’ll come to later.  \n  \nThe Charge 2 works with Fitbit’s Android and iOS app, and setting it up is as\nstraightforward as any other tracker. Simply create a profile, entering your\ngender, height and weight, then select a number of goals. These include the\nusual steps, sleep and weight targets.  \n  \nOnce paired over Bluetooth, you can then sync your activity to the app and\nreceive rudimentary notifications from your connected smartphone. These only\ninclude caller ID, messages and calendar reminders.  \n  \nOriginally, the Fitbit Charge 2 could only display SMS messages. I can’t\nremember the last time I received a standard SMS message from anyone that\nwasn’t a marketer, so how useful you’ll find this is questionable.  \n  \nThankfully, a recent update to the Fitbit app now allows message notifications\nacross different apps, such as Facebook Messenger and WhatsApp. This makes the\nfunction much more useful and is a very welcome update. There’s still no way\nto interact with the message, and notifications for WhatsApp don’t scroll the\nmessage, but you can at least see the message sender. It helps you to decide\nif it’s worth whipping your phone out.  \n  \n👉Activity Tracking  \nAs you’d expect, the Charge 2 has the usual all-day activity and sleep\ntracking with silent alarm. Slightly disappointingly, it isn’t a smart alarm\nthat can wake you up at a more optimal time. The Charge 2 can begin\nautomatically tracking selected sports and exercises such as hiking, cycling\nand, of course, running. Otherwise, you can trigger these from the button on\nthe side.  \n  \nWithout the waterproofing seen on the new Flex 2, swimming is a no-go – which\nis a shame. There’s also no built-in GPS, but if you do go for a run with your\nsmartphone paired, the Charge 2 can use connected GPS for tracking distance\nand routes. You don’t need to trigger the run from the app, either. Just start\nrunning and it will track in the background, or use the Charge 2 to manually\nstart the run if you want running metrics on the display. GPS information will\nautomatically get pulled in.  \n  \nI took the Charge 2 for a number of test runs, including running the same\nroute back-to-back – once with connected GPS and once without. The real\nsurprise was the margin of error between the results. The first GPS-connected\nroute was recorded at 2.64km, while the run sans smartphone came up at 2.65km.\nThat was impressive considering accelerometer-based tracking can be\nsignificantly off the mark.  \n  \nHowever, distance even with the connected GPS seemed to sell me short. I’ve\nrun this route a number of times before using Strava and the GPS in my Huawei\nP9, and it’s typically recorded at around 2.85 to 2.9km. This distance was\nconfirmed by the GPS built into the TomTom Spark 3 I wore simultaneously,\nwhich measured each run at around 2.9km.  \n  \nAs an aside, a Jawbone UP3 I wore put both runs at a combined 5.79km distance\n– unfortunately, it didn’t split the two laps. As I literally sat on my\ndoorstep sweating profusely between the two runs, I can add the two distances\nfrom the Charge 2 together without much discrepancy. So this compared to the\n5.29km total from the Charge 2 confirms it does come up short and shows how\naccurate the Jawbone UP3 is.  \n  \nIt’s worth noting that I was using an Honor 8 Android smartphone this time\naround during testing. Because I’m a glutton for punishment, I decided to\nconduct the test again to see if the discrepancy was caused by the GPS in the\nHonor 8. I’ve found various phones have tracked distances differently, even\nthrough GPS – and this was confirmed. I ran again, this time with Strava using\nmy phone’s GPS, the Fitbit Charge 2 using connected GPS, and the TomTom Spark\n3.  \n  \nBoth Strava and the Charge 2 now reported the first route as 3.3km – over-\ntracking the distance. The TomTom Spark 3 was once again more accurate,\nfactoring in any deviations on the route to avoid obstacles, at 2.93km.  \n  \nI then ran the route again with my smartphone turned off, so no connected GPS\nfrom the Fitbit Charge 2. This time, it tracked the distance at 2.86km, so\ncloser to a truer result. It shows that an inaccurate GPS sensor can throw off\nyour results, which is why I generally prefer to have GPS built directly into\nthe running device. It will ensure greater consistency, even if you change\nyour phone.  \n  \nAs for basic step-counting, the Fitbit Charge 2 appeared to be quite generous\nwith steps, counter to what I found for distance. It averaged around 500 steps\nmore per day than the Jawbone UP3, and around 800 more than a Samsung Gear S2.  \n  \nAll manufacturers use slightly different algorithms for detecting actual steps\nand to make sure it’s not just you flailing your arms around. So it’s more\nabout consistency, and in this regard the difference between trackers was at\nleast generally the same between days.  \n  \nI was told by a Fitbit ambassador that the Charge 2 actually uses a barometric\nsensor to calculate its steps by tracking changes in pressure. That’s an\ninteresting approach of which I wasn’t aware, and also explains the lack of\ntrue waterproofing; there’s a small hole for the sensor on the underside of\nthe tracker.  \n  \nThe Charge 2 has been improved over the original in that there are now move\nalerts. Since the release of the original, move alerts have become a basic\ninclusion with rival trackers, so I’m pleased to see its presence.  \n  \nThe Charge 2 will detect when you’ve been idle during a set time window – say,\nyour working hours when you’re sat at a desk – and then provide a vibration to\ntell you to get up and take a walk. This will happen 10 minutes before the\nhour if you’ve not taken 250 steps in the past 60 minutes. You’ll receive a\nmotivational message on the display, too, and it’s a surprisingly handy\nprompt.  \n  \nAlongside the 3-axis accelerometer there’s also an altimeter, so you get a\nrecord of the number of floors you’ve climbed. It’s a small touch, but one\nthat can prompt you to take the stairs in lieu of the lift more often. When\nmotivation is what makes or breaks an activity tracker, it’s the little things\nthat add up.  \n  \nAs for the PurePulse optical heart rate tracker on the rear of the device, I\ntested this against the Wahoo Fitness Tickr X chest-based HRM and the wrist-\nbased optical HRM from a TomTom Spark 3. Pre-run, the Charge 2 initially put\nmy heart rate around 10 BPM above both the Tickr X and TomTom Spark 3.  \n  \nPost-run, this was the case as well. The Charge 2 gave me a 144 BPM read out\nversus 134 BPM and 135 BPM from the Tickr X and Spark 3, respectively.\nStrangely, the Charge 2’s heart rate reading then plummeted briefly to 60 BPM,\nwhile I assume it struggled to get a proper reading before eventually finding\nit again. At this point, all three heart rate monitors levelled out at a 120\nBPM post-run reading.  \n  \nFitbit says that “like all heart rate tracking technologies, accuracy is\naffected by physiology, location of device and different movements”. I\nmentioned earlier that the Charge 2 is available in different sizes. I was\ninitially sent a large size, which, while not ridiculously loose, wasn’t quite\nas tight as I’d have liked – even on the smallest hole. I have very slender\nwrists. To protect my ego I’ll say that I can still bench two plates even with\nthis disadvantage.  \n  \nFitbit replaced my strap for a smaller model and this improved the heart rate\nreading while running, since this is where you’ll want a snugger fit. It meant\nthat on my second set of test runs, there was less difference between the two\nlaps I ran. Still, the Charge 2 was basically as prone to deviations as I’ve\ncome to expect from most optical HRMs, where they typically struggle with\ncontinuous readings during intense exercise. Typically, a chest-worn HRM will\nhave a greater sampling rate, meaning it takes readings at much shorter\nintervals for accuracy.  \n  \nThe Charge 2 does better taking resting heart rate measurements throughout the\nday and while you sleep, and this has always been a good indication of your\ncardiovascular health. It’s a metric you can track over time, so as you aim to\nbecome fitter, you can track your resting heart rate decreasing as your\ncardiovascular system works more efficiently.  \n  \nI’ve now been using the Fitbit Charge 2 for a few months, and being able to\nsee how my resting heart rate has changed based on my training programme is a\nuseful insight. I’ve (intentionally) put on some weight in a bid to pack on\nmore muscle, but as a side effect, I can see that my resting heart rate has\nincreased from around 54 BPM to around 58-59 BPM. It shows to me that I should\nperhaps think about increasing my supplementary cardiovascular training.  \n  \nYou can also use the optical HRM for other exercise activities such as\nweightlifting or cycling, which you can trigger from the tracker itself. The\nresults page is broken down into Heart Rate, Calories and Impact tabs. The\nCharge 2 told me that an hour-long weights session kept me in the “Fat Burn”\nzone throughout, burning 426 calories, and also contributed 1,616 steps to my\nday.  \n  \nNew with the Charge 2 is a VO2 max approximation to provide what Fitbit is\ncalling your “Cardio Fitness” level. This is the maximum amount of oxygen your\nbody uses during intense exercise and is another good indicator of your\noverall cardiovascular health. Fitbit calculates this by comparing your\npersonal data against your running speed while using connected GPS and your\nheart rate measurements. Your score is provided against other people from your\ngender and age.  \n  \nI actually found my Cardio Fitness score became slightly worse after my\ninitial test run. This was most likely due to the anomalous heart rate\nreadings that put it higher, and therefore more inefficient, than what the\nother HRM sensors I wore were reporting. The second lap in particular was\nquite a bit off.  \n  \nWithout accurate continuous heart rate tracking, the Cardio Fitness score\nwon’t be as accurate. The second set of test runs, with the tighter strap,\nprovided more accurate results and put my Cardio Fitness score back above 60.\nI’m proud to say that this puts me at “Excellent” for my gender and age. It\nwon’t ever be as accurate as a true VO2 Max test, but in fairness, a proper\nVO2 test is a far more complicated and expensive process that wouldn’t be\navailable to many.  \n  \nIt isn’t all about intense exercise, though. A Breathe mode takes you through\nguided breathing exercises. A circle pulsates on the screen to show when to\ninhale and exhale, and you can choose different durations. It uses your heart\nrate and adjusts itself accordingly to get you in a more relaxed state. There\nare two- and five-minute durations. Mildly annoyingly, there’s no way of\ncancelling one mid-way, so if you start one you’re going to need to follow\nthrough.  \n  \nThis feature isn’t drastically different to what you’ll see in the forthcoming\nwatchOS 3 update for the Apple Watch although the implementation on the Apple\nWatch is more elegant. The Apple Watch uses haptic feedback to help you time\nyour breathing, whereas you need to stare at the Fitbit Charge 2’s screen. How\nuseful you’ll find the Breathe mode remains to be seen – we all know how to\nbreathe, after all – but it could be a nice primer to just take it easy every\nnow and then.  \n  \nThe Charge 2’s sleep tracking is an interesting one. It gives you a time\n“asleep”, which is the time you spent “awake” and “restless”, subtracted from\nyour overall tracked sleeping time. It means that while you might have “slept”\nfor eight hours, the “time asleep” reading on the dashboard might only read\n2hrs 42mins. It’s worth keeping this in mind before assuming that the device\nisn’t tracking your sleep correctly.  \n  \nI think this is actually a better, and less misleading, measurement than the\noverall “sleeping time” that other trackers and sports watches offer. It can\nshow you why, even though you’re getting your target hours of sleep, you’re\nwaking up fatigued and weary come morning. Really it’s the quality of asleep\nalongside duration that’s important for appropriate recovery and well-being.  \n  \nIn my case, with the sleep graph produced by the Charge 2, everything lined up\nas expected. This included the times I’m woken by the neighbourhood urban\nfoxes who sit in the middle of the road and yelp incessantly for absolutely no\nreason.  \n  \n👉Fitbit Charge 2 – App and Guidance  \n  \nOver the years, I’ve worn a whole raft of Fitbit trackers and so have seen\nmany of the changes that the app has undergone. One area the company should be\napplauded for is updating its app with new features and improving the\ninterface. It’s really evolved over time to be clearer and now provides far\nmore engaging features  \n  \nThe dashboard provides plenty of at-a-glance information on your day, from the\ntime asleep as mentioned above, to floors climbed, steps taken and distance\ncovered. You can jump into each sub-menu for more detailed information, with\neverything logically laid out. The Cardio Fitness score is tucked away behind\nthe heart rate reading, for instance, and the continuous heart rate readings\ngraph is easy to understand.  \n  \nThere are also areas where it’s possible to log your food and water intake;\nuseful if you want to have an overview of everything from activity to\nnutrition as well.  \n  \nNew to a recent update are Adventures, which are found under the Challenges\nmenu. These are virtual tours of famous locations, such as Yosemite National\nPark. By getting in extra steps, you unlock content along the route, including\nfacts and photographs of landmarks that you can view using the gyroscope in\nyour phone.  \n  \nIt’s a nice touch, and gives you the extra impetus to be more active. They’re\nparticularly great if you don’t like the idea of competing against friends,\nbut would rather do something on your own.  \n  \nThere are, of course, the standard leaderboard challenges if you do want to go\nstep-for-step with friends. You can opt into day challenges or longer ones,\nsuch as Workweek Hustle. You receive updates towards the target in a timeline,\nso you can see how you and your friends are doing.  \n  \nYou can also “Cheer” the updates, similar to a “Like” on Facebook. It’s a nice\nsocial element. There’s also a 7-day steps leaderboard, so you can see how you\ncompare over time.  \n  \nIf there’s one complaint about the app, for me it’s the lack of guidance. I’d\nlove for Fitbit to take a leaf out of Jawbone’s book with its Smart Coach\nfeature, which lets you know how all of the data can affect your wellbeing and\nhealth. It provides useful prompts – such as staying better hydrated, or\nexplaining how going to sleep 30 minutes earlier might have a positive impact,\nthen offering to set you a sleep reminder.  \nYou do get the occasional notification to tell you how well you’re progressing\ntowards your goal, but actually having this in the dashboard would be better,\nsince it’s easy to ignore or dismiss the notifications. You can opt into\nweekly progress emails as well.  \n👉Fitbit Charge 2 – Battery Life and Charging  \nBattery life is rated at around five days, which is about right. A major\nimprovement over the old Fitbit Charge is the new “clamp-style” USB charging\ncable. This locks around the tracker on both sides and makes orientating it\nmuch easier, ensuring it stays connected. The old Charge had a connector that\nplugged in directly and therefore could easily become dislodged. You’ll get a\nnotification and an e-mail to let you know the Charge 2 is running low on\nbattery.  \n  \n👉Should I buy the Fitbit Charge 2?  \nThe distance, step counting and heart rate measurements, while perhaps not the\nmost accurate, are consistent enough to prove useful. Combined, they do give\nyou a measurable way to track your progress. The new Cardio Fitness score,\ntoo, is a useful metric. The Fitbit app has also come on leaps and bounds in\nproviding motivation, but there remain areas where it can be improved.  \n  \nThere’s nothing really revolutionary about the Fitbit Charge 2. It’s very much\nan evolution of the Charge where styling has taken centre stage. The new\ncustomisation options will appeal to the sartorially inclined, but potentially\nthere aren’t enough new features to make it a must-have upgrade if you have\nthe old model. Especially since the Breathe mode feels like a gimmick.  \n  \nThe real disappointment is the lack of waterproofing. The Charge 2 is only\nwater-resistant, unlike the other new Fitbit addition, the Flex 2. So while\nyou can wash your hands wearing it, you definitely can’t go swimming with it\non. You’ll have to take it off to shower as well, which can prove disruptive.\nIdeally, a fitness tracker is something you want to put on and only ever take\noff to charge. Every time you take one off is one more chance you’ll forget to\nput it back on, nullifying its purpose.  \n  \nConnected GPS is an improvement over the old Charge and Charge HR, but it’s\nstill not an ideal replacement for a dedicate GPS sensor built directly into\nthe tracker.  \n  \nA wearable such as the Fitbit Charge 2 will never be able to compete on\naccuracy, especially against expensive tests such as a VO2 Max. What you’re\ninstead looking for is reliability, and this is where the Charge 2 does well.\nIn the end, if you want a HRM-equipped everyday fitness tracker that you can\ndress up or down, the Fitbit Charge 2 is still a good all-rounder.  \n  \nVerdict  \nThe Fitbit Charge 2 is an improvement over the original, but it doesn’t really\nbring a whole lot new to your wrist.  \n  \n🔴Guys! My only request is please don’t dislike my review. If you have any\nquestion or if you think I am wrong. Just ask me by commenting below.Please\nhit YES Button if you found my review HELPFUL.Write reviews, help others,\nhappy shopping  \nThank You for reading this review.  \n-●➽ Bhavesh B.O.T●-\n\n", "I gifted this to my sister and she had a major allergic reaction to the band.\nShe tried wearing this on both of her wrists and had a reaction on both her\nwrists. Her wrist almost got burnt because of the poor quality of the band.\nAnd she has tried other Fitbit bands earlier so it's not that her skin is\nallergic to fitness bands. I think that the seller might not have kept the\nproduct clean or maybe it was kept in unhygienic condityions. Whatever might\nbe the reason, this is unacceptable and should be investigated.  \nAttaching the images here for proof!!  \nFitbit Charge 2 Wireless Activity Tracker and Sleep Wristband (Large,\nPlum/Silver)\n\n", "Update: After nearly a month of use -  \n1) Battery life: I charge the tracker once a week. Lasts 6 days at least on a\nsingle charge. If you don't have UL certified charger, use USB port of your\nlaptop to charge - this will ensure battery is not stressed.  \n2) Auto exercise tracking is spot on. But I ensure to start exercise recording\non the tracker manually  \n3) Sleep tracking couple of times did not record sleep stages but simply\nlogged number of hours slept. Don't know what the issue was but it worked fine\nthe next night.  \n4) Quick View feature should have an auto turn off option - the tracker\notherwise blinds you when sleeping if the screen accidentally turns on. There\nshould be a schedule for automatically turning Quick View off at night between\na defined time period. People have already requested this feature on Fitbit\nforum. Let's hope this is implemented soon.  \n\\----------------------------------------------------  \nNovelty! I was in two minds to go for either this or Alta, especially since I\ndidn't want to look like a nerd and hence style was of essence. Charge 2 all\nthe way. This is an awesome device. Blue color is nice - goes well with formal\nas well as casual attire. Black I felt will lead to a nerdy look. Tracking is\npretty accurate - love all the stats that one can play with. Had it for all of\ntwo days and simply love it.  \nDownloaded the fitbit app on my phone and started the setup and immediately\nreceived an OTA. Post install, fitbit got configured.  \nI use the following :  \n1) Step tracking - results are close enough to my phone's step count - NOT\nusing connected gps  \n2) Workout mode - treadmill and weight training. This throws up an insane\namount of data - actually nice to dive into the stats and track progress. To\nturn on, navigate to workout and then tap the screen to select appropriate\nworkout mode and start by long pressing the button on the side  \n3) Sleep tracking - Tell sleep stages - and over time I hope to improve my\nsleep duration and cycle  \n4) Quick view - Have turned this ON - just turn your wrist (rotation should be\nof 'sufficient' amount for this to work) - not a flick but rotation of wrist\nas you move your wrist towards your face. Screen will automatically light up.\nYou can then navigate through the menu if you wish to by either the push of\nthe button or tapping the screen (actually tapping anywhere on the screen with\na certain 'momentum' - seems this feature relies on gyroscope to work and it\nis NOT detecting any tap/pressure point etc.  \n5) Notifications - You will need to keep phone's Bluetooth always ON for this\nto work. Location (a mandatory feature to be turned ON to sync the band) can\nbe turned OFF  \na) Messages - Love the fact that you can read messages as they arrive - Charge\n2 vibrates and just turn your wrist to turn on the screen and read the message\n- it will auto scroll. You can't go back to the message but is quick and\nefficient - no need to take out the phone for pesky forwards and never miss\n(read delay in replying) to your better half ;)  \nYou need to configure which messaging app can fitbit access and hence display\nmessages from - unfortunately only one app can be chosen  \nb) Receive call notifications on the band - again it vibrates and displays the\ncaller's name (and 'Unknown' in case the no. is not saved in your phone's\ncontact list  \n5) Silent alarm is also a nice feature. Have configured one on my fitbit to\nmatch the one I put on phone. The fitbit vibrated twice on alarm and would\nsnooze automatically if you don't press the button on the side. Snooze\nduration is 9mins and can't be changed. The alarm feature ensures I am up on\ntime with two devices on vibration - one next to my pillow (my phone) and one\non my wrist (fitbit)  \n6) I have also configured the order of menu - like i) enabling battery\nindicator and bringing it up the order so that I can check the battery level\nwith fewer pushes of the button, and ii) removed assisted breathing  \nFurther points to ponder:  \nA) Battery seems to last 5 days as claimed - at 67% after two days with one\nday of fiddling with the new band :D  \nB) Buy a screen protector. Read that the screen is plastic and hence scratches\neasily  \nC) Bought a small size. Use the Charge 2 measuring assist available online as\na PDF. Take its print and cut out the band and measure your wrist to know the\ncorrect for you  \nD) If you are looking for a replacement band - all the best. Can't find any\nreasonable priced ones. Official one cost a bomb at Rs.1,799\n\n", "I am shocked to see the people crying, complaining and bickering over the\nprice.  \n1\\. It is the best fitness tracker to be launched by fitbit till date; and\nprobably will be top of the line for a long time to come.  \n2\\. It is the same price as the fitbit charge hr so I don't know what everyone\nis complaining about since quite a few useful new features have been added\nalong with the increased screen size.  \n3\\. For people comparing the price to the US price of $149 which comes to\naround Rs 10,000, please note that the additional price you are paying here is\non account of shipping, handling, import duty and many such miscellaneous\ncharges as this product is imported and not manufactured in India.  \n4\\. Even if you are purchasing it in the USA, consider your travel costs to\npurchase it. If someone else is sending it for you, you still have to pay\nshipping unless your getting that for free.  \n5\\. It is a brilliant tracker and stop giving it 1 star reviews just for the\nprice, lets talk about the performance and features!\n\n", "The tracker works fine and the interface on the app provides enough data and\ntrends to monitor parameters like pulse, calories burnt, sleep and VOX2\nchanges. It certainly helps in keeping track of the progress and provides a\nbit of motivation to do better than the last day or last week. The battery is\ngood and lasts almost a week ( I did not activate the notifications)  \nThe pedometer is fairly accurate and counts the steps well. So is the\nstaircase climb counter.  \n  \nNow the bad-  \nThe heart rate monitoring is more or less accurate in the heart rate range 65-\n90. The variation I found when checked with a pulse oxymeter was 3 -4 which I\nthink is fairly OK. When the pulse is above that - the tracker shows more than\n120, the error in measurement is very high to the tune of inaccurate. I found\na variation of 20 beats plus variation. Then, this is not a medical device but\nonly a tracker.  \nThe pulse monitor has the annoying habit of not showing any value in the\nmiddle of a run. You shake it a few ties or take it out and put it back on and\nthe reading comes back. This is an irritant rather than a flaw.  \nI have been using the tracker since last 45 days and suddenly the tracker\ndecided not to sync with the app. This practically makes it useless and the\ntracker became a digital watch. From the Fitbit forum, one can see there are a\nnumber of users with this problem. I had contacted Fitbit and they had asked\nme to send the tracker to their agent in Delhi and on receiving it, they will\nsend a replacement in 15 day's time. In terms of customer handling, the\ncustomer support is good. They reply to the mail within 3- 4 hours.  \nThe app ( I use an android phone) decides not to connect to the server and\ngives the error - invalid password. After multiple tries, the app connects.\nAgain, this issue is also common - many posts in the fitbit forums.  \n  \nThe tracker and the app are not error free and has their own share of issues\nand the solutions to the issues are not there at the moment. Getting\nreplacement is good, but whether this will happen every time or every case is\ndoubtful. Go through the fitbit forums before deciding on a purchase.\n\n", "\n\n Got my fitbit charge 2 last evening. It seems that there is some problem with\nthe step count. It is not at all accurate. Some time the step counts absolutly\nfreezes. Don't know if the product that I have received is faulty or this is a\ngeneric problem. I have Argus on my iPhone which counts steps perfectly.\nCheckout the video attached.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 October 2016", "on 1 October 2016", "on 7 July 2017", "on 22 August 2017", "on 22 November 2017", "on 19 September 2017", "on 18 May 2017", "on 28 September 2016", "on 1 December 2017", "on 6 October 2016"], "reviewer": ["Aidan", "rohan haldiya", "vgogte1", "Sam Aercy", "🔴ʙʜᴀᴠᴇsʜ ʙ.ᴏ.ᴛ™👽", "Safina", "DK", "Rahul Gupta", "Amazon Customer", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Fitbit Charge 2 - just go for it", "Sleep stages (as promised by customer care) isnt really available.", "One Star", "FAULTY PRODUCT !", "One Star", "Totally worth! go for Charge HR", "Makes one proactive 😎", "Gives good stats but poor quality belt", "Excellent Deal and on time delivery by Amazon", "Nice but not the best"], "review": ["After lot of research and weighing out similar fitness trackers, I decided to\nbuy this one, got a good deal during the Amazon prime sale, it's just been a\nweek with this and the first impressions have been great. Will put out a more\ndetailed review soon.  \n  \nFor those of you who have slightly smaller wrists and are confused choosing\nthe strap size, I would advise you to go with the \"small\" one, it's more\ncomfortable and fits just fine with still good amount of holes left.\n\n", "Team, I was waiting for alta HR (mainly for Sleep stages) for 01-April, Also I\ndid call up 'fitbit customer care' before ordering this product suggested by\ncustomer care. They promised that Sleep stages and HR monitor is available in\nthis device. I did receive this product yesterday and found that some of the\noptions are working (lot of manual intervention needed) also sleep stages\nisn't really available in this product. Also food logging etc, it counts steps\neven if i don't actually walk (even during driving etc) i couldn't really find\na way to correct it or cancel it. Its really confusing. I even checked\nsettings, browsed some pages/help etc... Seems some of these issues are\nalready there. I was hoping previous issues/bugs would have been fixed in any\nproducts new version, but unfortunately to my disappointment i see that it\nisn't. I would again try to find update information with fitbit customer care\nand fitbit pages my settings etc.. after all that if im not satisfied then i\nwould return this product with disappointment.\n\n", "Received a defective piece in a new package. Placed a return request which got\ncancelled.\n\n", "THE PRODUCT WAS FAULTY, DEVELOPED PROBLEM WITHIN 7 MONTHS OF BUYING. THOUGH IT\nWAS IN WARRANTY PERIOD, THE PROCEDURE TO GET A REPLACEMENT TOOK ME A YEAR. THE\nPRODUCT WAS RETURNED TO THE VENDOR PHYSICALLY WITH ALL ACCESSORIES, BUT WHEN I\nRECEIVED THE REPLACED DEVICE IT WAS MINUS THE CHARGER TO START WITH, I HAD TO\nBUY A CHARGER ONLY TO KNOW THAT THE REPLACEMENT WAS NOT WORKING. I HAD TO WAIT\nFOR THE CHOICE OF MY COLOUR AND A CONTINUOUS REMINDERS WERE SENT FOR OVER\nCLOSE TO A YEAR TO FINALLY GET A FAULTY PRODUCT AGAIN. THE PRODUCT SHOULD BE\nTAKEN OFF THE RANGE OF PRODUCTS ON AMAZON.\n\n", "Faulty item supplied and stopped working after 3 weeks. No idea who will\nprovide warranty for this\n\n", "Steps accuracy is less compared to my old Charge HR.  \nGood thing is battery. It last for about a week.  \nFITBIT Fan.\n\n", "The charge 2 was a must buy ever since it was launched. If you aren't a\nhardcore fitness freak who wants to keep track of each and every move (and if\nyou are still so) and someone who just wants to be fit-bit in their lives and\nbe active throughout in order to combat the lifestyle disease in general then\nthis will (to some extent) take CHARGE of your life ;-)  \nTo those who are complaining that it shows more/less steps taken than real\ntime should consider some standard deviation of any technology in account.  \nBesides it just is a motivator to be really moving around and other facets viz\nsleep / cardio fitness /diet & water intake so that one can be control of\none's life in the healthiest possible way. The app is the best. No doubt with\na beautiful interface.  \nGet the Fitbit and it will make you FIT (lot) over a period of time. It's\ndoing good for me then why not you. Good luck and get gong.\n\n", "For 10K ₹ this is overpriced . Gives great stats and company provides lot of\ninformation around diet plan and training. This has improved my health\nconsciousness.  \nThe belt of The watch is of poor quality. It is peeling off after use of\n3/4months (posting a photo) . For this price expecting a better quality\n\n", "Excellent Deal and on time delivery by Amazon. Very satisfied with the product\nquality. Would highly recommend this product Fitbit Charge 2 if you have a\nfitness Goal for long term. It is loaded with many features to keep you\nmotivated towards your fitness Goals.\n\n", "It is a very great product but some times it is not very accurate. The heart\nrate sensor seems to work very great. The sleep tracking is also good. Fits\ngreatly on your hand,and the rubber ring of the strap has a stopper under\nit,which gives a great attachment to the strap me holds it very perfectly. The\nsteps which it calculates are not very precise,it calculates the steps even if\nwe move our hand or if we do some work. The special breathing sessions give us\nsome relaxation. The touch some times is not very effective,I rather tap on\nthe right side of the screen which is a bit more effective. Overall it is a\nnice product. You can go for it.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 July 2017", "on 8 April 2017", "on 14 July 2017", "on 7 November 2017", "on 17 June 2017", "on 4 April 2017", "on 9 October 2016", "on 14 October 2017", "on 24 October 2017", "on 3 January 2017"], "reviewer": ["Sudeendra", "Amazon Customer", "Karan G.", "Amazon Customer", "SURESH JHANWAR", "Sarosh", "sophia", "Kedar", "Amazon Customer", "Pranav Mahadev"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["A reassuringly solid upgrade to the Charge HR.", "Gadgets are for making our life easy, not complicated", "One Star", "Fitbit Charge2: A Wise Investment", "mi band is much better than this", "Counts steps while driving as well as sleeping", "In this search FITBIT CHARGE 2 has been awesome so far", "As I paired the band, it already had loads ...", "LOOKS :) FEATURES :(", "Changed my life style. Changed my life."], "review": ["Upgraded from a Charge HR band, which I'd gone through three units of - 2\nwhere the rubber casing of the band warped and made unusable and one where the\nbattery life dropped to >1-hour, so I was not really happy with Fitbit.  \nThis one seems to have learnt from the earlier versions - the actual tracker\nunit is definitely more solid and doesn't have any rubber casing, the straps\nare detachable, the bigger screen shows more data and so on. Slight learning\ncurve to use, replaced the official strap with one that allows for more\nventilation, 1-month of use and quite satisfied with the purchase. Wish the\nalarm vibration was a bit stronger - its become weaker than in the old Charge\nHR unless I'm missing some setting.\n\n", "Gadgets are for making our life easy, not complicated.  \nProblem in syncing, unresponsive to tapping and other issue. Not value for\nmoney.\n\n", "not satisfied !\n\n", "Performing perfectly as per expectations. Effectively tracks sleep pattern,\nnotifications, alarm in addition to tracking different types of workouts eg.\nRunning, weights, interval, treadmill, elliptical trainer, resting blood\npressure etc...\n\n", "Very inaccurate reading.Didnt expect such a device from fitbit. Tracking steps\nincrements even when driving a car, riding bike and various other activities.\nmi band is much better than this. Dont Buy this product.\n\n", "Its useless ,counts steps while driving as well as sleeping. It doesn't worth\nthe price\n\n", "I was looking at a device which would keep a track of the activity i do\nthroughout the day and can give me an estimate of how active or inactive I\nhave been. In this search FITBIT CHARGE 2 has been awesome so far. I have been\nusing it for almost a month plus now and I absolutely love it. It pushes me\ninto meeting higher fitness targets and I can definitely say it has made me\nunderstand my workouts better. The colour is snazzy, the display is vivid, the\ninterface is friendly and easy. Of course there are cheaper options available\nbut i think fitbit nails it. I would highly recommend it for anyone who is\naiming at living a fitter and active life. You can set goals with it and it\nhelps you being conscious of your health, Which i think is absolutely\nnecessary and unavoidable these days. If you are contemplating buying it, LOOK\nNO MORE AND BUY IT!!!!\n\n", "As I paired the band, it already had loads of pre-recorded fitness data on it.\nEven it did not provide notification (vibrate) for some of the incoming calls.\nAnd the performance of fitness tracking was also substandard.\n\n", "I am using FITBIT for more than a couple of months now. So far so good.  \n  \nPROS:  \nIt is sleek, it looks elegant and absolutely stunning.  \nvery comfortable on the wrist.  \nThe strap has good quality so not sweating due to the strap at all.  \n  \nCONS  \nAs long as accuracy is a concern, I would say that it is not 100% accurate.  \nAlthough It counts steps properly but fails to count exact stair many times.  \nPrice is little on the higher side as it is lacking the waterproof feature.  \n  \nConclusion: In the given price range you may find more feature in other\nfitness trackers but I am sure you won't find this elegant look which is also\ncomfortable at the same time.\n\n", "Cheaper one may work. But I am brand conscious. It looks good. Works\nperfectly. Brand is not built without reason. I wear it instead of watch.\nCan't take chances with cheaper one. Well tried product.  \nSaw my sleep data. I was horrified. I Start sleeping early. And changing my\nlife style. Today I am going to buy a bicycle.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 March 2018", "on 15 January 2018", "on 26 April 2017", "on 8 April 2017", "on 31 October 2017", "on 14 January 2018", "on 14 September 2017", "on 6 October 2017", "on 9 February 2018", "on 9 May 2017"], "reviewer": ["Amen", "Amazon Customer", "Amazon Customer", "Aman", "deepa", "A Patil", "Narender S.", "Amazon Customer", "Swapnaja Sharma", "Sunil Kumar"]},
{"rating": ["1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Poor quality", "within 6 month display is not working ..how to replace place or repaired..", "Worst product experince", "Bad Product with incorrect measurements", "Wrong readings and unresponsive item", "For general activity tracking", "After using it realised it's such a waste it counts arm movement also", "It is a good product. However there are a few areas where ...", "Great Fitness Tracker", "The product is not worth it respond some time and ..."], "review": ["After 2days it stopped syncing and after that it has also stopped pairing\n\n", "For 6 months it work ok but now the sheen is not showing any information..  \nWe also don't know how to get replace or replace this is purchase in 21st Jan\n2017, it is under warranty ..\n\n", "Guyz i got it from my friends prime account for 10k. The product arrived very\nnext as per prime...i unboxed and tried watching youtube videos for review and\nother essentials after all such things..i opened my tracker tried to turned it\non but i found no charge and tried to charge it after which it turned on\nfinaly a sigh of relief as i saw the reviews were worst for few..then tried to\npair with my samsung galaxy s7 edge but it could only generate the code for\neach trail after there was message stating restart blutooth, keep away all the\ntrackers,retry...this mighty process churned my time n brain ..but never\nsurpassed that level ..again tried youtube baba..no significant answers at the\nend making me to go for refund..this worst experience with amazon they every\ntime call up asking for returning the product but they failed in quality check\nwith sellers..\n\n", "The product is nothing what you pay for. It does not track any exercise\neffectively. While I ride my cycle, it counts it as step like I am walking.\nAccording to it just a medium level activities I am burning 3600 calories, if\nI would be burning such a amount that I would have been fit by now. Waste of\nmoney.  \nReturning it.\n\n", "We bought 3 Fitbits in the family. 2 are ok and one shows wrong readings, is\nvery unresponsive and box seemed tampered\n\n", "The display is good and bright enough to be seen in outdoors. Tapping has to\nbe done at the corner where device meets band and will register it 80% of\ntime. Step tracking seems to be ok , but adds a few steps while\ndriving/sleeping, though not significant when compared with 7-10k steps I put\neveryday.  \nBattery provides claimed life and even better it by turning off unnecessary\nfeatures. I had 30% left after complete 5 days with auto sync, notifications\nand quick view off.Will get fully charged in less than an hour.  \n  \nRelax feature is just a gimmick. Smarttrack can detect a few activities. Sleep\ninsights is a great feature. You will understand the reason behind the\nlethargic feeling in the morning and make changes to sleep patterns.  \n  \nCharge 2 seems to be great for general activity tracking with some\nnotification support. But Gear Fit 2 could be better if you are looking at a\nsmart watch with activity tracking, not withstanding bad reviews about battery\nlife.\n\n", "I had a huge craze for Fitbit. After using it realised it's such a waste it\ncounts arm movement also. iPhone has a better feature to track step count.\n\n", "It is a good product. However there are a few areas where the product could be\nimproved,  \n1\\. At a Twist / Turn of the hand the time and other measures must get\ndisplayed. But this feature is very inconsistent. It does not always work.\nSome times it displays some times it does not.  \n2\\. When I am working out in the Gym, I would like to monitor my heart rate -\nespecially when I am doing a HIIT Session. It is very frustrating to the see\nheart rate in the middle of the HIIT. The feature as in (1) above does not\nalways work. It would have been nice if in some mode the time and heart rate\nis always kept displayed so that I need not keep twisting my hand and keep\nlooking - and see it not working most of the time.  \nRegards  \nVenkat\n\n", "I was initially conflicted between investing in an Apple Watch Series 2 or in\na FitBit. However, I think I've made the right choice. The FitBit Charge 2\ndoes a wonderful job of keeping track of your workouts and your sleep pattern.\nThe heart rate sensor gives you a good idea of your heart rate, while resting,\nsleeping etc. I personally enjoy the interface because it doesn't let you\nbrowse or do anything else except keep track of your fitness. Call and text\nnotifications are just alerts, which means that you'll have to refer to your\nsmartphone in order to fully read or reply to them. The FitBit app is a great\nportal to log your calorie intake, your weight loss (or gain) goals, your\nother fitness goals. It helps you structure your workouts by making note of\nhow many times a week you've exercised as against your weekly workout goals.\nThe charge is great - it stays for almost a week. Overall, it's a great\ninvestment, totally worth it if you're looking to track your fitness\nseriously.\n\n", "The product is not worth it respond some time and some time not u cant rely on\nthis product The product is not worthy i want my money bach\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 November 2017", "on 12 August 2017", "on 21 October 2016", "on 12 April 2017", "on 28 September 2017", "on 17 May 2017", "on 19 August 2017", "on 17 August 2017", "on 18 April 2017", "on 5 August 2017"], "reviewer": ["Amazon Customer", "SUMIT AGARWAL", "phaniveluri", "Upendra Jeliya", "New Amazon Customer", "renjith", "Su", "Venkat Rajendran", "Sanjana Ramkumar", "Manas"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["It's a daily requirement in life...", "One Star", "I'm fully satisfied with this watch ..", "Amazing product!", "Charge2 User Review", "Perfect watch", "Fitibit is Disappointing (To say the  Least), It is Horrible", "Changes your life in small but meaningful ways", "I'm sorry to say, but the device sucks", "Faulty piece delivered."], "review": ["Yeh ! It's simply good , it has so many features like sleep alarms , work outs\n, treadmill exercise, running​, cycling, heart measure ,stop watch, relax time\netc..\n\n", "I want a replacement, this product this not working properly and I waited for\nthis product more than a month. Request you to replace the same\n\n", "Excellent\n\n", "Using it past 5 days. Amazing product, has completely changed my routine and\nhabits for good! Counts steps Correctly , calories burned counted based on bmr\nrate, floors counted when elevation more than 10feet (so variance here as all\nbuildings don't have same geometry), tracks sleep pattern but I am not sure\nhow correct that is (given I am asleep then🙄) but will understand how it\ntracks sleep to accept or reject the data. Another good thing is the ease of\nusing app which is awesome and then there are challenges from friend or even u\ncan challenge them. Only problem I face during initial two days was a burning\nsensation and red skin underneath the dial. But when I wore it loose, not much\nloose and not very tight, the problem has resolved and data tracking is also\ncorrect.  \nOn the help from Fitbit company, I sent them a mail attaching image of red\nskin telling them about my issue with Fitbit charge 2 and they responded\nwithin hours saying they would be ready for a full refund. I was very\nappreciative of their response and told them will revert if issue isn't\nresolved in a week but as it has resolved wont be returning it. Btw received a\nresponse from Fitbit saying I can return whoever I feel uncomfortable with the\nband due to the issue.  \nOverall a very satisfying and amazing experience with Fitbit charge2. Keep it\nup and keep us fit!\n\n", "Good Desing and sturdy watch. Waterproof and dust proof, when I say so, it\nmeans I wear it while playing football in rain, mud and dust. Only fault I\nfind is the measuring foot steps which not only gives exaggerated count but\nalso measures footsteps while you are driving a car. Not realistic for a\nproduct which comes at this price tag. Also the heart beat monitoring I think\nis not correct but not very sure. Honest opinion for someone looking to buy\nthis - if you are really desperate for smartwatch and that too from the Fitbit\nname then go for it, else look for a different option.  \nWearable wise review, I have not faced skin rashes and/or any skin burn while\nwearing this, I can say this as I wear it for almost 20 hours a day, while\nsleeping as well.\n\n", "If you think it is costly you are acctually wrong this is a quality product\nwhich have given all the activity trackable features  \nThis is a fab! Looks gr8888\n\n", "Seriously I expected much more with the 15000/- odd that i shelled out for\nthis product. I used Mi Band and GoQII before this and the experience was\nbetter. The call notification is virtually absent (only one feeble link) and\nuseless. Alarm vibration rings only once, you miss is more often than not.Also\nthe step counter is bit dodgy when compared with Google Fit. Guys better for a\nfossil with the same price.\n\n", "Have been hooked on to the Fitbit for almost six months now and have found it\nmaking small but perceptible changes to my lifestyle. I have always been quite\nconscious about my weight so did not buy the Fitbit for helping me reduce\nweight. Here are a few examples of things that changed  \n\\- I walk more every hour. Thanks to the step count and reminders  \n\\- I have stopped watching TV at least 20-30 minutes before I wind down to\nsleep, after I noticed that my resting heart rates were lower when I had a\nsmall interval between tv and sleep time  \n\\- I triggered a change in my mattress after noticing sleep patterns differ\nbetween hotels and home. This helped improve sleep quality as well.  \n\\- I drink more water now and keep a log  \n\\- I take the stairs far more often and check if I do ten floors every day  \n\\- I do more deep breathing during the weekdays after I noticed that resting\nheart rates dipped over the weekend, indicating better relaxation!  \n  \nAltogether, the device and app pair is a great tool to make you more conscious\nabout little habits that affect your health in small but meaningful ways. Am\nglad I bought the Fitbit  \n  \nOne drawback. The device is not water proof so cannot be worn while swimming.\nGetting the flex for swimming alone does not make sense. Would be great if\nfitobot finds a way to measure heart rates and keep the device waterproof\n\n", "The only thing I like about the device is that it looks great.  \nThe sensitivity of the device is terrible. Whenever I travel in a car or train\n, it counts steps.....I mean what is the fun....  \nGiven an option of refund or exchange, I would take it with my eyes closed....\n\n", "Battery percentage not showing. Charging cable faulty. Unit is not charging at\nall. Not happy with the product. Probably will return the faulty unit and\ncharging cable. Same piece I had purchased in canada. I bought extra unit for\nmy wife.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 June 2017", "on 13 February 2018", "on 6 October 2017", "on 12 February 2017", "on 5 November 2016", "on 28 November 2017", "on 11 July 2017", "on 19 May 2017", "on 26 September 2017", "on 5 November 2017"], "reviewer": ["Amazon Customer", "Aditya Madala", "raja", "gaurav kumar", "RD", "Pavit batra", "Subhra", "Rangarajan V", "Sheikh", "Ramanand Mishra"]},
{"rating": ["3.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Three Stars", "Worst product", "Battery backup poor, straps are not up to mark.", "Software support is good and keeps motivated with timely feedback but price paid ...", "Not worth it for the cost....", "Delivery was timely and product is good for regular use", "Excellent product backed with one day amazon prime delivery service", "Very disappointed as you also need windows 10 software to set ...", "Not working", "One Star"], "review": ["Its ok,poor strap..break in 10 mothhs,but in warranty,fitbit will me a new one\n\n", "I got the product it is worst , I tried to turn on but its not turning on,\nworst product  \nSo pls I need a replacement of my product pls contact 9731456939\n\n", "Started using it on Sunday and low battery indicator showed on Tuesday. The\nbattery backup didn't match with the product description. Seeing other reports\nit appears that that there is too much fluctuation in quality. Also, the\nfastener is too close.\n\n", "The band records hand movements as steps and gives sizable false data.\nSoftware support is good and keeps motivated with timely feedback but price\npaid for hardware and software is not entirely worth its value. Overall, it\nremains an average experience.\n\n", "It's recording steps even when we drive...  \nAlso the number of steps is inaccurate... Also when we are not walking and\njust are doing some typing work, steps are counted...\n\n", "Delivery was timely and product is good for regular use. However I faced\nunusual rashes on the wrist due to Fitbit Band. Maybe it was due to some\nallergic reaction to the material used in band. It didn't suit me.\n\n", "Excellent product with amazon excellent 1 day delivery  \n  \nI see lot of confusion around band size but after buying one I think for\nIndian female wrist small needs to be bought and for male large is needed.  \n  \nNote for a fitness band the strap needs to be loose a bit for better tracking\nof pulse and heart rate\n\n", "Amazon should mention it the product description that it's not compatible with\na windows cell phone and that it also needs a USB dongle to set it up. Very\ndisappointed as you also need windows 10 software to set it up with a laptop\n\n", "Bought this fitbit on February 2017 and now its not even working or getting\ncharged. Don’t know how genuine this product it. Is there any warranty??\n\n", "The device does not work. Request Amazon to help in getting this replaced.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 May 2017", "on 9 October 2017", "on 30 August 2017", "on 27 August 2017", "on 9 October 2017", "on 24 August 2017", "on 18 October 2016", "on 29 July 2017", "on 10 October 2017", "on 2 December 2017"], "reviewer": ["Amazon Customer", "Chetu", "Pranab Das", "Amazon Customer", "nagalakshmi", "Amazon Customer", "Bikash Sharma", "Amazon Customer", "Amazon Customer", "Sameer Bhargava"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Go for its, its the best!!!", "Updating my review. Now I think its piss poor.", "... for my brother on the occasion of bhaidooj he loved it very much", "Heart rate counter is superb but belt is causing trouble ...", "Most well rounded band for this price point", "Wouldn't recommend it.", "Very expensive and inaccurate data capture for price point", "Perfect fitness Tracker", "It's good overall, 2 issues noticed in last 1 yr", "AVOID!"], "review": ["Perfect gadget. Keeps u updated and on toes. Its a matter of understanding\nyour product well is what i would suggest. I was using Alta earlier which i\nchanged one month back and switched to charge 2. The best in class model this\nis. All the activities are detailed out. Even your workouts can be registered.\nAlso has a breathing session which I njoy very much. Battery lasts for 5 days.\nGlass doesnt get scratches as many have said. Guys go for it, its the best\nFitbit so far. Be fit, get Fitbit😊👍...I am wearing a small size fitbit charge\n2 (as seen in the image).\n\n", "Been using it for 6 weeks now. Almost 20 hrs a day.  \nFirst things first: You can wear it for long periods. No issue there.  \nBattery lasts 4.5 days with 4 hours of cycling every day.  \nHeart-rate monitoring is good. Cannot comment on accuracy as i don't have any\nalternate device to match.  \nI also bought a screen guard separately which gives me a better peace of mind.  \n  \nProblems:  \nDoes not performs its primary goal. The distance calculated are completely\nwrong. See the attached pics. Same route of 37.5 kms are calculated as 31, 26,\n19 and bloody 6 kms on occasion.  \n  \nWould not recommend this device at all. Will have to buy a new device and its\ndefinitely not fitbit.\n\n", "I bought it for my brother on the occasion of bhaidooj he loved it very much.\nThank you amazon. Awesome product.\n\n", "Heart rate counter is superb but belt is causing trouble to my skin if I wear\nit more than 10 hr. I don't know why but after removing Fitbit I had severe\nitching 3-4 times at some part of belt area on my wrist.\n\n", "This is my very first fitness band so I am no expert but so far after almost 6\nweeks of using this I can say I definitely don't have much to complain about.\nI tried out a few other bands and fitbit was the most intuitive so went for\nthis.  \nCons:  \n1\\. I think we are at a point where universal chargers are common sense but\nsadly not the reality. This comes with proprietary charger so if you lose it\nor break it you have to buy one from fitbit again.  \n2\\. The wrist motion that wakes up the screen doesn't turn itself off even\nafter the band detects you are sleeping. I am a light sleeper and was woken up\nseveral times because of light suddenly flashing in my eyes so finally had to\ndisable it. There's no option to do this via the band, can only be done\nthrough the app so I just turned it off completely.  \n3\\. The tap feature to move down the menu is a little flaky. Not a fan. And\nyou can only go down the menu not up.  \n4\\. The distance counter is off a good 200-300m for every km. My treadmill\nshows I have walked 2km but fitbit will show only 1.6km walked.  \nPros:  \n1\\. The band is more rounded than all other bands available at this price.  \n2\\. These guys have been in the game long enough and know what is expected. As\na result their app is really good. Very user friendly, very intuitive. Syncs\nwell. You can compete against your friends and win challenges, set up goals\netc. This is a major motivating factor for me.  \n3\\. Movement reminder urges you to walk every hour. Definitely made me more\nactive.  \n4\\. HRM is fairly accurate. First thing to know in this area is that no wrist\nHRM is very accurate at this point, but fitbit band does the job.\n\n", "For the price, and the features advertised, this is a poor product. Build is\nnowhere near to justify its price. the screen is plastic instead of glass and\na gentle breeze would leave a scratch on this poor product. It DOES NOT detect\nexercises automatically. You can forget about accurate step counting if you\nhave long commutes to work. There is no intelligent removal of steps while\ntraveling. That's something a cheap phone with google fit accomplishes with\nease. The only things that work are the floors counted (doesnt exclude\naltitude changes during commute) and sleep tracking is more or less fine. The\ncontinuous HR sensing is the only thing you may consider this product for,\nwhich is also off by a fair margin when the BPM is over 150.  \nThe bottom line is that the price for this device cannot be justified in any\nway. Neither the build not the performance meets expectation. One is better\noff with a similarly poor performing device that is bought cheaper.\n\n", "Mi Band offer same details in one fifth of cost. Just the brand name. Simple\naspects like climbing floor or steps taken are incorrect. It even records, Ur\nmanual gearbox car drive in traffic as climbing stairs. Adding an image for\nconfirmation.it says I climbed 60 stairs in a day while I was driving for 12\nhours. Hilarious. So if you are into fitness. Don't waste too much money get a\ncheaper Mi band.\n\n", "It's perfect to keeps u active and it motivates to do the workout it's perfect\nfor everyone i had rashes on my wrist because of it but I always now sanitise\nit every day so it want happen again else it is just perfect perfect perfect\n\n", "It's good overall, 2 issues noticed in last 1 yr: wrist band is already gone\nand end up spending another Rs.900  \nSecond issue is tracking problem. While driving I have noticed step count is\ngetting increased even if the road is marginally in good condition. Second\nproblem shows lacks in functioning of Fitbit overall.\n\n", "Let me be clear, what I have, to compare with this, has been a lot. And this,\nin no way, has been a cheap purchase. To compare this with, I have an LG G\nwatch (the old, square face), a Moto 360, a 360 2nd Gen, an Apple watch sport,\na Firbit Charge HR and a Fitbit Flex.  \n  \nThis thing is so good at heart rate monitoring, it's ridiculous. But what bugs\nme is the most glaring omission of all. It doesn't calculate distance\nproperly, adds way too many steps and under counts steps once I'm actually out\non a walk. And I'm comparing this thing with all of the above. This thing\nsuc*s so bad, it contradicts itself! The fitbit app counts 1 kilometer in 10\nminutes and counts 7997 steps - through GPS. This count is by the app itself.\nThe same exact distance, I start an activity on the watch so it starts\nrecording me for that exact same kilometer when the GPS is on, and mind you,\nis connected to the smart band and it touts 'connected GPS', This thing\nrecords 5000 steps and 560 meters. How off can one thing be!?  \n  \nI've tried wearing on the dominant wrist, thereby altering the sensitivity;\nI've tried using the 'connected GPS' option with the phone screen ON and\nfitbit app in the foreground all the time, I've tried altering my stride\nmanually; all this, and this thing won't budge.  \n  \nI've had it. The apple watch and Fitbit Charge HR give me the same results, if\nnot a little worse as compared to GPS data, without me having to carry my\nphone along. Thanks to Amazon's return policy, I'm able to return this. No\nmore Fitbit products for me, most of all never this one. Manufacturers should\nknow what sh*t products they sell when they start taking these things back.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 February 2017", "on 7 December 2016", "on 6 December 2017", "on 2 March 2018", "on 6 November 2016", "on 15 December 2016", "on 23 September 2017", "on 19 June 2017", "on 8 January 2018", "on 17 October 2016"], "reviewer": ["Manddy", "Faisal Dilawar", "ashish", "Shah Jaydeep", "Mrudula Putcha", "Sameer singh", "Chris", "Amit", "Prethish", "Harneet Kalra"]},
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["(Long, In Depth Review) Great Device, Build Quality Way Better Than Original Charge (HR)", "Major let down!", "Worthy fitbit.Good in quality", "Two Stars", "Product started coming off in 2 months itself. It ...", "A COMPLETE REVIEW FROM A 2-WEEKS OWNER OF FITBIT CHARGE 2: Bought on Amazon.", "Bad strap!!", "we recommend logging in to your Fitbit account on a different ...", "Cool product", "Problem with display"], "review": ["Breaking the review into two parts:  \n  \nPart One: If you've never owned a Fitbit  \n  \nThis is the mid tier product for Fitbit. It replaces the original best-selling\nCharge & Charge HR. Steps, Flights, Heart Rate, Calories Burned, Connected GPS\n(shows a little map post workout when tied to your phone, and yes, you need to\nbring your phone with you on walks/runs), and notifications (as of now, just\ntexts, calendar alerts, and displays phone number of incoming calls). Great\nintro watch/tracker to be your first Fitbit. Does pretty much everything. Yes\nthere are other trackers out there, and some cheaper (in some you get what you\npay for). What separates Fitbit is the software and social functions. You\nwon't find a better app with ease of use, not to mention with the largest\nuserbase of trackers it's much easier to find friends and families to\nparticipate in challenges. Read on if you want to know some of the features.  \n  \nPart Two: If You've Owned A Charge/Charge HR, and should you upgrade?  \n  \nThe Charge watch has been the workhorse of the Fitbit line. Worth getting a\nCharge 2? In a word: YES. Since you're familiar with the Charge already, let's\ngo over some of the issues you may have experienced and highlights/common\nquestions answered:  \n  \n1) Build Quality: The Charge 2 is a far far superior quality than the original\nCharge. Right out of the box, you'll notice how much sturdier and thicker the\nband feels.  \n  \n2) Swapping out bands is relatively easy. Once you figure out how to press on\nthe band on each side to release, it's fairly painless. I could see someone\nelderly struggling with it at first. **If you had problems with your original\nCharge band bubbling, the ability to swap bands and how the tracker is\nconnected to the bands should eliminate the issues you have experienced **\nObviously way too early to make a call on how the device will hold up, but\ngiven my experience with Blaze & Alta, this feels similar in build quality, if\nnot better, and neither of those devices have suffered from bands falling\napart on a wide scale.  \n  \n3) Width of the device is nearly identical to the original Charge/HR. The\nbutton on the left side of the device is much more pronounced (good thing).\nYou can give it a nice firm click, and it doesn't feel loose or cheap as some\nof the Charge buttons were prone to.  \n  \n4) SIZING: The band itself is much longer than the original. I have always\nworn small in fitbit products, and found myself almost on the last hole.\nSomething to keep in mind if you think you are on the cusp of small/large.\nSmall likely the way to go.  \n  \n5) Display is nice, 4x larger than the original Charge. The font is displayed\ncrystal clear, and is very bright. Can see it extremely well, even in bright\nsunlight. It is NOT a color screen. The font is a bright offwhite, as opposed\nto the original Charge that had a soft almost blue to it. Texts when incoming\nscroll across the screen.  \n  \n6) Overall look is sharp. Much better looking than the original. Very sleek\nand elegant. Actually looks better than the Blaze given thinner profile.  \n  \n7) Has a breathing/relaxation function. Have only dabbled with this. It\nactually monitors as you inhale and exhale and prompts you when to take deep\nbreaths, etc. More of a gimmick to me, but some may find this useful.  \n  \n8) Navigation is relatively easy. When selecting specific workouts (you can\ncustomize the list in app), you hit the button on the side to get to the\nworkout screen, then tap to cycle through them (run, weights, treadmill,\nelliptical, etc). Hold the button and your workout starts. During the workout\nyou can cycle through metrics specific to your activity such as calories\nburned, heart rate, etc. Some activities will display steps, pace,calories\nburned, etc.  \n  \n9) Menu items start with your clock face, then by pressing the button will\ndisplay Heart Rate, Exercise, Stopwatch, Relax, and Alarm.  \n  \n10) Clock Faces: There are seven to choose from. Some display day & date, and\nmost have the option to where when you tap the display it will cycle through\nstats (may display heart rate, date, steps taken, how far you are in your\ngoals, your hourly movement reminders, etc). BUT DOES IT HAVE SECONDS? Yes,\ntwo of the watch faces are digital (numbers display, not hands) and have\nseconds displayed. There is only one \"classic\" watch face with the hands, and\nno that one does not display the second hand.  \n  \n11) Notifications: You get basic texts (no pictures of course), both SMS &\nWhatsApp message. Incoming calls will display the contact and/or phone number.\nAnd you get calendar alerts. There is no 3rd party support at this time such\nas Facebook, Instagram, etc (The Blaze watch will be offering these soon in\nnext software upgrade, so I guess there is hope the Charge 2 will get those as\nwell).  \n  \n12) Reminders to Move: Sit on your butt too long and it will thump you with a\nvibe (250 steps per hour).  \n  \nToday I put it through its first paces with a workout. I use it mostly for\nlight cardio and weights. Heart rate was spot on as it usually was with\noriginal Charge HR & my Blaze. No issues with step counting on the elliptical\nI used to warm it up. I have not used the watch for 24 hours yet, so have not\nbeen able to judge the VOX/Cardio Fitness Level rating new to this device.  \n  \nPROS:  \n\\- It is worth upgrading alone from the Charge/HR simply due to building\nquality. Pictures do not do it justice. As another poster on a forum where we\ndiscuss Fitbit devices said, it has that \"Apple\" quality feels to it. It no\nlonger feels like a cheap rubber tracker. The ability to swap to leather,\nmetal or other colored bands means you can wear this unit for any occasion if\nthe style is your thing. It really does look great.  \n\\- Monitoring of heart rate using optical sensors has never been a problem for\nme, and this one seems to be no different. Obviously, some folks have trouble\nwith them due to body hair and whatnot, but the sensors on Charge HR, Blaze,\nand now Charge 2 seem to be spot on. An issue I had with the original Charge\nwas it getting \"lost\" when I hit higher cardio levels. This doesn't appear to\nbe as much of an issue this time around. That said, this isn't a medical\ndevice, so I expect it to not be 100% all of the time. Use it as a tool in\nyour overall fitness profile.  \n\\- The charger itself is a new clip style (looks like a staple remover) and\nfits over the sides of the tracker. Fits nice and snug and snaps in. It won't\nfall out of the charge (actually think that's impossible given the design). No\nmore worrying about it not snapping on and falling off or getting it just\nright. Big improvement.  \n  \nCONS:  \n\\- vibration is notably weaker than the original Charge. May be an issue for\nsome using it as an alarm if you're a heavy sleeper. That said, I wore it very\ntight to bed last night, and it was able to wake me this morning (something\nI've had problems with on the Blaze from time to time).  \n\\- text notifications are neat if you've never had them. However, I have a\nBlaze, where you can see the whole message at once. The Charge HR slowly\nscrolls texts and notifications to you, which can be annoying if you're used\nto the Blaze. They serve their purpose well though, and I can't ding it for\nthis as it's a step up from the original Charge.  \n  \nVERDICT:  \nI reviewed it as if I were upgrading from the Charge/HR to this device. It is\na no-brainer if you've held on to your Charge/HR and not upgraded yet to the\nAlta or Blaze for whatever reason. I'd rank the Charge 2 ahead of the Alta. If\nmoney is no object, spend the extra to get the Blaze simply due to the color\ndisplay and easier navigation (not to mention ability to see full texts as\nthey come in). Otherwise, you'll be very happy to have moved up from other\nFitbit products. The Blaze is their high-end product at the moment, but the\nCharge 2 is a very close second.  \n  \nI'll happily answer questions as I did for when I originally reviewed the\nBlaze out of the gate, and edit this review to reflect common questions or any\nissues I face as I put the device through its paces in the coming days.\n\n", "Fitbit have marketed themselves over the years very well. Same cannot be said\nof their product (my first one).  \n  \nFitbit Charge 2 looks elegant with the right colour but is built off cheap\nmaterial (plastic!). I've used this for a month, even a minor touch against a\nwall leaves an ugly scratch on the display which is disappointing. The strap\nis tough enough, but, what would you do with a strap if your display is\nscrewed.  \n  \nThe activity tracker works ok, nothing great although you start to get\nfrustrated when it starts tracking your driving as \"steps\" which is\nridiculous. An activity tracker that costs > 10k should be smarter than this.  \n  \nHeart rate monitoring is done well and quite accurate, notifications don't\nwork well at all. I didn't receive call notifications, I had message\nnotifications coming in initially, but, I had turned it off, then, I turned it\nback on, and ever since, didn't receive any notifications!  \n  \nNot very sure about the exercise tracking since mostly I was into badminton\nand it never guessed that which is mostly the case with all the other\ntrackers.  \n  \nThe app as a whole is beautifully done with nice widgets and graphs. But the\nsyncing is too bad. It is advertised to be auto synced, but, that never\nhappened for me. I had to manually sync with the app every time which gets\nirritating over time!  \n  \nIf you are already on a smart watch, don't buy this. I made the mistake of\ngiving up Apple Watch and giving this a shot and was majorly disappointed.\nNow, I'm back using the Apple Watch.  \n  \nOverall, Fitbit Charge 2 is a major let down. If Fitbit want Apple's\ncustomers, they'll have to do way better than this.\n\n", "Great product and best one in terms of value for money among offered series\nfrom fitbit wrist band.It also comes with a best smooth pulse rate tracking\ninfo.Also it is spontaneously responding the smartphones which is connected\nwith it.Overall it is good and worthy fitbit ,supercool.😊😊.For more details\nplease check the below mentioned;  \nDescription:  \nMake every beat count with Fitbit Charge 2 - the all new heart rate and\nfitness wristband built for all-day, workouts and beyond. Pure pulse\ncontinuous heart rate makes it easy to maximize workouts, better track calorie\nburn and get a snapshot of your cardio fitness level, while all day activity\nand auto sleep tracking, lets you see how your whole routine adds up. Record\nyour workouts with multi-sport modes to see real-time workout stats on screen\nor rely on smart track to automatically record select exercises for you. The\nlarge OLED display helps you stay connected with call, text and calendar\nalerts, stay active with reminders to move and find moments of calm with\npersonalized guided breathing sessions. Plus, you can find a look that fits\nyour style with customizable clock faces and interchangeable bands. With more\nadvanced features in a sleeker package, it's the motivation you need to push\nyourself further every step, every beat and every day.  \n  \nFeatures & details:  \nPure pulse continuous, automatic wrist-based heart rate tracking to better\nmeasure calorie burn all day  \nMaximize your workouts using simplified heart rate zones (Fat burn, cardio and\npeak)  \nSee call, text and calendar notifications on the OLED display  \nGet a better understanding of your fitness level and see how you can improve\nover time with a personalized cardio fitness score  \nTrack all day activity like steps, distance, calories burned, floors climbed\nand active minutes  \nAutomatically track how long and how well you sleep and wake with a silent\nvibrating alarm  \nUse connected GPS during run mode to see real time stats like pace and\ndistance on your wrist  \nFind moments of calm throughout your day with personalized guided breathing\nsessions based on your heart rate.I hope you love this review.So please let me\nknow is it HELPFUL TO YOU ARE NOT.😊😊\n\n", "Not working within 1 year warranty period  \nNeed to know the procedure\n\n", "Product started coming off in 2 months itself. It seems there is quality issue\nwith product.  \nI have added the pictures of the same. Plus I don't know whom to contact for\nreplacement, I don't see anywhere phone number or E-maill address.\n\n", "This is my first experience with Fitbit and I love this product, except for\ntwo issues I have faced in the two of ownership.  \n  \n1\\. When you are travelling, the Fitbit counts the steps/stairs even when you\nare in a car or a bus. It keeps adding the corresponding badges too based on\nhow many steps your tracker counts while traveling. There is no way to reset\nor remove these badges and you loose the motivation immediately. There is no\nway to stop the Fitbit Charge 2 from counting steps/stairs while you are\ntraveling. You only have the option to negate the steps by adding the activity\n'Driving' from the online dashboard. But even this does not remove those\nbadges that were given to you by mistake. I have a whole bunch of badges to my\ncredit in 2 weeks, since I was on a road trip for 700kms (both ways) where it\ncounted 30000 steps, while I was sleeping in the bus.  \n  \n2\\. A couple of days ago, the Steps/Stairs/Distance/Active Minutes counters on\nthe tracker were reset to '0', every time I synced the tracker with my app.\nContacted customer service, they asked me to check the time zone on my\nphone/pc where the app was, but there was no issue with that. They couldn't\nprovide an answer at all and were beating around the bush. By then, it was the\nnext day and tracker was back to normal, even on synchronizing with the app.\nBut I lost the step/stair counts for the day and lost all the challenges I was\npart of because of that.  \n  \nAnyways, this is still a great device in many ways. I would still recommend\npeople to buy it after they read the pro's and con's below.  \n  \nPro's  \n1\\. Subtle device. You won't even feel you are wearing it.  \n2\\. Pulse Tracking, SMS and Call notifications, Steps, Stairs, Active Minutes,\nCalories Burned, Distance Covered, Exercise Tracking, Sports Tracking,\nBreathing Exercise and Stopwatch on your wrist (watch out for some con's\nrelated to these below).  \n3\\. Simple and easy to use GI for the app. I have used the app on Windows 10\nLaptop, Windows 10 Phone, Android 6.0 Phone and the even the online Web-\ninterface. Extremely user-friendly.  \n4\\. Prompt Customer service. You can reach @FitbitSupport on twitter and they\nrespond in decently quick time. And the best part is, if your device is\nfaulty, they give you a free replacement.  \n5\\. Excellent Fitbit Community. You will have a lot of people in your area who\nare already Fitbit users. You can challenge, add friends, etc. You get a lot\nof motivation because of this.  \n6\\. There are a lot of other apps that can be readily synced with Fitbit app.  \n  \nCons  \n1\\. The Call and SMS notifications are not available for Windows Phones till\nnow. Beta testing is underway and you may expect a first launch by June 2017.  \n2\\. There is absolutely no way you can turn off the tracker. The only way it\ncan turn off is when it runs out of battery. If you remove and keep it on\ntable, the tracker will assume you are sleeping and record your sleep. If you\nkeep it in a bag and travel, it will still continue to think you are walking.\nThere is no way to stop this. And the badges get added too, with no way of\nundoing this. You may negate the steps but you cannot remove those badges.  \n3\\. Some reports say that the step counts are exaggerated by about 20%. I am\nnot sure. But if you swing your arm while sitting in a chair, the tracker will\nstart counting.  \n  \nVerdict:  \nGood to buy product. But make sure you are aware of the negatives as well\nbefore you buy. Search the Fitbit community forums for more. At the end of the\nday, this may not be 100% accurate but it is definitely a great way to keep\nmotivating yourself. I lost close to 2 kilograms in 10 days, since I am able\nto keep track of my input and output.\n\n", "The strap is so bad. Two weeks and the buckle has come off\n\n", "Please don't buy if using Motorola phones band is not compatible, please check\nfitbit's own community how hundreds of consumers are struggling to get the\ntracker paired with moto phones..Investing into a premium tracker is to track\nmy activities not the other way around.  \n  \nReply from Fitbit's support team.  \n  \n\"We're sorry to hear that you're unable to sync your Charge 2 tracker to your\nMotorola X-Play Android device.  \n  \nWe appreciate you for troubleshooting the issue prior to contacting us. Upon\nchecking our system, we confirmed your Charge 2 last sync time was 11 hours\nago with medium battery through Android device.  \n  \nPlease confirm if the following steps has been already considered. If you miss\nsome steps, we suggest you to follow each of every steps below:  \nForce quit and then reopen the Fitbit app.  \nIf the tracker doesn't sync, quit the app again and try turning Bluetooth off\nand on.  \nReopen the app once more. If the tracker doesn't sync, try again after\nrebooting your mobile device.  \nIf your tracker doesn't sync, try again after restarting your tracker. For\ninstructions see How do I restart my tracker?  \nLastly, try uninstalling and reinstalling the Fitbit app.  \nIf your tracker won't sync after you reinstall the app, we recommend logging\nin to your Fitbit account on a different mobile device or computer to help\ndetermine whether the original device is the culprit.  \n  \nPlease note that if you must have location services turned on to sync your\ntracker. With this latest update, Google changed the permissions for Bluetooth\nsyncing, requiring the use of location services. For more information about\nthe latest Google permission requirements, see Google’s Android 6.0 Changes\ndocument here: [...]  \n  \nWe are hard at work trying to find a work around for this new change from\nGoogle to ensure you can sync your tracker.  \n  \nWe look forward to getting you back on track!  \n  \nSincerely,  \nMildred G. and the Fitbit Team\"\n\n", "Generally had a good experience in last one month of use except once when even\nwhile in a car it started counting floors on car movement. That was ridiculous\nbut other than that,  \nPros:  \n1\\. Looks elegant  \n2\\. Sharp screen and elegant  \n3\\. Sleep pattern is nice  \n4\\. App is useful  \n5\\. Battery 3-5 days easily  \n6\\. Strap is very sturdy  \n7\\. Charges in short time  \n  \nCons:  \n1\\. Counts floors in car bumps too or even steps  \n2\\. Strap is dirt magnet even on normal use but can clean  \n3\\. Sometimes when u move ur wrist to see readings, doesnt wake up\nautomatically\n\n", "The product display suddenly stopped working and i have tried lot for factory\nsettings but the disply would not work nor can I return this product as the\nreturn time was 13 oct today is 15 October.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 June 2017", "on 21 May 2017", "on 16 February 2018", "on 12 November 2017", "on 5 June 2017", "on 18 February 2017", "on 2 August 2017", "on 25 October 2016", "on 24 November 2017", "on 15 October 2017"], "reviewer": ["aar_kay", "Vishwas Shashidhar", "GVK BASICS", "Vinod Viswambharan", "Shripal D.", "Amazon Customer", "Akshai", "Amazon Customer", "Rajneesh", "ravinder"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Inaccurate count.", "One Star", "Not Recommended", "Good. But not very accurate", "\"connect to internet to sync\" says the app. when ...", "No good service. Belt breaks very early due to wear ...", "Best Watch under this price segment", "The Best Fitness Tracker..!!", "Bought This For Pedrometer, FAILED ON TESTS", "TOO MANY ISSUES WITH SYNCHING"], "review": ["Inaccurate count. Haven't even walked so much today, it considers my car\ntravel as steps hence resulting in wrong calorie count etc.  \nIn fact i have climbed steps up and down today say around 40 but it shows only\n3 steps taken. Check the pictures attached.\n\n", "Not even 4 months , the strip of the watch has come out\n\n", "Bought this product a week or so back. Initially it was measuring steps\naccurately. maybe i wasn't using it while driving it or something. Then it\nhappened and not once bt twice. Once when i was travelling in a train\ncompartment and the wristband was packed inside the suitcase. It counted 2000\nsteps when i had not worn it at all. Second time it happened when i was\ntravelling from one place to another in a car. The tracker counted nearly 3000\nsteps when not even one was taken.  \nI have read many similar complaints from other users/buyers. Currently i am\naway from the place where i bought it and hence have no choice but to retain\nit.  \nI hope the company releases some update or some SW patch where such an anomaly\ncan be rectified.  \nGiving a rating of ONE STAR. I don't hate it but i dont like it so much either\nto give 2 stars.  \nNot recommended till issue rectified by Fitbit.\n\n", "Bands are wiggly at the joints, in both bands i bought (charge 2 & alta).\nmakes a rattle noise while tapping. counts steps even when im just doing\nthings which involve hand moments & when im actually sitting. elleptical\nworkout doesnt show correct steps reading when holding the still bars on the\nmachine. very less details for the price, waterproofing could have been\nbetter, only splash proof not even shower proof.  \nApp support is good. if you are a beginner then this is ok, if you want\ndetailed info then go for another one.\n\n", "\"connect to internet to sync\" says the app. when bluetooth pairing with phone\nis done, why does it still need internet just to get daily data from tracker.\nplus, they dont mention this requirement in the manual. chatted with fitbit\ncustomer service and they told me internet connection is needed even to sync\nbetw phone and app. this is ridiculous. they shud've just let sync betw phone\n& tracker by BT and when internet is turned on then only data gets synced to\nFitbit servers. Check out fitbit forums, many ppl have complained about it,\nbut Fitbit wont add this feature.  \n  \nFloor climbing: not so accurate  \nSteps: fairly accurate  \nHR: fairly accurate  \nSleep tracking: didnt work for me, plus found it uncomfortable to wear to bed  \ndesign: is good, but strap locking mechanism needs improvement  \n  \noverall, i wud say u can get similar accuracy & functionality for lower price\nfrom Honor/Mi  \nhence for brand value if u want to pay, then it makes sense to go for this\n\n", "Dont buy. No good service. Belt breaks very early due to wear and tear in less\nthan months. Bought last year. Attaching images.\n\n", "Make every beat count with Fitbit Charge 2 - the all new heart rate and\nfitness wristband built for all-day, workouts and beyond. Pure pulse\ncontinuous heart rate makes it easy to maximize workouts, better track calorie\nburn and get a snapshot of your cardio fitness level, while all day activity\nand auto sleep tracking, lets you see how your whole routine adds up. Record\nyour workouts with multi-sport modes to see real-time workout stats on screen\nor rely on smart track to automatically record select exercises for you. The\nlarge OLED display helps you stay connected with call, text and calendar\nalerts, stay active with reminders to move and find moments of calm with\npersonalized guided breathing sessions. Plus, you can find a look that fits\nyour style with customizable clock faces and interchangeable bands. With more\nadvanced features in a sleeker package, it's the motivation you need to push\nyourself further every step, every beat and every day.  \nThis is my very first fitness band so I am no expert but so far after almost 6\nweeks of using this I can say I definitely don't have much to complain about.\nI tried out a few other bands and fitbit was the most intuitive so went for\nthis.  \nCons:  \n1\\. I think we are at a point where universal chargers are common sense but\nsadly not the reality. This comes with proprietary charger so if you lose it\nor break it you have to buy one from fitbit again.  \n2\\. The wrist motion that wakes up the screen doesn't turn itself off even\nafter the band detects you are sleeping. I am a light sleeper and was woken up\nseveral times because of light suddenly flashing in my eyes so finally had to\ndisable it. There's no option to do this via the band, can only be done\nthrough the app so I just turned it off completely.  \n3\\. The tap feature to move down the menu is a little flaky. Not a fan. And\nyou can only go down the menu not up.  \n4\\. The distance counter is off a good 200-300m for every km. My treadmill\nshows I have walked 2km but fitbit will show only 1.6km walked.  \nPros:  \n1\\. The band is more rounded than all other bands available at this price.  \n2\\. These guys have been in the game long enough and know what is expected. As\na result their app is really good. Very user friendly, very intuitive. Syncs\nwell. You can compete against your friends and win challenges, set up goals\netc. This is a major motivating factor for me.  \n3\\. Movement reminder urges you to walk every hour. Definitely made me more\nactive.  \n4\\. HRM is fairly accurate. First thing to know in this area is that no wrist\nHRM is very accurate at this point, but fitbit band does the job.\n\n", "Bought this for 11,999/- after reading a lot of reviews online. It feels great\nusing this band. The quality is just too good, display is really good (pretty\ngood in sunlight), pedometer & heart rate monitor is really accurate. I wish i\nwas completely water proof, but it not. Its only splash proof. Guided\nbreathing works really well. Overall an excellent buy for this price range. Go\nfor it without a second thought.\n\n", "Used the device for few hours only to realise it counts every hand moments as\na step. I bought it for this purpose mainly.  \nYes sleep, water intake, heart rate works fine. However when i tried to match\nHR with BP machine it didn’t match. Difference of 10.  \n  \nI may not be a expert in this, but these are my observations. Its upto you if\nsuch errors are in acceptable range or what? Maybe i’m over expecting.\n\n", "i have been using fitbit charge HR for last 18 months, thought the charge 2 is\nan upgrade and ended up buying it. too many issues with synching, i have been\nin touch with the fitbit technical team and trust me it is a waste of time and\nthey give the same solution every single time. the sleep schedule does not\nsync or it syncs in an erratic manner. i am regretting my decision of buying\nthe FITBIT CHARGE 2. I WISH AMAZON TAKES IT BACK AND REFUNDS THE AMOUNT.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 July 2017", "on 16 June 2017", "on 22 October 2017", "on 6 October 2016", "on 23 September 2017", "on 9 September 2017", "on 26 December 2016", "on 5 October 2016", "on 22 September 2017", "on 2 November 2016"], "reviewer": ["Hitesh", "Anand", "Sandeep", "Dr. Yogin Soni", "PP", "Nilesh", "Parth yadav", "Ganesh Kamath", "Shubham Sachdeva", "Renu"]}
]