[
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["5 star frm my side😍", "Battery drining faster", "Quality issues with phone", "Five Stars", "Yellowish screen..!", "Robust userfriendly phone", "Five Stars", "Awesome.... please go and buy this deal...", "Five Stars", "Iphone 6s is avesome 🤗🤗🤗"], "review": ["Yes its original... thnx amazon\n\n", "Its very good working but it's having battery problems\n\n", "Delivery was prompt but there are many issues with phone . Most of the time\nearphone doesn't work .some times when I open clock app , phone gets hanged .\nUnfortunately there is no return possible for this product . Big time let down\n\n", "Best❤️\n\n", "Guys just like U I too have bought iphone 6s with excitement.But in a day all\nmy excitement got out.Coz the screen was yellowish(even when I turned off\nnight mode),clearly I got 2 see d diferences frm d iphone 6s of my fren who\npurchased it in iphone store.Am worried now.So patiently wait nd purchase it\nin Apple store.I had lot of hopes of amazon,nw have to worry abt my hard\nearned bucks..!\n\n", "No individual review required for this phone, as its iPhone from Apple. Great\nphone and happy to see that its now available with internal memory of 32GB. I\nown the earlier version with 16GB, but had to download the photos frequently\nto free up the memory. Bought this phone for my wise, she is very happy with\nthe extra memory as she keep lot of songs.  \n  \nIts worth for money.\n\n", "best phone...\n\n", "This is actually good. Delivery was good and the product inside was brand new.\nOn the back there is also self declaration of is mentioned which is now\ncompulsary for all the electronic products in India. All the accesories are\npresent in the box and not checked the charger and the earphones (As i have an\nextra old set), but i hope that they are in eorking condition too.  \n  \nThanks Amazon and the seller too.\n\n", "Nice phone i found it 33k owesome thanks on time delivery\n\n", "I purchase 29990 price its value for money  \nIts my first ios phn  \nLookwise very nice  \nBatery drain fast little but its as usual apple phn  \nCamra quality averge not best like lg phn  \nOverall nice phn\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 September 2017", "on 15 August 2017", "on 28 October 2017", "on 1 September 2017", "on 14 June 2017", "on 16 June 2017", "on 19 August 2017", "on 29 May 2017", "on 29 June 2017", "on 24 October 2017"], "reviewer": ["★  Aliv ★", "Suryateja Tumma", "Nilesh Vaidya", "Amazon Customer", "adarsha", "Bharathi Jayavel", "Amazon Customer", "Ankit", "pradeep d.", "manu pachar"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["is it worth Purchasing in 2017 ? Detailed Review after using it for 6 Months", "Great even as of Late 2017!!", "Apple Best Performance oriented iPhone", "Received a t-shirt instead of the iPhone", "Beware: you might get marble pieces", "Damaged product delivered", "Best affordable iPhone right now", "deliery used product", "AS USUAL AWESOME!!THANKS TO AMAZON..", "Read your iPhone buying guide"], "review": ["!!! I am Using this Phone Since last 6 months !!!  \n\\----------------------------------------------------------------------------------------------------------------------------------------------------  \nPlease Read Complete Review, it will Help You to take a Decision if you are\nPlanning to Buy it in 2017.  \n\\----------------------------------------------------------------------------------------------------------------------------------------------------  \nNOTE:  \n@ I am Not mentioning Technical Specs, this Review is Purely from Normal\nUser's Point Of View.  \n  \nPros:  \n1) Screen Size is Perfect.  \n2) Light weight and very Compact.  \n3) I am Using JIO sim with it and phone handles maintains good internet Speed.  \n4) Super Durable, Anodized Back is effectively Scratch Resistant.  \nNOTE: I am a rough user( ex-Nokia User) and have dropped it many times from\nvarious heights, has got few scratches but are almost Invisible.  \n# See the IMAGES for details.  \n5) Considerably faster compared to its android counterparts.  \n6) Handles huge games like NOVA , MC 5, Asphalt 8 Flawlessly.  \n7) Camera Quality is Unbeatable.  \n8) Touch ID is better than Previous versions.  \n9) Touch Sensitive screen has lot of practical uses which are fulfilled by\napple's applications.  \n10) Lot of Accessories Available.  \n11) Charger and Ear-phones are working fine. (after 6 months of rigorous Use)  \n12) It has 3.5mm Earphone JACK, which iphone 7 don't.  \n\\---------------------------------------------------------------------------------------------------------------------------------------------------------------------  \nCons:  \n1) Memory Availability. You need to Keep on Deleting stuffs Regularly  \n2) Updates are Regular, but Consumes Lots of Storage.  \n3) Price is Still high and only occasionally drops, considering the Fact that\nit was Launched more than 2 years ago.  \n\\----------------------------------------------------------------------------------------------------------------------------------------------------------------------  \nSHOULD YOU BUY THIS PHONE in 2017 ?  \nYES, definitely go for this phone over iphone 7. Its value for money product\nand after all its a iPhone.  \nPlease Purchase 32GB version as its Cheaper or same that of 16GB version\n(Didn't understand why this abnormal pricing).  \nIf you want you 1st iPHONE, then PLEASE, DO NOT Purchase iphone 7 over this,\nbecause its much expensive, has almost Similar Features and user Experience\nand Most Importantly iPhone 8 is Coming this Year, so it would be Foolish to\ngo for iPhone 7 over 6s.  \n\\------------------------------------------------------------------------------  \nThank You for reading this review.\n\n", "I will be describing my experience as of the current time (late 2017) and\nprice around 32-35K (as it keeps fluctuating).  \nI got this phone during the diwali sale .. for my mother who was earlier on an\nandroid. Iphones are the best bet if you are starting new in the smartphone\nworld. Well I know smartphones have been here for quite a while but there are\nalways starters .. (like my Mom).  \nThe ios interface is niche and simple as compared to its android counterpart.\nIf your needs are just basic ( like clicking pics, calling, using a few other\nmessaging apps etc)..and you want a premium phone with an attractive design\nwhich is fast, durable and feels good to hold in hand, this is the one to go.  \nYou can get cheaper android phones with similar or even better configurations\n(one plus 5, Nokia series etc) but IOS experience is the deal maker here. You\nIphone is definitely going to have a better life than any of the android\ncounterparts. Plus the long term apple software support for its devices makes\nthem a great deal. (iphone 5s is still supported by Apple even after 4 years..\nwhich no other manufacturer does)  \n  \nI also bought a one plus 5 for my dad and I can tell you, the phone is\ndefinitely faster than the 6s but still I prefer the overall experience of\niphone.  \n  \nIf you are a geeky person or anyway you want high customizability for your\nphone interface.. camera (one plus 5 offers DSLR capabilities) Android is\ndefinitely the way, but if you are a simple user who just wants to get the\nwork done with a nice and simple interface then the iphone is for you.  \nPlease prefer 6s over iphone 6 due to the 1gb ram difference.. Upcoming\nsoftware updates might just be much heavy. Also it only has slight differences\nfrom the upper models like 7 and 8 so its a good long term bet.  \nI personally bought an iphone 7 due to the water resistance and better\nbattery, but i did not find any performance difference in daily use.  \nHope it helps..!!\n\n", "Why should you care about the iPhone 6S?  \nIts a phone that is similar when compared with its sibling the iPhone 6 but\nhey its not the same device its an another iPhone but in the same clothing  \n  \nwhat is all about the iPhone 6S..?  \nits a phone that has the same chassis as the famous iPhone 6, but hey the\nphone is not at all the same this is known as 6S comes with some unique colour\nlike Rose gold, just not the color this iPhone has a feature like 3D touch\nwhich is again a patent unique to apple iPhone only you wont get to see this\nfeatures in any other smartphone, other than that it comes with the best\ncamera 12MP i-sight camera which is one of the best in its category even after\nthis device is two year old but everyone wants to buy it there are no changes\nbut still everyone wants to own one this is the magic of Apple.  \n  \nIt also gets an bigger battery which makes this device last longer and due to\nthe A9 processor the battery has surely improved making this device faster\nthan Before this surely makes this device a perfect buy in 2017 if you want to\nhave smart looking iPhone device this should be your choice it also looks\npretty neat then the latest iPhone 7 and there are no much big differences\nbetween both the device this phone will outperform all those big size android\nsmartphones, this can surely be your cup of cake, if you are tired using those\nandroid device and want to come to iPhone family, and have a budget that of\niPhone 6s guys then this is the right choice for you, you are getting a\nbalance specification which comes with iPhone 7 and, this part is lovely.  \n  \nToday owing This iPhone is just like driving a BMW where quality matters the\nmost, One advice i would like to give to all those who are reading this if you\nhave finalized getting this iPhone make sure you wait for this June end as\nthere can be a price drop in coming months which can save you some amount\nafter the launch of iPhone 8.  \n  \nEven getting this phone at this price will surely make your day once you start\nusing it,  \n[...]\n\n", "Received a t-shirt instead of the iPhone.\n\n", "I wish i could give anything less than 1 star.  \nGot a box of marble pieces instead.  \nWe had only heard or seen this happening with other people but this time it\nhas happened to me...and ita for real trust you me guys...\n\n", "Fully damaged product was delivered by Cloudtail. The device was already\nswitched on by the time we opened the package. I had ordered this as a gift\nfor someone and now i'm thoroughly embarrassed. Trying to get a replacement.\nLet's see how it goes.\n\n", "Yes, it's a wise decision to buy an iPhone 6S in 2018 if you get some\ndiscount. I bought it at 30k. I am loving it. Super stylish, classy look.\nPerformance is very fluid. Love the 3D touch, iHealth, iMessage and many more\nfeatures that missing in android. I found iOS is more reliable, more secure\nthan android. Battery back up is very good. Easily last more than a day with\nhigh usage. I don't compare iPhone with android devices. If you know what is\nan iPhone then you never go for android for your primary phone. I too have a\nandroid. I'm using Samsung C9 pro, but using it as secondary device.\n\n", "delivered used product\n\n", "I have upgraded from 5s to 6s the 5s was also bought from amazon 3 years ago\nwhich was genuine with good packing. This 6s is also 100 percent genuine and\nalso the delivery was fast, i got it within 2 days. As usual apple is\nButtersmooth and the interface is awesome i currently feel that i had really\nupdated because the overall feel while using 6s with respect to 5s is awesome.  \nNow i have to say something to people who says that they are getting false\nproducts, i suggest them to check the seller initially, do not blindly click\nthe link with less price please do carefully check the seller and also the\nseller reviews the seller cloudtail is the most trusted since it is amazon\nseller which is 100 % trustable.  \nAnother thing is if you have purchased a mobile you can check its genuinity\neasily, if it's an apple i phone its easy to check that the package contains\ngenuine i phone. please type \"apple IMEI check\" in google enter the IMEI\nnumber provided in the invoice of your order it will shows the model and the\nentire warranty information and also the condition of the phone that is it\nused or not. Please do consider this little things then your online shopping\nwill be satisfied with peace of mind.  \nI have been shopping with amazon since 2013 i didn't even occur any problems\nand also the products which i have bought is with outstanding quality and also\ngenuine with long lasting.\n\n", "● There are the different iPhones currently sold in India as on Jul-17  \n\\- iPhone SE, iPhone 6s, iPhone 6s Plus, iPhone 7 and iPhone 7 Plus  \n● There is no point in writing in length about these phones since everyone is\nvery well aware on the reasons why they may shop for an iphone. So, I thought\nit make sense to compare the prominet features that could help you to make\nyour decision easier  \n  \n** iPhone SE **  \n● This is a 4 inch phone that fits very comfortably into your hands and is\ngood for your wallet since the 16GB version costs around Rs.21,000  \n● This packs the same A9 processor, camera, fingerprint sensor and many other\nfeatures of iPhone 6S and 6s Plus  \n● The 12mpx camera is one of the best among phones around Rs.20,000. It\nsupports 4K videos, live photos, full HD slow motion video, etc.  \n● In terms of performance also, the phone stands among the top in the list in\nthe Rs.25,000 bracket  \n● If you dont like big screen phones, this is the best phone for you. But I\nwould say if you have used a bigger screen phone, you would definitely\nstruggle with a smaller screen since reading stuff on a 4 inch screen may not\nbe a better experience for you. In that case, spend this money on an Android\nphone and you will love it  \n  \n** iPhone 6s **  \n● The main difference 6s has over SE is that 6s has got 3D Touch and display\nzoom other than a bigger screen of 4.7 inches  \n3D touch is an amazing feature where the phone can understand the pressure you\nput on screen while touching and can activate various functions like double\nclick, left click or many other functions that could have been achieved by\nmore than one click  \n● 6s also comes with a 128GB option while SE stops at 64GB  \n● 6s has got a larger battery, but there is not much difference in battery\nendurance due to the bigger display  \n● The selfie camera is also upgraded from 1.2mpx in SE to 5mpx in 6s  \n● So, if you are on a tight budget, but still want to go for an iPhone, this\none is the best choice. I bought the 32GB version for Rs.35,888 in Jun-17  \n  \n**iPhone 6s Plus **  \n● The only difference 6s Plus has over 6s is the screen size which is 5.5 inch\nand optical image stabilisation for main camera  \n● 6s Plus had been infamous for rumours that the phone could bend from the\npressures of your pocket, but Apple is reported to have addressed it by using\nhigh-grade aluminium  \n● Optical Image Stabilisation works can effectively eliminate effects of\ncamera shake and images are sharper. This is especially useful during low\nlight where the exposre is longer and there are more changes for your hand to\nshake or shiver during shooting  \n● The larger screen is good for watching videos, reading, etc. And if you are\na gamer, spending this much for a 5.5 inch phone makes sense. This is sold at\naround Rs.45,000 for the 16GB version  \n● The phone performance and battery endurance is very much similar to iphone\n6s  \n● If you dont have a need for a larger screen, I would not recommend to spend\nmore money, but iPhone 6s would do good for you. if you are serious on this\none, I would suggest to spend a little more and go for iPhone 7  \n  \n** iPhone 7 **  \n● iPhone 7 brings in a low of new features  \n● This comes with a 4.7inch display. The display is one of the best on\nsmartphones with a lot of new features. In practical, the display is brighter,\nvery easy on eyes and colour reproduction is more accurate  \n● The processor is upgraded to A10 and the camera sensor is also upgraded that\nexcels is low light photography. The dual camera system captures depth\ninformation  \n● There is no 3.5mm headphone plug, instead it packs the wireless earpods.\nHowever, it comes with a 3.5mm adapter that connects to the lightning port  \n● The phone is splash as well as dust resistant  \n● The jet black and red are the new colours iPhone 7 is sold in  \niPhone 7 is one of the biggest update and comes with a lot of exciting\nfeatures. The 32GB version is sold at Rs.49,000. If you are serious about\niPhone 7, you may need to think spending around Rs.60,000 for the black or red\nsince the phone does not look much different from iPhone 6s if not on these\ncolours  \n  \n** iPhone 7 Plus **  \n● This is only for those people who have got deep pockets. The base version is\nsold at around Rs.72,000  \n● The phone has got a bigger screen of 5.5 inch and a superior camera with\noptical zoom & telephoto aperture  \n  \n** Summary **  \n● Go for iPhone SE only if you use your phone mainly to make calls or if you\nare upgrading from a smaller phone. If you are moving from a bigger screen\nphone, the 4 inch display of this phone will not be a welcoming experience  \n● iPhone 6s is the phone that I recommend if you have a tight budget, but\nwould like to boast of your iPhone among your mates  \n● 6s Plus is not at all recommended because you will get iPhone 7 with a lot\nof new features if you spend a little more. However, if your only need is a\nlarger screen I wont discourage you  \n● iPhone 7 is in a different league. Its the best iPhone available today\naccording to me  \n● If you are struggling to find ways to spend your hard-earned money, put it\non iPhone 7 Plus black or red where you will get an amazing gadget to show\noff.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 April 2017", "on 24 October 2017", "on 27 May 2017", "on 4 May 2017", "on 4 October 2017", "on 13 July 2017", "on 8 February 2018", "on 7 May 2017", "on 18 August 2017", "on 23 July 2017"], "reviewer": ["Sameer Patil", "Anubhav Rai", "Karan Singh", "Amazon Customer", "manan", "Pavan Kulkarni", "Koushik", "Amazon Customer", "Edukrishnan.v", "Friendly Sparrow"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["The phone as such was fine but in the box there is supposed to be ...", "Happy.....to fast service from amazon...i got delivered my courier early....", "Review by a first time ios user . I used samsung galaxy s6 edge earlier and many more other android phones.", "NOT HAPPY!", "Buyers beware Apple iPhone corrosion poor anodizing", "Five Stars", "Bit expensive but worth it.", "Please acknowledge the complaint.", "Five Stars", "Payment issue"], "review": ["The phone as such was fine but in the box there is supposed to be a SIM\nejector tool. Apple gives proper tools while I got, can you believe it, a wire\nbent to look like an ejector tool. Because of that I couldn't open the sim\nslot for half an hour and I had to use my friend's tool finally. This is\nreally shameful and cheap on their part to do.\n\n", "Awesome Apple product by Iphone 6s n specially i like 3D Touch features, its\nfeel very premium compare to samsung or other like one plus....Thanks To\nAmazon to delivered my product Before Commitment Date..\n\n", "A must by phone. There r many android devices available such as one plus 3T\nwith high specs but this is very awesome.The best smartphone till now.U will\nfind it ever better than iphone 7 because apple removed airpods and all in\niphone 7. Also battery backup is very good than any other android device.\n\n", "The phone looked great when i got it.  \nBut after a werk of use i realize, the phone discharges super quickly, the\nscreen randomly starts flickering. It also hangs randomly. Its an electronic\nproduct and this might happen.  \n  \nBut, i have been placing a return for this iphone for the last two days and i\njust have not heard back from the seller. No email conformation, no phone\ncall.  \n  \nI am extremely unhappy with the service.\n\n", "From 8 months of very careful usage even though kept in an apple approved case\nthe so called high quality Apple anodized gold color started chipping off in\nweird vein designs all over the body on its own , Buyers beware even though\nthe mobile is in warranty Apple India will blame it on our normal usage or the\ncase used and won't be of any help other than wasting our time . Never had\nsuch issues with the older models.\n\n", "Nice phone! i recommend\n\n", "Best phone in its class. Well what can I say you either have \"The iPhone\" or\none of many cheap chinese toys.\n\n", "Now I’m facing problem while using my I phone 6s it’s hanging too much and\nyesterday when I have silent my phone it’s silent button is not working\nproperly it’s keep silent.  \nSo I am trying to contact your customer care but no buddy is responding. I\nwant to change my phone I don’t need any excuse from your side\n\n", "Amazing prdct. .lve it...\n\n", "I buy this product through my credit card with 0% interest.  \nReceived a message from Sbi credit card :-  \nDear SBI Cardholder, Your EMI Booking amount of Rs.30808.81 at AMAZON4 has\nbeen converted to 6 EMIs at 14% reducing rate of interest on 21/10/2017.  \nI booked this phone with no interest. Why I pay interest.  \nPlease resolve my issue as soon as possible\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 October 2017", "on 13 August 2017", "on 14 May 2017", "on 22 September 2017", "on 13 July 2017", "on 27 November 2017", "on 5 October 2016", "on 7 November 2017", "on 11 November 2017", "on 23 October 2017"], "reviewer": ["Amazon Customer", "Hiren sureshbhai vadoliya", "Amazon Customer", "Diya ch", "D", "omkar", "mihir", "MANISH BHARTI", "Anil Kumar Mallick", "Deepak sharma"]},
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Excellent bargain!!", "No action From amazon and not good product", "Bought a new iPhone 6s, which got delivered well ...", "Best phone for long duration", "Duplicate products", "Waste of money if u want to purchase as a user", "Return it now", "I am getting very dissapointed as i have booked my ...", "Found hanging issues in my phone", "If its not an iPhone, it's not an iPhone."], "review": ["Very happy with the phone. Battery back up is very good. Display looks great!!\nSo does the photos taken with the camera.\n\n", "Box received Open and voice not clear, Seems its re-furbished...I had already\ninformed Amazon but no action seems to be taken from their end\n\n", "Bought a new iPhone 6s, which got delivered well before time. However the Sim\ncard slot is not working.\n\n", "the best phone i ever have... always truest brand... expecting next 5 years no\nneed to change mobile\n\n", "Phone screen has gone in just 4 months. Seems like a duplicate phone\n\n", "Nothing in the phone expected Apple logo .If someone want to show off than\nonly purchase otherwise android phone is much better in every thing .\n\n", "Thats un cool man, i want to return this product,,and the assossories are\ndamaged...\n\n", "I am getting very dissapointed as i have booked my phone on the EMI BUT i am\nnot getting emi and force fully i have to pay whole amount in single\ninstallment\n\n", "I don’t know but it has hanging issue. Sometimes stuck and needed to restart\n\n", "There is little that I can say here about this beauty! The iPhone 6s is\ncurrently the best budget iPhone that you can get your hands on.  \n  \nIt's been 4 days since I've been using this and I've only charged it twice. I\nuse a good amount of internet for emails and research.  \n  \nThe camera is just pure fun. It's feature packed and does the job better than\nmost of the other counterparts out there.  \n  \nSwitching from Andriod. I had my doubts. But the iOS is just a sheer pleasure\nto use. It's so simple yet incredibly effective! It's intuitive and makes your\nlife really easy while working with the phone.  \n  \nFor the price it is available right now, this is a must buy if you are\nconsidering buying a phone.  \n  \nWill post more updates when I've used it longer!  \n  \nAnd last but not the least... Thank you Amazon for the prompt delivery.\nReceived the item one day before the estimated date! Simply brilliant!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 September 2017", "on 10 October 2017", "on 27 October 2017", "on 25 October 2017", "on 30 September 2017", "on 7 September 2017", "on 1 November 2017", "on 10 August 2017", "on 29 October 2017", "on 5 May 2017"], "reviewer": ["V.S.Rajagopal", "Amazon Customer", "Nutan toppo", "Amazon Customer", "Khushbu S.", "Anand Financial services", "Anshul", "Amazon Customer", "Ankit", "Deeganta Dutta"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Had very minor scratch on the screen.", "Amazing Product from Apple", "that's what I like about apple products", "Just the right Apple bite", "Genuine Review", "Why it is written made in in China in the ...", "... will be in parts Product_ it in itself is good. The touch working speed is good", "Supeerrr forever mobile phone", "One Star", "This product is very nice have to buy it"], "review": ["I am giving 4 star because there was a very minor scratch on the screen, other\nthan that product is very good.\n\n", "A perfect size phone for day to day use with awesome battery backup. No issues\ntill now. Thank you Amazon for the timely delivery.\n\n", "Smooth as hell, that's what I like about apple products.\n\n", "Neither too small nor too big. The right size with enough memory and fairly\naffordable price especially with EMI. The camera results are excellent.\n\n", "Hello guyz... I am wiriting this review after using this phone for 15 days.  \n  \nI bought it from a local shop in Guwahati after doing a lots of research, cost\naround 42k here.  \n  \nI was confused among samsung galaxy S7 edge,  \nLg G6 and iphone 6s. And guess what i am happy with this choice, my brother\nbought S7 edge, and we compared in all possible aspects.  \n  \nPros:  \n*Super smooth performance with zero lags  \n*Very sleek and feels sturdy  \n*Rear camera is great with 4k videos capabilites and slo mo, normal front with retina flash.  \n*Get updates immediately  \n*sound quality is best i have ever come accross  \n  \nCons:  \n* battery life- With facebook , whatsaap, few minutes of games , photos, data on, will last around 12- 16 hours, but heavy games will drain within 5 or 6 hours. Great standby time. Offscreen doesnt consume battery at all.  \n  \n*You will feel a bit restricted if you were on android earlier. Cannot download stuffs over 100mb on cellular data. Need wifi  \n  \n*charging time is a bit longer. 2 hours almost from 0 to 100  \n  \nGo for it, no need to worry, its very good\n\n", "Why it is written made in in China in the back of the mobile? Is it not the\ngenuine one then why we should pay Rs.41000/- + for a duplcate phone. is it\nnot from the Apple?  \nKindly check and revert.\n\n", "It will be in parts  \n  \nFirst THERE IS NO RETURN POLICY OF APPLE PRODUCTS ON AMAZON. YOU WILL HAVE TO\nVISIT SERVICE CENTER AND GET THAT IN WRITTING AND PRODUCE IT TO AMAZON FOR\nFURTHER PROCEEDURE  \nProduct_ it in itself is good. The touch working speed is good. Primary Camera\nis good though in secondary camera retina flash doesnt have much impact.\nBattery is an issue. I used on wifi for preparing my phone charged fully\nbefore starting. I downloaded backup from cloud store and well only 23 percent\nwas left. Backup included gmail, photos, apps(5 in all) and yes software\nupdate also. I just bought it for a change from 4 inches. But if u ask me\niphone se is a fine option until you want 6s only.  \n  \nPackaging was good and so was delivery. Got within 3 days considering the\noriginating point and my place are on two extremities. The phone was in\nperfect condition when arrived.  \n  \nSpecial mention of mr kenneth the customer care executive for helping me with\nan issue. My best wishes for his endeavours.\n\n", "Super mobile But do not take original invoice clearly and how can be when\nhappens mobile having problems in warranty period then tell me how can be\nclaim in istores\n\n", "chutiya banate hai\n\n", "Hi product is very nice and it good product it has good quality picture and\nGoogle screen and you have to buy the product and it based a finger print and\n3d touch go and buy it  \nBrody discretion below  \n  \nreakthrough design. Pushed even further. iPhone 6s - Take everything that made\nthe previous generation great, and advance it to a new level. They’re made\nwith 7000 Series aluminium, the strongest a ...  \n  \nFeatures & details  \n12MP primary camera with auto focus, 4K video recording, flash and 5MP front\nfacing camera  \n4.7-inch (11.4 centimeters) Retina HD 3D-touch capacitive touchscreen with\n1334 x 750 pixels resolution and 326 ppi pixel density  \nIOS v10 operating system with 1.84GHz A9 chip 64-bit architecture processor,\n2GB RAM, 32GB internal memory and single nano SIM  \n1715mAH lithium-ion battery providing talk-time of 14 hours on 3G networks and\nstandby time of 240 hours  \n1 year manufacturer warranty for device and 6 months on in-box accessories\nincluding batteries from the date of purchase\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 December 2017", "on 5 April 2017", "on 19 May 2017", "on 6 November 2017", "on 1 September 2017", "on 18 August 2017", "on 1 May 2017", "on 20 August 2017", "on 29 January 2018", "on 3 January 2018"], "reviewer": ["Amazon Customer", "Nikhil Prajapati", "Hrishabh Singh", "K.Jayaram", "tinku y.", "Amazon Customer", "Amazon Customer", "Suraj JD", "rahul", "Vivek"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Four Stars", "Best Buy for your buck", "Amazing product, totally safe to order online.", "Loved my", "Got it for 33k..", "quicker delivery and an awesome iPhone. Happy with the purchase", "I just loved it", "I was a Samsung user and after switching to Apple, I realize that Samsung is way better!!", "worthy phone and trustfull site."], "review": ["Excellent  \nThanqqq so much amazon\n\n", "\n\n", "The apple iPhone 6s is a great device with good features amd design that\nstands out in the competition when compared against some of the android\ndevices priced similarly\n\n", "For all of you out there wondering if you should order online or not, I was in\nthe same place a few days ago and it was my first time ordering a high ranged\nsmartphone online.  \nI was scared until I opened the package, but to my delight, everything was\ngood.  \nThe quality of the product I received is awesome, the phone is brand new and\namazing.  \nThis was my first time switching from android to apple and trust me I wish I'd\ndone it sooner.  \nDefinitely ,go for it! :)  \n\\- A happy user.\n\n", "Got to know about awesomeness of the Apple only after using it..!! Loved my\niphone\n\n", "The deal was amazing as I got it for just 33k. The packaging was not good\nalthough it was from cloudtail. The phone is working fine. No issues at all.\n\n", "As expected from Amazon, quicker delivery and an awesome iPhone. Happy with\nthe purchase\n\n", "Beauty.. I just loved it\n\n", "There is nothing so special in this phone that people are mad after it. Apple\nis only popular because of Brand value, not for manufacturing products.  \nFor the pros part-  \nGreat colour (Rose Gold)  \nDurable  \nGood speed (not great)  \nCompact  \nBeneficial 3d touch  \n  \nNow let us talk about the cons-  \nScreen colours are not vibrant  \nProcessor is not the fastest  \nHangs sometimes  \nAnd if you don't believe me, check on internet that the study in true that\nafter you buy an Apple device, they slowly and steadily slow down your phone\nby major and minor software update. So be aware!! An update is not always for\ngood.  \n  \nThe biggest Con-  \nThe camera is very blurry and bad.I hate its camera.  \n  \nMore info about the fourth con-  \nThis is not a rumor, a complete and accurate study and only Apple is this\nclever to force you to buy their only by name flagships. Other companies like\nSamsung are honest and never do this bad practice. In other flagships, after\naround 20 months, the phone feels a bit on the slower side because the\nprocessor gets old by the time.  \nEnough talking for today.  \nAnd again this is my honest review and not any practice of degrading Apple.\nPlease click the helpful button below the review.  \nHave a nice day.\n\n", "i ordered iphone 6s on 14th Oct and got it on 16th oct. this is a full\noriginal product and awsm. this is my first iphone ever and enjoying this\napple iconic brand's phone. u can buy and trust on apple and amazon also for\noriginal product. thank you amazon and apple.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 November 2017", "on 15 November 2017", "on 13 July 2017", "on 16 May 2017", "on 26 August 2017", "on 18 June 2017", "on 20 August 2017", "on 24 September 2017", "on 24 September 2017", "on 19 October 2017"], "reviewer": ["Sumit mishra ", "Raja kumar rajak", "Amazon Customer", "Aradhya Singh", "Amazon Customer", "Manish mohan", "Amazon Customer", "Amazon Customer", "Akshat Sindhu", "mayur aggarwal"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["It was my bad that I didn't remove the cover on the", "Worst experience i had with amazon", "iPhone experience", "Really bad experience. I am stuck", "Good Phone", "NEVER Buy without Return Policy", "First android device was Nexus 5 and fell in love with that", "If you have an iPhone, you have an iPhone !", "Five Stars", "One Star"], "review": ["Thanks for the product , product was not defective.  \nIt was my bad that I didn't remove the cover on the iphone\n\n", "My phone was defected...  \nScreen was not working... I raised this with amazon and unfortunately they has\nnot entertained my request.  \n  \nWorst experience i had with amazon\n\n", "I got this as gift from amazon in maharaja sale that is why not showing as\nverified purchase.  \nThis is the first time I am using iOS and I have always been using android\nphones. My serious advice to you first of all is that be very sure you want an\niPhone before making a switch because android users will find that iOS is\npretty restricting and not as customizable and feature packed as android. I\nhave been using it for two days and already feeling the frustration of a lot\nof missing features. A lot of basic tasks require one or two extra steps in\niPhone that can be done with a single click in android.  \nThat being said iphones have superior build, better resale value and higher\nsecurity so over all they are good if you are willing to spend so much for a\nphone. The camera is definitely way better than anything I got on any of the\nhigh end android phones I used. Compared to App Store reviews in google play,\nthe apple App Store seems pretty deserted as far as reviews and activities on\nIndian apps is concerned.  \nOver all I have mixed feelings about making the switch to apple. It will take\nmore time getting used to. If you are a typical google fanboy or girl and use\na lot of android features then I suggest you don't go for iPhone, android has\nway better variety in market.  \nAs for the phone itself, nothing much to say except you get what you pay for.\nIt is a beautiful and sleek phone with excellent performance. No heating or\nhanging issues whatsoever. Charging is blazing fast as well compared to my\nandroid phones. It was a big investment and I hope I will be delighted by the\niPhone experience in due time.\n\n", "I received the phone on 27th and wanted to return on 4th April. The speakers\nof the phone dont work properly and I intended to to return it back. Neither\nspeaker-mode nor handset mode nor headphone modes are working. The voice is so\njittery and poor irrespective of the SIM type and network. I tried the phone\nwith all possible SIMS ... Airtel, Jio, Idea . But I have been told to contact\napple not amazon to do so even though I am eligible for return till 6th April.\nThey say its their policy with apple. Why didnot they tell me this while\nbuying the phone? I am stuck now so awfully. People have been warning me not\nto buy from amazon but I did not heed to their warnings and believed amazon. I\nwas feel really angry and disappointed with the way the situation is being\nhandled.\n\n", "I would say that the body is very slipper, hence I recommend anyone buying\nphone to buy a hard back cover. This new colour is very rich. It's camera is\nvery good, even it's optical clarity is good. The processing speed is very\ngood preferable for non gamer.  \nIt's new feature Siri is not good, I would say it's one of the drawbacks of\nthis phone. It only functions with internet support and in India there is lot\nof network problem. Even if there is internet support it does not work\nproperly.  \nIt's battery life is also one of the drawbacks. The battery lasts for 9 hrs\nonly ( not on heavy use). Since it does not have Bluetooth support, if we use\nShareIt then apps shared over it does not work on this phone.  \nIt also does not display music files in music library which are received from\non whatsapp, mail or even downloaded from google, you are only able to\ndownload music from app music or through ShareIt.  \nOverall I would recommend you to buy Oneplus 5 or Honor 8. This phone is only\nmade for photoholic people but even in that prospect you can choose the other\nrecommended phone since they are ranged at same or lesser price with better\nfeature. You can buy this phone if you want to buy a apple phone, those who\nare a apple fan.\n\n", "Bad experience ! Read the fine lines before ordering\n\n", "Launched in 2015. 6s is still blazingly fast than many of its contemporaries.\nI am a diehard stock android fan. First android device was Nexus 5 and fell in\nlove with that. Let's see whether 6s will be as good as Google's flagship\ndevices.\n\n", "Great piece of technology! fully loaded with features. 3D Touch works\nexceptionally well and Thanks to Amazon for sending a great product in no\ntime... Was lucky enough to get a mind blowing deal of 29,999 /-\n\n", "\n\n", "The Phone was damaged. Small scratches on the sides. Never expected this would\nhappen with the brand new phone.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 May 2017", "on 15 March 2017", "on 20 May 2017", "on 6 April 2017", "on 17 August 2017", "on 17 May 2017", "on 26 September 2017", "on 17 October 2017", "on 25 February 2018", "on 2 March 2017"], "reviewer": ["Amazon Customer", "Sunil K.", "PBG", "Saurabh Chaubey", "Sheetal Naik", "JS", "Rakesh Kumar", "Himanshu dutta", "suresh", "Anvitha Anand"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["This is very irritating very poor quality! I havn't completed one month of purchase", "Was a huge admirer earlier but highly disappointed with this particular", "Confused between SE | 6 | 6s | 7 ? Go for this", "Superb !!!", "Just bought Apple iPhone 6s on monday. I am ...", "Apple", "Back camera is not working", "Fall from grace - beware of the very poor build quality of apple phones these days", "Good phone. Fast processor good camera not like 7 ...", "Worth of purchase"], "review": ["Frustrating ! I am unable to Charge my product. This is very irritating very\npoor quality ! I havn't completed one month of purchase, Please resolve the\nproblem! this is problem with Phone.  \nPoor quality Provided, Frustrating\n\n", "With such a huge brand name you can’t have sub standard customer support.\nWithin three months the phone has stopped charging. The customer care support\nare telling some moisture might have got inside the phone.\n\n", "So i was confused between all of the above devices. I was a user of OnePlus2\nand the change to iOS was easy AF. SE is small and compact. 6s in a body of a\n5s! Total beast none the less. Superb battery but if you like watching videos\nit isnt a phone for you since the screen is small. Like real small.  \n6 is just a step above 5s. No point in buying that. Just the screen is a bit\nlonger nothing significant other than that.  \n6s The best of the lot. Has to be. Great ergonomics by apple. Handy. 3D touch.\nGreat cam. 32gb is great. Quick. Smooth. Throw anything at it and it will\nhandle it!! And to be honest there is no point of going for an iPhone 7. Just\na minor number of changes and youll have a 7. I didnt think about 7 at all.  \nSo if you are confused between any of those devices you should go for 6s!!\nTotal beast.\n\n", "Best phone Ever..\n\n", "Just bought Apple iPhone 6s on monday. I am disappointing first time with\nAmazon. Main camera is not working. I have called many times on customer care\nbut have no solutions. Guide me what to do\n\n", "Best as usual\n\n", "The iphone was dispatched in protected timeframe but the back camera was not\nfunctional. The view finder always showed black screen but front camera was\nworking fine.\n\n", "Bought a phone at a whopping 46k (Not on amazon). Phone receiver conked off 1\nmonth out of warranty. And because the receiver has been designed to be a part\nof their screen module, apple wants me to pay 13K for the repair. While I was\ncontemplating this, the speaker has developed a crackling sound. And since\nlast week, huge lag on the browser.  \nI have seen their service centres passing some ridiculous service costs to\ncustomers before. And when I spoke to apple reps about it, they told me it was\na part of their service cost strategy.  \nHas completely put me off apple. A friend who bought this phone the same day\nas me, had his mute button Conking off, luckily in the last month of warranty.\nAnd they made him wait 3 weeks before they figured out what to do with the\nphone. Only after he put a lot of pressure did they finally give him a\nreplacement as they were not able to repair the button - again a design issue.  \n  \nThis phone is just not worth the price as the build quality is like cheap\nChinese phones these days which don't even last a year.  \n  \nWill wait for the Nokia 6 now and buy it at the same price apple wants me to\npay for a receiver repair.\n\n", "Good phone. Fast processor good camera not like 7 plus though quite good.but\nonly one problem sliver anodising faded in some area after use. But it's quite\nnatural after using so many months.\n\n", "Nice phone, people recognise you when I phone comes in your hand. It's my\nfrist I phone, camara is excellent. No other can beat I phone. Only battery\nlife is to less\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 October 2017", "on 29 October 2017", "on 24 August 2017", "on 24 July 2017", "on 19 October 2017", "on 7 February 2018", "on 26 November 2017", "on 23 June 2017", "on 18 October 2017", "on 27 October 2017"], "reviewer": ["Rahul Patil", "Amazon Customer", "Samarth", "Ramkrishna", "Tahsin Imam", "Samar", "Amazon Customer", "Vishwajeet", "SARANYA BARIK", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Better than all because read all", "Phone is best but delivery very poor I take to dilvery 17/6/2017 ...", "One Star", "Thank you Amazon for an excellent service and customer care", "super stylish.", "Simply great and WOW phone ever!", "worst serivice from amazon and apple", "iPhone 6S - Touch pad issue", "Perfect phone. I have been using Android since last ...", "Amwesome  experience!!"], "review": ["If you need very very beautiful smartphone don't think go for it  \nLet's go and talk about others features  \nFinger print sensor is fantastic  \n2GB RAM is cool and fast  \ncamra awesome front camra is good  \nA9 fusion chip fast working devise than iPhone 7  \nOverall  \nBest\n\n", "Phone is best but delivery very poor I take to dilvery 17/6/2017 but delivery\nto 19/76/2017  \nProduct I love it 😘😘😘😘😘\n\n", "very bad experience. wrong product delivered\n\n", "Thank you Amazon for an excellent service and customer care. I had been using\nthis phone from last three months and i have to say it is definitely the best\nphone! The phone is lightning fast, the sound quality is crystal clear, the\ncamera works like a pro! heavy duty games work great too. And the best of all\nno heating issues or lags.Go for it friends\n\n", "Awsum phone... super stylish.. Ios ecosystem best one in smartphone. Fluid\nperformance, simple and elegant. Must buy thing in a life.\n\n", "This phone in 2017, is still a killer model for a person like me who is not\ninto heavy gaming or music stuff. I was confused between SE 64gb and 6S\n32variant(64 not available anywhere around) If one is comfortable with small\nscreens, SE is a value for money (27k for 64gb variant with same features of\n6S) I phone 6s- 32GB variant is right now perfect for me although I guess it\nmay prove insufficient in the coming years. This is my first I phone and hence\nits WOW !! :) switching from android to ios is wonderful experience in itself,\nI won't get into detailing. Both platforms have their own pros and cons.  \n  \nTalking about this model, it is sleek, trendy, light weight and rose gold\ncolour looks simply great in hands :) Headphones and music quality is 10/10.\nCamera is a tough competition to One plus 3t. I am enjoying all the features\nand exploring the ios platform. Battery lasts for 1 and half day without\ncharging( with my usage that consist only of mails, imsg, whatsapp, instagram,\nsaavn and Vodafone play movies.) Battery was still 16% the next day. :)\ncharges really faster than my previous HTC model.  \n  \nThis phone is here to stay! I don't see it lagging behind other phones even in\nthe coming years :) Thank you Amazon and Darshita Electronics for the super\nfast delivery and excellent packaging !\n\n", "bought this phone got it next day and after 2 days the vibrator of the phone\ndoesnt seems to be working fine it makes a louder sound than usual i have\nraised a request for return and sopke to customer care as well till now no\naction has been taken or they are helping me.They just sayin that apple has\nthe control about the replacements and repair.  \nlater i contacted the sericve center and they took my phone for repair as they\nconfirmed the problem is with the phone ,instead of giving me replacement and\nas thier standard procedure(diagnosis ) and will take week to to update about\nthe repair but not for replacement, i hardly used it for 3 days . no response\nat all from amazon wheni insisted for return .\n\n", "I got the new iPhone product on May 16, 2017 however noticed that the touch\npad is not working and I would like the product to be replaced. It is\nappreciated if I receive a quick response on this issue.\n\n", "Perfect phone. I have been using Android since last 8 years and 1st time using\nios as primary device. some features are good But I miss Many User Friendly\nInterfaces of Android.  \nPros:  \n1\\. Premium Build Quality.  \n2\\. iOS 11 upgrated  \n3\\. iPhone 6S 4.7 Inches very Handy  \n4\\. call quality is awesome.  \n5\\. Camera quality is awesome.  \nCons:  \n1\\. Battery Guys, it Sucks. Need a power Bank  \n2\\. Screen is not scratch Resistant. It got minor scratches within 3/4 days\nuses.  \n3\\. cost to performance ratio is not good. Many Branded Androids performing\nway better than this.\n\n", "First i m afraid to buy online but to b very honest so far im very happy with\nmy iphone.  \nNo heating, no lagging, run smoothly, battery backup is awesome, 5* for both\nApple/Amazon.  \n  \nOne suggestion fot amazon plz share correct Courier boy contact no so that we\ncan also follow for the same.  \n  \nRest eveythingh is fine.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 January 2018", "on 18 July 2017", "on 19 May 2017", "on 11 July 2017", "on 2 March 2018", "on 6 September 2017", "on 2 July 2017", "on 24 May 2017", "on 20 October 2017", "on 6 August 2017"], "reviewer": ["Saif Ahmed ", "Mahi patel", "Deepa", "Amazon Customer", "Amazon Customer", "Anita Sohoni", "Amazon Customer", "Amazon Customer", "Apurba Phukan", "Ranjeet"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["1st of all such a nice product.", "Is it worth it in 2017? <Read this first>", "Awesome phone", "A worthy successor to the 5S", "One of Best Buy", "No service from apple and Amazon and no warranty for this INR 40000=00 product ... Who in this country can help", "Dont wait", "Warenty card not found", "Amazing product", "Don't think twice before buying!"], "review": ["1st of all such a nice product..  \nDelivered before date...  \nProduct is fully original.. No matter..  \nI phone is I phone...  \nOperating is very fast..  \nNo other phone compare to I phone..  \n5 Star for Best Product..  \n5 Star for Fastest Delivery...\n\n", "Flagships! They're high end premium devices that come out once a year\n(commonly) which pack pretty much every high tech feature imaginable.  \n  \nThey represent a company's idea of what a powerful phone should be. But like a\nlever other phone, even they get 'old'.  \n  \nAnd I'm guessing we all use our premium phones for at least 2 years. In that\ncase, how a phone ages overtime also plays a crucial role in determining it's\npower and value.  \n  \nSo taking a second look at them after several years of release is a worthwhile\nthing to do.  \n  \nLet's do just that. How about we take a second look at Apple's ex- flagship\nmodel, the iPhone 6s. How has it aged since September 2015? Is it still worth\nbuying in 2017? Let's find out.  \n  \nSo, the iPhone 6s has seen some price drops recently. The base model has been\nbumped up to 32 GB, which if not impressive, is still better than the\nworthless 16 gig model we had earlier.  \n  \nYou all know how that phone was perceived by the public back in 2015. After\nall the excitement died down, these are the things that have (kinda) held up\nafter approximately 2 years of usage:  \n  \nThe build: The phone is made our of 7000 series aluminium and has managed to\nsurvive a few minor drops over the period of its moderate usage.  \n  \nIt will last a pretty long time, if you are somewhat careful with your\nhandling.  \n  \nThe display: Yes, I know. It's not even 1080p. But the lack of pixels isn't as\nevident unless you compare it side by side with a full HD panel.  \n  \nOn its own, it's still pretty good, though you can't play 1080p videos on your\n'premium' phone. But it has that excellent brightness output of (close to) 600\nnits, so there's that!  \n  \nThe front camera(somewhat..): The front camera remains pretty good, even among\nthe present gen smartphones which are all set out to be 'selfie experts'!\nYou'll have good quality selfies and videos upto 720p from this front snapper.  \n  \nAlthough you get higher quality videos from other phones, you can't deny the\naccurate colors that this phone captures.  \n  \nThe software: Well, I'm talking about the software support. It still has the\nlatest and greatest OS updates from Apple and won't be discontinued any time\nsoon. That's not to say it's flawless though. I've experienced several lags\nand slow downs and crashes throughout the UI, from iOS 9 till 10.3 to date.\nMore on that later.  \n  \nThese were some of the things that still remain significant despite to the\ncut-throat competition.  \n  \nNow let's look at the things that aren't doing too well after aging:  \n  \nThe general performance: Now let me be clear, the 6s is not a laggy mess by\nany means. To a lot of people, it's still a pretty fast and fluid phone. But\nit does slow down quite a lot.  \n  \nI've seen a lot of phones and I can clearly see some dropped frames in the UI/\nanimations and delays while opening apps such as camera or facebook.  \n  \nIn other words, even the iPhone is affected by age and can slow down to a\ncrawl overtime.  \n  \nThe 64 gb model I've seen has managed to stay decently responsive, but hasn't\naged as smooth as something like the Nexus 6P. That phone is still one of the\nsmoothest out there!  \n  \nBattery life: You probably saw this one coming. The small 1810 mAh on the 6s\nbarely lasts a day of usage, and has gotten worse overtime.  \n  \nHaving too many apps on board along with mixed 4G/ wifi usage drains this tiny\ncell pretty quickly. You won't make it through a day, if you're constantly\nusing wireless services.  \n  \nRecharge speed also sucks. The puny charger included can barely pump put 1 amp\nof current and takes about an hour and a half to completely charge this thing.\nIt's unacceptable at least in my view, because it's dumb.  \n  \nSuch a small battery unit shouldn't take so damn long to charge up.  \n  \nThe Hardware: Yeah, things aren't too bright over here either. I'm taking\nabout the sensors and stuff.  \n  \nAfter 2 years of usage, the fingerprint sensor known as TouchID has stopped\nreliably working. It fails to recognise my fingerprint 6/10 times.  \n  \n​That's sad, considering it was one of the finest when it was launched. It was\npositively criticized of being 'way too fast' at the time. Now its 'way too\nfrustrating'.  \n  \nThe finger as well as the home button needs to be cleaned nicely before I can\nplace my thumb on it. But when it does work, it's still pretty fast at\nunlocking.  \n  \nOther things like the genealogy specs aren't too great for 2017 either. Though\n2 GB of RAM is good enough for iOS, it's not the king of multitasking any\nmore.  \n  \nThe DDR3 unit can barely keep some heavy duty apps and games open in the\nbackground. You'll see a lot more app and launcher reloads with modern day\napps, and this will only get slower overtime.  \n  \nThe rear camera: Though the front sensor remains pretty competent, the rear\ncamera sadly isn't.  \n  \nThe 12 mp sensor with a tiny aperture is easily bested by even mid range\nphones of the present day. It's good enough outdoors bit produces pretty\ngrainy and blurry images indoors and at night. Not super happy about that.  \n  \nOkay, this was the breakdown about what's good and what's not good about the\niPhone 6s, today. So should you buy this price dropped phone now?  \n  \nIf you're a strictly casual user who sticks to basic apps, doesn't mind about\nthe rather poor battery life but wants above average performance, I'd say go\nfor it. You'll probably be okay with the 32 gb storage too.  \n  \nBut if you are anywhere near a 'moderate/heavy user zone', you know what to do\nalready. Look elsewhere! There are much, much better phones that this one for\nhardcore road warriors among you, which will not only serve you well overtime,\nbut will also pack modern hardware.\n\n", "Amazing it’s true Iphone is Iphone no comparison It’s touch is so amazing .\nBattery backup was very good. IPhone 6s was best decision as compare to Iphone\n7, it’s 2gb ram is make ur iPhone very reliable\n\n", "It's hard to write reviews about iconic, and commercially successful products,\nlike the iPhone, because it is unlikely that we will be able to find something\nto write - that has not already been written about.  \n  \nNonetheless, the perspective of a rating changes, when the price-point of a\nproduct changes. The fact that the 6S is today available at a price at which\nthe 5S used to be sold 2 years ago, does make one look at this phone\ndifferently.  \n  \nFor those (like me) who are loyalists of timeless & classic design\nmasterpieces from Nokia (N-Series, Lumia 9XX), Apple (5-series), and HTC (One-\nseries) the iPhone 6/7-series design changes were a sacrilege, that tantamount\nto succumbing in to mass-market needs. However, look beyond that, and the\niPhone 6S is still as beautifully crafted as all iPhones are, and it is hard\nto find any flaws per se.  \n  \nAnd for those of us, who care more about what's under the hood, rather than\nthe shell, the relative price difference between the 6 and the 6S is worth it.  \n  \nPersonally, I like the marginally thicker design of the 6S, as it gives the\nphone some much-needed heft, as well as the necessary psychological\nreassurance of eliminating any fears of Bendgate, that battered the iPhone 6's\nimage. Build quality and craftsmanship continue to be top notch.  \n  \nThe improvement in responsiveness & performance is evident, especially if you\nare upgrading from a 2-year old 5S, as is the improvement in the quality of\nthe Retina display. I also think that the form factor of 4.7\" screen strikes\nthe right balance between readability & usability; and is therefore another\nstep in the right direction.  \n  \nThe higher resolution front-facing camera is a much-needed fix for today's\nselfie-obsessed generation, and irons out one of the key weaknesses of the old\nphone.  \n  \nNeedless to say, the increase in RAM to 2GB, is also reassuring, as it\nincreases the perceived life of the phone, given that apps will continue to\nbecome more & more memory intensive. Not that 1GB RAM was ever inadequate for\nthe 5-series, because the beauty of iOS (like Windows Phone) lay in the fact\nthat it is, by design, a far more resource-efficient Operating System, when\ncompared to Android.  \n  \nOn the whole, a worthy buy for those who don't care much about flaunting the\nlatest & biggest, especially at the price-points it is now available at.  \n  \nAnd yes, most women, like my wife, will tend to like the Rose Gold variant :-)\n\n", "Writing this review from my iPhone 6s . Got this phone at 28k during great\nIndian sale .  \nvery much satisfied with this beauty .\n\n", "There is a denial of service from Apple and Amazon even warranty is void for a\nINR 40000=00 product after purchasing in a 15 days time.\n\n", "No words to express..always awesome\n\n", "Warenty card is not found so how is it? There is just a bill and there is no\ndiscription of warenty in it.\n\n", "Writing a brief review about my iPhone 6s gold 32gb bought during festive sale  \n  \nFirst of all thanx to amazon and green mobile(seller) for providing me a\ngenuine product and well in time, great job both of you.  \nI was hesitating first because of some negative reviews but hopefully I got a\ngenuine one.  \n  \nNow something about the phone.  \nGreat design looks premium and what I like most is display size neither small\nnor big, easy to carry in pocket  \n  \nPerformance is incredible so far and what is for sure about apple products is\nthat it will remain smooth in future too, every app and game runs without\nhanging issue. I am pretty much satisfied with performance iPhone 2gb ram is\nbetter than any other 4-6 gb ram  \n  \nCamera is super worth the price and with Live Photos ,4K recording and much\nmore I am sure rear camera is best in this range  \nFront cam is also great and with Retina Flash it works well for selfie lovers\ntoo better than 12-15 mp of other companies  \n3D Touch is helpful but we need to get used to it ( first time iPhone users )  \nEverything is great in this product if you are an iPhone lover or boared using\nandroid and your budget is near about 30k  \nLast thing to mention here is battery performance it lags a bit for battery\nperformance but becasuse of it we can't call it a bad product for average\nusers it can last a day but with heavy usage it gives approx 7 hours  \nNow choice is yours guys do like my review if you find it helpful\n\n", "iPhone 6S, launched back in 2015 is still a beast today. It's one of the most\nfastest, snappiest and the premium mobile phones available today. It's miles\nahead of the iPhone 6 in terms of technology, hardware and performance, and on\npar with even the iPhone 7 (it doesn't have the matte black and jet black\nvariants though).  \n*Pros*:  \n1\\. You'll enjoy the best user experience with the iOS. Only the Google Pixel\ncan match it in terms of UI design and software performance.  \n2\\. The camera is phenomenal. It takes the most natural photos and has super\nquick autofocus. The front camera takes good selfies in low-light as well. You\ncan shoot 4K videos, although without optical image stabilisation, it's a bit\ndifficult.  \n3\\. The 2nd Generation Touch ID fingerprint scanner is the fastest in any\nphone. All you have to do is rest your finger on the home button and it\nunlocks.  \n4\\. It's great for multitasking. With the 2 GB RAM and the A9 chip, you can\nhave at least 15 different apps open and the phone won't lag or stutter for a\nsecond.  \n5\\. It's great for playing games, whether you're playing casual games or\nplaying heavy console-level stuff.  \n  \n*Cons:*  \n1\\. The battery is just okay. On most days, you'll get 15-18 hours on medium\nusage. Although on heavy usage days, you may need to plug it in once in the\nevening.  \n2\\. The design seems a bit outdated now. With phones like Galaxy S8 coming\nout, Apple needs to refresh their design.  \n3\\. Photography is not great in low light. It's still better than most phones\navailable in the market, but you won't be satisfied.  \n  \nAnd that's it! You'll feel complete with this phone. iPhone 6S compliments you\nin every imaginable way. So, don't think twice before buying!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 October 2017", "on 6 August 2017", "on 30 October 2017", "on 26 May 2017", "on 23 September 2017", "on 19 June 2017", "on 30 August 2017", "on 15 May 2017", "on 12 October 2017", "on 27 April 2017"], "reviewer": ["Amazon Customer", "Hemanth Shenoy", "Shekhar", "JPJ", "Shailesh Kumar", "chiranjeevulu sistu", "Dinnu", "Amazon Customer", "Sombir", "Adwitiya Pal"]}
]