[
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Life is Good & Lag Free with iPhone SE", "Four Stars", "Power in pocket size", "Amazing Phone.", "Best ever experience of mobile phone", "Great product.", "Beautiful", "4\" winner in 2017 and 2018", "Happy to receive an Indian assembled Iphone <3", "One of the best iPhone!!!"], "review": ["I use to use Android from Froyo version since 2011. Being an avid user of\nandroid, I still shifted to iOS. No matter how costly your android phone is,\nit will start lagging, over heating, sudden battery draining. As a result you\nhave face regular resetting of your android phone. iPhone is just a fresh wind\non all those irritating problems. Read carefully my review, which I have\nposted after 2months of use.  \nPros:  \n1) No lag, while atleast 60/70 apps running in background even.  \n2) Stunning photography could be done.  \n3) Highly sensitive auto brightness sensor. Changes the light very quick.  \n4) Google can be synced.  \n5) Contacts can be saved in Google directly. As a result, if you use an\nandroid phone & login through same Google account, your iPhone contacts will\nshow on android phone. Simultaneously if you save a contact at google, that\nwill reflect on your iPhone too. Just you need to keep Google auto sync mode\non in iPhone. Life is good.  \n6) 4K video is a pure charm once you watch it on your laptop.  \n7) Buy a gorrilapod @ ₹600, mount the phone on it, start slow motion video &\nleave it for an hour during sunrise or sunset. Just see the magic. A pure time\nlapse vide you would find. People call is SloMo with hashtag. Later transfer\nthe video to your pc & delete it from phone to free up the storage.  \n8) iPhone's 360degree photo, Square photo is iconic. Shoot a panorama pic &\npost it on facebook, it'll be converted into 360deegree.  \n9) So far no heating issue.  \n10) Very very fast charging. It gets 1% to 45% in less than 15mins.  \n  \nCons:  \n1) Average battery life. With power saver it can go upto 1.5 days. Without\nsaver I use it for entire the day.  \n2) In the era of 5.5 inch & 6 inch smartphones, this 4 inch screen is really\nlittle tough to get habituated. Nothing much, the very first issue you'd face\nis typing error or typo. If you are habitual using with 5 inch or bigger\nscreen, it will be little difficult to move your finger tips on proper\nalphabets. You want to write 'A', enough possibility is there that you would\npress on 'S' instead 'A'. But be assured, you'll be habituated within 2 weeks\ntime.  \n3) If you are bigger screen user, you might not like the video size in lower\nscreen size.  \nBut above two points are really ignorable. Human nature is based on their\nhabit. You'll be habituated with 4 inch screen, no worry.  \n4) Truecaller will work but not live. Apple won't any third party app to\ncompromise it's user's privacy, not even if the user himaelf wants to. After\nthe call, you need to copy the number & paste to Truecaller. It will work this\nway.  \n5) iPhone is not yours if you are multi sim user & do not want to keep more\nthan single phone.  \nClass says all. iPhone is meant for class users, who keeps single phone for\nmaking & receiving calls. Unlike those use who keep Jio for outgoing &\nVodafone for incoming.  \nJokes a part lol.  \n6) Storage is a real issue for this phone. These days 32gb is can not be\nenough for Vloggers like me. Again 64gb or 128gb version doesn't support my\npocket. Hence...  \n  \nConclusion:  \nIf you are confident, you could adjust with smaller screen size than your\nAndroid, if you could adjust little less battery backup, go for iPhone SE.\nBecause rest is all better than android. You'll get a pure lag free phone.\niPhone SE will never disappoint you by it's performance. Way better phone than\nany bigger screen, long battery backed up Android phones.  \n  \nPosting few pictures taken by my iPhone SE at Darjeeling.  \n  \nThus, I conclude & rest my unbiased opinion. Happy shopping.  \n  \nSumanta Chatterjee  \nKolkata\n\n", "Rattle sound when you tap on camera on 32GB Models.\n\n", "I phone SE(32 GB):  \nBattery backup amazing as compare to my old Redmi Note3. After moderate use of\nday I still get 25% battery in evening  \nPerformance is far better than any 3GB or 4GB android phone.Never lags in\nmultitasking  \nCamera: Quality of photos are some what good. Performance of 1.2 M Front\ncamera is great in day light . Never feel about lower pixel of front camera.  \nBuild quality is amazing . Compact and powerful device. Initially feel about\nsmall size but later on you will not feel about it.  \nWarranty and product is genuine and original .\n\n", "Totally in love with the phone. Although i use it as my secondary phone which\nmeans no social media and only work phone. i get an amazing 2 day battery back\nup. Good phone and to my surprise it did not get obsolete with the launch of\niphone 8 and iphone X.\n\n", "Best ever experience of mobile phone, this is my first iPhone which I could\nget under my budget with updated technology and features, I found it lightning\nfast, It runs without any lag even while operating multiple apps at a time.\nRear camera is unbeatable among the same range of mobiles available in market.\nPerson who is searching phone under the range of 15 to 20k budget should try\nit once if screen size doesn't matter much.\n\n", "This is my first iPhone as I’ve been an android user till now and experience\nhas been great so far.  \nI was apprehensive of buying this phone online but after 3 days of usage i can\nsay the it was a correct decision. Order is completely geniune and came nicely\npacked. No issues so far. Updated to ios11 and it’s great. A good buy for 19k.\nAnyone who loves small screen phone and wants to move to iPhone. This is it!\n\n", "Good phone;  \nno need at all to fit any accessories; I fitted tempered glass but I don't\nthink for a phone which costs Rs.26000/- can be protected with Rs.100/-\nTempered Glass!  \nAlso that \"feeling of Apple\" gets eliminated if you fit tempered glass!  \nSo I request not to fit it.....  \nEnjoy the original Apple device...That's better.\n\n", "Shifted back to 4\" after two year. The best phones I had used recently iPhone\n7 and google pixel. i found it most powerful mobile in 4\" . I think anyone who\nlove perfect size of mobile should go for SE 32 or 64 gb. And silver colour is\namazing as always\n\n", "I have receive an Indian assembled Iphone. Thank u amazon for that. Really\nproud of it. No words after all it a master design in software & hardware.\nWhen android offer 4-6 GB rams for smooth operations for the present time,\nIphone can provide better performance in 2 GB ram. There are more advantages\nthat can beat other android phones in same category.\n\n", "First of all, this phone is assembled in India and not in China. Do not get\nbothered about the hype of small size screen, which maybe the biggest concern\nfor whoever is purchasing this model, everything blends in nicely if you're\nnot expecting a 6s Plus size screen. This model comes with preloaded iOS 11.\nThan there is this premium hands on feel of the product. Camera is nice,\nHeadphone jack is still available in this model. So far I have not found out\nanything against the phone apart from a little 'faster than expected' battery\nconsumption.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 March 2018", "on 20 June 2017", "on 17 November 2017", "on 16 October 2017", "on 24 December 2017", "on 28 September 2017", "on 19 September 2017", "on 3 September 2017", "on 24 October 2017", "on 3 January 2018"], "reviewer": ["Sumanta Chatterjee", "Chandan V", "RD", "muditrajoriya", "Manish Pandey", "aman", "Amazon Customer", "SushilXYZ", "Sanjay Bhat S", "Dirghayu Parmar"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Excellent phone. Amazon fooling us", "Great buy, genuine product", "5 Star", "Overall nice performance except small screen size", "Chota packet Bada dhamaka.", "The product is awesome, the product receive before time", "Product itself is very good. Perfect. Reasonable price.", "Bought it for Rs 19, 000/- (32gb) Value for ...", "good one", "Best iDevice ever"], "review": ["Mint condition. No issues with the phone so far. Very easy to use with a\nsingle hand. That's the best feature of this phone. Very delicate so please\nput screen guard AND case.  \n  \nAmazon prime members were not able to view this product. My husband, a prime\nmember, was shown only space grey for this lower price! People please check\nfrom multiple accounts/browsers if you want to get the best offer.\n\n", "Great buy, genuine product, very competitive price. Of course, you must keep\nin mind the rumors about SE2 that might be launched by Apple soon while\ndeciding whether you want to want the existing model at a discount or would\nrather wait for the latest model.\n\n", "5 Star\n\n", "Overall nice performance except small screen size.  \nIt took around a week to adjust with 4\" screen as earlier using 5.5. But good\nthing is that you can operate with one hand as it's very handy & compact cell\nphone.\n\n", "Awesome phone as of its name...  \nPowerful processor good battery life..  \nVery nice Camera  \nOverall very much appreciated this phone in this price.  \nGo for it\n\n", "The product is awesome ,the product receive before time ,the cellphone is\nVOLTE,JIO work in these device\n\n", "Product itself is very good. Perfect. Very nice. Recommend to buy this\nproduct.  \nWORST DELIVERY OF WORLD FROM DELIVERY SERVICE.  \nALSO WORST PACKING OF THE WORLD.  \nBuy it.\n\n", "Bought it for Rs 19,000/- (32gb)  \n  \nValue for money.  \n  \nWith the A9 processor and 2gb ram it runs liquid smooth. Apps open up quickly.\nAlmost no lag time.  \n  \nBoot time on iOS 10.3.3 is barely 15 secs\n\n", "using iphones since 2009 and bought this one for my wife. Good choice in\nbudget for anyone looking to dump their android devices. Was expecting a India\nmade device but got a China made but no complaints as of now.\n\n", "Received it just in time. Was scared of getting damaged/incorrect product but\nthankfully this didn't happen. I must say this phone has an astonishing\nbattery life! I am a heavy user and still phone drives me through whole day\nusage. Its blazing fast just like 6S just with a bit smaller display, which is\nnot much of a problem\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 September 2017", "on 22 January 2018", "on 23 June 2017", "on 29 August 2017", "on 8 January 2018", "on 14 August 2017", "on 24 October 2017", "on 28 November 2017", "on 28 September 2017", "on 18 October 2017"], "reviewer": ["Mrs. L.", "Amazon Customer", "K Shah", "Amazon Customer", "Ashish Yadav", "Saurabh Shahasane", "buyer", "Kaizad Rustom Damania", "Bikram Singh", "kirti sutar"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Happy", "Great phone, you will miss it - must buy", "... a couple of weeks back and I am not happy with the battery", "Recommended, fast delivery & no issue at", "Still excellent in 2018", "Heats up when using whatsapp or duo voice calls in ...", "Amazing..!!!", "It has better features than iPhone 6 just go for it I ...", "Value for Money", "I m a well satisfied customer of amazon and always had a great experience ..."], "review": ["If you don't care about size and if you want performance then go for it. Got\nit for 15900 after getting cashback.\n\n", "Loved it - best one hand use. Took me a few days to move from that 5.5 inch\nlarge device. But feel great with this phone. iPhone SE is iPhone Sexy\n\n", "Bought this from amazon just a couple of weeks back and I am not happy with\nthe battery.It drains badly even in idle mode even when wifi,mobile networks\nand apps refresh all are in off mode.Dont know whether this is a faulty\nproduct!Anyone experiencing the same,Pls share your views\n\n", "Recommended,fast delivery & no issue at all\n\n", "Still excellent in 2018. Features are awesome.  \nno slowing down experienced after 1 month of usage. Don't miss a chance to buy\nthis model as it is very cheap and fairly above the android users of same\nPrince range. Finger sensor is little slow but just by fractions. IOS\nexperience is awesome, camera is really a quality one. Screen is small but\nsharp, Just loving it.\n\n", "Heats up when using whatsapp or duo voice calls in just 3 minutes. Highly\nirritating heat when using 4g data on youtube. Unfortunately there is not a\nsingle non heating alternative to this form factor in the android world\n\n", "Really Worth to buy..Amazing for compact phone lovers.. 5 stars for its\nperformance and product genuine in amazon.. Also, I appreciate amazon for\nverification after delivery !!!\n\n", "It has better features than iPhone 6 just go for it I got it for 18500 in\nfreedom sale (20000-1500 cash back )\n\n", "Received the phone in mint condition and it’s working fine. Thank you Amazon\nas i got it in deal price. I would recommend this product.\n\n", "I m a well satisfied customer of amazon and always had a great experience\nhere...and as usual get a genuine indian warranty product...no need to\ndescribe about the iphone se....its a well know brand\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 December 2017", "on 30 January 2018", "on 19 March 2018", "on 19 September 2017", "on 22 March 2018", "on 12 November 2017", "on 17 December 2017", "on 14 August 2017", "on 13 January 2018", "on 12 January 2018"], "reviewer": ["Apurva Narayan", "Amazon Customer", "vv", "Santhip Balakrishnan", "snehil dixit", "Saravan Kumar", "Parthasarathi", "g ram mohan reddy", "**", "Lalit Kumar Tak"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Five Stars", "Bad packaging from amazon", "( iPhone SE ) Big things come in small packages", "Amaging", "Awesome switch from Android to iOS!", "wanted to venture into the Apple world and this model seemed to be a good reason to not spend too much but get the ...", "Good battery back up", "Defective product", "Good phone with awesome hardware and performance.", "low price small size best in function with updated features"], "review": ["Great product from iPhone. Small in size but very powerful specially its\ncamera quality uncompareable.\n\n", "Very very bad packaging from Amazon. Package was open.it seems someone tried\nto find out what is inside the package..Though the phone box was sealed and\ncompletely new.  \nAbout iphone. No words....Just go for it... :) :)\n\n", "The iPhone SE is absolutely amazing. It’s just as powerful as my iPhone 6s\nwhich is totally worth it for the reasonable price that they are charging.\nAmazon is also giving good offers on this phone. If you’re an iOS user looking\nto upgrade from an iPhone 5, 5s or even a 6 for that matter, I would\ndefinitely recommend this phone. Trust me. You won’t be disappointed.\n\n", "Fast delivery genuine product\n\n", "It was once well said \"If you don't have an iPhone, you don't have an iPhone\".\nThe agreement to this comes from an hardcore Android Phone user too. The\nswitch is really worth while. Coming to the product. It's really zippy and\ndoes really everything that an iPhone is capable of. Moreover I loved the 4\ninch form factor that truly is the USP of the product. Really a great product\nfor first time iOS user.\n\n", "Little beast is what I call it. I was using Nexus 6P Special Edition, however,\nwanted to venture into the Apple world and this model seemed to be a good\nreason to not spend too much but get the taste of the ios.  \nThis phone packs great features, read through reviews and watch YouTube videos\nbefore you make your decision. This one is a fast feature packed phone.\n\n", "A must have if your a fan of small screen touch . Almost does everything\nequivalent to any it’s same segment phones , not considering the screen size\nthough. Good battery back up , sound output is good , touch sensitivity is\nsuperb , nothing less expected from Apple .\n\n", "Stopped working within 4 months..display gone..\n\n", "Now this product is correctly priced in india. For under 20k this product is\nworth buying. Superstar performance, handy size, very optimized battery\ncompared to iPhone 5s. It's battery lasts almost twice the time it used to in\niPhone 5s. Nothing more one would want from this phone.\n\n", "Good in condition, delivered within time.  \nAbout iphone SE: it is very comfortable for handling due to small size,\nremaining all other features are as equal to 6S. If anybody compromise for\nscreem size it preferable with lo cost.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 July 2017", "on 4 December 2017", "on 3 March 2018", "on 15 August 2017", "on 26 August 2017", "on 17 December 2017", "on 25 November 2017", "on 6 January 2018", "on 31 August 2017", "on 16 October 2017"], "reviewer": ["Amazon Customer", "vishal verma", "Vishwanath Menon", "Am rock", "Melroy Anthony", "chandan Choudhary", "Amazon Customer", "Nitish Tiwary", "Illusion", "VENKAT REDDY BANDA"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Makes up for its small screen with great performance.", "iPhone se", "Looking is Nice", "Love it!", "Designed by Apple in California Assembled in India.", "Great product! At the price of 5s you get ...", "Beautiful!", "Happy with the product!!!", "Perfect phone", "Really good phone if you want to switch to Apple with a higher configuration than iPhone 6."], "review": ["Sometimes touch doesn’t feel right on corners. Makes up for its small screen\nwith great performance.\n\n", "Great device. Have to adjust to the small screen and touch of the small\nbuttons. Great camera and iPhone experience. If u can manage small screen it's\na beast. Original product. Great delivery by Amazon. It's better u go for 6s\nit's the best. 6 is not good. U can go for a Android device if your budget is\nlow. Battery is great. Sound output excellent. Beautiful iOS experience\n\n", "Using internet and Hetting problem\n\n", "Love it!! Have no issues so far. Gotta be careful though dont drop it, which i\ndid once and the sound was feeble for awhile then it automagically fixed\nitself.\n\n", "iPhone SE is responding very fast with A9 chip. It feels very light and looks\nelegant. iOS 11 is amazing and one can immediately feel pity over Android OS.\nOnce you are used to Siri, Facetime, iTunes or any typical Apple theme, it's\nvery hard to get away. Apple resellers like imagine, Croma etc. are charging\ntoo much premium on iPhones. But thanks to Amazon and it's sellers we are\ngetting good deals. I am dazzled to see Designed by Apple in California\nAssembled in India. So go ahead and buy if form factor is not an issue.\n\n", "Great product! At the price of 5s you get the features of 6s. The size is\ngreat for people with small hands. It’s so fast than 5s and camera is better.\n\n", "This is my first apple Device, and I had my own speculations on how it would\nbe to make a switch from years of android. But this phone is such a beast\nmachine! Packs in that sucker punch for such a mild price tag.  \n  \nThe iOS interface is smooth and flawless, adding so much flavour to the user\nexperience.  \n  \nI got this device for 18,000 INR and i am absolutely satisfied with the money\ni spent on this beautiful phone\n\n", "I was little worried about ordering this product after the reviews of getting\ndamaged product...But Amazon gives the best phone in best price....Got\ndelivery on time and the phone is working perfectly fine...M happy with the\nproduct...It's awesome... Cheers Amazon!\n\n", "Its amazing as i was using 5s  \nIn independence sale i purchased it happy to got it in 18500  \nProcessor is very fast RAM is Double i.e 2 GB and no doubt about original or\nduplicate since i have checked on apple website by entering serial number.its\norigional  \nGreat service by amazon and rose gold colour is best colour  \nIf no one has issue of screensize thn its a best buy as 4 inch is sufficient\nas it is easy to handle\n\n", "I got this for 20k in a amazon offers. So fits my budget. Amazing\nconfiguration iPhone SE has and I love the size of phone, it's just perfect to\nuse with 1 hand.  \nInitially I was sceptical if this would be a genuine Apple product but it is.\nEverything is working fine so far. Thank you Amazon for best prize and thank\nyou seller for a good service.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 November 2017", "on 16 October 2017", "on 28 August 2017", "on 25 December 2017", "on 29 December 2017", "on 19 January 2018", "on 15 March 2018", "on 12 August 2017", "on 20 August 2017", "on 18 August 2017"], "reviewer": ["Sailu", "Amazon Customer", "Amazon Customer", "Sindhu", "Kaustubh Kulkarni", "Abhishek Balani", "Emmanuel Kenneth David", "Amazon Customer", "SHYAM J.", "Mandar Dhole"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["5 star for mobile...little beast", "#A Big Step for Small", "Handy IPhone", "Five Stars", "Apple 6Plus in 4 inch display is awesome. Apple lovers looking for small screen with all ...", "Wonderful product, fast and crisp", "Wow.... Amazing and mind blowing", "Excellent phone", "Nice deal.", "Four Stars"], "review": ["Amazing beast at this price segment (18999) thankyou amazon for making huge\ndiscount.....little bit disappointed by delivery but overall packaging was\ngood and such a great courier boy he opened the packet at the time he handled\nto me.\n\n", "This is Apple SE my first IPhone.After all reading reviews taken risk to buy\nit.Overall nice packing. Delivered in given date to my college. Product was\ngood, bought for 16k. Checked in Apple Site Its genuine product.  \nThis review is after 1week of usage.  \nThank you #GreenMobile\n\n", "This is always My right size of Gadget if it should be mobile for any\nindividual- Handy -within ones Palm hold & comfortable & convenient to handle\n!  \nI always wish & request Apple IPhone to continue to manufacture this size &\naffordable to such individuals who Loke yo Own an IPhone\n\n", "Very good product. U will not like any phone after using this\n\n", "Value for Money. Apple 6Plus in 4 inch display is awesome.  \n  \nApple lovers looking for small screen with all feature must buy this.\n\n", "Wonderful product,fast and crisp, unmatched quality.Those who talk long should\nconsider using iphone se which feels very comfortable in your palm unlike\nbigger android phones.  \nBesides,thanks Amazon for their super fast delivery.Actually the speed they\nwork is unbelievable to deliver the products.\n\n", "Wow...a clear interface, excellent performance,premium look... till yesterday\neven after ordering I was thinking my decision to buy iPhone is correct or\nnot. Also till my first day use what is there in iPhone which not there in\nhigh end android phones. I realised this iPhone is really a better mobile and\nnow it is cleared my why iPhones are costly. The home has all the answers\n☺️☺️☺️\n\n", "This is my first iPhone and really satisfied rather over satisfied. The\nbattery back up is superb. The battery stays more than 24 hrs even after using\nthe internet continuously. Thank you amazon for delivering such a excellent\nphone. Highly recommended. Other features are also superb. Apple is Apple\nafter all. The name is only sufficient.\n\n", "Nice deal .. got for 18k after Hdfc discount 2k... iPhone se power packed\nbeast with good battery life equal to iPhone plus models... iOS is butter\nsmooth...premium feel in hand... only one thing amazon delivery is horrible\ntook 1week for delivery....but package is good and genuine...feeling excited\nto use this iPhone...\n\n", "It is a mini beast!  \n  \nGood thing about the phone is doesn't heat up while watching a video. Haven't\ntried much with the camera. It is a very handy phone for compact size phone\nlovers.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 October 2017", "on 18 December 2017", "on 25 January 2018", "on 1 December 2017", "on 7 September 2017", "on 7 January 2018", "on 18 March 2018", "on 1 September 2017", "on 10 December 2017", "on 14 August 2017"], "reviewer": ["punit kumar", "G.Naveen Kumar", "Amazon Customer", "SANDEEP", "chandan kumar", "Amazon Customer", "Venkatesan T", "Avijit", "Amazon Customer", "Chandra"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["iOS", "Amazing phone", "All good except screen size", "Space for improvement, Apple...", "Two Stars", "Go For it Soon!", "Compact and powerpacked", "Iphone Se > iphone 6 = Iphone 6s", "The size fits into my pocket and easily handle to hold with one hand", "Two Stars"], "review": ["Touch is not so responsive  \nFinger print takes lot more time than an 7K android devices  \nIt is good but it is not best, worth for new iOS user not for existing iOS\nuser.  \nToo secured, need password for all things.  \nThere is no choice of product return, in case of any damage you need to\ncontact apple center\n\n", "Better than any iphone range till iphone 7 not i7+  \nNo other range in its own product can beat this phone.  \nRest for other companies no comparison\n\n", "Tons of youtube videos are there about this product no need to worry about\nthat..... Only this is trustworthy seller u have to find then all comes to\nplace\n\n", "Very good product received quickly in excellent condition as I first time used\niPhone from android found it little cumbersome to use apps are better looking\nand optimised for android I think, touch at corners is also missing some\ntimes. Display is good but not great.  \nGoods  \nVery fast  \nCamera VGood  \nBattery VGood  \nI purchased only for no good phone in 4\" category(android)\n\n", "I don’t know\n\n", "If yu love small screen,then this is the one! Jus go for it! Really Fast n\nAwesome Camera! Battery backup little dull after iOS 11 Update.. Best buy for\n18k! Bought it from Seller:Appario Retail. To check originality and coverage,\ngo to Apple official website and check it under support page with your iphone\nserial number!\n\n", "Compact. Powerful. Has all the best features needed and pocket friendly.  \nThe battery backup os surprisingly great almost manages to stay for about a\nday amd more with data, wifi, Bluetooth and gps on all the time\n\n", "This phone updates last upto 2022 and is a beast better than 6  \nIphone se = Outrbody of 5s+ Internal of 6s\n\n", "The size fits into my pocket and easily handle to hold with one hand. i love\nit these features of the iphone se. everything is well and ok compare to\niphone 6s and so , except screen size, touch id 1st generation, facetime.\nilove it .\n\n", "Initially thought that touch is not good. Android was more responsive and\nfaster. Thought of returning it. Planned to use it for 5 days as we have 10\ndays time to return. But now the fluidity makes me love it. Awesome screen\nclarity. Even phones above 20k can’t afford this experience. iTunes is worth\nsubscribing as the music experience is amazing. Camera clarity greatest of all\nphones in this range. Even better than 16mp phones. Apps and games are made\nfor this phone. Outstanding overall.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 September 2017", "on 13 December 2017", "on 15 November 2017", "on 31 August 2017", "on 3 December 2017", "on 25 January 2018", "on 9 September 2017", "on 25 August 2017", "on 17 August 2017", "on 9 March 2018"], "reviewer": ["Balaji Amarnath", "Adilkhan Balooch", "Dr GVK REDDY", "harsh chandel", "mac", "Kannann", "Avanish", "Benhur Emmanuel", "ik", "Karthik Bhupathy"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Im sorted for the next 2 years.", "Awesome phone with best price.", "Awesome product", "The phone came in perfect condition! Happy with the seller and amazon services", "Nice small phone", "It is a very good device from Apple", "Original condition and totally genuine product recieved.", "Worth Buying", "if got a chance to give rating in minus(-) i will give it", "Excellent compact mobile"], "review": ["Great phone, very comfy to use, 32 gb is just about enough for my purposes -\nie - a no frills business phone. Got it for a great price thanks to amazon -\ndelivery on time, packaged well. I can reasonably foresee that this will solve\nmy phone problms for the next couple of years\n\n", "Product delivered one day before scheduled date on priority basis,I got the\nphone with good price and phone is really awesome in terms of\ndesign,speed,packing.So I am truely happy and satisfied with apple and amazon\nfor providing best services to its customers.\n\n", "Till date there is no alternative for the quality of iPhone outputs..even\n1.2mp front cam pics looks like some 8mp android phone cam..Yes there are some\ndrawbacks like u don't get extra space if need comes.. But tats all marketing\nstrategy.. As far as the product I received is as always top notch and is a\ngenuine product.✌\n\n", "The phone came in perfect condition! Happy with the seller and amazon\nservices! The phone is great, working fine and at par with the expectations.\nWorth the money!\n\n", "Fantastic small factor phone. Infact tiny. If u like tine fonea. Warranty is\navailable for 1yeAr from purchase date. I validTed on site. No fast charging.\nGreat hardware. Not for the selfie craze people.\n\n", "It is a very good device from Apple. Please go for it if you need a very good\nsmartphone with a small screen size. Works flawlessly. Did not find anything\nto be so negative about the phone considering the release date.  \nBattery life is also good. Camera, performance, everything is good.\n\n", "Totally genuine product recieved. Came in a perfectly factory sealed pack.\nPhone and all its accessories are in perfect factory condition. Purchased it\nfrom cloudtail. Checked product warranty on Apple website. And the warranty\ndetails are also valid. No issues with the phone and it's inbox accessories.\nWorth the buy for 20k.\n\n", "Very handy, Voice & Camera clarity is too good. Battery life is good (for one\nfull charge will last for a day with 24/7 Wifi-On, Data On, GPS On, atleast\n30min youtube watch), buffering is too gud.  \nI did not found any draw back as per my use.\n\n", "I got defect mobile and just visit 4 time in last 5 month and still getting\nsame issue and they are not ready to replace as well. when i connect with\nsomeone and having a chat with him more than 5 min hitting issue is there and\nif i continue that chat more than 30 min then temperature alert appears. They\nchange battery but still getting same issue. In 5 months more than 25 days my\nmobile is in service center only.\n\n", "5s design with 6s specifications. Excellent phone with apples evergreen\ndesign. Thank you Amazon giving this mobile for the amount of Rs. 13250/- post\nexchange of my Moto G4 plus.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 September 2017", "on 31 December 2017", "on 16 August 2017", "on 16 October 2017", "on 2 March 2018", "on 27 October 2017", "on 20 August 2017", "on 7 March 2018", "on 16 March 2018", "on 30 August 2017"], "reviewer": ["LurkyMurker", "MADHUSUDAN", "Amith Kumar", "talia zubairi", "MAK", "Amazon Customer", "vishal r.", "Amazon Customer", "Pramod Thakur", "Ramesh s palati"]},
{"rating": ["2.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Issue with phone", "Very fast (much faster than my son's iPhone 6)", "great looks.", "Great", "Compact Power House", "Must buy if looking for phone in small form factor", "Battery Swells within 2 months of use.", "Who don't want to have an iphone!", "Best deal made with apple", "Love this Iconic iPhone SE"], "review": ["It seems give me an issue with touch and sound while listening to music ... I\nwill not purchase any electronics from Amazon going forward. Better to buy it\nfrom a store.\n\n", "Very fast (in all aspects) and the camera is very good.  \nHad the screen size been a bit bigger, I would have given 5 stars  \n(iPhone 6 is bigger but costs more, and is much slower than this)\n\n", "All you expect from an apple product......great looks.....great\ncamera.....decent battery backup....but screen size difference and certain ios\nissues are definitely noticeable if you are coming from android phones. At 18k\nstill the best camera you can find by far\n\n", "Iphone SE in 2018? Well thats the question came to my mind initially, i am a\nloyal customer to apple products for quite a long time , have been using\niphones and ipads. Due to some budget issues i had to buy some thing cheaper\nand it should be a iphone as i am used to apple music and cloud drive etc.,\nthis is super fast and super useful in 2018 with great battery backup, elegant\ndesign, up to date OS, nice audio output, after all it is an Iphone right? So\nif you want a cheaper Iphone with spects blindly go ahead gor this.\n\n", "I'm posting this review in my IPhone SE.  \nThank you very much for amazon for providing this genuine phone less than 20k.  \nPhone is awesome, no performance lagging, good camera decent battery back up!!  \nOveral compact \"power house\"  \nIf u want to have iPhone around 20k, please go ahead without any confusion!\n\n", "Awesome product ... never fails to deliver ... best in the class... form\nfactor is great. Classic design packed with smashing power makes a product\nwhich is truly remarkable.... love it\n\n", "The battery of the phone has swollen with just a month and half of use.\nHorrified to see the phone swelling at its joints. Returned to the Service\ncentre. Hope they replace the phone and ensure better quality.\n\n", "All of us wants to have apple phone! I guess at 20000 price tag it is an\naffordable i-phone. Features are good although not latest. However, it is more\nthan enough. Speed is really good. The exchange offer was also available,\nwhich helped me to exchange my old phone as well however exchange rate was\nquite low.  \nOverall it is a good product at this price tag.\n\n", "Best deal made with apple. Small but powerful. Only drawbacks - single sim and\n1.2 front MP camera. Rest everything top notch. Every thing can be done using\none hand.  \n26000 was a bit too much already. Thanks to Amazon who reduced the price to\n18000 which one can say is the best price for the phone.\n\n", "It's small but power packed. Everything about this iPhone is good. I love it's\ndesign more than my iPhone 7  \nThank you Seller for quick delivery. The product was in good condition though\nthe packaging was not protective. May be all the mobiles were shipped in\nprotected container during big billion sale.  \nVery happy with the product\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 February 2018", "on 15 December 2017", "on 2 January 2018", "on 18 March 2018", "on 19 August 2017", "on 3 January 2018", "on 31 January 2018", "on 20 November 2017", "on 3 January 2018", "on 10 November 2017"], "reviewer": ["Amazon Customer", "Debabrata Das", "Sachin Goyal", "Amazon Customer", "Shivakumar S", "gajender", "SPS Dhaliwal", "Sourav Neogi", "Divyank", "Dr. Shashank"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Product was good but amazon service was very bad", "My headphone jack not working", "Superb Quality with Awesome performance!!!", "Four Stars", "Buy this if u want a phone.", "Five Stars", "Took the phone out to use in my trip abroad ...", "Perfect Deal for this FALL.", "Pocket friendly phone with great hardware!!!", "Excellent mobile"], "review": ["Product was good but amazon service was very bad .... It was mentioned that NO\nCost EMI but interest is applied there.\n\n", "My headphone jack not working plz help me Apple store.. I expected ur service\n\n", "Awesome phone, even after used to 5 inch screens, this phone with 4inch screen\ndid not made me to regret my decision. Looks very stylish and compact.  \nUsing it for about 3weeks, Performance wise not even a single instance had\nheating issue or apps hanging. Camera quality is damn good especially Live\nPhotos. Front cam is on par with 8mp cams of other brands. Music lovers will\nfall in love with this phone instantly.\n\n", "Excellent product. super voice channel. I am very satisfied with the product.\nVery comfortable as i use this mostly for voice call , scheduling my tasks.\nVery handy.\n\n", "I got this phone for 20k.In this price range the processing power,usability\nand camera performance are top notch.I'ev being using this mobile for a month\nthe battery life is consistently good i.e 16hr of mixed usage..The best part\nabout having this phone is the feeling of not having it as it's very light in\nthe pocket...Feels good in the hand too....\n\n", "Masterpiece. Amazing Amazon service.  \niPhone and Amazon extraordinary combination.  \nI was android fan , this is my first I phone. After using for two days , find\nthis phone is way ahead of android and beyond comparison and highly secured.\n\n", "Took the phone out to use in my trip abroad from 17 October for local number\n,cameras and sound has issue and it doesn't catch 3g or 4g properly ,please\nreplace\n\n", "Guys just go for it. It’s a blend of IPHONE 6S “inside” and IPHONE 5S\n“outside”. Pretty good deal got it for just 15K with exchange. can easily come\ndown for a couple of years. Thank you amazon.\n\n", "Great phone from Apple, no lag whatever you throw at it!!! Great camera and\nscreen. The size of screen and pocket friendly phone is perfect for travel in\nMumbai train. Battery lasts entire day after regular use.  \nThe selfie camera is a downside but not much of concern for me\n\n", "i got the mobile on 22 august as mentioned.till now i am not facing any heat\nor any issues. this is my first ios after 4 android mobiles. \"i can feel the\nbrand name apple\"😜😜\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 January 2018", "on 11 August 2017", "on 22 August 2017", "on 29 August 2017", "on 13 September 2017", "on 20 August 2017", "on 3 November 2017", "on 3 December 2017", "on 12 August 2017", "on 25 August 2017"], "reviewer": ["dinesh k.", "Amazon Customer", "Praveen", "Bangru", "11_techie", "Nagarajckm, Bengaluru. ", "Amazon Customer", "Prashanth MS", "Bhavik Kansara", "Ganesh"]}
]