[
{"rating": ["2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Amazon service good, product faulty though..", "One Star", "Great iPhone with all the latest features at an unbelievable price", "Scratch on Screen", "Missing accessories", "i Got a tempered product", "In love with my new iPhone7", "Product is good and I had paid through my credit card of ...", "Excellent phone- avoid jet black", "Worth it"], "review": ["Delivery was on time, product is legit with a proper Indian warranty as well.  \nBut the iPhone 7 I got has a 'microphone' issue, giving a hissing sound in the\nvoice calls and video recordings... Trying to sort out with the apple service\ncare, though they r taking a long time\n\n", "At high volume, during call voice from the speaker is very low, it is not\naudible. It seems iphone is faulty.\n\n", "The Apple iPhone 7 (Black) is a step ahead from the previous iPhones. I\npreviously used the iPhone 6 and this one has a lot many new features like 3D\nTouch, Force Touch, Live Photos and the phone is a lot more faster too. The\nnew iOS works swift and fast and is very suitable for the the 7. Amazon\noffered a great deal on the phone during Diwali and I got it for about 37,500.\nAmazon delivery was straight up; the phone was seal packed and retains the\napple 1 year warranty. The matte black is a great colour, relatively harder to\nscratch than the jet black version too. This one has a very subtle look to it;\nun-exagerated and un-boastful in appearance.  \n  \nFor new iPhone users, this is a competitive price to start off with the iPhone\nexperience. Apple makes very simplistic designs and has a clear philosophy.\nThe phone does not allow for much customisability options but in itself is\ncontent.  \n  \nGreat deal made the Diwali a happy one.  \n  \nProduct Quality: 10/10  \nPrice Value: 10/10  \n  \n-soothsayer\n\n", "Phone is brand new, but came with a scratch on the top. That's unbelievable\nhow a scratched product packed in sealed box. Checked warranty online which is\nvalid till 30th Dec 2018. Phone was turned on at 31st Dec 2017. Warranty is\ncorrect.\n\n", "Very much disappointed with the package. Earpods with lightening connector and\nlightening to Headphone jack Adapter is missing , I could not Cross step 2 of\nthe return section .Please provide the way to reach you . It would be of great\nhelp !!\n\n", "i Got a tempered product. Service center denied to service my phone because it\nhad a missing covering which is black in color and is above the logic board.\nRequesting amazon to replace the product and expecting that they will do so in\ninterest of the company and enjoy good reputation.\n\n", "Phone is awesome. Phone design, look is great. Someone said Apple 2 GB RAM =\nAndroid 4 GB RAM. It’s true.Apple camera clarity is really good. apps loading\ntime is very quick and so fast. Battery back up is satisfactory. I’m\ncontinually using mobile with Mobil data on, phone could long last for 1 1/2\nday. Fingerprints sensor is very fast & accurate . It protects even Paytm\nwallet. display is good. EarPods are amazing. Love you apple .\n\n", "Product is good and I had paid through my credit card of Standard Chartered\nBank and I have paid in scheme of 6 instalments interest free which was\noffered by Amazon at the time of payment but my bill of credit card is showing\nthat there that I have to pay the full amount and there is no interest free\ninstalment. I will request Amazon to look into this matter and inform me.\n\n", "Well to top it off the phone is quite good and is a delight to use...but dont\ngo for the model in jet black...the glossy finish looks good but eventually\nyou will get white spots on its back if you use a cover and the sppts just\nspoils the jet black experience for you...the issue of ehite spots can be\ncross checked on apple site as various consumers have complained about\nit...guess the review helps\n\n", "I had been using this phone for the past 7 months so can give you my\nperspective.  \nI Had been using Android flagship( that too a nexus) for over past few years.\nAnd that nexus was unusable after 2 years.  \nAnd on top of that Google stopped android updates after 2 yrs of phone's\nrelease which was main driving force for me to switch over to Apple.  \nAnd that decision could never have been better.  \nSo coming to phone itself,it's amazing. Let's list them as pros and cons:  \nPros:  \n1.UI is buttery smooth  \n2\\. Camera is great with snappier response.  \n3\\. Processor is way ahead of the Android counter parts.  \n4\\. Many Ios apps are better optimized than. android versions.  \n5\\. Dust and water resistant. (IP67)  \n6\\. Thin,light and amazing for one handed use.  \n7\\. Great battery life can last you a day easily with moderate to heavy use.  \n8\\. Future ios updates are guaranteed unlike in case of Android.  \n9\\. Best IPS panel in the market with spectacular viewing angles.  \n10\\. Call quality is best in class.  \n  \nCons:  \n1\\. Low resolution screen (720p)  \n2\\. Kind of limited flexibility as compared to android (which is a trade of\nyou have to make if u buy ios devices)\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 August 2017", "on 12 October 2017", "on 28 October 2017", "on 2 January 2018", "on 29 January 2018", "on 10 February 2018", "on 2 October 2017", "on 11 November 2017", "on 22 February 2018", "on 4 March 2018"], "reviewer": ["Vijay Shinde-Amazon Customer", "N SATISH KUMAR", "soothsayer", "DareDevilNomad", "mohamed fazil", "Saurabh Srivastava", "vijay", "9830086052", "puneet", "Saurabh"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["iPhone and Amazon Amazing!", "Got black matte black", "Five Stars", "Worst buy so far - iPhone 7", "Awesome phone", "Awesome", "Glad with the product and the delivery!", "Five Stars", "Not Happy with Phone Quality", "Five Stars"], "review": ["Amazon’s customer service was so great, product arrived with excellent\nprotection and way earlier than expected date and time. Have been using the\nproduct for months now and never faced any hard feelings.\n\n", "Worth buying it. New home button is amazing. Good phone just bought from\namazon . But delivery was some late anways phone is great . :)\n\n", "Always the best. Slim & Light Weight  \n  \nBattery Life :: one day  \nPerformance :: So good\n\n", "I think it is a refurbished one. for the past couple of months the performance\nhas been so poor and for the past 2 days, the speaker is not working. I am\nreally worried if I can get it replaced or repaired.\n\n", "Excellent phone; brand new with full warranty as checked online ; perfect\ncamera; powerful battery life; aesthetic design and great performance. No\ncomplaints whatsoever. Got jet black 128 GB below 50 K.\n\n", "Awesome 😊 Lovely! This one os superb and performance is also good.\n\n", "One of the best phones of iPhone. Have been using it for over a month and have\nbeen impressed with every feature.  \n  \nPacking was intact. Received the product on time too. Very happy with the\nproduct and the delivery.\n\n", "\n\n", "Call receivers and callers to this handset cannot hear properly. I have to\nvisit Apple Store to get it repaired. I am not sure if this will be covered\nunder warranty. This was not expected from such a high brand value product!!\n\n", "very gud performance original product\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 November 2017", "on 28 January 2018", "on 20 November 2017", "on 6 February 2018", "on 3 February 2018", "on 29 September 2017", "on 2 December 2017", "on 26 September 2017", "on 10 November 2017", "on 3 December 2017"], "reviewer": ["Sarnath Jegadeesan", "ashu sharma", "varishta das", "Sidhartha D.", "Abhishek", "Shani Deshwal", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Rishabh Jain"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Amazon Sale is The best :D", "Great product & genuine seller", "Got new iphone 7 jet black product is awesome and genuine work amazing", "Great phone", "Android to iOS a smooth transition", "Nice product", "Apple iPhone is the best in the world.", "Who is selling defective product apple or amazon seller?", "Five Stars", "Amazon service 👌"], "review": ["I think this is the best thing that is worth of 42K and no one will ever\nregret it after purchasing this piece of beauty and that too in a SALE :D :D\n:D :D\n\n", "The product was delivered in one day. The only thing was I had to pay for that\ndelivery.  \n  \nProduct is super awesome. You can trust the seller received a genuine product\nincase of me it was a jet black phone.\n\n", "Got new iphone 7 jet black product is awesome and genuine work amazing. Hope\nno problem will occur in future get it in 42k.\n\n", "It one of my favourite mobile I got in this Diwali it’s work good and worthy\nproduct for the price I happy with that.but only think they delivery tha\nproduct it’s to late I force and demanded for the day fully finally at the\nnight only they given.the packaging phone without any safety they put in\nnormal box tat really unexpected\n\n", "Was worried if I would lose data while changing phones however thanks to move\niOS app everything was smooth.\n\n", "I purchased this item in great Indian sale at a very good price it was\ndelivered to me very next day. I am really happy with this purchase.\n\n", "Apple iPhone is the best in current time. Gold model of Apple iPhone is pretty\ngood. In iPhone your data is more secure instead of android. People want\nsecure to his data and which feature is available only in apple iPhone.\n\n", "Worst product for 40,000 cost.Can you imagine,IPhone get stuck while watching\ndownloaded VDO?Playing game with this phone is a nightmare because it ll\nliterally burn your hand if you play continuesly for 30-40 min.Approximately I\nam restarting my I phone7 weekly 3 -4 times due to phone Hang.\n\n", "Got original Iphone with nice packaging, using last 2 month and it is very\ngood product, thanks amazon.\n\n", "I am very happy with amazon replacement service first I have received damaged\nsim tray phone I sent a mail to amazaon team they arranged the new phone it is\nworking fine everything is good thank amazon\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 July 2017", "on 20 October 2017", "on 1 December 2017", "on 21 October 2017", "on 17 October 2017", "on 13 August 2017", "on 30 September 2017", "on 20 March 2018", "on 15 November 2017", "on 23 December 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "pchari30", "Amazon Customer", "Sunny", "Gurmandeep", "PRAMOD RWT", "S M.", "Amazon Customer", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Delivered in good condition under exchange", "Product is bad, dissatisfied with the performance", "Good phone", "... this product one day early and product is very nice and beautiful looking", "Amazing Phone!", "It was initially a minor problem which I never bothered but now its been one year i m using this the software has gone bad to worse and it has been a bad experience ...", "One Star", "Not happy", "I love to listen music", "Nice phone."], "review": ["Delivered in good condition under exchange. Working well. Truly a phone with\nlots of features. Experience is far better than Android with amazing picture\nquality that matches good cameras. Easy to install and transfer from old\nAndroid phone than before.\n\n", "Product is bad, dissatisfied with the performance. Excessive issues, battery\ndraining with minimal usage. Order page states, product can be returned within\n9 days, but am unable to return the product, are not getting the option. Can\nAmazon please look into it & help?\n\n", "Received phone in good condition on time. Have used it for sometime. No\nproblem has occurred till now. Would recommend.\n\n", "Got this product one day early and product is very nice and beautiful looking.\nJust have a doubt that this have bluetooth and apple generally don't give this\nfeature.\n\n", "One of the best phones! From camera to the design to everything small details.\n\n", "its been one year i bought this phone on Amazon but ...I m having trouble with\nthe software of the phone , it feels really sick to use the phone which\nstarted getting hang from the very beginning. It was initially a minor problem\nwhich I never bothered but now its been one year i m using this the software\nhas gone bad to worse and it has been a bad experience to buy the phone .\n\n", "White spot is there on the screen\n\n", "Not a good phone delivered battery draining very fast and phone getting heaten\nup\n\n", "I love to listen music..product is good but i cannot plugin my sony ericsson\nheadset.. I am receiving a message iphone doesn't support this device though I\nhave used it with iphone 4S and other phones..I guess there is a problem with\nlightning to 3.5mm adaptor.\n\n", "Nice phone.. I am an avid iPhone lover so needless to say, haapy with the\nproduct and service of Amazon. Been an iPhone user since 4s days.. 👍👍\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 October 2017", "on 12 December 2017", "on 31 December 2017", "on 24 September 2017", "on 5 August 2017", "on 16 March 2018", "on 3 September 2017", "on 8 October 2017", "on 3 October 2017", "on 9 December 2017"], "reviewer": ["Naveen Madan", "Naveen Setty", "daga r", "Ashutosh U.", "Madhu", "Rakshinder", "Deependra Choudhary", "jatin v kapil", "Amazon Customer", "Suhash Vats"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best iPhone ever", "Perfectly Packed & Original", "Four Stars", "The best phone ever!!", "We have to carry power bank.", "iPhone 7 - Go for it", "Heating issue..but just go for it..", "The experience is not at all that great. I can see flaws which apple customer care ...", "Five Stars", "Amazing device"], "review": ["This is my first time buying iPhone, All I can say is buy it and you will have\nbest experience ever. I love the matte black & I am glad that I choose this\ncolor over silver iPhone :)  \n  \nIf you are buying for first time then I suggest iPhone 7 is the best.  \n  \nIt's simply awesome.\n\n", "Timely Dlvrd....... And what more to say on Apple :-)\n\n", "Its awesome phone. But a couple of times, i felt a little lag while using some\napps.\n\n", "Just one thing - \" If you don't have an iPhone, you don't have an iPhone!\"  \n  \nAs Apple puts it - \"Its the best iPhone we've ever made\". Agreed!  \nThis is without a doubt the best iPhone and the best phone out there!! Go for\nit!\n\n", "We have to carry power bank. This mobile has beautiful look only other than\nthat nothing is great. My brother using One plus, And that mobile is the best\nmobile right now in the market.\n\n", "Got this product from amazon Diwali sale  \nOn time delivery  \nPacking was good  \nGenuine product and checked it on Apple website  \nBattery backup is good  \nCamera is excellent  \nVoice call quality is awesome  \nSpeaker sound effect is extraordinary  \nJet black colour makes this iPhone more beautiful  \niOS 11 is working smoothly  \nNo hanging issues  \nNo heating issues  \nFull Charging takes 2hrs duration\n\n", "Thank you amazon for within 3 day delivery.. just got this Iphone 7 black\nyesterday. Everything is good about this phone..but found heating issue while\ncharging..that is why 3 stars only...\n\n", "The experience is not at all that great. I can see flaws which apple customer\ncare denies when i call the support\n\n", "After initial hiccups it’s working nicely\n\n", "There is no competition for any iPhone. iPhone 7 is also a benchmark and will\nremain in hearts of iPhone lover always.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 October 2017", "on 12 October 2017", "on 1 December 2017", "on 16 August 2017", "on 10 October 2017", "on 22 October 2017", "on 28 January 2018", "on 31 October 2017", "on 2 October 2017", "on 26 September 2017"], "reviewer": ["Jaymin", "Amazon Customer", "Amazon Customer", "Mohith", "Srikrishna ", "vignesh", "Raghavendra raju", "Nitish Goel", "Amazon Customer", "achint"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Cool, battery backup is not so great as they ...", "Fragile screen", "... days after my shopping the prices has fallen down Like anything, I feel not good", "Bad Experience : Excessive Heating Problem when switching on the location.", "Poor delivery and unwarranted product", "Got it at a nice price, 👍 The only thing is you might ...", "Awesome phone with a better battery than most of the ...", "Very satisfied", "Five Stars", "Iphone 7 heating issues"], "review": ["Cool, battery backup is not so great as they tell/told. Mobile performance is\nbest so far  \nBut, @Amazon, you have need to improve delivery speed. Try to deliver at leat\nfor the day of estimation\n\n", "Im using from past 8months .phone is awesome.but Poor and fragile glass\nShattered by a drop from 5feet height.its also porne to scraches easily just\nby placing on table.  \nBattery life is (18hours with jio sim with mobile data on) and (8hours with\nbsnl sim mobile data on)\n\n", "Product meet my expectation but when I saw within 2 days after my shopping the\nprices has fallen down Like anything, I feel not good. Price of my product\nreduces from Rs. 46900 to Rs. 40000. I have loses nearly Rs. 6000/-.\n\n", "Phone is heating excessively when I switch on the location. It seems that the\nphone will blast. I am not happy with Apple iPhone 7. I don't know whose fault\nit is Amazon or APPLE, but unfortunately I lost my money.\n\n", "Belated delivery and phone is dead now . Within a one month , how can an apple\niPhone can be dead without any physical damage ... it is jolting ...\n\n", "Genuine product, checked it on apple site. Delivery on time. Got it at a nice\nprice,👍 The only thing is you might want to consider buying oneplus phones if\nyou're looking for a better camera.\n\n", "Awesome phone with a better battery than most of the Android phones. Trust me,\nit's worth every penny u pay for it. Software n hardware sync superbly. Camera\nis as good as a dslr. I very strongly recommend Apple instead of the boring\nAndroid.\n\n", "Writing this review with this device. On time delivery and I checked the\nserial number on apple's website, the product is geniune. Great job, keep up\nthe good work.\n\n", "No comments!! Because all people are well known fact i.e. Apple\n\n", "The Iphone 7 is having heating problem in below conditions . 1-while charging\n, 2-Even when the phone is idle . Contacted apple i support and they could not\nresolve the issue till now.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 November 2017", "on 13 February 2018", "on 5 October 2017", "on 3 November 2017", "on 2 August 2017", "on 4 November 2017", "on 3 November 2017", "on 25 January 2018", "on 11 October 2017", "on 13 November 2017"], "reviewer": ["Amazon_Customer", "amith", "Anup Singh", "Anuj Sinha", "Amazon Customer", "Amazon Customer", "Raghu Chandrashekar", "manat madaan", "Anchen", "M ANAND DEEPAK"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Awesome phone iphone 7 black", "Awesome deal", "Recv on time as a prime customer, everything as ...", "A good phone. A defective piece.", "the product is as good as it was expected", "EXCELLENT", "Few items not received.", "One of that best devices apple had kept up til", "Five Stars", "Good"], "review": ["Awesome phone iphone 7 black!!! My first IOS experience is really better and\nexploring new features every day but a lil bit concern about scratches on the\nfront and back!!! Tempered and cover must!!!\n\n", "Got the product at 39k (available on apple website at 49k) along with 10% cash\nback with a 3 month emi holiday. Great deal\n\n", "Recv on time as a prime customer, everything as per indication. Definitely  \nprefer the iPhone 7 over 8 for the price difference or features.\n\n", "This is a good phone, great experience but I received a defective piece. Apple\nservice center didn't help either.\n\n", "Impeccable service from Amazon.in and team... Ordered it on 07-Oct-2017 and\nreceived it on 08-Oct-2017!!! And of course, the product is as good as it was\nexpected... It's iPhone 7 after all. Cheers!!!!\n\n", "Excellent build quality. Apple after all.\n\n", "I received the phone in a seal packed box but haven’t received Ear Pods with\nLightning Connector (wired), Lightning to 3.5mm Headphone Jack Adapter. Plus\nthe volume in the speaker is too low to listen.\n\n", "One of that best devices apple had kept up til, Bought for great value for\nmoney on amazon. totally satisfied with delivery service of amazon and product\nfrom everyone.\n\n", "As expected, iPhone never disappoints.\n\n", "Good. and got the original and genuine phone.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 October 2017", "on 24 September 2017", "on 1 December 2017", "on 23 September 2017", "on 10 October 2017", "on 26 August 2017", "on 14 February 2018", "on 1 December 2017", "on 31 December 2017", "on 5 August 2017"], "reviewer": ["Gautam Jain", "Hitesh Kalia", "Amazon Customer", "Salil S.", "Siegfrid Sangma", "LD", "Nishant Patel", "Kaushal Gosai", "KCP", "Anil"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Does what it needs to do !!", "amazon is very bad", "Camera shows black shade", "Compact and elegant. Decent battery life. Need a ...", "Contents Missing", "GO for IT mAN", "Duplicate", "... than that phone works perfectly Battery life is very good giving around 5", "Five Stars", "I purchased I Phone Jet Black. The phone is ..."], "review": ["It does what it is meant for. Dropped my iPhone and it which to default. I\nguess if it was a dark blue in colour it would have looked much more classy.\nBut still worth to buy for what it is meant for.\n\n", "I received defective product.  \nAND AMAZON SERVICE TOO POOR\n\n", "The rear camera of my iPhone 7 is showing black shade (about 3-4 centimetres\nin diameter) while capturing photos or videos.  \nNever expected this from Apple I am switching to some other brand after 6\nyears of being Apple user.  \nVery disappointed with Apple.\n\n", "Compact and elegant.  \nDecent battery life.  \nNeed a case to protect the phone.\n\n", "The iPhone7 did not have the 3.5mm headphone jack adapter & ear pods with\nlightning connectors. They were missing from the box.  \nThe phone catalogue says it includes with the phone.\n\n", "Perfectly delivered by amazon. captured by this I phone 7 very happy with the\nproduct  \nDon’t see rumours initially I was also worried that if I get fake phone or\nbroken but I reviced real phone trust blindly on amazon loved it ❤️❤️❤️❤️❤️\n\n", "agar aap ko iphone amazon.in se kharidna he to aap ready rahiye agar aap ka\nseller aap ko duplicate accessories sell karta he ya aap ki accessories and\nphone kaam karna band ho jata he to aap ko apple service centre se koi help\nnahi milegi. Woh log ek hi answer dege k hamne apni website par dala he k\nflipkart is authorised seller of iphone in india\n\n", "Using it for more than one month no problems at all iOS 11 is still has some\nbugs others than that phone works perfectly  \nBattery life is very good giving around 5.30 screen on time with mobile data\nis turned on all the time  \nGo for it if you want a good all round phone  \nBut the lack of headphone jack can be over come by a good wireless headset\n\n", "good and genuine product and about amazon delivery always before time.Superb\nfully satisfied by Amazon.\n\n", "I purchased I Phone Jet Black. The phone is under warranty and the lightning\ncharging cable is not charging. When I took the cable to Apple Authorised\nshowroom they checked the cable and the printing on the cable and informed\nthat the cable is not original. I want Amazon to replace the cable with a\nGenuine one\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 3 August 2017", "on 27 January 2018", "on 16 October 2017", "on 5 November 2017", "on 14 February 2018", "on 9 December 2017", "on 22 February 2018", "on 13 November 2017", "on 29 July 2017", "on 27 February 2018"], "reviewer": ["Arvind Kabra", "sushant slathia", "Shahid AFZAL", "Ganesh Devadiga", "Amazon Customer", "Paras sendri", "Saiyed suhail", "vishnu", "Amazon Customer", "P.Thiyagarajan"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["But I’m happy I was wrong about it", "Excellent and Genuine product delivered on time.", "Remarkable change after my last iphone 4 usage 2 year ...", "Excellent phone. Got in 32500 Rs only", "Just awesome..", "Over heating", "Battery getting hot.", "Issue with phone", "Pathetic battery quality", "Five Stars"], "review": ["Was initially scared to get this online at such a low price. Obviously was\ndoubting the credibility of the seller. But I’m happy I was wrong about it.\nGot an excellent product, at a very good price. Couldn’t have been happier.  \n  \nAwesome job on Amazons side for delivering it quickly.\n\n", "I know I would buy only from Cloudtail or Rocket Kommerce LLP.  \nThe product delivery was before time and in excellent condition.  \nIt is 100% genuine and I have no issues so far, using it close to a month now.  \nIf you are buying it please go atleast with 128GB variant, the gold one looks\nsuperb, but so is the silver one as well.\n\n", "Remarkable change after my last iphone 4 usage 2 year ago. Still battery is a\nconcern for iphones, i do not know about iphone X, iphone 8.. still needs\nimprovement in this area by apple..\n\n", "Got the phone in 2 days. About phone review. I think it is i phone so need not\nto review. I was earlier usine 5s but there is huge difference between 5s &\n7\\. It is osam. I got in 32500 rs with exchange in deewali offer (original\nprice was 38900) thanks Amazon\n\n", "This was the first iPhone that I have owned but I have gone through a lot of\niPhones in the past. One the best phones I have seen in recent times. The\nbuild quality, the smoothness with which it works and the features it has is\njust simply superb. The camera is so good that it can almost compete with a\nDSLR. Thank you Amazon... I was a little upset with the packaging of the\nproduct as it was shabby but the iPhone box was not damaged.\n\n", "Heating issue is troubling me a lot. I am really sad to say this for my fav.\nPhone brand. Had been using iphone from years but never faced this heating\nissue for brand new phone.  \nPhone is getting hotter in just keeping it to charge or to using phone for\njust 10mins only. Really disappointed. I will try to get this exchange/return\n\n", "Wring the review after almost 6 months of purchase my iPhone 7. Battery life\nso weak and getting hot. Sent for istrore for replacement. Very unfortunate\nfor Apple.\n\n", "hi,  \nI have purchased this phone (iphone 7-32 GB) on 19 march with 1 year warranty.  \nNow the issue i am having is the phone is not turning on , screen is like\nblank not working even the charger is not working and this happen that too\njust within 7 months from purchasing.  \nNeed Help please asap where to contact ?  \nThankyou\n\n", "The phone battery drains so fast, even when WIFI and Bluetooth are switched\noff. The battery doesn't even last a full day. Less than 6 months of usage,\nthe phone died on me today. It just refuses to charge. Don't know what the\nproblem is.\n\n", "Super deals... but mere ko amazon cash back nahi mila ... jab maine ye liya\ntha tab 1500 rs cash back tha by amazon pay bank pe... but mujhe vo abhi tak\nnahi mila..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 September 2017", "on 13 December 2017", "on 26 September 2017", "on 19 October 2017", "on 15 August 2017", "on 27 January 2018", "on 1 July 2017", "on 8 November 2017", "on 7 January 2018", "on 3 December 2017"], "reviewer": ["Sourav Basak", "pabitra padhy", "Viswanathan", "shrikesh", "Arnendu Chakraborty", "Rohini Prasad", "DR. SRIBAS GOSWAMI", "baljot", "V L Subramanian", "Ashok kumar"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Experience the Elegance", "Glad to have bought the iphone on Amazon", "Awesome but do not use it without case cover", "Best phone in the market", "Improved battery backup", "When it comes to iPhone you can trust Amazon", "Apple iPhone 7 found bend", "2 Thumbs up!!", "Superb seller and item", "Awesome!!!"], "review": ["My 1st iPhone. It took one day time to get used to iOS as I was an Android\nuser earlier. Whatever work you perform with this mobile you can feel it's\nquality. Call clarity is amazing. Camera clarity and music are truly\nexcellent. Inhand you can experience the elegance. Happy for buying this\n@38000 rupees in a flash deal.\n\n", "Excellent phone. Light weight and classy. I was only worried about a\nrefurbished iphone being sold as new. But the phone was new and am very happy\nabout it. It arrived early too. Worth buying it during the shopping festival.  \nOnly challenge would be to move data from the old phone which I think no one\nhas mastered yet.\n\n", "Its looks and feels like awesome. The phone is light in weight easy to hold\nbut its a little bit slippery so be careful the.  \nPerformance is too good compare to iphone 6s  \nRam management is also fabulous  \nBattery backup is better then iphone 6 and 6s slightly its give you more and\nthe charging time is 10-100 in 80-90 min which is good all phone have same\ntiming with default charger.  \nCamera is too good both front and back.  \nEverything is just fine who those wanna buy iphone 7 I’ll suggest you to buy\nthis beauty without any fear m really soo happy with that.  \nAnd one thing i put this phone on my desk for a while without any case cover\nI’ve noticed that the scratches are clearly visible so guys please take care\nof it\n\n", "Truly a class product by apple  \nThe camera is upto the mark. Full marks to the image stabilization. You get\nclear pictures even with a shaky hand  \nGreat Ram management even at 2GB. Where android phones fail even at 4 GB RAM  \nThe interface is really cool now with ios 11  \n  \nBuild quality is very premium as always\n\n", "Working super....its been over two months i am using it..battery backup has\nimproved a lot especially in comparison to the previous iphones\n\n", "I bought this phone on big billion days , got it at great price.  \n  \nA genuinely new product and flawless delivery .\n\n", "Worst product delivered by amazon .  \nAfter 15days phone automatically found Curved due to extra heat during inside\nbattery heat up .  \nI suggest try to buy from autherised store not online  \nEspecially Apple product.\n\n", "Absolutely 100% Genuine product, One day delivery, Buttery smooth OS,\nUnbeatable Price and a Great phone. 2 Thumbs Up to Amazon......\n\n", "I just love the product. Fell in love with the quality of the iphone. Its soo\nsmooth that you won't feel its even there on your hand. The curved edges are\nthe best while having the grip. It just fits in your hands like they are made\nfor it.  \nOther than that a big salute to the seller. The packing was good, the delivery\ntime was impressive just took 3 days to receive the item. Hope to shop with\nthis seller more. Love to hear back from the seller as well. ☺️ If there's any\ndiscount 😅\n\n", "Perfect phone with discount. Thank you so much Amazon!! I'm loving it\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 January 2018", "on 25 September 2017", "on 16 March 2018", "on 6 October 2017", "on 18 July 2017", "on 5 December 2017", "on 8 December 2017", "on 13 December 2017", "on 26 August 2017", "on 22 September 2017"], "reviewer": ["V L Narayana", "Rajkumar Chandran", "Umair Deshmukh", "Sagar", "subhajeet roy", "Amazon Customer", "RK Badatya", "Madhukar S.M.", "Rahul", "Chandra"]}
]