[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Five Stars", "Five Stars", "BEAST", "Five Stars", "A “ Wow” factor!", "4 years of making this designe is best", "Five Stars", "Five Stars", "Really awsum phone & also the delivery"], "review": ["Excellent product. Manjeet singh\n\n", "It’s a great mobile. Can I get invoice to my e-mail I’d.\n\n", "Truly a gr8 smartphone\n\n", "It is well said that “it’s not just a phone, it’s an Iphone”  \nAnd this is an Iphone 8 ❤️  \nThis A11 chip is insanely fast, It’s a beast in performance.The 2gb Ram of\nIphone 8 equals 8gm Ram of One Plus 5t.  \nI know you won’t get a dual camera with portrait mode but I don’t think anyone\ncares about that cause it’s too cliche. The 12 MP Rear Camera of this phone is\njust Flawless and Beautiful.  \nYou’ll get great High Definition pictures with this phone.  \nMultitasking and high performance gaming is very smooth.  \nI know it’s a whole lot of money as you can get One Plus 5t  \nGalaxy A8  \nGoogle Pixel 2  \nBut *TRUST ME* its *Worth Every Penny*  \nDon’t Upgrade if you have Iphone 7 or 7plus  \nBut anything under that is worth upgrading.  \nIt’s been 1 whole month with the Iphone 8 and I’m loving it, the Battery\nBackup of this phone is great, 100% in the morning goes on till night for\nLight Usage.  \nThankyou\n\n", "Timely Delivery and Excellent product!!!\n\n", "Amazon + Apple = Amazable\n\n", "Best in class at this price range!!\n\n", "Its an awesome phone\n\n", "It is ok\n\n", "First of all very much pleased with the amazon delivery. Thanks for the\ndelivery a lot before time cz of which u made my Diwali spcl.And about the\nphone I guess there nothing much to say as everyone knows wat Apple brand is n\nthey have lived up to the expectations as always. This phone is just a\nbeast...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 October 2017", "on 29 December 2017", "on 3 January 2018", "on 20 February 2018", "on 31 January 2018", "on 5 December 2017", "on 18 January 2018", "on 14 January 2018", "on 12 November 2017", "on 26 October 2017"], "reviewer": ["manjeet singh", "Mohammad Tariq", "Rajeev Rai", "Aman", "Vasanth Sasidhara Kurup", "Amazon Customer", "Bappa", "Avi Puri", "LALIT HANSRAJ GELRA", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Awesome product!!", "Make fool pathetic", "Iphone 8 speed is good as compared to the earlier versions", "It's a defective product. Please exchange it or refund ...", "Defected phone", "Five Stars", "Excellent phone", "Five Stars", "Outstanding phone. Great Seller", "Greater than good"], "review": ["As expected 8 rocks!!\n\n", "Very pathetic make fool\n\n", "Iphone 8 speed is good as compared to the earlier versions. Nice glass finish\nbody makes it more attractive. Additional security features makes it a WOW\nproduct.\n\n", "It's a defective product .  \nPlease exchange it or refund my amount.\n\n", "Got defected iphone and its not even return easily..\n\n", "Loved the phone, entire experience is very nice\n\n", "Excellent phone with fastest processor and exceptionally great camera. Battery\nlife is improved\n\n", "Superb Phone\n\n", "Delivered in one day with prime. Awesome phone. Got at an amazing\nprice...Great overall experience...\n\n", "Greatest\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 March 2018", "on 14 March 2018", "on 31 January 2018", "on 2 January 2018", "on 27 January 2018", "on 2 March 2018", "on 28 January 2018", "on 16 October 2017", "on 21 January 2018", "on 22 December 2017"], "reviewer": ["Viren", "Sunil rana", "Manesh", "Arif khatri", "Rohit Kumar", "Amazon Customer", "Simar", "KRIPAL SINGH", "Ankit Das", "Yashvant"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Best we can get 😍😍 im in love with this", "Received defective accessories", "Apple Fan ;)", "My opinion on a 50-60k handset, with a brand name-Apple", "Missing earpods from the I phone box - Highly deplorable", "Great phone!", "Amazon is good", "Five Stars", "Three Stars", "Buy only if you want to upgrade to newest Iphone.. Iphone 7 will also do.. Make sure once you do payment, you get confirmation."], "review": ["The best we can get in phone category. Im using this for about a year and\nconcluded this  \n  \nPros  \nSpeedy processor  \nClass-leading camera  \nWireless charging  \nSlick software  \n  \nCons  \nDated design  \nFast charging costs extra  \n  \nPOWERFUL PERFORMANCE THAT’S AHEAD OF THE PACK .  \nReally im in love with this phone .  \nIf you find this opinion helpful please hit the helpful vote button\n\n", "After paying 60K for iPhone received defective accessories. Don't buy a\nexpensive product through online shopping.\n\n", "I purchased this iPhone on 7th dec,2017  \nI’m reviewing it after using almost 3 months.  \n  \n1\\. The battery is not incredible but it’s good for heavy users, I use data\nwhole day and listen songs . It comes for 16-18 hrs easily.  \n  \n2\\. performance, You won’t find any lag anywhere. It is the best. I installed\nalmost 150 apps with asphalt, fifa, NFS etc. No lags just smooth.  \n  \n3\\. This is not imp but i felt the music while listening with earphones very\nrealistic. The experience is different.  \n  \n4\\. Space 64gb is perfect.  \n  \n5\\. There any many hidden tiny features in this phone which make your life\neasy.  \n  \nIf you like small screen and confused with buying 7 or 8, take iPhone 8.\n\n", "In top 3 most powerful phones till now, one of them is iPhone 8.  \n  \nThe battery seems fair with more than a day back-up..the phone’s design is\nseeking some doubt on build-quality because of its fine glass finishing. But\nif you have a good back cover, No worries....  \n  \nCamera(i have compared the quality with several dual cam phones),dispaly and\nmemory management is at its best for my usage. Audio also looks good.  \n  \nSince i have no wireless charger,no comments on that.  \n  \nAnd you know, the phone’s cost, only if you are confident to buy, go for it.\nWon’t dissatisfy you.  \n  \nLoved the phone not by the brand, but by what it has...\n\n", "I have ordered an I phone 8. But the earpods are missing. It is absolutely\ndeplorable from a firm like yours. We expect you to find a remedy as quickly\nas possible.\n\n", "Super and awesome phone. don't read useless reviews and close your eyes then\nbuy it.\n\n", "Iphone 8 is as per expectations and Amazon delivery is also superb.\n\n", "Excellent phone\n\n", "Super third class battery life. The battery lasts only 4-5 hours. Repenting\nbuying the phone\n\n", "Nothing exceptional when compared to Iphone 7... Had an issue with Amazon with\nrespect to payment. They couldnt sort it out stating that there system is not\nadaptable :-) Funny but true..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 February 2018", "on 24 February 2018", "on 26 February 2018", "on 17 February 2018", "on 28 December 2017", "on 22 December 2017", "on 4 November 2017", "on 4 November 2017", "on 4 January 2018", "on 16 November 2017"], "reviewer": ["Mohit singh", "7745089966", "Anu", "Nandakishor.U.M", "Anilkumar Mannambeth Karikkan", "Abdul jaleel", "Mahesh Yadav", "vaibhav vinkare", "Amazon Customer", "VISHAL MEHTA"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Orignal product received", "Pathetic after sales support.", "One of the best phone", "Charger problem", "Five Stars", "VERY GOOD", "One Star", "Shifting worthy", "Five Stars", "Four Stars"], "review": ["The iphone was original and new. There were no damages. Recived it the very\nnext day of order.\n\n", "\\- Pathetic Customer Service by Apple Service Center. Phone has several\nproblems (1) does not vibrate on ring (2) does not RING on incoming calls (3)\nscreen 'touch' response is sluggish. (4) all apps take 30-40 seconds to come\nup.  \n\\- Made 2 trips to Apple store, 2 trips to Service Centre, 3 chat support\nsessions. Problem persists.  \n\\- Apple Service Center Supervisor in HSR Layout, Bangalore even had the gall\nto say 'Warranty does not apply' to customers in India !!!!!!!  \n\\- Had I bought this phone in USA it would have been replaced without\nquestion. Am unable to use it for last 1 month.  \n  \nNow it is good for just a paper-weight. Am terribly disappointed with this\npurchase.\n\n", "Very good phone, nice battery backup & clarity is superb ( sound & display)\n\n", "I left one star jst bcz of defective charger. I have received a defected\ncharger. Although phone is all good.\n\n", "This I phone is best I phone & Amazon service is a great.. I phone 8 best\n,like,great....\n\n", "AWESOME PHONE  \nCAMERA QUALITY GREAT  \nONE OF THE BEST THING IN THIS MOBILE THAT SPEAKERS SOUND INCREDIBLE.  \nGOOD\n\n", "The product had scratches and the sim pin has already come out.the product\ndidn’t look intact\n\n", "I’m shifting from iphone 6 to iphone 8 ........so this seemed to be a big\nchange.........i cherished the 3d touch ........all new 4k low light camera\nwhich click awesome pic ........and all time powerful a11 bionic chipset adds\nperformance which gives us value to buy this phone........wireless charging\ndoesn’t matter to me but yes the fast charging and the audio voice call\nquality was good.........i prefer this device as it is a compact 4.7 inch\ndisplay rather than buying plus models that are huge and bulky.........……but\nremember if you’re low on budget but want a latest iphone then surely go for\niphone 7 plus because it offers you dual camera and all features in iphone 8\ndespite wireless charging and performance.......\n\n", "Too good. Delivered on time and as shown.\n\n", "So far so good.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 February 2018", "on 16 March 2018", "on 23 February 2018", "on 25 February 2018", "on 9 February 2018", "on 6 February 2018", "on 6 March 2018", "on 10 March 2018", "on 23 February 2018", "on 7 March 2018"], "reviewer": ["Mukesh Sagar", "Amazon Customer", "chand pasha", "Mandeep Singh", "Prasad dusane", "prashant Attri", "Banupriya", "Viyang Chowdhary ", "Santosh", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Must buy!", "Worth buying... Simply Awsome!!! ...", "Completely Avoidable Buying Experience", "Five Stars", "Why iPhone 8 over iPhone 7 and even iPhone X? Here's why", "I give iPhone 8 a 4 🌟", "Amazing", "Five Stars", "Gift yourself an iPhone 8 this fall."], "review": ["It’s amazing\n\n", "Amazing phone and amazon trust an ideal pair!\n\n", "Worth buying...Simply Awsome!!!!!\n\n", "The phone has turned out to be a dud! My iPhone 8 is rebooting continuously\nand Amazon support asks you to contact manufacturer, who will send it to the\nrepair facility in Bangalore. It's a whole new process that will take 7-10\ndays. My advise, never buy a phone online, always buy such phones from\nauthorised stores.\n\n", "Great\n\n", "Got my phone delivered last week, and I am impressed. Below are my thoughts\nabout this product. Views are strictly personal and mean no harm to users of\nother phones.  \n  \nA lot of people are in a dilemma whether this phone is any improvement over\niPhone 7? My verdict: Absolutely YES. First its a newer generation phone with\na more powerful chipset underneath. The difference in price between iPhone 7,\n32GB and iPhone 8, 64 GB model is hardly 11k. So you get:  \n\\- a faster processor(by upto 70%),  \n\\- Better CAMERA(Best camera at launch, improved lowlight images, much better\nimage processing),  \n\\- WIRELESS CHARGING  \n\\- 2x memory.  \n\\- Louder and better quality speaker  \n\\- True tone brightness (helps to protect your eyes, is different from night\nmode)  \n\\- Moreover since its a newer model, apple will provide the support for this\ndevice for 1 year more than iPhone 7.  \n  \nAll this for just 11k more. And since its upto 70% faster than iPhone 7, it\nwill show much better performance in later years as compared to iPhone 7. If\nyou plan to keep your phone beyond 2 years then 8 should be your pick. It can\neasily serve you well for 4 years, and will be on the latest software for at-\nleast 5 years(which is 2022, going by apple's support cycle for current\nphones, example: iphone 5s was launched in 2013 and still gets the latest iOS\n11).  \n  \niPhone 8 vs iPhone X?  \niPhone X is a rockstar, Show stopper. It has got a better camera and all but\nits still costs a whopping 33k more!! All you missout in iPhone 8 compared to\niPhone X is:  \n\\- Dual lens camera (8 plus has it)  \n\\- Face detection (much talked about, though some people prefer the touch id)  \n\\- Bezel less display (Showoff stuff IMO)  \n\\- THATS ALL!!  \n  \nPlus points  \n\\- iPhone 8 has the exact same chipset under its skin.  \n\\- Has wireless charging same as iPhone X!  \n\\- Retains the old tried, tested and loved touch id.  \n\\- Has the same no-nonsense and durable iPhone design that people have trusted\nfor years!!  \n  \nI think that I have emphasized enough on why iPhone 8 is the phone to buy and\nwould not let you down.\n\n", "iPhone 8 Review  \n  \n✔️ DESIGN:  \n• The iPhone 8's aluminium rear has been replaced with a glass finish - which\nfeels impressively grippy in hand - its overall finish is the same as that\nwhich debuted three years ago. This means it does feel somewhat dated,\nespecially when placed down next to Samsung's Galaxy S8, although those fond\nof Apple's go-to design unlikely will have any complaints.  \n• ‎This dated feel is largely down to the chunky bezels that surround the\n4.7in screen, with Apple's rivals - and even Apple itself - making the move\ntowards full-screen, bezel-free devices. This does mean that there's room for\nApple's trusty Touch ID sensor underneath the display, though, which has so\nfar worked flawlessly every time.  \n• ‎Like the iPhone 7, the iPhone 8 is waterproof too, thanks to the handset's\nIP67 certification which means, in theory, it should withstand being dunked\ninto water up to 1 metre for 30 minutes. This has rung true for us so far, but\nwe try and avoid getting the handset too wet given its exposed ports on the\nbottom.  \n• ‎The iPhone 8 is a tad heavier than last year's iPhone 7 at 148g, which we\nfound made it feel more robust. It apparently is, according to Apple, which\nboasts that the glass on the phone's rear is the \"most durable glass ever on\nan iPhone.\" We haven't managed to drop our iPhone 8 yet, but it feels like it\ncould withstand a tumble or two.  \n• ‎Elsewhere on the handset you'll find the Lightning port on the bottom edge\nis flanked by a speaker and microphone, and there's nothing up top. There's no\nreturn for the 3.5mm audio jack, but Apple includes a Lightning to 3.5mm\nheadphone jack adapter in the box.  \n• ‎There's also updated stereo speakers, which make the phone around 25\npercent louder than the iPhone 7.  \n  \n✔️ DISPLAY:  \n• The iPhone 8's display is largely identical to the iPhone 7. And the 6S,\nand, er, the iPhone 6. This means that the 4.7in screen, with its 1,334x750\nresolution, does feel somewhat old-fashioned, not to mention small, compared\nto the likes of the Galaxy S8 and Pixel 2, again, added to by the bezels that\nsurround it. Quality wise, while it pales against its rivals on paper, we've\nno complaints, and it continues to be among the sharpest and most vibrant on\nthe market.  \n• ‎The only real change to the iPhone 8's screen is the addition of Apple's\nTrue-Tone technology that first debuted on the 9.7in iPad Pro. This True Tone\nalters the colour temperature of the display depending on the environment in\nwhich you're in, reducing the harsh blue tones typical of an LCD when you're\nin a dimly lit room.  \n  \n✔️ PERFORMANCE:  \n• Apple's new A11 Bionic chip sits under the hood of the iPhone 8 and, as\nexpected, it's incredibly fast.  \n• ‎Specs-wise, the six-core CPU comprises of two low-performance cores and\nfour high-performance cores, with the regular cores being 25 per cent faster\nthan the previous A10 chip, and the high-performance cores being up to 75 per\ncent faster than the A10 SoC, according to Apple It also comes paired with\nApple's first homegrown GPU, which offers 30 per cent more performance than\nthe A10.  \n  \n✔️ SOFTWARE:  \n• The iPhone 8 ships with iOS 11, naturally, which brings with it improvements\nto Siri, reworked lock screen notifications, a new-look Control Centre and\nApple's redesigned App Store.  \n  \n✔️ CAMERA:  \n• On paper, the main camera on the iPhone 8 is no different to that found on\nthe iPhone 7, with Apple retaining the same 12MP sensor with built-in f/1.8\naperture and optical image stabilisation (OIS).  \n• ‎The biggest changes come on the video side of things with 4K recording now\navailable at 60fps and slo-mo video now 1080p at 240fps - both of which are\ndouble the iPhone 7 and the former is a first for any smartphone.  \n• ‎I tried it out in a variety of different lighting conditions, indoor and\nout, and were impressed with the camera's capabilities - in particular when\nlow lighting is involved, something our iPhone 8 struggled to cope with. This\nis aided by the always-on HDR, which increases saturation while retaining more\nnatural and realistic colours than images shot on the Note 8, for example.  \n• ‎The biggest changes are seen on the video side, with 4K recording now\navailable at 60fps and slo-mo video now 1080p at 240fps - double what the\niPhone 7 has on offer.  \n• ‎On the front of the phone you'll find a 7MP camera f/2.2 aperture, Retina\nFlash and 1080p video recording, and while this isn't as great in low-light as\nthe rear-facing snapper, it's perfectly good enough for the occasional selfie\nand Snapchatting, or whatever it is you kids get up to. Unfortunately,\nhowever, you don't get Apple's new Portrait Mode on the iPhone 8, nor the new\nPortrait Lighting feature that the iPhone 8 Plus has.  \n  \n✔️ BATTERY LIFE:  \n• According to Apple, the battery inside the iPhone 8 will last around two\nhours longer than the iPhone 7's, despite weighing in slightly smaller at\n1,821mAh.This has proved accurate during my time with the iPhone 8 so far. It\nusually gets me to the end of the day - just, whereas I usually had to charge\nmy iPhone 8 most evenings.  \n• ‎It's much less of a hassle to charge the iPhone 8 too, as it - along with\nthe iPhone X - is Apple's first smartphone to support wireless charging.\nWhat's more, whereas Apple usually requires expensive propriety accessories,\nthe iPhone 8 supports the Qi wireless charging standard, which means it'll\nwork with most third-party charges on the market.  \n  \n✔️ VERDICT:  \n• In short the iPhone 8 is an excellent phone and there are some great new\neditions to get excited about, such as the inclusion of wireless charging for\nthe first time and Apple's new A11 Bionic CPU, which is benchmarks are\nanything to go by, is the fastest mobile CPU on the market right now.  \n• ‎Beyond that, though, the iPhone 8 is an incremental update over last year's\niPhone 7, and its large bezels and three-year-old design mean it does feel\nsomewhat dated compared to the likes of the Galaxy S8 and Pixel XL 2, despite\ncarrying a similarly-expensive price-tag.  \n  \nThank You PEACE..  \n( IF YOU FIND THIS REVIEW HELPFUL PLEASE HIT THE 'HELPFUL YES VOTE')\n\n", "Phone is good except that the call failure is happening very frequently. Maybe\nit is due to the ios 11 update. But it is very irritating when the call cant\nget through or drops in between a conversation\n\n", "good\n\n", "iPhone 8 is the Best and the BEAST among all its rivals with a stunning\nDisplay and battery life.  \nHaving A11 Bionic chip into it’s heart, the phone is blazing fast and buttery.\nAnd let me tell you- I’m coming from 6S.. and the iPhone 8 is way better in\nterms of battery life and overall performance. It’s defin worth the upgrade if\nyou are from 6S or earlier.  \n  \nWhy you need to consider an iPhone 8 among others? There you go..  \n  \n1\\. A11 Bionic Chip - (gone mad with numbers.)  \n2\\. Great battery life. twice of 6S’s nearly.  \n3\\. 2018-lined Flagship.  \n4\\. Assurance for 3+ years.  \n5\\. The best Camera on the Planet  \n6\\. Supports wireless charging. (Right now May not be useful to many , but\ndefinitely in the forthcoming)  \n7\\. Bluetooth 5.0 - A great fun with AirPods\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 November 2017", "on 12 November 2017", "on 29 January 2018", "on 29 December 2017", "on 10 October 2017", "on 1 January 2018", "on 5 December 2017", "on 1 December 2017", "on 14 December 2017", "on 20 December 2017"], "reviewer": ["Amit", "raj_ankitraj", "Anupati ", "Rajnish Sharma", "Ravi N Padhy", "Mayank Pahuja", "Toshi Aley", "Varun Chandran", "Dr.G.Inna Reddy", "Prashanth MS"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Amazing phone the glass back is looks and feels great", "One Star", "Five Stars", "Three Stars", "Missing EarPods :(", "Just awesome", "No.1 in functionality", "A11 bionic. Awesome cheap", "Three Stars", "Three Stars"], "review": ["Amazing phone the glass back is looks and feels great.Not much different from\nthe 7 though feels like a iPhone 7 s\n\n", "I have got reused product and voice is not coming to me. Alongside that there\nis no headset with it.\n\n", "Amazing phone. Worth buying just for battery life it provides\n\n", "Amazon Order # 402-2038021-8872368.Further, To make up for this we will add a\ngift card Rs.500 on new order placed which you can use for your next purchase\nat Amazon.in this commitment you requested give rs.500 in my account.\n\n", "Very bad experience for the first time. No EarPods in the box. What should I\ndo? I think it’s better to return it back.\n\n", "Excellent phone , upgraded camera features from iPhone 7 and reasonable price\ncompared to its precedor\n\n", "Best for the people who love functionality & long term usage.  \nClose all background apps if experience heating.\n\n", "Great phone. I used iphone 6 for three years. From 6 to 8 it's a major update\nfor me. Loving it.  \nA11 bionic fastest cheap I ever experienced.  \n  \nNew AR thec awesome experience at start.\n\n", "I haven’t received invoice copy of the Same. Requesting you to kindly revert\non my mail.\n\n", "Need original invoice in individual name. Please contact as it's urgent.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 January 2018", "on 22 February 2018", "on 15 December 2017", "on 2 February 2018", "on 2 March 2018", "on 30 November 2017", "on 11 December 2017", "on 28 January 2018", "on 26 February 2018", "on 5 February 2018"], "reviewer": ["ANIL KUMAR SINGH", "Mohammad Wasi Akhtar", "Rahul Chowdhri", "uttam", "Rajendra V. Sowani", "Niranjanshriram", "Amazon Customer", "Abhinay Nilawar ", "Teja", "Db"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Five Stars", "Five Stars", "I thought there was supposed to be the wireless charger ...", "Five Stars", "Awesome", "Four Stars", "Defective piece", "One Star", "Amazing Amazon Delivery", "Absolute Disappointment!"], "review": ["Nice phone\n\n", "Awesome\n\n", "I thought there was supposed to be the wireless charger for iphone 8 but it is\nmissing in my pack\n\n", "Such an enticing phone and the gold color is remarkable.\n\n", "Only one word awesome.\n\n", "Excellent product and delivery\n\n", "Very disappointed with the product, the phone is defective and Amazon is not\nreplacing it, they'll also not return my phone that I surrendered for\nexchange, be careful with high end purchases.\n\n", "Defective item delivered\n\n", "Got it the same evening of India launch...amazing Amazon!!! Besides got the\nbest exchange deals on my old iphone 6!!!\n\n", "Phone has issues in fingerprint authorisation. Apps not getting downloaded by\nputting fingerprint authorisation. Getting overheated for no reason or rhyme.\nAbsolute disappointment.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 November 2017", "on 11 October 2017", "on 25 January 2018", "on 16 October 2017", "on 30 October 2017", "on 20 October 2017", "on 23 October 2017", "on 6 January 2018", "on 16 November 2017", "on 15 January 2018"], "reviewer": ["Amazon Customer", "Amazon Customer", "Joel", "Nishanth Krishna", "Amazon Customer", "Arijit Chaudhary", "Human carpenter", "ashim sarkar", "Karan", "Debottam Banerjee"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Best Apple Product Purchased", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "Four Stars", "Five Stars", "Five Stars"], "review": ["❤️❤️❤️❤️❤️\n\n", "Best In Class IPhone Ever !!\n\n", "It was great....\n\n", "Look Cool.\n\n", "Awesome product....\n\n", "Excellent\n\n", "Worth the money\n\n", "Nice device, not much changed in it with respect to iPhone 7.\n\n", "Its a great feeling experiencing the Apple Iphone 8 design.\n\n", "\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 February 2018", "on 28 February 2018", "on 27 February 2018", "on 4 November 2017", "on 28 February 2018", "on 2 March 2018", "on 23 February 2018", "on 28 January 2018", "on 29 January 2018", "on 31 January 2018"], "reviewer": ["Devyani T.", "Srinath Subbarao", "Vineet Kapoor", "Deep", "9739500157", "Puneet Maratha", "Sudhanva", "Gaurav Upreti", "Amazon Customer", "Ch. Saurav gujjar"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Go for it 👍🏻", "Apple's best and most boring iphone", "Do not buy - Missing accessories", "Earphones missing", "Four Stars", "Awesome..", "But i like", "Network issue", "Five Stars", "no words to say its a really awesome features phone display resolutation is really so good battery ..."], "review": ["Nice product from Apple. Gud to buy this amazing device especially if you are\ngoing from android to ios. Amazing experience and i was little worried that is\nit safe to buy from e commerce like amazon but i was wrong e commerce give\nbest deals. Go for it without a single doubt.\n\n", "Phone is good but can be skipped if u are already using iPhone 6/7 as it has\nsame old design only upgrade is latest chipset and glass back instead of metal\nback. Camera wise slight improvement both front and back  \nI would recommend iPhone 8 plus and if u can afford then go for iPhone x.\n\n", "EarPods with lightning connector and lightning to headphone jack adapter are\nmissing in the box\n\n", "Earphones missing. Never expected this from Apple.\n\n", "Good device but I expected something more\n\n", "Surprised with the ontime delivery. Took decision to buy and ordered in Amazon\nat 10pm and delivered at doorstep next day at 10.30 am precise.\nAwesome...congratulations to amazon delivery team for an excellent supply\nmanagement.  \niPhone is also very good and no probs till now.\n\n", "Nothing new apart from camera, chip and back glass finish. But i like it\n\n", "I am facing network problem with my instrument. Tried changing the handset\nwith idea SIM works fine but when the same SIM is inserted in iPhone 8 the\nnetwork signal decreases and calls are disconnected.\n\n", "Love the phone. Extremely good and the colour is so subtle and classy\n\n", "no words to say its a really awesome features phone display resolutation is\nreally so good battery back up so good processor and touch is really superb i\nam loving it recharges so fast thanks to apple\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 February 2018", "on 5 February 2018", "on 8 February 2018", "on 3 December 2017", "on 16 February 2018", "on 5 January 2018", "on 7 February 2018", "on 9 February 2018", "on 24 February 2018", "on 21 January 2018"], "reviewer": ["M.S", "G V Pavan kumar", "priyanka", "Amazon Customer", "Mohit Singh", "Arun Appu", "mounika", "Naveen", "Sridevi Prodduturu", "sumit walekar"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Its very good that amazon has delivered genuine product", "Cash Back pending", "Five Stars", "Five Stars", "Five Stars", "Things missing in the box", "Three Stars", "Five Stars", "Five Stars", "Five Stars"], "review": ["Its very good that amazon has delivered genuine product. Initially i was\nworried about buying it from an online store as its quite expensive. But i\ndont regret about it now.  \nThere's a issue with the battery it drains very fast. I dont know why.\n\n", "When ordered, showing Rupees 8000 cash back for payments made from citi credit\ncard but Still not received the cash back in my citi bank credit card account.\n\n", "Good product , Prompt Delivery\n\n", "superb\n\n", "Great product with quick delivery\n\n", "My phone does not have ear pods and lightning cable with it . Please confirm\nabout the same , the box says it should be there\n\n", "Good iphone 7 would be good in price range\n\n", "Good and they gave me a good price for my old phone.\n\n", "Perfect.. Excellent booking and delivery experience.\n\n", "Awesome Phone🤩😍\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 March 2018", "on 13 March 2018", "on 19 March 2018", "on 16 March 2018", "on 24 February 2018", "on 18 March 2018", "on 26 February 2018", "on 8 March 2018", "on 5 March 2018", "on 4 March 2018"], "reviewer": ["Mounika", "Amazon Customer", "KD", "Ranjit Singh", "Amazon Customer", "Amazon Customer", "sahil garg", "BONY JACOB", "Amazon Customer", "Yogesh Sundararajan"]}
]