[
{"rating": ["1.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["The product I received is of very poor built quality and I can even hear crackling sound ...", "I suspect the genuinity of the product", "Is it really worth your money??Read the review to know more..!", "Good LED bulb worth the price + Read guideline to buy your LED bulb", "Mismatch in product specifications (825 Lumens vs 3224lm mentioned in the website)", "Bad experience", "Read it, you find it's worthy👍🏼", "ORIGINAL OR DUPLICATE", "Lucky  & Nice deal for Rs 354", "Not worth - Poor Quality"], "review": ["The product seems to be counterfeit of Philips LED bulb. The product I\nreceived is of very poor built quality and I can even hear crackling sound for\none of the bulb when I shake it. I'm really shocked how 'Cloudtail India\nPrivate Limited' is selling products like these without having proper quality\nchecks, this is very bad #Amazon, really disappointed.\n\n", "I suspect the genuinity of the product. Poor Philips packing for each bulb.\nEach bulb had some issue like unwanted glue, low quality leads and other\nprinting. The barcodes below the pack were pasted with white stickers to\ndisable scanning. When tampered to scan, it takes me to a dummy Philips site.  \nAmazon, please check the genuinity of sellers / products which directly\naffects the trust on Amazon.\n\n", "Hai guys,  \n  \nI am writing this review after 7 months of usage and i want to share some\npoints from my experience.!🤔  \n  \nThis is the first time i am purchasing a philips LED bulb and i can say that\nit doesnt meet all my expectations.The product arrived in a good packaging\ncondition within 3 days of ordering..!(Amazon is best in that)😇  \n  \nNow time to discuss about the product;👇  \n  \nI purchased this product as a replacement for my 23w CFL bulb.😒  \n  \nI am not sure that whether 9w is enough as a replacement for 23w anyway i\nthought of giving it as a try and the brightness of the LED is more than\nexpected(To be frank 9w led bulb have more brightness than the 23w CFL bulb)👍  \n  \nWhen i got the package one of the bulb have a small sound when i shake\nit.Since its working i didnt cared about that but after six months of usage it\nsuddenly stopped working.👎  \n  \nSince i have the invoice with me i got a replacement from a nearby electrical\nshop(Dont forget to keep the invoice,if there is any damage during the\nwarrranty peroid we will get the replacement so dont worry about that).👌  \n  \nSince LED bulbs have a life time of more than 10 years i am a bit disappointed\nwhen one of the product gets damaged.(Anyway its ok,i got a new replacement)✌  \n  \nFinally one more thing .It is comparatively so small when compared to the CFL\nbulb .(I will attach a pic of both the products in a single frame so you guys\ncan check it out) .😘  \n  \nThats all about the prosuct i want to share .!☝  \n  \n👉Thanks 4 reading..!👈\n\n", "** Performance & Usage **  \n● The bulbs came in a well protected packing carton  \n● The size of the bulb is smaller than standard Incandescent lamps and\nslightly bigger than CFLs; however this fits in almost all fixtures made for\nCFL  \n● The colour matches that of standard fluroscent tubelights  \n● There is no fluctuation of light that I could observe or notice  \n● The bulb is not dimmable  \n● The bulbs does not light up instantly, there is delay of a second or two\nafter you switch it on  \n● It sufficiently lights up my kitchen where I installed it. I installed\nanother one outdoors where it is ON for the whole night  \n● This has got a Lumens Output of 91.7 which means it consumes less\nelectricity. However, there are other bulbs available with Lumens Output close\nto 100  \n● There is a warning label that this should not be used in completley closed\nlight fixtures. It is bacause of the electronics involved that will need\nventilation to sink away the heat. Eventhough there is another label that says\nthis is for indoor use only, I have been using this for the last two weeks\noutdoors without any issues  \n● The bulb has got 1 year warranty from the date of purchase. To claim\nwarranty, you would need the invoice from Amazon  \n● I paid Rs.519 in Feb-17 which is Rs.130 per bulb and I rate FIVE stars. I\nwill update this review after a few month's usage on the durability and\nperformance  \n  \n** LED Bulb Buying Guide **  \n● Eventhough there are many parameters that you can look for like Lumens\nOutput, Power Factor, Colour Rendering Index, Colour Temperature, LED Life,\netc. while choosing the right LED bulb, if you look at the below three\nparameters it will do good in making a better choice  \n● Lumens  \n\\- The more the lumens, more the brightness. To get a rough idea on\nbrightness, I have listed the equivalent CFL and Incandescent bulbs that can\nproduce a listed Lumen  \n\\- 450 lm: 8-12 watt CFL; 40 watt Incandescent  \n\\- 800 lm: 13-18 watt CFL; 60 watt Incandescent  \n\\- 1200 lm: 18-22 watt CFL; 80 watt Incandescent  \n\\- 1700 lm: 23-30 watt CFL; 100 watt Incandescent  \nThis will help you decide on the Lumen that you need for your bulb  \n● Colour Temperature  \n\\- Cool Light: Higher Colour Temperatures (above 3600K) are considered cool.\nCool light is good for office spaces, shopping centers, ertc. since it can\ngenerate higher contrast. Eventhough most of the cool bulbs now available are\nmore than 5500K, the most comfrtable for our eyes is between 3600-5000K  \n\\- Warm Light: Lower Kelvin temperatures (2600 - 3100K) are considered warm.\nThese are slightly yellowish and warm light suits homes since it is more\nflattering to skin tones and clothing  \n● Lumens Output  \n\\- This indicates how efficient a bulb is. This can be calculated by dividing\nthe rated Lumens by the Wattage. For eg. this Wipro bulb has 825 lumens and 9\nwatt; so Lumens Output is 825/9 = 91.7  \n\\- Bulbs with Lumens Output less than 75 is average, 75-90 is good and 90-100\nis the best  \n\\- There are many bulbs currently available with Lumens Output of 100  \n  \n** Summary **  \n● If you need more brightness, pick a bulb with more Lumens  \n● Select Warm Light for living rooms, bedrooms, etc. and Cool Light for\nkitchen, outdoors, etc.  \n● A bulb with more Lumen Output will consume less electricity than other bulbs  \n● So, after shortlisting different brands of bulbs with your required Lumens\nand colour temperature, buy the bulb with more Lumen Output and comparatively\nless price  \n● Lumens, Colour Temperature and Wattage will be printed on the packing carton\nof LED bulbs.\n\n", "I have received the product today - pack of 4. Observations are below:-  \n  \n.. Bulb boxes were damaged  \n  \nThe product specification indicates 3223 Lumens (\"Bulb Base: B22, Color\nTemperature: 6500K, Lumens: 3224lm\") while the details on the bulb case shows\n825 lumens . Refer picture uploaded here. Not sure if I had received the right\nproduct\n\n", "Poor quality.  \nI expected better from PHILIPS.  \nI ordered 8 bulbs (2x4) and I receive 4 poor quality bulbs and 4 comparatively\nbetter quality bulbs.  \nAmazon never provided on door delivery.  \nI always had to go with my bike ( Extra Expense).  \nVery sadly one of the bulbs just gave a blink and never worked again.  \nSince 7 other bulbs are working properly, I decided not to return the whole\npackage.  \nIt’s disgusting to go through all return processes. That’s not what we expect\nfrom online shopping ( a disgusting week).  \nLuminous intensity is same as other brands with same power ratings in the\nmarket.  \nMade of plastic except the heat sink.  \nI opened and examined the faulty bulb and saw a bad capacitor and from my\npersonal opinion heat sinking arrangements could be better.  \nWarranty offered is useless.  \nAmazon is selling for 50% off . What’s the point in it. It is the market value\nand from this experience I realise that I could have brought better product\nfrom local market.\n\n", "This is neither a review nor a statement. When i have decided to change my\nhome lighting and aesthetics, I have gone through many websites looking for a\nbetter and healthy lighting system. After hours of research into LEDs, CFLs,\nincandescent and fluorescent lights, the conclusion is what I felt like\nsharing with.  \nI try to be as objective and as simple I can be rather sounding technical.  \nIt seems that  \nthe LEDs may cause blindness over a long period of time.  \nCFLs may generate UV radiation also are hazardous considering the internal\ninert gases and the mercurial vapour.  \nIncandescent bulbs are relatively better but they consume more power\nunfortunately. Also few reports say that they raise cataract issues over a\ntime, but the high raise of cataract cases of the 80s,90s is due to sudden\nincrease of exposure to light due to electrification etc( as our grandparents\nare more dependent on sun for light and eyes used to get ample relaxation &\nrejuvenation time).  \nThe reason why all the light sources have got some or other problems is\nbecause that all these are artificial sources of light. So this artificial\nprocess of recreation of light is against the natural form is the vital reason\nbehind making it harmful for long exposures.  \n  \nSo I have read more and realized that if the lights can be put in any casings\nlike glass shields or such decorative jars which not only enhance aesthetics\nbut also reduce the harmful effects of light.  \nSo don't use any bulbs directly as a light source. Don't let them be naked,\nadd some colorful clothes to them :P or add translucent shields so that\ndissipates the light uniformly and takes at least 50-60%. of negative effects\nof artificial lighting. Also the placing of the light source and the wall pain\ncolour etc are other things to enhance lighting and to reduce the dependency\non higher lumens.  \nJust google yourself to realise the negative effects, if you don't trust in\nsome strangers free piece of advice :P.  \n  \nThis piece of writing is just to share my views and not against any product or\ncompany.  \nThe reason behind one star is my opinion against artificial lighting and its\nill effects but not for the particular products. The products are of good\nquality and many of them work efficiently.  \nBe rational and conscious, rather falling for consumerism.  \nStay healthy.  \nHope this info is helpful.👍🏼😊\n\n", "is this bulb original...\n\n", "As I go through reviews of Philips , crompton Greaves, syaska & Everyday ,\nthere is good & bad reviews , atlast I decided to go with philips  \nNone of these company get above 4 star rating , between 3 to 4* depends on\nreviewer level  \n  \n4 bulbs for Rs 354 nice deal  \n  \nGlowing well good for mid sized room  \n  \nBuy it , everything depends on your luck 👍👍\n\n", "Bought this a few days back and i would say i have mixed feeling for my\ndecision. One out of the 4 bulbs went blank within few minutes of usage and\nits disappointing  \n  \nAbout Product:  \n1\\. Bright light and perfect for your outdoor stairs or gardens in the night  \n2\\. Light is more focused on where you really need, and hence its good  \n  \nCons:  \n1\\. Poor quality or light or design - one out of the 4 bulbs went blank within\nfew minutes  \n  \nNot sure, how long the remaining 3 would last\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 July 2017", "on 17 May 2017", "on 6 March 2018", "on 17 March 2017", "on 17 August 2016", "on 7 November 2017", "on 30 September 2017", "on 15 October 2016", "on 19 March 2018", "on 15 October 2017"], "reviewer": ["Amazon Customer", "Aravind N M", "✌Ramees Rahman✌", "Friendly Sparrow", "Amazon Customer", "Mohammed Ishaque", "Ram ..✒️.....", "H Sekhar", "Anish Leo", "Praveen Prakash"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Replace the bulb.", "Repair", "Five Stars", "One Star", "good product with bad packing", "One Star", "Best product & brand in lighting solution.", "One Star", "Old / Used Bulb Received", "One Star"], "review": ["I buy this product. 2 years warranty. 2 bulb need replace. Because, it did not\nwork. How I replace?\n\n", "Repair\n\n", "Best quality online and time bond delivery good performance and sir I request\nyou not apply for delivery charge\n\n", "I have ordered and paid for 4 bulbs ..But delivered only 3 pieces box...\n\n", "product is good but I first time received a product with bad packing\n\n", "Fake and counterfeit product being offloaded in the name of diwali sale\n\n", "Trusted brands in lighting products.  \nOther brands may be having higher lumens/watt.  \nBut only Philips works for long run.\n\n", "Item was broken,not working out of three\n\n", "Old / used bulb received  \nBrightness is like 7wt bulb\n\n", "To bulbs is damage\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 4 October 2017", "on 19 December 2017", "on 26 September 2017", "on 20 October 2017", "on 18 October 2017", "on 22 October 2017", "on 17 September 2017", "on 3 November 2017", "on 17 October 2017", "on 11 November 2017"], "reviewer": ["Amazon Customer", "Ak", "Santosh kumar", "Amazon Customer", "Amazon Customer", "Vishweshsharma", "Baangs Technomac Kerala", "Amazon Customer", "Zubair Ahmad", "PINTU KUMAR"]},
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["About watch", "... Not sure this a genuine product &quality is not good..", "One Star", "Best Budget LED bulb with 2 YEARS of Warranty.", "Quality Not good.", "Unsatisfactory product quality", "Blue fused after 1 day", "0ne Stars", "Inferior quality of CELLO flask!!", "Nice product , but"], "review": ["Very good watch by sonata send by Amazon within 4 days\n\n", "I'm Not sure this a genuine product &quality is not good ....\n\n", "2 led bulbs are failed - kindly replace\n\n", "NOTE:  \n@ You need to Register the product on Philips Official website for Warranty.  \n@ It comes with B22 Type Holder, just like normal Bulbs.  \n@ It comes with 2 Years of Warranty.  \n@ I got pack of 2 and both of the bulb are working fine.  \n  \nAfter using it for couple of days, following are the observations,  \nPROS:  \n1) Product is exactly as shown in the description.  \n2) Brightness is almost similar to standard Tube lights.  \n3) Finishing of the bulb that I got is Good.  \n4) Bulb works perfectly without any fluctuation.  \n5) It Doesn't feel warm when Bulb is ON.  \n6) Sufficient enough to light a 100 sq.ft room.  \n# has 825 Lumen Brightness.  \n7) If 40% Efficient than normal CFL bulbs ( Claimed on package )  \n8) Finally its very Affordable.  \n  \nCONS:  \n@ Light is emits looks to SHARP, rather than Diffused.  \nWhich might cause Irritation to some users.  \n  \nVERDICT :  \nFor the Given Price and the Quality, you get 2 Years of Warranty as well. So\nits definitely a Good Deal.  \nI do Recommend it.  \n  \nThank You for Reading this Review.\n\n", "Product Quality Not good . One lamp out of pack of 4, was not working at all.\nOne lamp stopped working within two days. where as other make lamps ( Sliemo,\nSyska & Eveready ) are working OK. I am going to return back the PHILIPS\nLamps.\n\n", "Product seems to be fake. No quality / perfection of a PHILIPS LED 😟 You may\nsee the dirty outer surface of the LED in the image\n\n", "Blub fused just after 1 day :(  \n  \nNow how can I replace it?\n\n", "My Philips led bulb was fuge chinge phoone Number 8059059644\n\n", "The screw top and the push down button of the CELLO flask broke while trying\nto pour water into a glass! Please replace a genuine product of proper\nquality.\n\n", "It's really worth the price, but by mistake i had received 7w instead os 9w i\nhad placed order for. But worth the market price though.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 February 2018", "on 15 July 2017", "on 25 July 2017", "on 19 June 2017", "on 20 August 2017", "on 27 March 2017", "on 14 May 2017", "on 12 January 2018", "on 18 January 2017", "on 21 January 2017"], "reviewer": ["Ayush singh", "M. MEARH", "Amazon Customer", "Sameer Patil", "Abhay Joshi", "Nimal PS", "Amazon Customer", "Naresh kumar ", "Delo", "Kish"]},
{"rating": ["2.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["... review for Amazon product because this time Amazon really disappoint me. One of the led bulb does not ...", "One Star", "Design Flaw", "Five Stars", "Overall I am quite happy with my purchase and I have already replaced all ...", "Best price", "Looks good", "This product is useless With in 3 months three bulbs burnt out of ...", "Good product.", "Excellent Product And A Perfect Replacement for CFL's And Tube Lights A+++++++++"], "review": ["I think this is my first negative review for Amazon product because this time\nAmazon really disappoint me. One of the led bulb does not seem to be a new\nproduct. I got one led bulb with lot of scratches on bulb and on bottom where\nwe put it in holder. And bulb cap was not properly fitted looks like a used\nbulb is repaired by the seller so they open the cap and repaired it and sold\nwith discount. We can't sure whether it is new or not because Phillips doesn't\nprovide any seal on box. Now i will not buy any discounted products specially\nlightning deals products because seller sells their defected product to these\nlightning deal customers. I won't going to replace because i think it will\njust waste of time and money. I hope this repaired or old bulb last long but\ntrust me i don't think it will last more.\n\n", "1 no philips base B22 9 watts round led bulb not working.  \nneeds replacement.\n\n", "Fundamental design flaw by Philips in this product.  \n  \n1\\. The physical size of the bulb is small, compared with other brands.  \n2\\. The spherical plastic cover intended for the discrete light distribution,\ncovers the area very low as compared with other major brands like Osram.  \n3\\. In this product, the light distribution is designed to focus more to the\nfront area if we use the bulb in a wall fitted light.  \n4\\. But for suspended pendent lights or chandeliers type ceiling lights, the\nlight reflected from the ceiling is low which adversely affects the intensity\nand coverage.  \n5\\. The plastic cover is just a diffuser to make light more uniform but the\nlow area covered by the plastic cover cause 10-15% light loss, I guess.  \n6\\. The bulb and the plastic cover could have covered more area by enlarging\nthe product size to make it more meaningful, I think.\n\n", "Good\n\n", "With LED bulb getting cheaper by the day, I decided to buy couple of Philips\n9W LED bulbs for my home. In order to save energy and money.  \n  \nThis bulb delivers 825 lumens of light.  \nHowever, for my usage, 9W LED was bright enough.  \n  \nLED bulbs are also supposed to last longer than CFLs, but that is something\nonly time will tell.  \n  \nOverall I am quite happy with my purchase and I have already replaced all my\nCFL ,florosent lamps to LED , my home consumption is reduced 60kwh in month,\naprximately I am saving 4*60= 240₹ per month.\n\n", "Best 9watts price\n\n", "Works as expected.Brand is Philips Ace Saver, 825 lm, 9 W. MRP on box = Rs\n750. This order was supplied by Cloudtail.\n\n", "This product is useless With in 3 months three bulbs burnt out of 48 nos If\nthe supplier is genuine they have to replace\n\n", "\n\n", "Excellent Product.  \n  \nYou can easily replace a 60W-100W Tube light with 12-Watt LED.  \n  \nI'm impressed with the performance and it's been a year i have been using them\nand they work like a charm.  \n  \nI have replaced all CFL's and tube lights in home with various ratings of LED\nlights.  \n  \nHall Gets 2 X 14 Watt Led  \n  \nBedrooms Get 9 Watt Led  \n  \nBathrooms 7 Watt Led  \n  \nKitchen 9 Watt Led  \n  \nEarlier I had to rush to the local store to get the cfl lights replaced as\nthey were in warranty however now though there is 2 years warranty.  \n  \nNone of them have failed in the past 1 year.  \n  \npower bill has also reduced.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 July 2017", "on 12 November 2017", "on 13 August 2017", "on 8 November 2017", "on 27 January 2018", "on 16 October 2017", "on 24 December 2016", "on 20 December 2016", "on 7 March 2017", "on 25 September 2017"], "reviewer": ["Amazon Customer", "N.SIVAKUMAR", "Binu", "Purna", "Shankara  A", "Faheem rocky", "Kalyan Reddy", "Ramamohan", "Anoop Nambiar A.V", "PRAMOD HARISHANKARA"]},
{"rating": ["3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Three bulbs are ok but one is blinking.", "Damaged /fused bulbs supplied.", "Product stopped working within gone day of use", "Awesome Product", "Warranty issue. No response from Amazon", "Good.", "Two Stars", "Good", "Warantee replacement", "Philips or some other brand?"], "review": ["I bought it in deal and I found rwo of the bulbs was used and one of the bulb\nwas not working. Its blinking I cant return it as I might not get same deal so\nI am keeping it.\n\n", "Out of 4 bulbs supplied by Cloudteil India Private Ltd vide invoice no.\nDEL4-2071551dated 05.10.2017, two bulbs are not working\n\n", "Product quality is very bad. One of the light stop working within one day of\nuse ( used just for 2hrs)...\n\n", "I bought 4 pieces 9w bulb in 380 rupees and it is very good and light of led\nalso very good and milk is white.\n\n", "Stopped working 02 months of use.  \nWarranty claiming is a issue . No saving if such short life from product of\nPhilips sold at Amazon . Star is for just for presenting review.\n\n", "Very nice\n\n", "Product look ok but I doubt it's originally from philips house. Product looks\nold & refurbished\n\n", "Good ,All LED Bulb working , fast delivery,  \nTnaks\n\n", "one of the bulb fused from above order. let me know how get replacement within\nwarrantee period\n\n", "Product looks old or replaced with duplicate ones. It works but there are\nscratches and cosmetic defects. See attached pictures.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 August 2017", "on 2 November 2017", "on 21 October 2017", "on 28 September 2017", "on 18 August 2017", "on 28 December 2017", "on 27 October 2017", "on 19 November 2017", "on 14 October 2017", "on 30 September 2017"], "reviewer": ["Pravin", "Amazon Customer", "SRaina", "VIDYASAGAR PANDEY", "Amazon Customer", "Rimi mitra", "Satnarayan", "Ajmal vadakkan", "Bhisma Ranjan Upadhyay", "Amazon Customer"]},
{"rating": ["2.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Retention", "Three Stars", "DUPLICATE BULB", "Worth of money", "Five Stars", "No warranty card given.", "Duplicate", "Philips always best", "Five Stars", "Damaged product delivered"], "review": ["1led bulb kharab Hai nahi jal raha Hai warinti Hai 2 years ki retern karna Hai  \nThanks\n\n", "\n\n", "DONT BUY THIS PRODUCT NOT ORIGINAL\n\n", "Working fine , no issue , bright\n\n", "Energy saving bulb I am happy thank you\n\n", "Everything Is perfect but Warranty Card is missing\n\n", "Its a pure Duplicate product. Please don't buy.\n\n", "Good brought it by 349\n\n", "It's Superb\n\n", "Damaged product delivered.may not last for 2yrs.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 September 2017", "on 16 November 2017", "on 23 October 2017", "on 18 October 2017", "on 11 October 2017", "on 10 October 2017", "on 5 October 2017", "on 17 October 2017", "on 28 October 2017", "on 5 October 2017"], "reviewer": ["Aslam", "sachin kamthekar", "Mohammad", "Suman Mukherjee", "Amazon Customer", "Pradhan", "Vicky", "Amazon Customer", "Amazon Customer", "Siva K."]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Philips led bulb Warranty Issue", "Best LED Bulb in this Price Range", "No question about Amazon delivery and product quality. After ...", "Worst Quality LED Bulbs ever", "Five Stars", "Phillips won't honor Warranty. Bulb stopped working in 2 weeks.", "This is NOT genuine Philips", "Five Stars", "Not satisfied with the look and finish of the product", "Philips cheat you lifetime for product warranty."], "review": ["Wrost product. I have purchased this in October 2017 after one day use one\nblub got fused and got replacement, yesterday 16 Feb 2017 again one blub got\nfused. Now the wrost part is I am struggling for warranty coverage nither\nAmezon is takeing responsibility nor Philips, though blub has 2 years\nwarranty. I am not sure to whom I can contact for this so better to avoid\npurchase led bulbs from here or at least Philips one who don't want to\nentertain those customers who purchased bulbs online.\n\n", "It is Very Bright 🔆. In the Cover for 3 LED , It's written that the price is\n750 Rs. So, obviously you would be getting a Huge Discount by buying this Bulb\n💡 from Amazon\n\n", "No question about Amazon delivery and product quality. But after few days one\nof the bulbs stopped working. When I contacted Amazon customer care they told\nme that you will get a replacement in Philips service centre. Now, problem is\nthat service centre is quite far from my residence and time required to\nreplace a bulb is not justifiable.  \nIt would have been great if Amazon and manufacturer have some service\nagreement and get the defective product under warranty replaced through the\nAmazon Logistics itself.\n\n", "Philips used to use much better materials in their Led, these looked made of\ncheaper plastic and after 6 months one of the two bulbs has stopped working.  \n  \nUpdate in March - The second bulb has also stopped working now. I bought the\nbulbs in Aug 2017 and i must say these were the worst LED bulbs i ever\npurchased. Both bulbs died by 16th March 2018 ! What a waste !\n\n", "Good quality thanks Amazon\n\n", "Beware! Bulb will fail stop working in as early as 2 weeks. Manufacturer is\nnot honoring warranty. He is asking me to travel to another city far away and\nshow the bulb to authorized dealer for replacement. It will cost me more in\nterms of time and money to take the bulb to dealer. I can't belive such\nservice from Phillips.\n\n", "Please don't buy it.  \n  \nThis is NOT genuine Philips. I just received the package and when i opened it,\nthere were not protective things in place. Just the bulb packed inside the\nregular plastic amazon bag. Really ? for a bulb ?  \n  \nNext, when i opened the bulb pack and looked at the bulb, it looks ugly, cheap\nand so many scratches. Looks like a used product or atleast its not Genuine.\nPlease read similar feedbacks also. The price and brand Philips made me jumped\nto order this but now i regret that i couldn't get some time to sit and read\nthe feedback before i placed the order.\n\n", "Great\n\n", "Received the product very fast within one day but bulbs do not look brand new.\nI have purchased several LED bulbs from Amazon in last two years of different\nbrand like Everready, Syska, Philips but never I had such doubt. The bulbs\nlook refurbished. I have not returned relying Amazon. Presently all bulbs are\nworking. Illumination is as described 825lm., not very bright for a medium\nsize room\n\n", "No warranty on the product. Cheap quality, two bulbs not working after a year.\nWhen I contacted them for warranty, they say the bulbs will be replaced at the\ndoorstep, but nothing happened they are smiling cheating me for a long time\n(expecting to extend up to my lifetime).\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 February 2018", "on 22 April 2017", "on 30 January 2018", "on 22 February 2018", "on 6 July 2017", "on 7 March 2018", "on 21 July 2017", "on 29 October 2016", "on 26 January 2018", "on 22 March 2018"], "reviewer": ["Amazon Customer", "Mukrang96", "Mayur Bari", "Saif", "Amazon Customer", "manofnj", "Tomy Paul", "Edge", "Amazon Customer", "sdt"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Bad quality. Looks duplicate", "Five Stars", "So... Fake", "like two not working", "Worst Amazon experience ever", "No quality / perfection of a PHILIPS LED 😟 You may see the dirty outer surface of the LED in the image Package ...", "Used/Duplicate Product", "Three Stars", "Duplicate product, received in e-bay packing.", "How can changed new lamp"], "review": ["Bad quality. Looks duplicate.\n\n", "No problem yet\n\n", "Wrong product is get delivered\n\n", "Hai online friends I bought six 9W LED Bulbs from amazon, all the six bulbs\nhaving manufacturing defect, like two not working, another two bulbs low\nbrightness. Packing is also very worst,for these type of breakable products.\nSo choose the good seller and order your products.\n\n", "Worst experience ever...  \nOne bulb was fused and guarantee card was not filled to claim\n\n", "Product seems to be fake. No quality / perfection of a PHILIPS LED 😟 You may\nsee the dirty outer surface of the LED in the image  \nPackage is also in not good condition\n\n", "Got Used product. Think its duplicate.Had smudges and marks all over the bulb.\n\n", "Nice\n\n", "Duplicate product, received in e-bay packing.  \nTop came off, extra glue evey where.  \npoor finish.\n\n", "1 lamp was fused in warrenty period\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 October 2017", "on 6 October 2017", "on 27 September 2017", "on 5 April 2017", "on 12 August 2017", "on 20 May 2017", "on 16 August 2017", "on 26 September 2017", "on 21 July 2017", "on 19 August 2017"], "reviewer": ["Sivakumar.s", "Laxmikant B Malgaonkar", "Muhammad Mulla", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Anjo J.", "thalarisreenivasulu", "Koushik Paul", "Vishnu vardhan reddy"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["I got 4 LED bulb, one is not working ...", "Not the best built quality but good enough for day to day usage.", "Lights saver", "Five Stars", "Low light", "Worst quality of bulbs purchased from amazon", "Disappointed order", "Perfect packing", "Beware of second hand goods..!", "Got a good deal"], "review": ["I got 4 LED bulb , one is not working , you can buy workig condition bulb with\nsame rate in retail shop.it has no warrenty , and cannot be replace separately\n, so do not spoil your time and money.\n\n", "I also have Eveready 9W LED bulbs, compared to that the built quality is not\nas good (Have a look at the attached pictures and see if you could find out\nsubtle differences in build quality of both bulbs) . The brightness also seems\nto be a tad low compared to Eveready, especially when using on large rooms.\nPhilips advertises these bulbs as glare free but most people won't find the\ndifference. Personally i think there is a small difference when looked\ndirectly to the bulb. Or maybe its too soon to tell. Will update here if i\nfound anything interesting.\n\n", "Good light serves good light and saves electricity. You may need 2 bulbs for\none room. If you need more bright.\n\n", "Good products\n\n", "\n\n", "This is a worst product. The bulb fused within 2 months of use. This a\nduplicate Philips and it is  \nNot in keeping with name of amazon. By marketing such products amazon Is\nruining its reputation. In other products also I found some jugglry by the\nsuppliers.People should be careful when buying from amazon.\n\n", "This time order is very very disappointed due to product was defected even\nrequested for replacement as the 1st time product was also not working. So I\nrequested to return the amount for the said order.\n\n", "Nice and light weight compared to other led but the warranty card is not in\nthe box...??\n\n", "I felt it is used one but Amazon package is good and delivery is also fast,\nnever the less it glows well  \n2 stars cut for used piece\n\n", "Orignal products, cheapest rate, fastest delivery and all bulbs working well.  \nI wish more deals from amazon.  \nFour 9 watt Philips led bulbs at about 300 rupees.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 October 2017", "on 24 February 2017", "on 12 December 2017", "on 8 February 2018", "on 10 February 2018", "on 18 June 2017", "on 1 September 2017", "on 22 November 2017", "on 7 October 2017", "on 10 October 2017"], "reviewer": ["Amazon Customer", "Dipu", "Amazon Customer", "BIJAN HALDER", "Ashok Kumar", "Ravi Chand Garg", "SANASAM NEPOLIAN SINGH", "Jatin K.", "shashidhar", "amit kumar"]},
{"rating": ["1.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["No warranty, bad life, stopped working in 6 months", "not working", "Efficient LED Bulbs at affordable price!", "Poor Quality check", "Fake item", "Five Stars", "Bulb only work 2 month, now it is out ...", "Replacement required", "Worst ever, the bulbs are getting screwed one after ...", "Excellent"], "review": ["I am writing this to put it on record that the bulbs have stopped working in\njust 6 months. I am not able to claim warranty.  \nI am going to buy these again, this time from the local market, so atleast I\ncan catch hold of someone if I am duped again.\n\n", "one led bulb not working\n\n", "Philips is always a great brand which produces real quality products and\namazon is also a great market place to buy products at affordable prices and\nthe LED's both 14 Watts and 9 Watts are extremely bright even when compared to\nthe usual trafitional tubelights but there were a few dents, scratches and\ndirt in the bulb plaastic as well as the steel parts but really worth for the\nprice paid in the lightning deal and cash back offers. Would have rated 5\nstars if the above mentioned small defects were not present. Anyways I hope\nthese 4 LED bulbs with two 9 watt and two 14 watt combos give me the desired\nefficient longevity although the Philips authentic hologram sticker is missing\nwhile my old bulbs had those hologram stickers.\n\n", "The bulb is bright but the build quality is not what I expected from Philips.\nPoor plastic quality of diffuser with uncleaned extra silicon and dent at the\nbase. I almost felt as if the diffuser would split while turning it in the\nholder. My 2 year old Chinese Philips 7w is much better in build quality than\nthis Dehradun made one. Please rectify your QC process before customers start\nmaking switch to other brands. One star less for messy finish.\n\n", "Its not an original Phillips led bulb. Its a Fake item....pls do not buy... I\nhave attached images comparing original and the fake ones.\n\n", "Wonderful product for the best price ..  \nGot 4 bulbs for 320\n\n", "Bulb only work 2 month, now it is out of order not work. Warranty 2 years\nwritten but on line items not replaced. How I can get replaced.\n\n", "ProducT itself is good but One of the bub is damaged and need to be replaced  \nProduct has 2 year warranty...  \nNeed amazon to replace it with new one otherwise no advantage of buying\nelectric products through amazon\n\n", "Worst ever, the bulbs are getting screwed one after the other, they are\nmelting off. Something white and sticky in coming out just after 2 months of\nuse! Don't buy it.\n\n", "Excellent product.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 February 2018", "on 9 March 2017", "on 7 October 2017", "on 15 September 2017", "on 15 March 2018", "on 18 March 2018", "on 9 January 2018", "on 21 November 2017", "on 17 December 2017", "on 18 April 2017"], "reviewer": ["Soumya", "Amazon Customer", "Vijay Krish", "Vikalp", "Suryadev S.", "Athul", "RAVI RAJU", "Sunny", "Meghana hegde", "Saptarshi Karmakar"]}
]