[
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Best buy in 10k with great selfie.", "Battery drains!!", "Budget phone.", "Good Product! Camera quality is not as per expectation", "Decent midrange phone", "Will definitely not disappoint you", "Won't buy Motorola ever", "Value for Money... 3 GB RAM with ...", "Good phone at this price", "Nice phone wih nice handling"], "review": ["Great phone, I am using it from 7 months. No problems till now. Only problem\nis rear camera of this phone is not good and gives blured image always.\n\n", "If u are looking forword to buy it just remember the battery drains quickly\ncamera is not so good and phone heats too quicklyyy\n\n", "I would like to give you 5 star for the mice exchange offer nd fare price\nphone. But i am giving 2 because of i received faulty phone. This phone's\nspeaker is not working properly. It depends on phone's mood whenever it wants\nto ring or not.\n\n", "Good Product ! Camera quality is not as per expectation. System function\nsmooth, speedy and proper.\n\n", "Bought this phone for My mom for her birthday. It's easy to use takes decent\npictures and can be used with one hand for the most part. Amazon delivery was\nspot on and very reliable.\n\n", "Fantastic phone gifted it to my dad he likes it a lot. Really rugged and more\nimportantly water and dust proof. Have been using it for last 3 months\nabsolutely no complaints no heating or other complaints.\n\n", "Such a bad product, charging not working properly, And service of Motorola is\nthe worst . The people over there won't respond to your problem.\n\n", "Value for Money...3 GB RAM with Moto and 5 Inch Screen at unbelievable\nprice...Why to go for any other Brand , if we are getting Moto- Ruff and Tuff\nproduct at this price....Thanks Amazon..\n\n", "Good phone at this price. 📷 results is not good enough now. You can go for\nanother product if u r buying for good cam than. Otherwise battery is good\nworked 1.5 day . Built quality & finishing is good.\n\n", "Nice phone wih nice handling.  \nIt works smoothly. Touch sensitivity is good. Camera quality is amazing.\nLittle heat.  \n  \nI recommend this phone for others . It is the good phone at this price.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 December 2017", "on 30 October 2017", "on 29 August 2017", "on 17 July 2017", "on 21 August 2017", "on 1 October 2017", "on 4 November 2017", "on 30 January 2018", "on 30 January 2018", "on 24 December 2017"], "reviewer": ["alok kumar", "vaibhavi kalantri", "Maulik Damor", "srushti s.", "Sitara", "Naveen Krishna Yamarthi", "HEMANT", "Lakshay", "Jayprakash", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["No complaints from Amazon they deliver d best with the best pricing point", "Don't buy this product. No return facility, I tried thrice. Mobile gets hotter and hotter day by day during a normal call. Batte", "Moto G series value for money.", "Three Stars", "good mobile", "Good phone for the given budget", "My Moto G5...", "Very good fir average users", "But overall impression is pretty good. Due to smooth metallic body", "Moto G5 review"], "review": ["No complaints from Amazon they deliver d best with the best pricing point...\nBut smartphone is that best as I have expected so buyied Moto g 5s plus\n\n", "Don't buy this product. No return facility, I tried thrice. Mobile gets hotter\nand hotter day by day during a normal call. Battery support is frustrating.  \nFeel like it will blast at any time. My Personal Recommendation - Don't buy\nthis product and not from this seller too due to no support.\n\n", "Nice mobile, Value for money.  \nFront and back camera pictures looks decent.  \nOnly low-light camera needs to improve..  \nSpeed between multiple app is good.  \nUI needs to be improved..  \nFor normal usage 1.5 days battery life and worst case 10hr~12 battery life..\n\n", "PAYED THOUSAND MORE THAN ACTUAL PRICE\n\n", "best mobile in under 13k price.motorola is best\n\n", "Good phone for the given budget. Amazon delivery and the quality of the phone\nwas good. No errors or restart till date.\n\n", "Very good phone for the price. Haven't faced any issue in 6 months.\n\n", "Its very good product for ones with normal use.  \nOnly problem is with small battery.  \nBut for normal users it will definitely long for more than 24 hrs. I bought it\nfor INR 5800 with exchange of my old Samsung core.  \nTHUS Its a nice pick....on this price tag\n\n", "Not many days since I bought this phone. But overall impression is pretty\ngood.  \n  \nDue to smooth metallic body, weight feels heavier than actual. Camera is\ndecent. Feels same as G3. Battery seems to be draining faster than expected.  \n  \nSoftware part is good. No glitch so far. Not many apps loaded though.\n\n", "Good phone.The overall performance of the phone is very good and i am\nsatisfied with the product. I got this phone at a price of Rs. 8300 on\nrepublic day sale. Worth buying this product.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 October 2017", "on 11 February 2018", "on 5 February 2018", "on 22 July 2017", "on 16 October 2017", "on 18 August 2017", "on 10 September 2017", "on 5 February 2018", "on 21 August 2017", "on 30 January 2018"], "reviewer": ["Robin D'cruz", "Amazon Customer", "Mkumar", "Amazon Customer", "Harsh K.", "Ganesh Krupa", "Umesh", "Chintan", "Alok Mehta", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Good smartphone it is good to use and easy to ...", "Good Mobile under 10k for Moderate User.", "good RAM and offers smooth multi tasking and switching between ...", "Best phone in this price range", "Good phone for decent price.", "My most honest review. I have written everything in it. Hope it's helpful.i know it's so quite big But I have written everything", "Best Phone for Medium Budget and Use", "Moto 2015 is best but moto 2017 2018 is worst in hands of lenovo.", "Feeling good after having the same", "No heating problem, no hanging, only battery drains without use..see more.."], "review": ["Good smartphone it is good to use and easy to handle . It has 16gb a rom that\nis little small for storage because it get only 10 gb out of 16gb but the\nperformance of the mobile phone is very good and processor is better and fast\n. It has snapdragon 430 processor which is faster . All the things about the\nphone is good . I am using this mobile phone from 6 months. It gives better\nexperience\n\n", "Features of the Phone, Look and Feel, Quality is really good and meet my\nexpectation for Moderate Use.  \nPros :  \n1.Removable battery.  \n2.Dedicated slots for both SIM and External Memory.  \n3.Smooth Functioning, OTG spport.  \n3.Good Mobile under 10k for 'Moderate users' and with Motorola Branding.  \nCons  \n1.Battery drains faster and heating issue occurs if you use this phone to its\nhighest potential. (All gesture support, 4G use, camera use, gaming\napplication, paired Smartwatch, etc)  \n2.Poor Quality Earphone. (not even in-ear).\n\n", "I am writing this review after more than 3 months of usage. It’s a decent buy,\ngood RAM and offers smooth multi tasking and switching between apps. The\ncamera, however, gives a ‘camera error’ at times, while starting, which\nresolves by restarting the camera. For now I have installed another camera app\nfrom play store. If only this glitch is ignored, the phone is a great piece.\nIt’s screen resolution is beautiful. Love this phone.\n\n", "\n\n", "I bought this phone for my mother and boy am I impressed! This phone has got a\ngreat battery. It lasts easily for 02 days after a fully charge. Like most\ntech savvy parents, my mum too uses a lot of WhatsApp and YouTube. Even after\nan extensive use of battery draining apps, the phone does not become power\nhungry. The build quality is good. Camera is decent for the price. Overall,\nworth the money.\n\n", "From the last 7 months I m using my moto g5. I also had moto g3 and moto X .\nMoto g5 is a great phone to buy. It's amazing.  \n  \nEverything is well. It's back camera is also so nice. The only problem it had\nwas with its front camera. It's not for selfi lovers.  \n  \nOn the net I have read about that it's very slippery but after some time I got\nused to it. Not a big problem. I also don't face any heating up easily kind of\nissues while charging or using the phone which I have read on net almost\neverywhere.  \n  \nOverall it's just amazing. Nothing is perfect. We can't expect everything in\njust one.  \nBut still I need to warn selfi lovers. But everybody had a different angle.\nMaybe it suits u more.  \n  \nI love it's style so much that I don't even want a back or flip cover for its\nslippery issues.  \n  \nAnd u must try the keyboard→theme option.  \nI really love my phone.  \n  \nIf I don't use moto g5 then I will love to use moto g3 cause it's a phone\nwhich is like made for u. I love its textured surface. ^_^  \n  \nI gave it 4 stars and the last one left is for the front camera.  \nAnd ofcourse I forgot to mention the most lovely thing → HELLO MOTO💕 . Oh God\nI m  \nobsessed with this sound.👌\n\n", "On Time Delivery by Amazon. First time I am using an Android Phone (ya\nsurprise) and this Phone is fulfilling all my needs and purpose for switching\nfrom Windows to Android. Good phone if you are looking in a range of 15K (of\ncourse more options are available out) But I am happy with the Phone and the\nService given by Amazon.\n\n", "Mobile is OK but the battery backup is less.  \nThis mobile leges a bit.  \nLenovo is bad. Playing games with two brands.  \nPurchased it at 7000 this mobile is not comparable with my old 2 year old Moto\ng3 Moto g3 is best rough and tough in use but this mobile look weak  \nI sell it to my friend on the next day of its delivery  \nMoto loses reliability\n\n", "Using more than one month...  \nFeeling good after having the same. It is a Worth of money....do not use any\ncover or screen protector....it reduces the beauty of this phone....\nRecommending to buy the same....\n\n", "Though it is a good smartphone it's battery backup is not so good.The charge\ndraines even when you don't use the smart phone.If you have patience to charge\nper day you can buy it.  \n  \nIt's camera is very good. Multiple gestures facility is available . It's very\nlight smartphone though it has big size. After all satisfied.😊\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 January 2018", "on 3 December 2017", "on 3 December 2017", "on 1 July 2017", "on 11 December 2017", "on 19 October 2017", "on 18 July 2017", "on 13 February 2018", "on 9 July 2017", "on 25 December 2017"], "reviewer": ["Suray R.", "Lalit Gosavi", "Amazon Customer", "Amazon Customer", "Mayur", "Yashu S.", "Akhilesh Singh", "Monu", "Amazon Customer", "sandip karmakar"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best mobile phone ever its super smooth even after n ...", "Recommended", "Very good", "Except camera all looks good as per price....", "very good", "Superb product", "Battery issue", "First and last purchase through Amazon", "Don't waste your money on this senseless and useless product", "God a good deal for a good product, thanks to Amazon."], "review": ["Best mobile phone ever  \n  \nits super smooth even after n no. of app open in background\n\n", "A lovely budget Android phone. Recommended\n\n", "Very satisfied after a month of usage. Bought it under amazon exchange offer\nat great price. I would definitely recommend it.  \nCamera quality, touch and performance are really good.\n\n", "Not found its speed as expected some times fingerprint didn't work and heats\nalso. Camera average speed average . sometimes network issue comes up and\nwithin 10-20 minutes short out.\n\n", "Good deal thanks Amazon\n\n", "Wonderful battery backup, 3gb ram is sufficient for day to day use, no lag\napps runs smoothly, finger print scanner is quick and responsive. The only\nissue is 16gb internal memory, which can be sorted via external memory card.\nRest all is fine.\n\n", "Battery issue is the biggest issue that i found in this moto g5 . I face many\nissue in this phone . When i go out of my place i do not trust on its battery.\nI can only use this 2 or 3 hours continuous.\n\n", "Wrong decision to purchase the phone through Amazon, as the wi-fi is not\nworking stops working and gets disconnected everynow and then. Had visited\nMotorola service centre and got software updated , but still problem is not\nsolved. If anyone wants to waste money can buy through Amazon.\n\n", "Don't waste your money on this senseless and useless product....this mobile\nhas severe heating issues and it is restarting automatically\n\n", "Good product at a decent price got from Amazon!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 January 2018", "on 31 January 2018", "on 9 February 2018", "on 22 September 2017", "on 8 January 2018", "on 6 February 2018", "on 6 November 2017", "on 2 March 2018", "on 5 August 2017", "on 7 August 2017"], "reviewer": ["Vryinda Sahani", "taotzu", "Amit Sharma", "Shivtosh", "Amazon Customer", "Suhail", "Amazon Customer", "Sanjyot Sudeep Sarwate", "Amazon Customer", "JVC"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["its an awesome phone and Amazons service is super", "6999 with great Indian sale And i used this phone a week ...", "Gifted to my father feeling happy", "No good", "Superb phone for 7k", "Perfect in 7000 ( Amazon sale)", "It is like ok mobile", "Not good.. I will not encourage to buy this phone", "Good product with super discounted rate", "Satisfied after 1 week of use."], "review": ["its an awesome phone and Amazons service is super. They are really customer\nobsessed. I found an issue in the phone and called customer care and they\nimediately replaced the phone. Amazing service Amazon :)\n\n", "I have bought moto g5 rs.6999 with great Indian sale  \nAnd i used this phone a week  \nThis is the best phone under 7000 not redmi mi\n\n", "Great phone though bought it for 11500 rs, it's working very good. I am\ntalking to my family on video calls battery still comes for 1 day once full\ncharged. Little heating issue is present. The gold look really good. On a\nwhole good phn to buy below 10k.\n\n", "I brought this phone 2 months back.initially I like the phone look and\nperformance,  \nAfter installing the all required application phone is running slow,still RAM\nutilization is very less but I don't why this phone performance is low.\n\n", "One of the dependable mobile  \nPros:  \nGood camera.  \nDecent battery backup.  \nStock Android experience.  \nNo hanging issue.  \n  \nCons:  \nLittle heating issue.  \n  \nOverall I am satisfied\n\n", "It's Motorola offer I purchased it at 7000 in 7000 I think it's the best phone\nI can get in this feature. .\n\n", "It is like ok mobile.Camera and sound is off good quality..The phone sometimes\ngets switched off while taking vedios which is very frustrating..Moto must\nwork on this defect as it gives the feeling that the brand new mobile is not\nfunctioning optimally.\n\n", "Phone is worst and I never expected this kind of phone from moto..Bye Bye moto\n\n", "I got this for ₹6999 which was fascinating, good product but the delivery took\npretty long time which shld be improved.\n\n", "Really liked the pure Android experience. The display is awesome...as it is\nfull hd... Battery back-up is average of 12 hrs on normal usage.  \nOnly heats up during charging...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 February 2018", "on 31 January 2018", "on 16 November 2017", "on 20 July 2017", "on 26 January 2018", "on 26 January 2018", "on 10 September 2017", "on 27 October 2017", "on 1 February 2018", "on 29 July 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "jagan0077", "Sunny", "Amaz", "Shrishti g.", "Kunal Gaikwad", "Satya", "Patil", "Sourav"]},
{"rating": ["3.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Camera is not good as expected", "Nice phone", "Two Stars", "Overall good phone", "Good looking but go for higher G5 options", "Speaker issues", "Amazing", "Four Stars", "Weak Speakers ,rest of things are great", "Good built quality with many software bugs."], "review": ["Camera is not good as expected....  \nOverall performance is ok.... Battery backup is also descent... It managed one\nfull day with normal uses... Have to remove the back cover to insert/change\nsim and memory card...😒\n\n", "It's a very nice product in this range. Decent battery life for normal use. It\ngives you experience of latest version of Android, apps run smoothly. If you\nare looking for a budget phone then this is the best choice.  \nThe only issue is with SD card, it saves all the media file to phone storage\nby default not in SD card.\n\n", "The battery dies so soon, you need to constantly charge it.\n\n", "Phone is indeed best in this range but 2800 mah battery isn't enough for phone\naddicts and gamers. Else everything is fine. For Motorola lovers this phone is\nmanufactured by Lenovo. My heart broke when i saw lenovo logo on welcome\nscreen. Can't say about others, how they had felt upon seeing this.\n\n", "The phone is beautiful, sleek and easy to handle but... that's all. Sound is\nnot loud enough to hear in Indian environment. The battery is not powerful\nenough and needs charging once or twice in a day. The phone becomes heated\nwhile charging or when lot of processing is required during games etc. Camera\nis good. The seller did not send my free Memory Card as advertised in spite of\nmy repeated requests.\n\n", "Its been hardly three months that I have brought the product, but the speaker\nhas stopped working and I can use it only with a headphone...didnot expect\nthis coming from MOTO... Similar problems have been encountered by other\ncustomers too. So, Moto needs to work on this\n\n", "I am using this mobile past 9month working very good 1)no heating issue.2) no\nhanging issue 3) 📷 camera quality is very good.4) display is also very good.5)\nremoving battery option\n\n", "been using this since a year now. no major issue except heating which happens\nwhile charging and calling\n\n", "Only one speaker which is also weak you can not hear call properly in trafic\nand other outside places, rest of this are great and one toch Nav is fantastic\n\n", "This phone is having lots of flaws with software. Screen casting issues\nhappen, screen does not goes off, speaker sound output is too low for\nlistening voice in videos.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 July 2017", "on 8 July 2017", "on 9 July 2017", "on 28 August 2017", "on 7 November 2017", "on 16 November 2017", "on 2 February 2018", "on 21 December 2017", "on 31 August 2017", "on 19 August 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "Rahul Deb Aru", "Udit Kaushal", "Amazon Customer", "Yaiphabi", "jagdish", "Sakib Muneer", "DD", "Manu"]},
{"rating": ["4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["... was my first time buying Motorola smartphone and I'm pretty much satisfied", "Waste of time and money", "Super reliable. Had a few falls and knocks but ...", "Great phone", "This mobile is awesome. This product has nice features", "This is for stock Android lovers, not willing to spend high for pixels", "Nice graphics and this phone is super cool", "Good phone for given budget ( under 12000)", "average", "Great value"], "review": ["Well it was my first time buying Motorola smartphone and I'm pretty much\nsatisfied.  \nAmazing build quality.  \nImpressive design.  \nQuick reaction of fingerprint scanner.  \nMy favourite TURBO CHARGING MODE.  \nCamera performance was average.  \nStock Android.  \nBest phone in this budget.  \nI'm trynna be honest cause there is a little but heating issue.\n\n", "Not so good in this price range.... In addition Amazon return policy is very\nhectic. Camera quality is not as per expectations. Phone gets auto reboot.\nDevice heats up while in normal use and charging. Many more other issues.\n\n", "Super reliable.  \nHad a few falls and knocks but doing OK so far. Had it for more than 6 months\nnow and see no reason for replacement as it fulfills all my basic needs and\nthen some more .\n\n", "Delivery was very quick. Hassle free exchange was provided.  \nReview after using the phone for a week:  \nUps:  \n1\\. Great camera  \n2\\. Battery backup  \n3\\. Stock Android experience  \n4\\. Build quality  \n  \nDowns  \n1\\. No restart option. Power button turns phone off.  \n2\\. Turbo charger was not included in my box. Don't know whether it supports\nquick charge.\n\n", "This mobile is awesome. This product has nice features: fingerprint sensor,\ntwisting 2 time for camera, flashlight gesture great. Overall the best product\nfor budget people.\n\n", "Stock Android, great display delivering punchy colours, sound is on the weaker\nside. Camera is not that great, battery back up is average,\n\n", "Outstanding. High speed and never got hang. Nice graphics and this phone is\nsuper cool. Many tricks and tips in finger print. We can use the finger print\nfunction to handle the phone more easy and fast. Totally Awesome!!!\n\n", "Review after 5 months usage... phone is sturdy camera ok.... Good for budget\nrange...bt one thing...I had previously owned Moto g , G2 Moto g turbo....the\nperformance is not like previous Moto phones.... hangs ....more like Lenovo\n.... performance is poor\n\n", "design and looks are not good, i would not recommend it, as we have lot of\nchoice in market, but specs and price are good\n\n", "Great phone. Perfect size. All features. Quick and responsive. Best value for\nmoney. Came well packed. Came in time but delivered one day late.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 February 2018", "on 26 August 2017", "on 9 December 2017", "on 19 February 2018", "on 10 December 2017", "on 19 July 2017", "on 10 July 2017", "on 8 July 2017", "on 9 January 2018", "on 13 August 2017"], "reviewer": ["Aadil0097", "Amazon Customer", "Arjun shetty", "Amazon Customer", "VIPIN MAURYA", "rended beetle", "Amazon Customer", "Amazon Customer", "K T", "swadesh"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Good mobile.", "Not as per expectation", "battery backup not that good after a while", "good camera, great build quality and awesome", "mobile not working", "A gud one but some bug problems on the software", "Notification Led light missing", "One Star", "Recommended", "Great!"], "review": ["Overall good option for the its price range.\n\n", "Not as per expectation.  \n1\\. G5 doesn't have gorilla glass, easily gets scratchs.  \n2\\. No turbo charging, Taking more than 2 hr to complete charge.  \n3\\. Network issues  \n4\\. Camera is good  \n5\\. Good look\n\n", "battery backup not that good after a while.  \nTakes up huge amount of time for charging.  \nHeats up very quickly to.\n\n", "Greay battery life, good camera,great build quality and awesome displayed\n\n", "After Buying phone when started there is continue problem that there is no\nvoice going to caller  \n  \nif there is any technical problem so help us  \n  \nor  \n  \ntell us how to return product.\n\n", "Gud one, but after software updated, mobile having some issues on some android\nbugs...\n\n", "Notification Led light is missing, which disappointed me a little. I had\nbrought moto e3 power it had Led notification light.\n\n", "Received with packing damage...\n\n", "Great phone. Option to block notifications from some apps is very handy\nfeature. Finger print scanner and security works well.\n\n", "Best budget smartphone till date. Everything about this phone is great.been\nusing motorola since moto g2 and this moto g5 is the best one in the lot till\nnow.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 February 2018", "on 23 November 2017", "on 17 March 2018", "on 26 September 2017", "on 23 August 2017", "on 4 September 2017", "on 22 December 2017", "on 18 October 2017", "on 6 February 2018", "on 9 July 2017"], "reviewer": ["Shani Deshwal", "Amazon Customer", "anu chacko", "Samrat Dutta", "Raj Rathod", "Vicky Jishnu", "Swarnendu Aditya", "chand", "Amazon Customer", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Good budget phone", "Average phone..", "Good Device, but u have to get used to ...", "GREAT", "Good phone for budget", "Average phone", "I have been using this phone from past two months ...", "Great phone by MOTO", "Best deal for me .", "Best buy for durability and design."], "review": ["The phone is very nice and has all the features required for a nice user\nexperience. The phone is very snappy and is able to run any apps and perform\nmultitasking. The phone look is very good and camera is able to take good\npictures.\n\n", "Not VFM... Camera performance is average, worser than Moto G3, phone body not\nsturdy so dont give confidence in handling,  \nOverall Lenovo has ruined the class of Motorola smart phones...i was a fan of\nMoto before I purchased G4 and then G5\n\n", "Good Device, but u have to get used to the gold color. I would rather prefer\nthe black edition. Also Moto G5 Plus is a better buy in any given day.\n\n", "A well built product.  \nFor those searching a piece of tech which is just easy on the pocket and\nfunctions just as expected. A moto device with a great brand history and at\npar in providing latest OS, packed in a good streamlined design, without any\nprotusions.  \nFinally my worries about rapid charging proved wrong and it gives great\ncharging speed and doesnt heat up.\n\n", "The phone is okay. I am using it for like past 2 weeks. Runs smooth and fast.\nBut two times the phone got hanged and I had to remove the battery to restart\nthe phone. Battery backup is okay. Fast charging looks good. Both cameras are\nneat. Didn't run any heavy apps or games. Any overheating situations didn't\noccurred till this time. Fingerprint scanner works cool and fast. But\nsometimes right to left swipe end up showing the home screen. I don't know,\nmay be it is because of the improper swipe.\n\n", "In only four months the phone is misbehaving. The voice in and speakers are\nnot working. It heats up so much that you have to wait for it to cool down\nsometimes. When I checked today there is no option available here to reach\nsupport.\n\n", "I have been using this phone from past two months and it started having a\nspeaker problem suddenly and its so irritating that I need to connect my\nearphones every time I need to talk to someone. Also, its processor has\nstarted to slow down and Instagram suddenly stops. Not done Motorola pls\nreplace my phone or tell me how to solve the problem.\n\n", "Good, sturdy phone.  \nCamera quality is good.  \nNo lags experienced in 5 days of usage.  \nBattery life is a little low(lasts just 10-14 hours on normal usage ) but\nrapid charging compensates for it..  \nOverall a good buy\n\n", "Got this at a price of RS 6999. Now at this price it's the best option for me.  \nOverall a good phone but battery backup is bit disappointing. Phone do heat up\nwhen you play games or watch online videos for a long time but then it's\nnormal for every phone. Charging time is around 2.30 hours but interesting\nfact is you will get around 60-65 % charge in 60 min.  \nCamera is good and you can also record slow motion videos.  \nIf any questions about this phone.. comment here\n\n", "Excellent phone best buy in 12000. But lacks some features like call recorder.\nTimely delivery by Amazon. I'm in love with it😍😍😍  \nBiggest con the rear cam gives a bluish effect which I hate the most overall\nstrongly recommended.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 November 2017", "on 14 August 2017", "on 18 August 2017", "on 30 July 2017", "on 13 February 2018", "on 12 August 2017", "on 15 October 2017", "on 18 September 2017", "on 8 February 2018", "on 8 July 2017"], "reviewer": ["Abhishek Chaudhary", "Amazon Customer", "Vivek S", "Ashish Negi", "Sangeeth G", "rohit", "Ealisha", "Abhinav", "Vikash", "Pranav Talwalkar"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best in its classs... a professional performer", "Good enough. Motorola has become a brand to be trusted.", "Not met expectations", "It's not so good as sometimes it gets hangd and the back cover ...", "average", "Great purchase", "Worst", "Kind of okay product", "Holy crap.. does not deserve any", "moto g5 is a really good budget oriented phone"], "review": ["Its really a great mobile!  \nAlthough its inferior to g5plus but its not inferior in its class....a awesome\nmobile i bought it for just 4k... When the offer price was 7k i exchanged my\nold mobile to get this new mobile @4.2 k ...with amazon pay 200 cashback.. Net\nprice is only 4k....moto mobile looks are very professional not like mi phone\nwhich looks like local product....\n\n", "Good phone.  \nNo heating issues.  \nFingerprint sensor ,OS, Build quality are all excellent.  \nSpecs, Camera quality are all sufficient.  \nOverall : Good enough. Motorola has become a brand to be trusted.\n\n", "It had problems just after 12th day of purchase. Meanwhile the return window\nwas 10 days from the purchase. I inserted the Moto headphone in the phone, and\nthe phone started showing problems with its speaker. Then I had to run to the\nLenovo service centre to get it rectified. Definitely this Moto G5 did not\nmeet my expectations with respect to the hardware quality. Will not recomment\nto anyone\n\n", "It's not so good as sometimes it gets hangd and the back cover of the ph gets\neasily bend the steel portion it's not worthy .though it provides a turbo\ncharger with the pH but it take almst two hours to get fully charged and the\ncharger gets heats up very rapidly\n\n", "heating problems  \npoor battery life\n\n", "Well I've been using this phone for the past month and I've got to say that\nI've got absolutely no complaints. This phone is turning out to be a great\npurchase considering it's price. The camera is decent, call quality is good\nand the fingerprint sensor is really responsive.  \nIf you are looking to buy a decent phone at a bargain price then your search\nshould end right here.  \nGave the product 4 stars because I find the colour to be a bit girlish(black\nversion was more expensive by 2k, don't know why there is so much difference\njust due to colour).\n\n", "Regret for life. I am amazed how irresponsible  \nAmazon is.  \nThey have delivered me defective product and now they are showing tantrums\nwhile filling my complaint.  \nI am very upset from this  \nI have spent 11,000 for this piece of waste.\n\n", "Its okay for the price. But is not a perfect product. has some flaws. but good\nfor normal use. Heating issues are common. But the performance seems to be\nconsistent.\n\n", "Don't buy this Product from here.Product delivered was a defective one. It's\nbattery drains out quickly without using the phone.my battery is 80-90%before\nsleeping nd in the morning whole charge of the battery drains out and is\nswitched off. Holy crap.. does not deserve any star\n\n", "moto g5 is a really good budget oriented phone....it heats a little bit while\ncharging but thats managable  \nit has a very good camera, both front and rear  \nbattery backup is decent...easily works for a day and a half in a single\ncharge  \nfingerprint scanner in very capacitive and the phone packs a load of features  \nit does'nt hang in between apps....the ram is good\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 February 2018", "on 18 August 2017", "on 29 August 2017", "on 11 August 2017", "on 8 July 2017", "on 15 March 2018", "on 19 October 2017", "on 4 October 2017", "on 18 August 2017", "on 19 August 2017"], "reviewer": ["Praveen Kumar Cp", "Siddarth N.", "Amazon Customer", "Soumita dutta", "Pranjal", "Kalzang rabden", "harpreet", "Vipin Vincent", "Amit", "Sanigdhya Jyeshtha"]}
]