[
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["A little bit unsatisfied", "Never Settle One Plus", "The Best phone I ever had", "Awesome phone and great service by amazon", "Excellent phone, great and smooth operating system", "DAAAAYUMMM WHATTA PHONE!!!", "OnePlus 5T - Value for money", "Excellent Phone. Worth Buy!!", "Best phone in this budget", "Never settle"], "review": ["At first it was okay but after sometime I got some errors during the use of\ncamera and touch sensitivity while using keypad is less, sometimes I have to\npress 2 times on the keypad and I get some kind of disturbance while using\nBluetooth headset. Its like I've got a defective piece or something I don't\nknow but I feel like I've wasted my money.\n\n", "My first one plus device. I got it on first primw day sale and review after 2\nday of usage.  \nBattery 9/10  \nScreen 10/10  \nSound 9/10 (I'm big fan of Dolby atmos sound missing it)  \nAwsome gaming experience.  \nNo heating problem.  \nVarious LEDs.  \nFast performance.  \nI'm in love with it.  \nBuy it if your budget is 30-40k  \nYou won't regret.\n\n", "Post the review after using it for 3 months. This is the best phone that I've\never used. Actually it's a big thing that an 37K product is competing with 60K\nproducts and 90K products. And always the winner is OnePlus 5T. And now\nOnePlus have officially announced that OnePlus 5T is the world's fastest phone\nthan in case of performance and charging. I really like the Dash charging\nwhich is very useful in case of less time. And oxygen OS is the main\nattraction of OnePlus, because it can be customised in the which you like.\nNothing much to say I has all that what you need.\n\n", "Awesome phone. Had issues with the first order. Amazon was prompt in replacing\nthe mobile. New phone reached me within 3 days.  \nPros and cons have already been discussed by other customers, but I am totally\nhappy with the product.\n\n", "Excellent phone, great and smooth operating system, fabulous battery backup,\namazing camera, for an existing Apple user like me its a very smooth change\nfrom an Apple to a Android device. Excellent UI, great storage and ram. It's\nan top of the line device and a premium product from One plus.\n\n", "I am beyond happy with this buy. If the thousand+ positive feedback/reviews do\nnot convince you to buy this monster, I don't know what will.  \n  \nYes, the hype is real.  \nYes, the reviews are legit.  \nYes, this phone is badass.\n\n", "Writing this review after 2 days of usage (6GB RAM version)  \n1\\. Excellent smartphone/ look/feel/device and screen aspect ratio.  \n2\\. Great performance/speed.  \n3\\. No overheating observed. Yet to explore it's gaming performance.  \n4\\. Quick/ Dash charging is good.  \n5\\. Easy/quick face and finger print recognition.  \n  \nMinor complaints  \n1\\. Mobile back case and screen guard provided for 6GB version are not great.\nCould have been much better.  \n2\\. Battery life is good but could be improved further for continuous mobile\ndata usage/ON.\n\n", "Pros:  \n1\\. Looks Premium  \n2\\. Face unlock is swift  \n3\\. Camera is exceptional. I mean it!!  \n4\\. Good Battery back up  \n5\\. Smooth performance  \n6\\. Humongous screen. Its a paradise for gamer and video/movie watcher  \n7\\. Stock android experience  \nCons:  \n1\\. Could have bundled headphones in the box  \n2\\. Still waiting for Oreo update  \n3\\. Pre-applied screen guard is of not so good quality  \n  \nIf you are looking for a perfect phone. Go for it!!\n\n", "Best flagship cellphone in this price range.  \nPros  \nGreat battery  \nComes with free TPU case  \n6 GB RAM makes it a beast wit no lag at all. Handles multiple apps with ease  \nGreat photo quality  \nVideo recording is also great.  \nBattery easily lasts more than a day with medium usage  \n  \nCons  \nHD screen, but I guess this has been done to preserve battery life over a\nsingle charge. Also HD screen detail is not noticeable in this screen size.  \nUsing the inbuilt photo enhancer with the camera seems to alter photos to make\nthem look like posters.\n\n", "An amazing phone. Worth all the money spent on it. Sleek, blazing fast, face\nrecognition works beautifully even in low light, cameras are awesome, display\nis really good. Truly a flagship killer I suppose. I'm really enjoying my new\nphone. Would totally recommend this to everyone. It makes no sense to shell\nout more that double of what this costs on so called flagships when you can\nget more of everything than those at this price. It's like they say. Never\nsettle.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 March 2018", "on 24 November 2017", "on 2 December 2017", "on 14 January 2018", "on 2 January 2018", "on 3 January 2018", "on 31 December 2017", "on 2 February 2018", "on 7 March 2018", "on 25 November 2017"], "reviewer": ["keval gadhvi", "ashish kumar", "Deepak Sathyan", "Mahesh", "Gajendra Singh", "Jane", "Laxmikant Merchant", "Sai Ram Reddy Nomula", "Santosh Pati", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["This phone is worth every penny you will spend.", "Awesome :)", "Five Stars", "but product is very good..", "A great phone to have..", "Love you One plus you are amazing", "Flagship Killer", "The Best Phone I have ever purchased", "Speed", "Liked it but would have loved it in 28-29k price bracket"], "review": ["This phone is really awesome.  \n1- It's incredibly fast.  \nIt's so fast that you will not see any app taking time to load. It sometimes\nmakes you believe that the Face lock is not working but the truth is that your\nphone will be unlocked before your eyes even notice it.  \n2- Reading mode.  \nReading mode is the best feature a phone can give for book lovers or late\nnight WhatsApp users. It's really very useful. Your eyes will not strain that\nmuch. Although you can't compare it with kindle. It's still good.  \n3-Camera  \nI will say it's not like Google Pixel 2 but it still performs pretty good.  \n4- Fast Charging  \nI charge my phone before going to office. I plug in the charger at the time of\ngetting up and the moment i come out after taking bath, the phone fully\ncharges. It charges very fast. In 30 min my phone goes from 50% to 100%.\n\n", "Such an awesome phone... I haven't tried anything other than Samsung before...\nA new phone this is to me.. and it's nice to use, really!... The camera\nquality is good.. depth effect is good... Speed is great.. there is no lag at\nall.. overall, would recommend to everyone :) This phone is worth your money\nfor sure :) !!\n\n", "Undoubtedly the best mobile in the market currently.  \n  \nBought this product after researching for months and was 110% satisfied with\nit.  \n  \nJust buy it without even giving it a second thought.  \n  \nYou will be satisfied in every way possible.\n\n", "I ordered this phone 2 weeks back...received on time....packaging was\nweek....but product is very good....OnePlus 5t is an amazing phone...just the\nback cover provided with the mobile is not good because it is damaging the\nskin of the mobile ...white spots are appearing on back skin of mobile...\nCover all excellent mobile by one plus....loved it\n\n", "A wonderful product with beautiful packaging..  \nSlim, lightweight, slender design,  \nFast,good display,Oreo update available  \nGood dual sim support, good single speaker  \nFast processor  \nFace recognition fastest,other sucurity features can be combined.  \nAmazing charger..size bulky..  \nUsb drive support available but need to buy a connector  \nScreen guard and silicone cover free..but original covers from official site\nbetter  \nGood support from community Gros online  \nGreat camera for daylight..  \nOverall a great phone...  \n  \nWishes..good and frequent system updates, new camera software, better battery\nlife\n\n", "Its awesome its been about more than a month nvr faced any issue or lag it's\nmore than my expectations I'm a hardcore user and it stands wid me 24 hours\neveryday and dash charger its something i nvr though of its bravo whoever is\nthinking to buy this just run for it...wish i had more stars to add in this.\n\n", "PROS  \n1.Brilliant Display  \n2.Fast and Safe unlocking  \n3.Extremely fast UI  \n4.Big Battery Life with ultra fast charging  \n5.Pure Android and Clean UI  \n  \nCONS  \n1.Too slippery without the cover  \n2.Camera quality not upto the level of pixel/Iphone/s8/note.  \n3.Updates are not on time  \n  \nConclusion: A great smartphone with lots of feature and lag free performance.A\nphone I would recommend to anyone with the budget of 30 to 40k.\n\n", "Best phone for this price range. Magnificent build, Blazing Performance\n(thanks to the futuristic hardware), Dedicated Support from OnePlus (they\nlisten to you), Regular updates etc etc. I mean in this price what do other\ncompanies give you? Just a phone right? Oneplus gives you a commitment. A\ncommitment to bring satisfaction. Its been close to a month I purchased this\nphone and I havent faced any issues apart from minor ringtone volume bug (for\nwhich oneplus released the 5.0.4 update by the way, thats listening to\ncustomers, apple samsung motorola lenovo take notes please). The pictures are\nawesome. Night photography is simply out of the world. With decreased shutter\nspeed and its brilliant algorithm for low light, it produces day like images\nin the night, even under just celestial lighting. Try it to believe it. I am\nattaching few pictures which were taken at 1AM in absolute lack of lighting.\nOverall 10 out of 10. Go for it.\n\n", "Awesome phone for this era and value for money. Case provided is great. Go for\nit if better options not available at the time. Clever battery and performance\noptimization thus lightning fast charging and processing. Nice ester egg.\n\n", "Great display, best battery utilization optimization with a very very fast\ncharging..... operating system could be improved a little  \nGood processor, a very good low light back camera, performs good in normal\nlighting as well obviously. Front camera could have been improved and more\nfunctions could have been given in stock camera app though I like use of\nscreen as flash while taking selfies in low light  \nOverall a good phone.  \nGiving 4 stars as I feel the price is a bit on higher side given the chinese\ncompetition in market like Huawei and xiaomi but hey one plus don't reduce\ntheir price over time like them which is a plus in a way\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 February 2018", "on 15 December 2017", "on 21 December 2017", "on 24 January 2018", "on 13 March 2018", "on 18 January 2018", "on 25 January 2018", "on 2 March 2018", "on 20 January 2018", "on 22 February 2018"], "reviewer": ["Anmol Rastogi", "Amazon Customer", "Rudran Vagle", "Yasin khan", "Dr.Samik Basu", "Shariq", "Amazon Customer", "Oru Adaar Love Song", "Saurabh Singh", "Ankur Gupta"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Review after first day", "Great Value for Money", "The underdog of 2017", "Amazing Phone & True Flagship Killer!!!!!", "GREAT PRODUCT 1+5t", "TAKE IT AND GOOO", "Awesome phone", "Tough competitor", "Amazing Product with all the specifications at this price", "Amazing buy."], "review": ["Delivery: obviously fast and accurate.. Love you Amazon for that  \n  \nProduct: Awesome in terms of performance and battery life. Means downloaded\n1.6gb update couple of times on 4G, watched videos etc. Still battery on 35%.\nSo no problem about that. Just loved this part.  \n  \nProblems which I've observed are with OxygenOS rom. Alert slider is BS. Many\nof tiles are removed and apparently I cannot turnoff Do No Disturb mode with\nlatest update of Oreo 8.0.0\n\n", "Excellent display. No lags whatsoever.  \nThe minimalistic bezel is a great plus in n terms of the design. Great value\nfor money.  \nHowever, the camera is a bit disappointing. Photos are not that great as\ncompared to those captured in Google Pixel / iPhone X.\n\n", "After a month of usage i feel oneplus is a real competitor to apple , samsung\nand other conpanies.  \n  \nThe major advantages are -  \n1\\. BATTERY  \nThe one plus 5t has a great battery life. It has dash charge which is i feel\nthe fastest available on market. Within 5 minutes it has around 10 - 15\npercent charge. It also holds up good for games such as asphalt 8 and modern\ncombat 5  \n  \n2\\. CAMERA  \nThe camera is amazing. It can take great portrait pictures . A professional\nphotographer will truly love this phone. Even in darkness the camera works\njust fine  \n  \n3\\. PERFORMANCE  \nThis phone can do amazing multitasking. It can smoothly run 5 - 10 apps\nwithout any lag. This is especially useful if someone uses this phone\ncontinuously for hours.  \n  \n4\\. SECURITY  \nThe fingerprint sensor is the fastest I've seen. And the face unlock too is\nvery fast and during emergencies , time will not be wasted on trying to unlock\nthe phone  \n  \n5.DISPLAY  \nAnother mind blowing feature is the display. It is bezel-less and the display\nis truly amazing. The colour contrast is very good  \n  \n6.COST  \nI believe this is the best phone below 50 k and while it may be cheap for what\nit holds, it rivals the power of the galaxy series , the apple phones at half\nthe cost  \n  \nThat being said , no phone is without any disadvantage. However these vary\nfrom person to person . Some which i found with this phone are -  \n1\\. Due to the phones size the fingerprint sensor is a bit hard to reach  \n  \n2.the feel of the phone is a bit different and so adjusting will take a week's\ntime  \n  \nThis phones scores in all areas and i feel this could really change the tide\nin mobile phones in the near future\n\n", "I am writing this review after using this phone for 15 days. In one line this\nphone is value for money in true sense.  \n  \nPros  \n1\\. Processor is super fast & not observed a single lag in 15 days. Even\nrunning faster than my Galaxy S8+ (may be due to clean UI as compared to\nSamsung).  \n2\\. Display is Excellent in this price range. (Should not be compared with\nHigh range phone like Pixel, Galaxy S8 etc.)  \n3\\. Dash Charging is mind boggling Fast. Used so many phone with Fast charging\ncapacity but this one is best.  \n4\\. Battery Back up is decent can run for 1.5 days on single charge with\nmedium usage.  \n5\\. No heating issue even after heavy usage.  \n6\\. Amoled Display notification is cool & look nice.  \n7\\. Rear Camera is superb in daylight condition.  \n8\\. Fingerprint Sensor is fast & surprisingly Face unlock is also super fast.\n(wasn't expected that much accuracy for Face Unlock before buying)  \n9\\. One of the best advantage is OP team listen to their customer for any BUG\nor Feature improvement & provide update frequently.  \n  \nCons.  \n1\\. Potrait mode not available in front camera.  \n2\\. Speaker could have been better in this price.  \n3\\. It should have at least IP67 rating.  \n4\\. One Basic in built music player should be added in Oxygen OS.  \n  \nOverall in this price range my rating for this phone is 9.6 out of 10.  \nThose who are willing to buy a mid range phone which have all the quality of\nFlagship Phone go for it without any 2nd Thought, you will not regret.  \nIf your main priority is Camera & can spend some extra buck should try for\nPixel or Galaxy S8. In this price range you will not get better camera than\nthis in any other phone.\n\n", "Blazing Fast  \nBoth Delivery was done in less than 24hours of order  \nMay b advantage of being PRIME customer....  \nProduct is really good impressive I feel somewhat is 5t bit taller may b t for\ntall ..but is absolutely stunning display...  \nGreat work by OnePlus Hope u improve the camera performance bit better  \nAssistive lighting face unlock is totally blazing Fast...now can unlock in\nfull dark area...Kudos again..\n\n", "BEAST !  \nHuge jump for me after using my OnePlus One for 3 years.  \n  \nOnePlus has produced a beauty of a smartphone with the new 5T.  \nWill take time to adjust, having a huge display. But this beast doesn't\ndisappoint.  \n  \nPro's:  \nFace ID (Ultra Fast)  \nFingerprint sensor (Ultra Fast)  \nHeadphone Jack is still there !  \n  \nCon's :  \nCould have used stereo speakers\n\n", "Awsome is the word. Good camera, while in low light it clicks some ok photos.\nPlaying games awesome. Face unlock and finger unlock too is the fastest.\nAwesome screen. Thank you Amazon and OnePlus for bringing this mobile.\n\n", "No bloatware  \nButter smooth  \nMild heating with heavy gaming  \nDecent battery backup  \nGood camera (portrait mode doesn't work with front cam)  \n**Don't try to zoom and capture pics... It deteriorates the image quality to\nthe highest**  \nShipped with Prefixed screen guard and back cover, no earphones\n\n", "Amazing Product with all the specifications at this price.. no other mobile\ncomes with snapdragons 835 processor at this price. Face unlock is very secure\nand is very fast.. How ever there are also some deficiencies in the product\nlike  \n1\\. No front flash for night time selfies  \n2\\. Phone is not water resistant  \n3\\. Camera quality not as great as expected  \n4\\. Battery capacity should have been more\n\n", "Amazing buy... The phone is just too fast and the Amoled display just lights\nup the phone.  \nCamera is too amazing. The portrait mode provides such great depth to photos\nthat you can't stop clicking them.  \nVideo Slo-Mo is great too.  \n  \nThe Snapdragon processor 835 is inarguably the best. No heating issues and in\nfact everything works so smooth.  \n  \nSleek design makes it look so elegant in your hands. Its a MUST BUY.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 March 2018", "on 24 January 2018", "on 25 February 2018", "on 7 March 2018", "on 30 December 2017", "on 6 December 2017", "on 3 December 2017", "on 22 February 2018", "on 31 January 2018", "on 28 November 2017"], "reviewer": ["Deeptroll999", "M", "Amazon Customer", "Pritam Jana", "Lekhraj S.", "Jaydeep Dhar", "Lohit", "Maddy", "Amit B.", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["... about 20 days could say that I made a good decision. 2 major problems I had with my ...", "One of the best phone ever.......", "Superb quality product at a very reasonable price. Must buy...", "Amazing device. The Display quality is excellent and its ...", "Best Android Flagship Phone", "The best phone in 2017 for the 33k you spend", "Oneplus5t >Iphone 8plus", "Flagship Killer", "My First Android phone", "5T... More than an incremental upgrade."], "review": ["Switched from iPhone 6s to OnePlus 5T and having used this beauty for about 20\ndays could say that I made a good decision.  \n2 major problems I had with my iPhone was camera and memory(was using the 16\nGB version), 5T has an amazing camera that ckicks sharp and crisp pictures\ncomparable if not better than Note8 and iPhonex. Also Memory is not an issue\nanymore.  \nHave saved 17k over my last purchase and I still get a better Phone, what more\ncould I ask for :)\n\n", "Great display I liked the 18:9 aspect  \nSuper fast performance (installing apps in seconds, that's crazy)  \nDouble satisfied with the camera, including front camera  \nLong lasting battery and insane Dash charger fill the battery less than hr.  \nBut somehow I don't like the music listing experience in 1+ (poor bass)....\nhope an upcoming update will fix it.....\n\n", "Excellent product. Value for money, super fast and smooth operations. Camera\nquality superb. Face unlock feature is a beauty, battery lasts more than a day\neven with heavy usage. At this price point, other smart phones are way behind.\nI have used One Plus One, One Plus x, One Plus 3 and now this 5T, all are\nsimply superb.\n\n", "Amazing device. The Display quality is excellent and its Light weighted as\ncompared to Galaxy note 8. The camera is also improved in Low light.  \nCase and pre-applied scratch guard provided with Phone is very good though.  \nOver all very good experience with amazon delivery and Oneplus 5T Device\n\n", "I am writing this review after using Oneplus 5T(8gb+128gb) variant for 20days.  \nPROS:  \n1\\. Look and feel - 10/10. The feel and look of the phone is premium. The grip\nis also good. 6.01inch optic super amoled display is superb. Viewing angles\nare amazing from any angle it seems same.  \n2\\. Ram - 10/10. 8gb Ram is very fast  \n3\\. Battery - 9/10. Fast charging. Lasts 10-15 hrs with medium usage!  \n4\\. Storage - 9/10. U get 111gb.There shd have an expandable slot!  \n5\\. Processor - 10/10. Totally awesome. No lags even when multitasking.\nSwitches to the apps very quickly.  \n6\\. Touch - 10/10. The response is very good. Even a light tap does the job.  \n7\\. Camera - 9/10. Ultra fast focus. Crisp clear pics. Takes clear photos in\ndaylight and a decent one in low light without flash. Has a pro mode too which\nis extremely useful in low light photography. Bokeh effect in portrait mode is\nawesome. Clicks perfect selfies.  \n8\\. Network - 10/10. No network issues.  \n9\\. Charging - 10/10. Extremely quick charging. Full charge within 40 mins.  \n10\\. Speaker - 10/10. It's loud and clear. Good output for music too.  \n11\\. Security - 10/10. Facial recognition is very fast and accurate even in\nlow light. Now with recent update of virtual light, facial unlock in dark is\nalso not a problem anymore. Fingerprint scanner is very fast and convenient.  \n12\\. UI - 10/10. User friendly and easy to use. Feels like stock android.  \n  \nCONS:  \n1\\. No portrait mode for selfies.  \n2\\. No expandable storage.111gb is sufficient.. But the kind of pics this\nphone generates, it shd have 1.  \n  \nUsing a Nillkin black backcover which gives it a premium look.\n\n", "Moved from Nexus 6 to One Plus 5T and using this for the last two months. It\nis the best bang for the bucks in the price range. The total 33k it is worth\nin all aspects. People mentioning no IP 67 rating and all should be told that\nit is just the numbers and I recently used it during a speed boat ride where\nit was splashed with waves quite so many times and still it runs damn smooth\nwithout any issues. Those who pick up this device will be very well aware of\nthe specs and that need not be told. Only thing, please buy a good phone case\n(even though it ships with one) as the device is slippery and you dont want to\nsee a cracked 18:9 screen soon after you start enjoying those movies on this\ndevice.\n\n", "Excellent phne..!  \nGood display  \nAmazingly fast phne  \nCame is above expectations  \nActually was lil confusion weather to take 5t or iphone 8plus... But guys thns\ngod i did not buy 8 plus.. This is excellent phne for half of the cost n I\nsaved half of the money... Superb phne anyday i suggest it go for it guys\n\n", "Best bang for buck phone in the market today. Looks and feels great in hand.\nSlick and smooth user experience and surprisingly good headphone jack audio,\nbeast of a phone in performance & portrait mode works well too, rear & selfie\ncameras are good enough in low light, you'll not feel shortchanged at all.\nBattery life is good too and lasts for a day easily. Auto brightness\ncalibration could be better.\n\n", "I was using iPhones since birth however after iOS 11 release iPhone has become\nso much buggy,every alternate day we get new iOS release.  \nHence I thought to switch to Android and I saw 5T coming.  \nSuper performance in terms of everything  \nSay it battery, display, face I'd and Charging.  \nWe cannot keep spending blindly for a brand name who is not stable in terms of\nsoftware updates.  \nThanks Oneplus, you're a saviour.\n\n", "I'm definitely pleased with my 5T. I held myself from posting a review for\nalmost a month to test and see if it's consistent. And yes. It definitely is\nconsistent. This is the best purchase for the price and for the performance.\nThe battery life is enough to get thru a day with some left over if you aren't\na power user. The camera is good. The build is solid. The screen is darn good.\nAnd the UI is smooth and close to stock Android. Definitely worth it!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 December 2017", "on 8 December 2017", "on 9 February 2018", "on 28 November 2017", "on 3 February 2018", "on 4 February 2018", "on 30 January 2018", "on 30 January 2018", "on 15 December 2017", "on 29 December 2017"], "reviewer": ["Amazon Customer", "Joseph Charles", "Amazon Customer", "Pankaj Gupta", "Chinmay Kumar Pradhan", "Vimal Viswanath", "Adhikya", "anmolsahota", "Vinay", "Christas Mony"]},
{"rating": ["3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["It sucks", "Op5T...", "A beautiful / Good looking series of phone have started..", "Design ....to the level of  the hype created....", "Better than iPhone- when compared side by side with an iPhone X.", "The best Android smartphone out there", "Oneplus 5T- just go for it", "Awesome !!", "Best phone ever", "One more beast from Oneplus"], "review": ["Mobile is good but it's been just a month and it started hanging and Black\nscreen appears for some seconds. Touch doesn't work fine also it's camera is\nnot performing well. Never expected this to happen. This mobile was my dream\nbut now it's like a nightmare for me. It has started irritating me now. Hangs\na lot and touch problem and application crashes automatically. Even After the\nOreo update, it is ruined and....so am I. 😭\n\n", "Getting OnePlus again from Amazon. Its my second phone after using OnePlus\nOne. After switching to OP5T, my daily work has completely shifted to mobile\nrather than laptop.  \n*Just missed the Star Wars Edition.\n\n", "This phone doesn't needs a review..  \n  \nGreat phone.. today's date it has everything that even apple cannot afford to\ngive..  \n  \nInfact it is better than apple.. battery does'nt like apple.. you don't have\nto go like beggars to every place to get charged.. neither It gets space full\nafter upgrades like Samsung..  \n  \nSuddenly I am able to relate this brand with Image which Nokia had..  \n  \nOnly worry is these one plus guys should continue making such phones in these\nprice ranges, they should not jump their prices now and then..  \n  \nAnd specifically for Apple users.. no hard feelings.. friends.. try / test /\nupgrade.. to one plus.. this is a sensible choice..  \n  \nDon't be confused with all reviews overhere.. this is the best phone.. in\nmarket yet today.. after buying this my craving for best phone is done..  \n  \nHope this review works for you.. to decide..😊\n\n", "Excellent design...faster performance ..sleek look.  \nCamera yet to use & evaluate...  \nThe two useful features i am missing form my lenovo K4 are ( hope i have\nsearched it enogh ..)  \n1\\. Flip to screen off  \n2\\. While the call is in progress & you put the caller on speaker.... speaker\nagain goes off auto as you take phone close to your ear\n\n", "One word for it -Awesome phone . Great service by Amazon and green mobile. Got\nit in one day instead of 2 day delivery. The only thing was there was no offer\nof any kind or cashback like I got 10% on my last purchase of Moto G5s plus.\nAbout phone everyone know what it is and it is right now best in the market.\nThe only cons I can think of are-  \n  \n1) It has no memory card slot for it and although it is 128 gb , it is still\nsomewhat less for me.  \n  \n2) This phone and all the other Andriod 7.1 and 8.0 phones do not support\nMiracast. They only have chrome cast. And after trying hard I can't\nconnect/screen mirror it to my Sony Bravia TV.  \n  \nApart from these two the phone is good the performance of phone is better than\nlatest iPhone. The camera quality is great but still it lacks if you are a\nprofessional camera/DSLR user. But for the price you are getting all this is\nworth it. It is a total VFM.\n\n", "Simply amazing.. it's one of the best android phones i've used so far. Speedy\nboot, agile processing and UI is intuitive.. simply fantastic. I'm happy with\nmy decision. battery lasts upto 24 hrs on full charge, though depends on the\nusage so might be different for others, but I received upto 24 hrs on the\nfirst day of use. Camera is good, though not that great, but manages good\nshots. One can't get bored of this one so easily.\n\n", "I was searching for 2-3 months to buy phone which really gives me value worth\nits price. Finally i have zeroed down my searching to Oneplus. Then I was\nwaiting for launch of One plus 5T Lava Red as I didn’t want buy that usual\ncolors. Finally, I bought Oneplus 5T Lava Red on the very first day of launch\ni.e Jan 20, 2018 and got the same at an attractive price (got good old mobile\nexchange price and instant credit card cash back). Amazon delivered the same\nwithin 48 hours. This was all about my purchase.  \n  \nNow about the phone:  \nBest part of this phone is its camera – superb DSLR quality pictures.  \nLooks- Awesome looks.  \nFunctioning- with 8 GB RAM, it functions flawless.  \nDisplay is superb.  \n128 GB memory is very much sufficient storage.  \nOS 8 Oreo is another added feather.  \nThere is lot more to explore in this phone which I will be doing and updating\nsoon.\n\n", "Amazing phone with good specs. Been over 2 months now, battery backup is\nreally good after using the phone with leaving data & location on for the\nwhole day & playing heavy games for around an hour and also some usual phone\nactivity, the battery still remains around 35% which is really good. The\ncamera is quite good, but it's not that good for low light conditions.The\nphone is not too big as it seems from the dimensioning. The steel back looks\nstylish but there's no grip at all, this is why OnePlus gives the silicone\ncase. One good thing about OnePlus, you keep getting updates for bug fixes\nregularly. The face unlock is absolutely stunning, better & faster than iPhone\nX. It also works in complete dark areas. The finger print sensor at back is\nquite handy. Dash charging is a life saver if u forget to charge ur phone,\nit's really quick. All over it's the best in class within this range.\n\n", "I brought this phone for my dad on his birthday he paid the bill but girf from\nme and I must say this is the best phone I had ever seen used in my life .\nPerfect can describe one plus 5T in one word .My dad always used to say that\nwhy these phones are so costly and are they even worth ? I think he got his\nanswer .He loves this phone .  \n  \nThe features I think this phone got are -  \n1\\. Charging speed ,If you never owned a flagship phone in ur life than\nbelieve me you would be stund by it's charging speed it's incredible .But I\nwould point out one thing that the battery life isn't that great but kind of\naverage .  \n2.user interface ,If you love stock Android like I do, you would love one plus\n5T.  \n3.Snapdragon 835 is a beast doesn't matter how heavy a game is it would crush\nit like candy crush .  \n4.Camera .I love it's camera it's super fast and pexilation is a never seen\nfriend .\n\n", "No doubt oneplus is the best flagship smartphone manufacturer.  \nBest phone, fastest phone. The most i love is the face unlock which is\ninsanely fast.  \nAlso beats iphone X in speed test.  \nJust go for it. Dont think twice\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 February 2018", "on 16 December 2017", "on 5 February 2018", "on 5 February 2018", "on 18 February 2018", "on 29 November 2017", "on 23 February 2018", "on 10 March 2018", "on 21 December 2017", "on 1 December 2017"], "reviewer": ["Anjali", "Sameer TJ", "Vikas Suresh Gupta", "Avis", "Amazon Customer", "Dhiraj Mahindra", "Amazon Customer", "rajat", "Amazon Customer", "Biswajit Newar"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Excellent phone. I'm very happy with it", "It is a very good phone in a Price budget of 35000", "Best Buy For 2017", "Awesome phone. My previous phone was MI Max", "Excellent phone no heating at any time while charging and ...", "This is an amazing phone with no bloatware unlike others", "Great delivery and exchange experience!", "Excellent mobile for now and next year", "Value for money.", "Awesome Phone in this price range. True flagship killer. Go for it !!"], "review": ["Excellent phone. I'm very happy with it. Best bang for your bucks. The in-hand\nfeel is spectacular. Devices felt very well balanced & the weight distribution\nis almost spot on - this is something which Apple has executed well in the\npast. Glad to see OnePlus paying attention to these details. The screen is\nbright, clear & unless you pixel-peep with a magnifying glass, you won't\nnotice any pixelation. Battery life is also acceptable, lasts for a day &\ntopping it up with the dash-charger is easy-peasy.  \nPhoto quality is mostly great under normal conditions and unacceptable in\ndarker situations. But that's okay with me. I didn't pay a small fortune like\nI would have for getting an ivy-league iphone or a Pixel. Overall, great phone\n& I don't see myself upgrading or changing anytime soon. This phone offers all\nthe phone I would need for the time being.\n\n", "It is a very good phone in a Price budget of 35000. As one plus is giving\neverything that a smart phone of 2018 should have. Camera quality is superb\nand bokeh effect is good too. Performance wise it don't lag and battery\nperformance is also decent.  \nThe users who like to play a lot of games then it is a good phone for them as\nit didn't heated much and didn't lag even on games like Nova.  \n  \nSo far it is a very good phone to buy in a Price budget of 35000\n\n", "Took a while to get used to such a good phone. Blazingly fast, simply refined,\nbrilliant camera... Lots to like. You have to use it to know just how well it\nperforms, like a charm. Order via Prime sale, came in under 24 hrs and since\nnever been set aside. Check out more reviews of it. And don't believe the hype\nthat it's not good enough. The others are way too expensive to compare and\nstill this trumps them.  \nBlindly do go and pick this. You'll regret you thought of anything else.\n\n", "Posting this review after all most 1 month use. I bought it early prime sale.\nAwesome phone. My previous phone was MI Max. That was quite big phone.. but I\nlove 5T, user friendly easy to handle. I can feel the change. Only problem\nwhich I'm facing sudden app close, I don't no whether it is hardware problem\nor apps. Becoz of this I'm giving 4 starts. Cameras are awesome, front facing\ncamera is amazingly clear.\n\n", "Using since a month, Excellent phone no heating at any time while charging and\nCharing and talking.  \nCan choose which application should use the mobile data network , as in\niPhone. I left iPhone due to double sim requirement.  \nMobile cover + Screen guard is supplied, but NO HEAD FONE\n\n", "Have been a Samsung user throughout before switching to one plus. This is an\namazing phone with no bloatware unlike others. I am happy and amazed with the\nphone with regards to the battery, design and almost everything. One plus has\na dedicated team who hears community and work on creating a phone that user\nwants unlike big brands who works to make more money. Would definitely\nrecommend this phone without a second thought.\n\n", "Recieved the product within 18 hours, and exchange was hassle free. Have only\nbeen using the phone for a couple of days now but so far so good! Have only\ncharged the phone for 20 mins in the past 2 days, and the battery is going\nstrong, which is a huge change from the earlier phone!\n\n", "I have been using mobile over a month now. As of now per inoovation available\nin market, this has perfect hardware spec and performance. Particularly camera\n3d effect. Amazing! As if DSLR is in hand, love to take pics now. Mobile is\nvery fast may due to optimised hardware and 6gb ram. 6in screen with 5.5 inch\ntraditional mobile size, very handy.. finally it's thin and low weight..great\nmobile to own for next 3 yrs, provided Oreo and Android 9 updates are\navailable..\n\n", "The first thing I love in this the screen.  \nI think this the best value for your 33k.  \nEveryone review channel mentioning wireless charging in this device but I\nthink we don't need that charging because my device charge it full in one hour\nand around.  \nThe best thing about 5t is rear camera set up. But about disappointment from\nfront camera because it won't capture in wide angle.  \nBut overall it's an amazing devise till now experience.\n\n", "Mind blowing Phone. Truly flagship killer. Go for it !! It's close to 15 days\nnow since I am using it and I loved the phone so far. Sharing my overall\nexperience here.  \n  \n1\\. DELIVERY - Thanks Amazon for On time delivery 👍.  \n  \n2\\. LOOK & FEEL - One word - SMART 😎😍. Extra care to be taken though while\nputting the phone on to the surface as rear cameras are bit seeing outside\nfrom the body. Can overcome this by using some decent back. One transparent\nBack cover is provided in the box along with screen guard applied on the phone\nscreen.  \n  \n3\\. PERFORMANCE - Incredible so far. No lag. Played multiple Heavy games like\nAsphalt extreme, Taken, 3D tennis etc and OP5T welcomes and handles them\npretty smooth with no phone heatup observation so far. Oxegen UI - Simplicity\nis the best. I am on Android - 8.0.1; Oxegen OS - 5.0.4.  \n  \n4\\. BATTERY - Awesome so far 😎. I usually charge in alternate days with avg 5\nhrs screen on time. Dash charging is gr8. Takes approx. 1 Hour to charge from\n2 to 100% (Screen-shot attached).  \n  \n5\\. CAMERA - Great Camera. Not much settings to tweek. But having multiple\nmodes (Pro, photo, slow-mo, selfie, portrait - for Bokeh feature to shoot DSLR\nlike photo which works pretty well). Decent low light photos. Selfie camera is\ndecent. However, couldn't find Bokeh feature in front camera so far. Take a\nlook on the shoots attached.  \n  \n6\\. OTHER FEATURES -  \n\\- Loudspeaker and headphone sound quality is decent.  \n\\- In built call recording feature is good.  \n\\- Extra features are pretty smart  \n\\-- 3 fingers screenshot.  \n\\-- 3 diff display modes (Normal, Night & Reading which make the display B&W\nand can be enabled app wise.)  \n\\-- Multi-tasking while making one app minimise on bottom side of screen just\nlike YouTube videos and look something else on phone.  \n\\-- Game-do not disturb mode.  \n\\-- Face unlock and finger print scanner are super fast.  \n\\-- Taking selfies from finger print point.  \n  \n6\\. OP COMMUNITY APP - Keeps the users up-to-date with the phones updates etc.\nGet instant response from OP team.  \n  \nCONCLUSION - Overall it's worth buying phone indeed comparable to it's other\ncompetitors available in market in this price range !!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 February 2018", "on 18 January 2018", "on 15 December 2017", "on 15 December 2017", "on 25 January 2018", "on 15 December 2017", "on 23 January 2018", "on 21 December 2017", "on 25 January 2018", "on 11 March 2018"], "reviewer": ["Raju  P", "Amazon Customer", "Michael Vivian", "Amazon Customer", "Shopper A", "Amazon Customer", "rekha rane", "Amazon Customer", "praneeth", "Harsh Dutt Sharma"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Its a great mobile", "Best for the price.", "Great phone. Superfast and amazing experience", "Witness the raw power and speed", "It's software is smooth and fast and best hardware. camera is better but rather than nature ...", "Amazing Job by oneplus.", "Simply the best phone in the world taking all factors into consideration.", "Performance and price at it's best!", "Its good but has the Chinese feel.", "Best Battery efficient phone"], "review": ["Simply awesome.. Best in the market. Only one request.. Should have included a\nbetter cover/case and an earphone. It will be a nice gesture.  \nMobile is a beast no doubt about that.\n\n", "Bought this after exchanging the OP3. I think the display is what makes this\nphone absolutely magnificent. The battery life is insane! You get minimum 4hrs\nSOT.  \nIt's light, premium and feels good.  \nThe camera is average. Yes it is average in low light. To he totally honest,\nit's bad in low light. Even the portrait is meh. Software updates may improve\nthat.\n\n", "Great phone. Superfast and amazing experience.  \nVery good camera quality: back as well as front. Also, it has nice depth\neffect feature.  \nVery good configuration.  \nPerformance is good. No lag at all.  \nSound quality is decent enough.  \nBest phone in this price range.  \n  \nDrawback:  \nCould have provided SD card expandable memory.  \nDesign could have been something unique.\n\n", "This phone comes with the flagship hardware from all the aspects excluding the\ndisplay resolution (which is far better many other smarties in this price\nrange). OnePlus has yet again proved their capability to deliver a beast\nwithout hitting the price bars high. And they have already established a very\nstrong fan base in India as well as the international market. I gotta talk\nabout the camera here. Whoaaaa... Not the best one for those who use it in\nAuto mode. But once u step into the Pro mode, you will definitely feel the\neffort OnePlus has put into this phone. Just amazing with the freakin fast\nSD835 chip powered by the-jaw-dropping 8GB RAM. Some people are so worried\nabout the SD card slot. We have 128 GB storage which for me would take my\nentire life to get filled :P. #LaveRed: the new color invented by OnePlus :P.\nI suggest them to better obtain patent rights for this color. For a rufous\nperson like me, this phone is damn sexy. Forgot to mention the screen\nbrightness and the vividness. It is one of the best in its class.  \nFinal word: Yet another victory for the #TeamOP #Kudos.\n\n", "This phone has unbelievable speed of charging. It's software is smooth and\nfast and best hardware.  \ncamera is better but rather than nature photo it processes the image and make\nit look beautiful.  \nPhysical appeaance of mobile is way average compared to what we see in\npictures and battery is 3400mah which is one and only drawback of this\nflagship phone.  \nOverall it is best phone to buy but i think it is over priced by around 5k.  \nYou can definitely go for it even if this negative sounding review.\n\n", "This one from oneplus is just amazing, the build quality is top notch, just\nholding it feels premium and the overall UI experience is fluid and coming to\nthe camera though he had provided with same sensors having same focal length\nit manages to take good portrait images even in low light than that of oneplus\n5. Coming to accessories the addition of a silicon case with the smartphone is\ngood Add-on from oneplus. So to include with the review I would say you won't\nregret once buying it and using it, so it's a big yes from me for people who\nare looking for perfect budget smartphone which is capable to compete with the\nhigh end ones easily.\n\n", "Worth your money when compared to other flagship phones. They are over priced\nwhile this serves your need with same and even better specs at even lesser\nprice. Don't forget to use the other benefits like 12 months accidental\nprotection (because of this there is no need to worry about water\nresistantance) and zomato gold (already unlocked it thrice in a month. I'll\nsee if I can get my phone's cost using this :p ). Iam in love with my phone\nafter many years.\n\n", "Simply the best!  \nUsing this phone for the past one month now. It is undoubtedly the best phone\nin this price range. One plus has done it right, combined the best hardware\nwith the smooth silk and user friendly software.  \nPros:  \n1)Beast in performance with snapdragon835 processor and 6/8gb RAM.  \n2) Almost feels like unlimited storage with 128gb variant.  \n3) Dash charging- 0-full charging in 1hour 10 minutes.  \n4)full 1 day battery life with heavy use. 1.5 days with light to moderate use.  \n5) Highly customizable software- gestures and navigation button functions have\nmade power button obsolete.  \n6) Blazing fast face unlock and the fastest finger print scanner in the\nmarket.  \n7) A very good camera for the price range.  \nCons:  \n1) Audio and speaker quality could have been better.  \n2) Low light photography needs improvement.  \n3) No portrait mode in front camera.  \n  \nApart form all these, this phone just destroys all competition in this price\nrange. A must buy for someone with a range between 30-40k.\n\n", "Everyone must be knowing the pros of this phone, so I will just point out the\ncons:  \n1\\. Sometimes touch becomes irresponsive.  \n2\\. Should have provided secondary lens as telephoto lens.  \n3\\. Low light photography is not that good and looks noisy and artificial.  \n4\\. The led notification sometimes blinks wrong colour.  \n5\\. Dash charger sometimes won't work and you need to remove and insert once\nagain.  \n6\\. Sometimes Sound comes from speaker even after plugging earphones.  \n7\\. Very bad placement of power and volume buttons.  \n8\\. Alert slider is not comfortable to use.  \n9\\. Sometimes ringtone go silent while receiving calls.  \n10\\. Many indian units have issues like sudden call dropping, call connecting,\nnoise during call, voice breaking which is not a network related problem when\nwe checked.  \n11\\. Ambient light sensor works weirdly which makes me to increase the\nbrightness manually.  \n12\\. These things makes me feel like using a typical Chinese phone. It is\nactually Chinese though 😉\n\n", "Got Yesterday, still running at my first Charge(24% right now) with 8+ hours\nof screen time. Everyone knows OP 5T is Flagship phone in specs and\nperformance, thing you don't know is more than Flagship level in Battery\nperformance. I'll give my full review after 3months of usage.  \n  \nP.S: don't need to charge for 8hours at first charge. I unplugged after 100%.\nThis is lithium battery don't need that old style 8hours charge. Google for\nmore.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 January 2018", "on 23 December 2017", "on 9 December 2017", "on 20 February 2018", "on 5 March 2018", "on 1 December 2017", "on 17 December 2017", "on 23 February 2018", "on 26 February 2018", "on 9 January 2018"], "reviewer": ["Sreevisakh S", "Amazon Customer", "Amazon Customer", "Rajadeepan S", "Akash Amin", "YSN.KISHORE", "ravichandra", "Amazon Customer", "Raghavendra", "Murali Manohar"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["May the force be with you", "Extended Warranty for 3 months on your Oneplus 5T", "Top Notch", "For a user like me who jumped from j7 prime to 5T", "Best phone in the market.", "How to describe it", "Mind blowing device.", "AMAZING PHONE", "Blue tooth issues", "Very very good phone"], "review": ["One of the best phones I have used till date.  \nComing from iPhone 6s to this was a very nice move as I am getting the best\nfeatures at low price.  \nDisplay,camera,software,sound - all A+  \nFront camera doesn't have portrait mode  \nI have the star wars limited edition - the force is strong here!! Guys and\ngirls, if you want the best features Inna phone but don't want to shell out\nmuch on iPhone 8/X then this is where your search ends.  \nThank you Amazon for a speedy delivery\n\n", "I am sharing these two codes with the community so that you can get free\nextended warranty for 3 months.  \n  \nThe coupon code is only for the purchase of One plus 5T midnight colour\nvariant  \n  \nHere is the code for this :  \n  \nCoupon code for use on purchase of OnePlus 5T (Midnight Black 6GB RAM + 64GB\nmemory): removed by Moderator  \n  \nCoupon code for use on purchase of OnePlus 5T (Midnight Black 8GB RAM + 128GB\nmemory): removed by Moderator  \n  \nThe person will have to purchase the device from Amazon India only. Valid from\nFebruary7 to February20 2018 ).  \n  \nYou will receive the confirmation e-mail confirming the activation of the\nextended warranty as applicable by March 31, 2018  \n  \nWhen you add this product to your cart you will be asked below for the\npromocode, you have to apply this code over there.\n\n", "Perfect Smartphone with Highest Specifications and smoothest Android Software\nExperience.  \nLoudspeaker Volume is very high, just Quality of sound is not as good as Pixel\nPhone(Only Con is No Stereo Speakers.)  \nExtremely happy.  \nDash Charger......best best bestest ever.\n\n", "Service :  \nEver heard of fastest service? Yes! That's Amazon. I had to pay Rs. 150 extra\nfor immediate delivery... And it reached me before 11 hours...  \n  \nAbout the phone :  \n  \nThis phone's a killer...  \n  \nFor a user like me who jumped from j7 prime to 5T, this phone has a lot of\nfeatures that are surely gonna surpass your expectations...  \n  \nCamera :  \nBest at low light photography...  \nI guess they have to work on fixing the stability issues on 4k video mode.  \nDual camera takes a lil while to focus the image...  \n  \nFastest unlock with face lock even in the darkest room, it actually utilises\nthe screen's brightness to capture.  \n  \nBattery life and charging are excellent!\n\n", "i must say it is one of best phone in the market. i ordered on 30th Dec and\nreceived it next day and since then i am going ga- ga over it.the\nbuilt,design,looks,features..everything u name is just amazing.  \ni got 8GB phone and the speed is mind blowing.  \nif you are seriously looking for a phone and having a budget of 30+k must go\nfor it. u wont be disappointed.\n\n", "Everyone knows features and performance by seeing videos and reading different\narticles. for me it's as per seen in YouTube unboxing and article I read\nbefore purchasing. I will give five star\n\n", "The product was delivered on time! The packing was great. Product condition\nwas top notch. Everything about the phone is great. Except maybe the back-\nfacing fingerprint sensor. It works like magic, but I personally don't like a\nback facing fingerprint. Face unlock Is really fast. Marvellous job by One\nPlus. A slight heat up in playing really RAM consuming games, but that's\nunderstandable. Overall, it's a great device ! Certainly go for it.\n\n", "Was waiting for the phone badly but missed it's first sale but got lucky to\nget it on it's second sale. Purchased in November and using for last 40/45\ndays  \nGot cash back also...  \n  \nNow about phone..  \n  \nDisplay - 5 on 5 - amazing viewing experience, be it low light or in sunlight.\nIt has got amazingly bright screen and very gentle on your eyes at the same\ntime. just opt for adaptive brightness with night mode timings on  \nIt's best view and great for eyes as well.  \n  \nCamera- 5 on 5 - Amazing camera quality. You would never miss your DSLR when\nyou have this phone in your hands.  \nCamera clarity is amazing. Choose any mode you want for different effects and\nit gives you an amazing quality picture, be it low light or bright sunny day.\nI got a portrait made out of pictures clicked from this phone with size of\nabout 4 feet long. Not even a single sign of blurr here.  \n  \nPerformance- 5 on 5  \nBest phone ever used till now for multitasking. Used several makes like apple,\nSamsung, blackberry, Sony but never got such great performance. Wether using\nheavy games or any other official work. it's switches very smoothly\neverywhere. Finger sensor responds very quickly and also face recognition is\nsmooth and phone unlocks really quick on face recognition. Voice recognition\nalso works well. Never found any difficulty or issue in this 45 days of use.  \n  \nAll in all  \nBest phone in market.\n\n", "Just discovered that Blue tooth not working correctly after the very first\nmonth of purchase...\n\n", "Shifted from Iphone 6s to one plus 5T.. was hesitant initially.. But 5T nailed\nit.. super smooth.. blazing fast.. beautiful phone and great display as well..\ndid not find any lags/slowness till now.. starting to love this.. Face unlock\nworks just fine.. (Sometimes in rooms with low light it does respond after a\nfew secs except that it works decent ) We anyways have a finger print\nauthentication as a backup.. very good purchase..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 December 2017", "on 7 February 2018", "on 29 December 2017", "on 11 February 2018", "on 3 January 2018", "on 12 December 2017", "on 29 December 2017", "on 4 January 2018", "on 4 January 2018", "on 27 November 2017"], "reviewer": ["Abhijit", "Rahul", "Shoaib Patel", "Surdeep Devanathan", "Sonam Gupta", "Akshat Sharma", "Amazon Customer", "dhraj", "ameet", "Sujith Kumar"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["INDEED A FLAGSHIP KILLER", "Brilliant Phone", "Superb Value for Money", "The Value King!", "Perfection all the way", "Great Phone in all areas except :", "Best value for money phone in mid range bracket", "Nice phone", "Finally feel upgraded !", "Blazing fast fone jus go for it..."], "review": ["I just love it!  \nThe performance is simply awesome. This phone is crazy fast.  \nThe AnTuTu benchmark score is 208809  \nCamera is good and it's better than Iphone. Can't compare it with Sony\nflagship phones even though it has got Sony lens.  \nFastest Face recognition ever  \nBattery life is awesome  \nDash charging is simply great!  \nThis phone never ever slows down on heavy usage and there is no heating issue.  \n  \nCheck out for protection cover in Dbrand India. It's awesome, you can\ncustomize the back cover as you wish.\n\n", "Brilliant all round phone... Excellent performance, display is superb and a\ngood camera for the price point.. Face unlock works surprisingly awesome\n\n", "An excellent phone. I upgraded to oneplus 5T from S5 and the new larger\ndisplay + increased speed is a breath of fresh air. Great phone and excellent\nvalue for money. The Star Wars customization was what tipped the scale for me\nas I weighed buying a similarly priced android phone from different companies.\n\n", "The OnePlus 5T is clearly a winner in all aspects.  \nI've been getting consistent 26-30hr battery performance (Location permanently\nset to high accuracy, switching between 4G and WiFi, medium to heavy usage),\nthe screen looks great and performance is on par with the flagships(if not\nbetter).  \nThe camera could be better but is good enough for everyday shots.  \nIt's a clear, reliable and stylish choice for people looking for high end\nperformance at an affordable price.\n\n", "This is the most perfect android device out there which can compete with an\niPhone (switching from apple, as am not happy with iOS11).  \nEverything about the device is awesome except for the low light camera\nperformance, which is also not bad compared to other phones at this range. but\nsince they claimed it to have it improved so much with that secondary camera i\nhad high expectations and it was a bit let down.  \n  \nApart from that I am glad i waited a while for this one. definitely\nrecommended as an happy customer.\n\n", "The phone is the best I have ever come to use.  \nThis has a great camera and everything is just so perfect and smooth, the\ndesire to use this phone is uncontrollable.  \nThe phone has 3500 Mah battery, which due to the large screen size, struggles\nto pass through the day and gives a screen ON time of about 6 hours at low\nbrightness. But, the dash charge compensates for that high speed reduction of\nbattery.  \nWish that this phone had a bit more bigger battery.  \nRest! This phone is the best!\n\n", "Rated the best value for money phone of 2017 and deservedly so.  \n  \n• Vivid and sharp AMOLED display  \n• Wonderful battery life  \n• Dash charging is amazing  \n• Face Unlock (though not new to Android) works extremely fast and well in a\nwide range of lighting  \n• Android Oreo about to come to the OnePlus 5T  \n  \nOverall a very good buy for the mid range price bracket providing a near high-\nend experience.\n\n", "Overall Nice Device.  \n  \nGood points:  \nExcellant Performance,  \nNice battery backup  \nDisplay is good.  \n  \nBad points:  \nCamera picture on dim light is not very good\n\n", "Timely delivered.  \nThe phone comes with super clear large display. Sleek body and the design will\nkeep you amazed.  \nGood battery life and high quality picture clarity.  \nSpeakers are way better than my previous phones.  \nOverall the experience is very good and I feel contented with my purchase.\n\n", "Nice super fast fone, good for gaming, every one better buy 128 gb version, no\nheating whatsoever, camera better than previous one plus, doze mode has been\nimplemented well just like iPhones, almost no idle battery drain, I miss the\nfront fingerprint sensor of my OP3.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 March 2018", "on 2 December 2017", "on 1 January 2018", "on 1 January 2018", "on 3 December 2017", "on 18 January 2018", "on 18 January 2018", "on 19 January 2018", "on 4 January 2018", "on 2 December 2017"], "reviewer": ["Amazon Customer", "Vikram Ramesh", "Zephyr", "Siddhant Sawhney", "Kumar R", "Amazon Customer", "Nishant", "Abhay Kant", "ajay prakash", "Ambar M."]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["My honest review", "... 3 months now and I have got a really good experience from it", "BEST FLAGSHIP PHONE", "Brilliant phone. Really snappy", "OnePlus the best and beast android phone ever in mobile industry", "Just one word 5T is awesome whether its camera or its performance", "superb phn with really fast dilivery !!!!", "Value for money #topnotchof2017", "One plus 5t 64 GB", "Excellent phone for a great price!"], "review": ["I use this phone for one month but this phone is very good and very fast\nperformance and looks like a very smooth this camera is perfect dual camera\nInfinity displays the best display segment display PPI is best face lock and\nfingerprint based 8 GB RAM and 128 gigabyte help your performance mobile..\nthat's it so no hesitation go for it\n\n", "I have been using this phone for about 3 months now and I have got a really\ngood experience from it. The phone is having Soo many awesome features but one\nwhich makes this phone so unique is the charging speed it charges too much\nfast and drains battery really slow so the phone is really good in any sort of\nemergency this. OP5T gets a little bit warm than others that is because of the\nover clocked CPU and it's warmth is almost unnoticeable. The is also really\ngood for gaming too which means this phone can run any game on it and by any I\nmean any game (fortnite is also coming soon for mobile). Also it has also\nreceived Android Oreo update so enjoy the latest OS. At last let me mention\nthe camera it takes beautiful pictures. The sound quality is also good not the\nbest but not bad either. Overall people might think that it's an expensive\nphone but something you need to realize is that the features like 8 GB RAM ,\nSnapdragon 345 , Aderno GPU , fast face and finger print unlock, 6 inch AMOLED\ndisplay, 3300 mAh battery , ultra super hyper speed charging speed you can get\nall these features in any other phone for minimum RS 70000 and One Plus 5T is\njust RS 38999.  \nAlso for a side note my OP5T is Star Wars Edition.\n\n", "Fantastic phone , its really a flagship killer . The phone is extremely fast ,\nand the camera is just awesome including the portrait mode and slow motion\nvideo recording.  \nIts really a compiditor to Samsung flagship products and iPhone.  \nBut only one cons of this phone is that the portrait mode is not that much\nefficient in low light conditions , however its not a major factor . Its\nreally a fantastic phone special the built quality and the processor , its\njust fav.  \nI love this phone💓\n\n", "Brilliant phone. Really snappy. Its been a smooth experience since i bought\nit. It comes with a pre applied screen protector and and a black translucent\nback cover as well. Best part is the dash charge.it charges 0 to 100 in around\n50 mins. And the battery is big enough to last an entire day.\n\n", "Hi guys , I have been using OnePlus 5T from 11 days ..it is beast phone and\nworking very nicely..i am very sure that OnePlus 5t wins hearts which every\nandroid company doesn't.. My choice is 128gb mid night black..  \n  \nPros.  \n01\\. 18:9 full bezeless display.  \n02\\. Protrait mode works nicely.  \n03\\. Face locking.  \n04\\. Long lasting battery.  \n05\\. 8Gb ram  \n06\\. Well priced  \n07\\. it's OnePlus brand  \n  \nCons.  \n01\\. No single cons .\n\n", "my Previous phone was oneplus 3t phone and i was impressed by it and hence\ndecision to buy 5t - Again very impressed by it  \nOnly Glitch is my 3T was updated to Android 8.0 Oreo and 5t is still on Nougat\n- weird !  \nI am so spoiled by dash charge of 3T that i couldnt go to any other fast\ncharging phone...Just one word 5T is awesome whether its camera or its\nperformance.  \nBut at price of 33k, they must atleast provide slot to expand memory - thats\nthe only CON i see in this phone...Still five stars to it\n\n", "the delivery was quite fast the phn is over all very good  \nfeels great in hand  \nthe face id is insanely fast !!!  \ndont forgort to to buy the free accidental and damage protection plan from\nkotak 811 the details are givien in the special offer option !! it works\n\n", "Writing this review after 2 weeks of usage..  \nBattery - last easily upto a day and more (moderate usage)  \nPerformance - butter smooth  \nCamera- very crisp and clear even in low light (zooming reduces somehow\nquality but not an serious issue)  \nBuilt- slim and handling is easy on hand  \nWas very confused to select mobile as dis is d first one plus company mobile\nfor me .But I did the right choice over Samsung ..Any 1 planning to buy it\nwith having budget 33k go for it without hassle free.\n\n", "It is a good phone but I can't say it can perform in the long run better than\nSamsung.  \nWhat I like the most is face unlock and finger print.These both are quick. It\nis a slim phone.I like the camera too.  \nIt's speed is also good. Overall I am happy with the phone. I don't know how\nit will perform in the long run. Dashcharge is not that quick but it is ok.I\nbought in Amazon prime and I got in two days. The phone by Amazon is good and\nu can believe Amazon.T  \nThanks Amazon.\n\n", "I have been using this phone for a little over a month now, and it has been\ngreat. Having previously used the note series and the iPhone 6, I am very\nimpressed with the speed and smooth performance of this device. The superb\ntechnical specs do translate to a great user experience.  \nWhile the camera might not be on par with the pixel 2 or the iPhone X, it\ncertainly is a good camera and since a side by side comparison is unlikely for\nmost users, this makes for a great value for money proposition.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 January 2018", "on 18 March 2018", "on 15 January 2018", "on 2 February 2018", "on 16 December 2017", "on 31 January 2018", "on 13 December 2017", "on 17 December 2017", "on 16 March 2018", "on 6 January 2018"], "reviewer": ["Raktim Das Mahapatra", "Manthan Vashishth", "Siddharth ", "Amazon Customer", "TADIKONDA NARESH", "Manas Goswami", "Yash", "Vaibhav Bailur", "Gangadhar", "vas"]}
]