[
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["gladly get this one its fun to have a wireless controller.", "WILL IT BE A REPLACEMENT FOR XBOX 360 CONTROLLER? (DETAILED REVIEW)", "Awesome Product 😎", "Must buy for gamers!", "Good quality gamepad - looks solid and premium!", "Amazon Wishlist Trivia", "Great looks and Great Feel. Value for money.", "A compact beast..", "Works perfectly but only for Windows PC", "Game wireless without being penniless."], "review": ["this is my second controller i am presently using the logitech 310 which is\nvery comfortable and a top notch product beats any controller at any time. so\nbefore reviewing i just wanted to give a context as to what redgear was up\nagainst. and after doing intense gameplays including fifa, need for speed, far\ncry i must say red gear performs well. people have been saying about\nconnectivity issues, i found none a great wireless controller for the price.  \ni want to point out that this controller is not very comfortable for playing\nfifa at a stretch i found this during marathon gameplays with my buddies since\nthere is no rubberised thumb grips on the analog sticks, which was there on\nthe logitech one.  \nnext the build quality was very good for the redgear.  \nbattery backup was just awsm.  \n  \ni got this one only for the convenience that a wireless gamepad has over their\nwired counterpart i.e. in my case logitech. by no means i found any latency\nissue with redgear the gameplays were smooth and precise. only down point is\nthe non rubberised analog thumb grips over all this is an amazing controller\nand i cant recommend them enough. definately buy this one.  \nand one more thing try to go for the dual dongle one as its the same price,\nplus you get a back up dongle which many of you will definitely like. hope you\nguys find this useful as i tend to research my purchase before i get one.  \nso after gaming for some more time i noticed something(the thumb grips were\ntoo slippery so i added hot glue it also prevents the flaking of the rubber on\nthe grips) but that is very minute and i fixed it using some hot glue and its\nperfect now no need to buy thumb grips now. see the pics to get the idea.\n\n", "================  \nINTRODUCTION :-  \n================  \nGamepad has become quite an essential requirement for gaming. Every Pro gamer\nmust require to master this technology. To fulfill the need RedGear has\nlaunched its own series of gamepad. Though most of their gamepad are worth\nbuying but nothing beats the ease and comfort of this gamepad.  \nThe product is not new but still it is one of its best in its series. I have\ntried many other gamepad but nothing beats this gamepad. The product give its\nbest in its price range. It gives an edge over most of its competitors at the\nsame price range.  \n  \nThis controller goes after the Xbox360 design, so casual gamers who are on a\ntight budget can enjoy an alternative gamepad with a price tag of Rs.999  \n  \n================  \nBOX CONTENTS :-  \n================  \n• Gamepad.  \n  \n• Micro USB cable.  \n  \n• Driver Cd.  \n  \n• A Quick Manual.  \n  \n• USB receiver.  \n  \n========  \nPROS:-)  \n========  \n• Cheaper than the Xbox360.  \n  \n• It is wireless.Clutter free.  \n  \n• Excelent Range.  \n  \n• Average Battery life.  \n  \n• Xinput controller.  \n  \n========  \nCONS:-(  \n========  \n• Multiple wireless device on the same frequency disturbs the signal resulting\nin laggy gameplay.  \n  \n• No bluetooth, so android phones will need an OTG.  \n  \n• Service Centers are in limited regions.  \n  \n• No application to change the sensitivity of the LT and RT buttons.  \n  \n• Micro USB provided is only for charging purposes. You cannot use it in Wired\nMode.  \n=============  \nFEAUTURES :-  \n=============  \nOne of the many things I love about this controller is that it not only looks\nlike an Xbox360, it is an Xinput controller, where your PC detects it as a\ntypical xbox controller, so you dont need to configure using 3rd party\napplications to fool your gaming rig that it is an Xbox controller.  \n  \n==================  \nWIRELESS RANGE :-  \n==================  \nYes it is wireless using RF signals at 2.4 ghz no bluetooth so it isnt exactly\na solo device. You need to hook it up with a USB receiver. The Range is\nexceptional for users who want to buy this for a couch play in your mancave or\nliving room. But tends to lag in gameplay when you have multiple wireless\ndevice using the same frequency causing signal interference.  \n  \n===============  \nBATTERY LIFE :-  \n===============  \nThe company says 10 hours. Now i havent been able to test that but for casual\ngamers such as me, i charge it after 3 days with 2 hours of gameplay under the\nbelt.  \n  \nThe charging is done by a Micro Usb cable with a duration of 6 hours for a\nfull charge. The LED indicator flashes in charging mode and shows no light\nwhen its full.  \n  \nCan we play it in WIRED MODE?  \nSadly you cant. The gamepad only accepts the cable for charging not for wired\ngaming.  \n  \n==========================  \nDESIGN AND BUILD QUALITY :-  \n==========================  \n• The gamepad is is of hard plastic with rubberized grips on both ends of the\ngamepad, suitable for persons with sweaty palms.  \n  \n• The X,Y,A,B keys, Dpad, analogue stick all resemble the Xbox360 controller.  \n  \n• The vibration is moderate but not at all disappointing. Although its\nessential that you have to install the Driver that came along with the Disk.  \n  \n• The button press feedback is crisp and on the lighter side. However the\nrubber on the analogue stick has an off chance to wear off with consistent  \ngaming so i suggest to buy thumb grips for longer life.  \n  \n• The Dpad could have been improved with a round layout to actually feel that\nyou are pressing two buttons for a bidirection control.  \n  \n• The LED indicator shows you whether it is Xinput mode or Dinput mode.  \n  \n• The turbo mode here is a toggle button which enables you to simulate rapid\nbutton presses that you can customize on which button you need to  \ndo.  \n  \n• The X,Y,A,B buttons are backlited.  \n  \n==========  \nVERDICT :-  \n==========  \nIf you are looking for budget friendly gamepad, then look nowhere else. I am\npretty sure it won't disappoint you. Though it will not give you the Feel of\npremium gamepad, but getting one for third price with just one or two less\nfeatures, is a brilliant buy.  \n  \nIt requires xinput to give vibration feedback. The R3/L3 click button feedback\nis not so good. But no complaints for the cost effective controller.  \n  \n[...]  \n.  \n&  \n.  \nYou owe me a Smile :-)\n\n", "For the price this comes in I would say it's not the cheapest but it is worth\nit. If u want a controller which is Xbox kind go for it. The keys are super\ngood except the ones which are labelled as LB, RB ( These are good for usage\nbut for longer play time I would suggest u change your game controls for\nbetter experience). Next the haptic feedback is great and for the price this\ncomes in u cannot expect any more. I got this in a deal for rs 1100.\nErgonomics are top notch and the grip layer in the palm support is like icing\non the cake. Battery backup is great with very low charge time. This product\ncomes with 1 year warranty for manufacturing defects so this ensures your\ninvestment. If you are a game enthusiast and is looking for a gamepad just\ngrab it and you won't regret your purchase. It works on both Android phones\nvia an OTG cable and on computers with a quick paring dongle. It comes with\nlights and different modes which help significantly.\n\n", "Bought it for 999 which was pretty amazing deal and as was the product. Works\nvery fine and is the best in available price range.\n\n", "Good quality gamepad. looks solid and premium. Redgear pro gamepad is best\noption available right now for budget wireless gamepad. it's take 2 hours to\nfully charge. In just single charge its giving me more then 10-12 hours of\nbattery backup. So Battery backup is amazing.  \n  \nRegear pro gamepad is made for windows OS but you can also use this gamepad in\nandroid phones as well. But i try this gamepad in 3 android phone and its only\nworking in 1 phone. This gamepad is perfectly working in Redmi note 4 but in\nstock android phone (Lenovo K8 Note, Lenovo K8 Plus) this gamepad is not\nworking! check out my full review video on YouTube for more info!  \n  \nIf you like my review click on Helpful Button!  \nCheck Out Full Video Review On My YouTube Channel!  \nLink In The Bio!  \nThanks!\n\n", "I gifted this to my boyfriend on his birthday. I don't know anything about\ngaming. The last game that I played was actually Snake Xenia on a Nokia phone.\nGames make me nervous, probably because my hand-eye coordination sucks. Then\nagain, my boyfriend is a gaming addict. I somehow accessed his Amazon account\nand saw his wishlist. I saw this baby as one of the things he wanted. It was\nin my budget and since it was on his wishlist, I assumed that he would like\nit. Thereafter, I ordered this from my Amazon account. How did it end? He\nloved it and he couldn't believe that I could give him something that would\nmake his gaming time more enjoyable. He is happy. So, I am happy. How bou dah?\n\n", "I was looking for a good pc controller for quite some time now. Finally bought\nthis on the recommendation of a friend. A wired xbox controller is more\nexpensive than this. Plugged in the dongle and it connected within 3 seconds\nwith my windows 8.1 laptop.  \n  \nFeels good to hold. Good plastic on the analog sticks. The shoulder buttons\nare great and snappy. They are just the right amount of hardness. The face\nbuttons have the same tactile feedback of the xbox controllers. Button mashing\ngoodness.  \n  \nA full 5 on 5 rating from me. Once I've spent more time using this controller\nI'll update this review with comments on battery life and wireless\nconnectivity. Till then, dear redgear, please keep making more of these value\nfor money products.\n\n", "Those who have Sony W800D tv...this is your must have accessory... played\nasphalt 8 past two days... working smooth...  \nGot it for 1150 from seller Appario.. prompt delivery 👍🏼  \nDon't know why they are selling it for 1600...waited few weeks for it's price\nto drop...some lucky people got it for 999...  \nI don't have much RAM & graphics in my pc... So I'm playing games like\nassassin's Creed black flag & gta sa..  \nThank you Red gear for additional dongle...  \nWhen its price falls below 1200..don't give a second thought...\n\n", "The controller works like a charm with windows PC, all the xbox games for pc\ncan be played and feels pretty good experience.  \nIt is only for Windows PC, although it supports Android but there aren't any\nproper games that are compatible with these controllers and for sony android\ntv the range is not enough as the receiver goes to the back of your tv so it\njust decreases the connectivity and rarely works.  \nI am writing this review after around 3 weeks of usage.  \nI feel at this price point this the best you can get.  \nDon't worry about the quality its good and satisfying.\n\n", "Totally worth the money. In fact, it is better in comparison with the more\nexpensive controllers from Logitech. Since it is a Xbox 360 imitation, the\nergonomics, more or less, remain the same. Build quality is surprisingly good\nfor an imitation and hope it doesn't break down any time soon. In a nutshell,\nthis is a very good wireless controller and if you are looking for one without\nhaving the means to dish out 3-6 thousand rupees for a original Xbox 360 or\nXbox One wireless controller, I would suggest buying this controller.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 November 2017", "on 11 October 2017", "on 20 January 2018", "on 6 November 2017", "on 20 November 2017", "on 11 November 2017", "on 5 October 2017", "on 29 January 2018", "on 11 November 2017", "on 2 December 2017"], "reviewer": ["sobhan", "Jeron", "Mahendra Singh", "Gautam", "XInnovator", "Saniya Sharma", "Naman Varma", "Deepasekaran", "Amazon Customer", "Siddhartha K."]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["2 game pad to computer for 2 player game", "Worth the buy. Go for it!👍", "Gamer weapon", "Awesome 😘......... Good controller", "Value for money", "Awesome product,", "Truly this is one of the best wireless gamepad for those who are the Professional Gamers", "Just go for it.", "Dhamaal awesomeness!!!!", "Good to play specifically in computer and my choice of ..."], "review": ["I have two of these game pad now for two player game.  \n  \npros  \n1) robust. dropped twice from 3 feet and nothing happened. works well as\nbefore.  \n2) very responsive. Never felt lag while playing the game  \n3) Turbo button cool to cheat in some games. Also many buttons can be made\nturbo at the same time.  \n4) Able to connect 2 Redgear Pro wireless game pad to computer to play 2\nplayer games  \n5) Never felt to recharge batteries during game play. usually play for 2 hours\nand then mostly it is on charge.  \n  \ncons  \n1) Weighs ~215g. Little heavier on hand.  \n2) In one of the game pad, need to press D-pad little harder. Not a big\nproblem though.  \n3) since D-Pad is not circular, pressing diagonally is little cumbersome. Need\nto practice to press diagonally.  \n4) observed that the game pad can attach to both the wireless receiver. There\ncan be confusion on what Gamepad is player 1 and player 2. The issue is only\nduring power-up and hence not a big problem either.  \n5) One of the usb receiver didn't work more than a meter. Since I have 4 usb\nreceivers now, tried another one and now both the game pad works across the\nliving room. Since one receiver was defective knocked of one star from rating.\n\n", "Best controller I've used so far and works like a boss. The grip is amazing,\nis smooth and doesn't require a driver except for the vibration for which a CD\nis provided. It's just too cool!! And the delivery was extremely fast.\n\n", "Awesome Gamepad with huge battery backup and ultimate vibration feedback\n\n", "It is really very Good.. And its vibrate too while playing like Ps4 controller\n🎮 Osm!!! 😍\n\n", "Works perfectly,detected as xbox controller by pc, beautiful looks with good\nvibration feedback motors,played gta v, sniper elite 4 ,far cry 4 , spintires\n\n", "Writing this review after 3 Months of Usage :-  \n  \nPros:-  \n1) Long lasting battery - i charge the battery after 7-8 days of daily 2-3\nhours usage. (with disabled vibration setting)  \n2) Build quality is awesome. The product looks premium.  \n3) 2 dongles in case one get defected other will work.  \n4) Light effect at A,B & X,Y buttons which would be helpful to play in night.  \n  \ncons:-  \nuntil now i haven't find any con of this Gamepad.\n\n", "Truly this is one of the best wireless gamepad for those who are the\nProfessional Gamers. The triggers and analog sticks are very accurate. I got\nthis deal @ 999. So it's totally BEAST in this price grp.\n\n", "Awesome gamepad... Amazing battery life.. compatible with android tv as well..\ntested on my sony bravia.... Overall build quality is also good..\n\n", "What an amazing product... Works flawlessly with my Lg G6... Did not work with\nHonor 8 Pro. Amazing build and excellent experience. Works with all Asphalt\ngames.. Does not work with Need For Speed no limits...\n\n", "Good to play specifically in computer and my choice of games is Modern Combat\n5 Blackout, Gangster New Orleans, GTA V, Asphalt 8, For and Motorsports and\nQuantum Break\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 October 2017", "on 26 October 2017", "on 9 March 2018", "on 26 January 2018", "on 24 December 2017", "on 20 December 2017", "on 18 October 2017", "on 27 December 2017", "on 26 October 2017", "on 17 November 2017"], "reviewer": ["Yogesh", "Aashutosh.B.C", "SyeD MiB", "Manish", "gurinder singh", "RAHUL KAUNDAL", "Jelly ", "Jaydeep Palekar", "complete money worth", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Rt and Lt Keys got mushy after extensive use.", "Cheap and best .. ... Gamer go for purchase you will never face any problem", "great service by Amazon", "Usb Receiver broken", "Awesome", "AwEsoMe", "Nice Gamepad", "Five Stars", "Awesome.", "Five Stars"], "review": ["I use the rt key for acceleration and shooting which it is the most used key\non the controller. I wouldn't say it was bad but the spring inside was not as\nresponsive. I used the key so much that it feels a bit mushy now. The Lt is\ncomparatively more tactile now....... Anyway that was only because of my\nuse...... Also the price is very low I would say\n\n", "Best gamepad ... Dont thing too much for purchase ... Best for play game ..\nAnd tje price is to good\n\n", "Firstly, great service by Amazon. The product came in a well packaged\ncontainer.  \n  \nNow about the controller. If you're reading this to confirm about the working\nof the controller, well I'll help you out.  \nJust like you, I too read comments/reviews continuously to see if it's worth\nthe buy. So after much thought i bought it and boy it was the right call. The\ncontroller has in built xinput which makes the game realize the controller as\nan Xbox controller. You can switch between xinput and direct input. For direct\ninput you'll have to install certain drivers which can be done with the disc\nprovided. For xinput, it's just plug and play.  \n  \nThe buttons are well recognised and there is no lag for Windows 10.  \n  \nI bought the dual dongle version so there are two dongles. You have to be\ncareful where you place them because you can lose them easily and there are no\nspares available and cannot be bought separately.  \n  \nIt has lithium battery which is rechargeable with the usb cable provided.  \n  \nSo final rating  \n  \nLooks - 8  \nworking - 10  \nOver all experience - 9  \n  \nSo just over the fear and order the damn thing. you won't regret it\n\n", "Just ten days of use, receiver is broken\n\n", "It is the most greatest xbox type controller for its price. No third party\nsoftware needed for ur xbox to make it think an xbox controller is connected.\nxinput and direct x are supported, so basically works with all modern games.\nResponse is a bit slow, but that might be because of the no. of wifi i have in\nmy area, which interrupts the frequency. I suggest buying the wired on unless\nu r planning to use it with the living room tv or xbox and play on couch.\n\n", "Awesome Gaming experience i Luv it long bettere lyf and Awesome Control's Nyc\nProduct\n\n", "its very nice gamepad\n\n", "\n\n", "No words. The best ever controller. Quality is very good. Overall awesome\nproduct buy this without thinking. I have 3 controllers\n\n", "amazing durable controller..try to get it on sale..den you can get it around\n1k\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 January 2018", "on 13 December 2017", "on 17 October 2017", "on 2 February 2018", "on 4 October 2017", "on 24 December 2017", "on 25 January 2018", "on 27 January 2018", "on 27 October 2017", "on 30 October 2017"], "reviewer": ["Akhilesh Bandi", "aman s.", "Amazon Customer", "Abdul Mukthar", "Chandan Datta", "Technical Paras", "ISHANT KUMAR", "Varun jhalani", "Kb", "Surajit Das"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Reviewing this after 3 months of usage.", "Quality gamepad for all types of gaming !", "An Xbox Styled,  PS3/PC controller!", "A Good Product...", "Battery backup is good. Sometimes one of the USB dongles gets disconnected ...", "RedGear Warranty SUCKS", "AXBY LED lights not turning off.", "Receiver not working,Not expected such trash after paying 1.5 k", "Finally an Xbox controller alternative", "This is the worst controller i ever received When first i order the ..."], "review": ["Its built quality is very good, battery lasts long enough to play and get\ntired.  \nSwitches are very good to press and responsive although I was charging this\nwith a phone charger and after a month whenever I used to remove from\ncharging, the lights blinks showing its battery low so I had to off the\ncontroller and keep it for some time to use it.  \nOverall its very good to use.\n\n", "I have purchased so many gamepad before but this is best for pc gaming ,\nprices is 3 times higher than normal pc gamepads but quality is 10 times\nbetter that normal gamepad so don't even think to buy quantum , other gamepad\nwho cost you below 1k .  \n  \nI really want to thank you Amazon for delivery at night also (9:30pm ) as i\nrequested u to deliver asap .\n\n", "I was wishing that anyone would create a xbox styled controller for PS3, Came\na controller from 'REDGEAR'. The controller was amazing for Ps3 but i don't\nknow about PC, but have to try it on PC. A single issue with this Product in\nusing on Ps3, it takes lotta/lots of time to get turned on.but except this,\neverything was fine. Once again thanks to Amazon for Packaging process.\n\n", "It's a good gamepad. I won't say the best but it's really a good investment at\nthis price. It doesn't require 2 dongles but the other one is just a spare.\nOne little hiccup is the lack of explanation of the led indicators during\ncharging and battery status. Other than that, it's a good product. Btw, amazon\ndelivered it within 2 days in top condition. So, a very good job by amazon\ntoo...\n\n", "Analog sticks are smooth, but a bit short makes it hard to aim precisely.\nBattery backup is good. Sometimes one of the USB dongles gets disconnected and\nthen pointer starts drifting in one direction, you have to remove and replug\nthem, then it starts working again.  \nAll in all good controller for casual and adventure games, but not for FPS.\nGood for Rs.999.\n\n", "At First it was great..........but than as long night's passed............came\na time..........when it started to lag precision  \n  \nthe joysticks became loose  \nthe RT and LT button's spring broke( and they were stuck in pressed position\nalways)  \nthe light's started losing their intensity  \nand exactly after 3 Months this controller had died.  \n  \nmaybe i received a faulty piece... but you never know.\n\n", "I would give it a full 5 stars as the gamepad works perfectly and the feel is\nnice but , the only problem i am facing is my AXBY LED lights are not turning\noff.  \nI tried pressing back+B for 5 seconds and gamepad turned off but the lights on\nthe buttons doesn't turn off.  \nGoing for a replacement now , so i hope it will work.\n\n", "The receiver has stopped detecting in the laptop and error is coming up \"The\nlast USB device you connected to this computer malfunctioned,and windows does\nnot recognize it \"  \nThis is not done , i have hardly used this controller and within 1 month the\nreceiver has stopped working , i am not able to get the replacement as well,\n\n", "Its an Alternative to expensive Xbox controller, works great on PC, almost\nevery game can be played with it, vibration and force feed back works well, i\nhope redgear should also work on PC steering wheel for racing games :)  \nGames Tested : Crysis 3, Sniper Elite 2, Cuphead, Road Redemption, Marvel Vs\nCapcom 3, FiFa, Don Bradman Cricket, NFS, Call Of Duty  \n  \nCons: Doesn't have bluetooth and andriod Compability (But who needs its at\nthis price its good) :P\n\n", "This is the worst controller i ever received  \nWhen first i order the controller it had a problem with rt button which didn't\nwork and immediately returned it and the second on i received was working good\nbut within few days again that Rt button stopped working and the button became\nloose.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 January 2018", "on 20 January 2018", "on 3 February 2018", "on 14 January 2018", "on 23 February 2018", "on 17 February 2018", "on 25 January 2018", "on 9 February 2018", "on 10 November 2017", "on 13 March 2018"], "reviewer": ["Sushant Dutta", "Amazon Customer", "/_TechnoRaj2.O", "Arighna Chakraborty", "Vivek", "Divyanshu", "Rana Harshvardhan", "Amazon Customer", "samarth", "Manuj partap"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Must have for everyone !", "Decent product", "They cheated amazon and the seller!", "Need to purchase new wireless receiver for this", "it is perhaps the best looking wireless gamepad", "Good product", "A must have for all gamers!", "I would not recommend this item if you are going to use it ...", "A fantastic budget alternative to the Xbox/Steam controllers.", "Five Stars"], "review": ["Due to some medical issues (which I am not disclosing here) doctors have\nsuggested me to have bed rest. I ordered this wireless gamepad in order to\nplay PC gamed while laying down. Thank God I am made this purchase and now I\nam having good time in spite of my disease.  \n  \nPros :-  \n* Good build quality.  \n* Proper touch of a X-Box 360 controller.  \n* Long distance coverage.  \n* Good battery life.  \n* Nicely designed.  \n* Firm grip.  \n* Wireless (of course)  \n* Extra dongle included in the box.  \n* Automatically switches after 5-10mins of inactivity (saves battery life).  \n* Plug & Play  \n* Zero delay in connectivity.  \n  \nCons :-  \n* Slightly heavy.  \n* Some buttons make noises on continuous stroke.  \n* Some games are not supported.\n\n", "The build quality is good but it doesn't support 70% games on both pc and\nandroid. Even though it doesn't support many games it has a good battery\nbackup. It works almost 6 hours on single charge\n\n", "I'm a lay person! I bought xbox360 for my niece and nephew as the Xbox 360\njust had one wireless control, I needed one more wireless control. So I was\nlooking for another one so I put in search bar xbox 360 wireless control and\nguess what I got this redgear pro. Unfortunately I fell ill as soon as it\narrived because there's this virus going on in Hyderabad the kids, their\nparents, my parents and I. So we couldn't check it on time! Now when we're\nfine my brother checked and said it's not working! But we were late in\nreturning! But that's amazon's fault it should not come up in the search\nresults when I put xbox360 wireless control! You try it it will be second!\n\n", "I lost its wireless receiver.please help me for another one\n\n", "I bought this gamepad for Rs. 1299. In that range, it is perhaps the best\nlooking wireless gamepad. It looks like a xbox controller and it surely\nimpressed my friends while i was playing with it. So if looks is your\ncriteria, then you should definitely go for it.  \nNow coming to the performance, I played Batman Arkham asylum,Rise of the Tomb\nraider, NFS MW,WWE2k16 etc and it performed quite well. Although I feel that\nthe vibrations are on the lower side and there is no way you can control the\namount of vibration you want, which according to me was a con. Apart from\nthat, it is a very good joypad.  \nThe only thing i am worried about is the servicing if i need it. Dont know is\nreadgear has any service centers for repairing gamepads.\n\n", "Full plastic body. Response is good. A little rubberized at the side of grips.\nCharges very fast. Feels nice. Detects instantly. Software cd included but\ndoesn't need installation in win 10. Overall good product in 1k.\n\n", "Its perfect. Charge it, play with it, that too all at once! Have fun with it.\nJust remember to buy it during offers, the price goes as low as 800rs. Buy it\nblindly.\n\n", "Controller is attractive and all but the levers have failed in just a month..\nI would not recommend this item if you are going to use it regularly.\nUnsatisfactory.\n\n", "This is a well built, sturdy device that holds up very well for extended\ngaming and has no issues with connectivity. I considered the steam controller\nand the xbox controller before making this purchase, and having used all major\nconsole controllers in the past, i can say that the redgear holds itself up\nvery well to the competition, especially given that it is a fourth of the\nprice of the others, Usage times over the last month has given me about 8 to\n10 hours of gameplay between charges. The build quality is sturdy and feels\nreassuring, while remaining light enough to avoid fatigue. Connectivity is\ninstant with simple plug and play enough to get one started.\n\n", "Good Product compatible with android windows and mac wirelessly\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 March 2018", "on 20 November 2017", "on 17 February 2018", "on 2 March 2018", "on 31 December 2017", "on 27 October 2017", "on 28 September 2017", "on 21 November 2017", "on 3 March 2018", "on 22 January 2018"], "reviewer": ["Anupam Singh Rathore", "Amazon Customer", "Maha siddiqui", "Mohan Miah", "Gourab Mukherjee", "Soumendra", "Saif Z Shaikh", "Atharva Deshpande", "Emmanuel", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Easy connectivity, will surely Enhance your gaming experience", "Awesome Gamepad...", "Four Stars", "Good Satisfied.", "Five Stars", "Pathetic Service. Good gamepad.", "personally recommend you.", "Just go for it", "Excellent product", "Low Quality Product"], "review": ["Smooth, just smooth, very well fixes in your hands looks Ace, One of the\ncoolest bumper and triggers, Easy connectivity , will surely Enhance your\ngaming experience. Enjoy Brothers :D\n\n", "That's Really Awesome Gamepad... Go For It...  \nI Used this Gamepad On My Android Mobile, My Laptop and My Smart 4k Led and\nThat's Work Very Superb...\n\n", "nice one the packaging was good and all plastic some rubberized grip overall\nbest but the buttons are noisy\n\n", "Thumb sticks are truly amazing; But the LB and RB buttons are of very bad\nquality and triggers are average. D Pad is good looking and fixed as of xbox\n360 controller but it makes large sound when you press. I am giving it 4 stars\njust because of the thumb sticks coz they are even better than original xbox\none controller. ( I write this review after using this product for more than 3\nmonths). A, X, B and Y are same as other controllers. I've dropped this\ncontroller 4-5 times but nothing happened. ( I dropped it from the height of 2\nmetres) If you're on low budget than probably you should go for this\ncontroller.\n\n", "Perfect for pc games!!\n\n", "I ordered this Product on December 4th 2017. it came on 6th December 2017. The\nproduct was damaged. I requested a Replacement and then on 8th December I got\nit replaced and got new one. I used it and it is an amazing gamepad no doubt.\namazing quality. nice buttons and good vibrations. but after using it for one\nday the device is not charging. Instructions said that when you charge it the\n4 LED lights will blink and mine dosent blink. so again defective. And this\ntime I didn.t even have the option to replace it and I could only get refund\nand I talked to customer service. they said please order again and increased\nits price. This is their strategies to make more money.\n\n", "This product is worth buying....must buy it ... personally recommend you....  \n#smooth handling  \n#vibration is good\n\n", "One of the best gamepad ever used ... battery backup is amazing\nunbelievable...\n\n", "It is awesome product for it price and works properly on pc\n\n", "controller is good with features but quality is very much compromising.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 October 2017", "on 18 October 2017", "on 23 November 2017", "on 25 January 2018", "on 18 December 2017", "on 15 December 2017", "on 24 November 2017", "on 25 November 2017", "on 24 November 2017", "on 20 November 2017"], "reviewer": ["Mohit Agnihotri", "Amazon Customer", "gurkamal singh", "Ganesh Patil", "Ali Ahmad", "Kaundinya", "Chauhan", "shivam", "Shrusti", "Shrek"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Great value for money", "Very good and worthy.", "Bought the wireless one for 999", "Awesome product..", "Five Stars", "Why only me😭", "Great service, great gamepad", "Great", "The best controller you can buy under 2k", "Very good controller in budget..."], "review": ["Got today..Great gamepad...Got 2 dongle gamepad...works well on my pc as well\nas on my sony android tv...charges at other adapters too....\n\n", "One of the best buy. I'd definitely recommend to fellow gamers. Pic: it's\nwireless only. It's charging.\n\n", "The BEST\n\n", "Its just awesome, Just plug n play games.. Loved it.. Got it within one day..\nThankuu amazon..\n\n", "It's very good. And I'm satisfied with the product.\n\n", "Firstly received a defective product then i replaced it.....still the Y button\nis loose...i must say dnt buy in sale days...just buy at normal pricw i.e.1299  \nElse u ll get a defective one for sure\n\n", "Bought the gamepad a month ago and it works beautifully. Charges very fast,\nsmooth af buttons, awesome grip, reasonable price of 1 grand. The L2 button\nstopped working a week ago, and I asked for an exchange; and they sent someone\nright the next day. I got the gamepad back in 3 days. Incredible service from\nAmazon. Buy, buy, buy.\n\n", "This gamepad is legitimately the best gamepad I have ever used.\n\n", "What can I even say... This thing is a beast for the price. Didn't expect it\nto be so good!  \n  \nPros:  \n1\\. Amazing textured sides for grip  \n2\\. Illuminating buttons  \n3\\. Supports Xinput and DirectInput  \n4\\. Amazing battery life  \n  \nCons:  \n1\\. Haptic feedback isn't strong enough.\n\n", "Don't buy x box one controller. This product same work as x box one controller\nin budget so save your money and apply your intelligence.....\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 September 2017", "on 12 October 2017", "on 16 December 2017", "on 8 October 2017", "on 4 November 2017", "on 25 January 2018", "on 11 November 2017", "on 30 September 2017", "on 28 October 2017", "on 20 December 2017"], "reviewer": ["Amazon Customer", "vickybala", "Arun Kumar Sinha", "Yogesh kumar", "Biplab Singha", "Amartya Samantaray", "Vinayak Arora", "Akilesh", "Sankhyo Halder", "Sayandeep J."]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Just... amazing", "i am Purchasing ThisItem second Time This Is Good For Gamers 99% support All Games", "The packaging was good and delivery was really amazing", "Spent 3k, converted PC into couch gaming", "Best controller at this price and haven't even charged it for almost two months !", "Can u pls tell me can you play games like assassin's Creed", "Not as expected (sellers fault)", "Awesome controller with excellent built quality and no problem in ...", "Satisfied w/ product.", "Entry Level Gaming Apparatus"], "review": ["One of the best controller ever\n\n", "i am Purchasing ThisItem second Time  \nThis Is Good For Gamers  \n  \n99% support All Games\n\n", "It's a really Rugged and intact controller and I haven't noticed any loose\nkeys and joysticks. The packaging was good and delivery was really amazing.  \nSince it is wireless it has some amount of lag to it and sometimes when the\nfrequency of pressing is really high, the keys won't respond but that doesn't\nmake a huge amount of difference, more like it's good for most of the first\nperson shooters and other games but definitely a no for games like cuphead.  \nthe best thing about controller is it's Xbox compatibility in almost every\ngame and the back lit keys.  \nAt this price it's definitely worth it.\n\n", "cheap and best controller for PC. Comes with charging cable worth 100Rs and\nrechargable batteries inbuilt ( 200-300 Rs)  \nI am putting these because XBOX 360 without above comes at base price of 3k\nand you can buy 3 of these in that price.  \nAnyway in festive sale time price goes to low as 1k for double dongle version.  \nI have bought 3 of these for playing party couch co-op games on windows 10 (\ni5 +8G + 2G graphics + 256SSD ) with friends and family.  \nNidhogg2, Duck Game, ultimate ChickenHorse, Shift Happens, Don't starve\ntogether , Ibb and Obb, Worms Armageddon, Worms WMD  \nLovers in a dangerous spacetime, Little Big planet, Cuphead, Castle Crashers.\n\n", "This is the best wireless controller you can ever get at this price. It's been\nalmost 1 and a half month since I purchased it and I haven't even charged it\nfor once. The battery backup is extremely good I can say here. I play games\nfor like 2-3 hours a day and it was shocking to see that when it had been 1\nmonth since I used it, it was still working without even charging it for once.\nReally impressed.\n\n", "Can u pls tell me can you play games like assassin's Creed ,just cause.Can all\ncontrolls can be operated in this gamepad\n\n", "Ordered the gamepad from amazon for 1200 rs. Got a defective one , so i am\ngiving a 3 star. Left bumper key was not functioning properly , i had to press\nit hard to make it function.Also the \"B\" and \"d pad up\"key were not responsive\neither.So i opted for a replacement , hopefully i'll get a new gamepad that is\nworking properly. I don't know whom to blame on this one.\n\n", "Awesome controller with excellent built quality and no problem in\nconnectivity, connected to my windows 10 machine in no time. The controller is\nrecognized as Xbox 360 controller hence support most of the games. Battery\nback is also excellent 6-7 hours of runtime in a single charge. Didn't expect\nmuch from this brand but was amazed with its product quality. Definitely worth\nthe money for those who want budget controller.\n\n", "A very decent controller for PC. Mine just last for ~5 months 'cause RT key\nbroke internally due to little rough use. Battery backup is good as compared\nto other controllers. Texture, look and feel is quite nice for ~1500 RS... If\nyou play The Witcher 3 then please don't go for this one, buy Xbox one\nwireless instead.  \nTL;DR A decent product, not recommended for daily gamers...\n\n", "It's been a week I've been using this.  \nNo problems Noticed. I played certain games like  \nNeed For Speed MW 2012, Assassin's creed IV black flag and FIFA 14.  \n  \nIt is replica of Xbox 360 controller  \nNice inhand feel, illuminated keys are good  \nVibration feedback is awesome.  \n  \nNo lag felt in wireless connectivity.  \nAwesome value for money product for basic gamers.  \nGO FOR IT\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 October 2017", "on 10 October 2017", "on 18 December 2017", "on 8 October 2017", "on 10 March 2018", "on 8 January 2018", "on 2 March 2018", "on 12 March 2018", "on 21 March 2018", "on 22 February 2018"], "reviewer": ["Amazon Customer", "eliyas", "shopper", "Kapil Aggarwal", "Swapnil Chavan", "Yogeesha", "junaid g.", "Manoj kumar", "Amazon Customer", "Fazil J."]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Best of the best !", "Weapon for gamers.", "I would like to recommend this wireless game pad", "Value for Money !!! Gamers Friend!!", "Loved it!!!!!!!!", "Well Worth a Look.", "Awesome", "Product is good having great battery backup but customer support and delivery person are cheaters.", "Link your Adhar Card to This controller Before You Play", "Five Stars"], "review": ["I've been using it for a year now and I believe I can give a pretty fair\nreview for this product. Got it for ₹999 :P  \n  \nConnectivity: Super fast (1-2 seconds), atleast 5 meters  \n  \nMaterial: Sturdy Built (can bear multiple drops easily from 3-4 feets)  \n  \nAccuracy: No issues regarding accuracy  \n  \nComfort: I've played for hours continuously (whole night) and never felt a\nthing. Also, the buttons A B X Y glow constantly so that's an added advantage.  \n  \nCompatibility: Plays almost all the modern games built for playing via remote\ncontrol like GTA 5, Witcher 3, Max Payne 3, Battlefield 1, Just Cause 3,\nPrototype 2 etc.  \nAlso, I've tested it on PS3 and Android, apart from laptop and pc, they work\nlike a charm.  \n  \nBackup: If you have no life i.e. play all week (7 days) for 4-5 hours daily,\nyou'll probably have to recharge it twice or maybe thrice which I believe is\nvery good.  \n  \nThere is no downside to buying it.  \nAlthough the receiver I received with it broke so I bought another one for 99\nfrom Amazon itself. It's rarely available.  \nIt's so good that I own two of them now.  \n  \nAt this price, it's a steal :P\n\n", "The best controller in price. Working is smooth and battery backup is also\ngood. Vibration motors are perfect. And I like its illuminated XYAB keys.\nWorks in both dinput and xinput mode.\n\n", "I would like to recommend this wireless game pad, it worked on my android TV\nas well as my Computer, its simply awesome, its battery backup is insane.\n\n", "Best Gamepad at this rate. Fit and feels good on hand. Nice controller for\nRocket League. Build quality is awesome. Rubber on the sides gives perfect\ngrip. Turbo button is really helpful. Works not only on laptop/PC but also on\nAndroid Phones (via OTG). Power back up is good. Force Feedback works perfect.\n\n", "Just recieved the product... Build quality look premium Af... Looks really\nawesome... Works perfectly fine... I recommend it.. Go for it.. Worth its..\nPlayed 2k18 works fine.. Just plug and play...\n\n", "Used on a Win 10 Laptop.  \n  \nVery good purchase. Worth every bit of the 1500 I spent on this. I usually\ngame by connecting my laptop up to the TV and it has been a blessing to play\nwirelessly. Gives me a solid 6-8 hour gaming time. Charges pretty quickly.\nBoth joysticks are premium. Slightly on the tougher side of build, so it's\ndurable but I did feel my palms starting to ache after some intense sessions.\nThe buttons are a tad bit overly clicky. I don't mind the sound but vs the\nXbox One controller you'll take some time to get used to it. I rarely use the\nD-Pad but it has worked well too.  \n  \nConnectivity is good. Didn't require any driver installation just plugged in\nthe dongle and was set from the moment I unboxed it. The bone I'd have to pick\nis probably the lack of a storage space for the Bluetooth dongle. It's pretty\nsmall but is always an inconvenience to keep it always plugged in. If you have\na small sleeve in your Laptop bag which can house the small USB dongle, then\nyou're set. It is easy to lose but can't be too unhappy about it. Great\nproduct. Would recommend.\n\n", "The best controller for pc battery life is very good and is durable\n\n", "At first time i have connectivity issue like auto disconnection and connection\nthats me make so frustrated while playing The evil within 2 and middle earth\nshadow of war . within every 10 min gamepad started disconnecting and\nconnecting i hated this. then i used another dongle comes in package that\nincreases connectivity.  \nIts been 2-3 week am using this, following are the things i like  \n1) Long battery backup even though i charged it only for first day and second\nfor few hours , im still using it on wireless without charged it untill i.e 2\nweeks , seriously good backup daily playing time 2-3 hours.  \n2) vibration is OK  \n3) range is normal  \n4) Quick response of button and connectivity.( may be i got one faulty dongle\nfor bad connection and other dongle is good).  \n5) Good backlit of ABXY keys  \n  \npros:  \n1) If any barrier is come in between the dongle and gamepad then there is\nconnectivity issue , however barrier is as much  \nas note book. (because of this issue i rated it 4 star)  \n2) Got one faulty dongle  \n3)Amazon service is bad as thug.I dont like delivery person who said \"paying\nmoney with debit card you will get 10% discount\" and i paid then after 1 week\ni check there is no 10% cashback, then i call customer support , she said \"get\nthat 10% cashback by that delivery person who delivered the item and we dont\nprovide any 10% cashback . then she hung up\".Customer support is very bad and\ntheir delivery persons are lair.\n\n", "The quality Of tgis product is very good  \nGrip Are also Awesome Just loved it .  \nOne of the best controller in this price Segment\n\n", "The quality of gamepad is very good.  \nGrip are also awesome.... Best controller in this price segment....\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 February 2018", "on 18 February 2018", "on 5 March 2018", "on 20 November 2017", "on 24 January 2018", "on 6 January 2018", "on 15 March 2018", "on 7 November 2017", "on 23 January 2018", "on 23 February 2018"], "reviewer": ["Abhay Shrivastava", "Omesh Kumar", "Sujal", "Akash Thakur", "Ayush Gupta", "Vamsi Advait", "tanmaybhandari", "Abdul muqsit", "Neeraj kumar", "Shubham Kumar"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Go for it If you belong to PC master race but want to experience the peasant class. (Because YOU can).", "Loved it...", "Great Product.", "Best in class", "Honest Review", "Marvellous Gamepad From Red Gear", "First Impression was decent. Longer usage showed the flaws.", "Never to buy", "Redgear is on 🔥 after launching this gamepad😁", "Product is nice.. works smooth"], "review": ["Pros:  \nHassle-free connection.  \nSturdy to hold.  \nDecent looking.  \nExtra dongle.  \nRubberized sides.  \nOverall great experience.  \n  \nCons:  \nUngripped Analogs. ( They can be bought separately)  \nD-pad moves all together, cannot smooth shift between buttons.  \nRight trigger was like of shaky for me.  \nLack of space for dongle storage. Could loose it if unattended. (Maybe that's\nwhy an extra one)  \n  \nNever the less, great responsive controller for a decent price.\n\n", "After using it for a month, I can say it's a premium quality gamepad at this\nprice. I got it for 1050/- in a lightening deal. Keys feels really good and\nclicks sound satisfying, and pressure keys for shooting and running are high\nquality and works too good with any game e.g. GTA 5, The Witcher 3 etc.  \nI had a wired Redgear gamepad before this but after 1 and half years of use\nit's USB cable stopped responding from time to time, it would usually gets\nmalfunctioned or wouldn't connect at all on PC. So, I decided to go wireless\nthis time to avoid USB plug in and out every time I have to play. Response\ntime is real, as real as wired one, even if there's a difference you wouldn't\nbe noticing anything. It works from 10 feet distance and may be more, also\nvery comfortable in hands and weight is perfect, neither too light or heavy.\nVibration is fine, you might need to install drivers for that if you're not\nusing Win10.  \nIt has best battery life, I've only charged it for 3 times in one month\nperiod. I'm not heavy gamer but i would still play 2-3 hours a day for 3-4\ndays a week. Still a good battery back-up and it charge-up really fast too, in\njust 30 minutes or so.  \nOver all a good deal, go for it if you're looking for a premium quality build\nin low prices, it's the best one.\n\n", "Going to buy a controller is very difficult as we have choose its features,\nprice and design too. This product is best for Gaming purposes to serve. It\nhas got many features. Firstly, the keys are smooth and works perfectly well.\nSecondly ,it has got integrated force feedback which is very nice and cool.\nThirdly, the price is not that high. You won't regret buying this.\n\n", "\n\n Nice product nicely built keys are good charges well connectivity is superb\ntotally satisfied\n\n", "Received it today, I'm Gonna write a described review after a week of\ndifferent test, for now hands on experience is below:-  \nWhen i saw the box, well it seemslike small but the device inside is in a\nperfect size which increases ease of access to all of the keys.  \n  \nThis model is upgraded one and comes with 2 wireless receiver (idk what's the\npoint but i think if one stopped working or related scenario)  \n  \nSide of the gamepad has rubber coating with dramatically enhances the\nstability in your hands  \n  \nPowerful force fedback indeed, no doubt in that  \n  \nIf using on windows, it works like a Microsoft XBox Controller 😛 which is a\ngood this to adore though😁  \n  \nProvided cable is of okay-okay length, there is a CD along with to configure\nit for force feedback  \n  \nIlluminated ABXY Keys😍 Looks charming.  \n  \nThere is one thing i think could be improved, wgich is it's finishing, few\nbuttons and Z axis levers were wobbling in there fitting positions and their\nfinishing was not like the rest of the buttons or sticks.  \nI will provide more information within a week, hit thanks if my review helped.\n🙋  \n  \nExtra piece of advise, Do read the manual before using it.  \n  \nSome games me crash when this controller will be in sync, it's not the\ncontroller's fault, all you have to do is, switch to different modes.  \n(i.e. if you're on Xinput mode then just switch to DirecInput and wolla, this\nworks like a charm, in order to switch and detect in which mode it currently\nis, you have to read manual 😁)\n\n", "One of the best gamepad I have come over with N it's jus amazing as I'm\nplaying \"assassin's Creed origins\" in this gamepad it's has quite gud\nresponsive from RT & LB buttons n L & R sticks perform gud while aiming...u\njus need spend few hours to master the aiming technique if u r new to\ngamepads....n I suggest u it's magnificent for all new games n old ones u\ndon't have have spoil ur keyboards & mouse anymore coz this gamepad is damn\ndurable for even hack n slash games\n\n", "\n\n Updating my product review:  \nThe game-pad appeared to be a good deal for such low price. But below are the\nproblems I am facing:  \n1\\. The left analog is broken within 6hours of gameplay. I am attaching a\nvideo for your reference  \n2\\. Gamepad disconnects frequently from the computer. Like once every 25 mins,\nwhile playing (not afk)  \n3\\. The analog sensitivity is way too low.  \n  \nI am trying to claim warranty. Will update status here.\n\n", "\n\n Never buy this product. After 6 months of light usage only one of the\ntriggers was not working and there is no customer service available.\n\n", "This is little monster🔥.. Honestly speaking i am loving playing any games with\nthis controller , it provides better grip to hold the controller, Happy with\nthe Amazon's amazing delivery,  \nIts a nice product.\n\n", "Product is nice.. works smooth.. but I'm still wondering what is that scratch\nkind of a thing on the rubber grip handle.The Only reason I'm not sending it\nback because I was very excited to use the product. Not cool though.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 February 2018", "on 23 February 2018", "on 6 March 2018", "on 2 March 2018", "on 24 October 2017", "on 1 March 2018", "on 8 November 2017", "on 4 October 2017", "on 24 March 2018", "on 30 January 2018"], "reviewer": ["Talha moiz", "Sur Pan", "Sayak", "Amazon Customer", "Shigarf Mashaam", "Vipul", "Ratnavel S.", "Siddharth Taparia", "Shriyansh asati", "Harshad Rane"]}
]