[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Redmi Mi 4 - It's A Good Smart Phone", "Excellent specs for this price!", "Satisfied. Value for money.", "Go for It", "Dissapointed with this phone", "Budget friendly excellent phone", "Redmi 4 is the best under the price range", "Fine product", "I found some shortcomings while using the Redmi 4. ...", "Best Budget Phone"], "review": ["Nice look, slim and very handy. Received one day before the expected delivery\ndate...thanks amazon for speedy and safe delivery... under 9000 Redmi Mi 4 is\ngood decision to purchase. It almost covered all smartphone features... Finger\nprint is very accurate and fast. Camera is normal but no shutter lag. Nice\ndisplay 3gb ram and 32gb rom is enough for normal user. Battery backup is also\ngood. Music out put is very clear and crispy, but in-built speaker volume is\naverage. Best musical experience by using head set. I tested with JBL 100csi\nand with the help of equillizer settings found awesome sound out put...\nSatisfied with the purchase.... 😍😍😍\n\n", "Excellent configuration for such a price. Sturdy and compact phone. The MIUI\nis very easy to use by elderly people. Camera quality for outdoor photography\nis decent. Having said that, its better to put on a tempered glass , since the\ndisplay isn't a Corning Gorilla. Fingerprint sensor makes it smoother to\nunlock.... no need to give passwords each time.  \nAvoid using fast-chargers to charge this phone to prevent overheating. Battery\nbackup is quite decent. Stand alone battery life in Airplane mode is about\n2-3days (depending on the room temperature). Under heavy usage like YouTube\nstreaming.... it lasts for more than 1-1.5days. Overall a good deal!\n\n", "Delivery: Though it was supposed to deliver before next day 8pm but Amazon\ndelivery was 1 hour late.  \nPhone:  \nBuilt quality: 9/10  \nBattery: 9/10 easily lasts for 2 days if you are a moderate user.  \nInterface: MIUI 8/10  \nRam: you will get around 900mb ram free after first boot.  \nInternal memory: around 8.5 gb free after first boot.  \nGaming performane: good enough. No lag in paying mid range games. Didn't play\nhigh quality games like asphalt.  \nCamera: 6/10 rear camera is pretty good at outer condition. Not good at low\nlight. Front camera not good. Overall average performance.  \nOverall value for money. If you are not into photography and selfies then it's\na must have for you. Go for it.\n\n", "This review is after using it for more than 10 days.  \nDisplay is good.  \nRam management is good.  \nPhone does not lag.  \nHeats up a little during charging.  \nCall quality is excellent.  \nSound Output is average though It's better through headphones.  \nCamera is average.  \nBattery backup is excellent.  \nI purchased black one and it looks premium.  \nOverall a great phone for a reasonable price.  \nP.S- There is a new competitive player in the market and it's Tenor(10.or). If\nyou don't care for brand name , you can go for it.\n\n", "Not what I expected from Xiomi. 3s Prime is far better than Redmi 4. It gets\noberheated, battery backup not good, and it sometimed stops detecting my 2nd\nsim. It even started to restart. I bought it only 1 month back. And it has\nalready started showing problems. Not a pho e I'll recommand you'll to buy.\n\n", "Good looking. It has 5inch screen 1280×720 pixels resolution.  \nPowered by 1.4GHz Octa-Core Snapdragon 435 processor with 3GB RAM and 32GB\ninternal which can be expanded through microSD card up to 128GB.  \nRedmi 4 coupled with 13MP back camera and 5MP front facing camera and runs on\nAndroid 6.0 Marshmallow with 4100mAh battery and weights 150gms.\n\n", "Great product in the price range I have no problems that's good enough for the\nprice I'm getting so much features (4+64) variant  \n1- Awesome processor  \n2- Miui is love  \n3- Huge battery backup  \n4- great look easy to hold sexy design fits in the palm really easily  \n5- camera is by far the best under 10k whichever variant you buy the storage\nand ram will be different but features and hardware same !\n\n", "The glass is not good. It can break easily. Battery lasts 36 hours approx with\nuse for internet. It heats up but not that bad. The phone looks good but the\nfront glass looks bad. Overall fine product. There is no better deal than this\nin the market today. So no choice. As it has many sensors as well as it is 5\ninches.\n\n", "I found some shortcomings while using the Redmi 4.  \n  \n1) The Home key button, Back Key button etc. which given in the lower side has\nno light. If using phone in dark place or night you have no idea where is the\nback key and other keys.  \n  \n2) The volume buttons of the Redmi 4 are very tight. You have to press very\nhardly for making volume up and down.  \n  \n3) I found the speakers both side in phone but only One side of speaker is\nworking. It seems other speaker is given in phone is only for be fooled of\ncustomers.  \n  \n4) The picture quality is not up to the mark as said/presented by MI.\n\n", "I am reviewing this phone in redmi 4. It is a fantastic phone. Great battary\nlife. Awesome touch sensitivity. Processor is great too. Camera perfect. I am\nvery happy with this device. I recommend anyone who is reading this ....go\nahead and don't be confused to decide. Coz there is an entire sea of smart\nphones.  \nUsing it for 2 weeks now and it's going great.....\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 October 2017", "on 28 December 2017", "on 9 November 2017", "on 3 October 2017", "on 25 July 2017", "on 2 December 2017", "on 12 October 2017", "on 18 October 2017", "on 10 November 2017", "on 25 February 2018"], "reviewer": ["Retheesh Xavier", "ARITRO MUKHERJEE", "Pallab Kumar Das", "Akshay", "Rick", "nithiin_07", "Ashutosh", "Amazon Customer", "Rajan", "Siraj Patel"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["A great budget device", "Nice budget phone", "Shandaar! Zabardast! Zindabad!", "Five Stars", "Utterly disappointed", "Very less phone's memory and hybrid sim to use to SD card.", "Now i used past 3 months always heating issues Ponds ...", "at this price the best phone that one can afford", "Five Stars", "Not satiafied"], "review": ["A great budget device you won't regret.  \nThis thing is packed with features.  \n.  \nIt has enough RAM that you won't feel any lag in daily usage.  \nUI is clean but not stock.  \nThe camera is on par with other budget phones.  \n32GB of inbuilt storage so that you won't need a memory card unless you like\nto keep useless junk in your phone.  \nHybrid SIM tray.  \n5\" HD display. Not so bright. You might face issues outdoors.  \nNavigation keys are backlit.  \n4000mAH battery to get you through the day with heavy usage.  \nSpeakers are loud enough.  \n4G VoLTE enabled.  \nand the list goes on..............  \n.  \nWhat else are you expecting from a smartphone this cheap?\n\n", "The phone was delivered safe and sound. The battery lasts long when no heavy\nusages. The camera too is fine. It has 16 gb ROM however surprisingly only 8\nGB is usable but memory can be expanded at the cost of second sim card.\nOverall it is a nice budget phone.\n\n", "Redmi 4 is a great phone within budget of common man.  \nPros-  \nIt's looks are fab. 😎  \nCamera 📷 is awesome too.  \nWorks quite fast. 🚀  \nProcessor and GPU are in good sync.  \n64 GB is more than enough.  \n5GB free MI Cloud storage.  \nInterface is good, you enjoy using it.  \nBattery is more than enough.  \nCharges ⚡ quickly with Mi Charger.  \nSpeaker 📢 produces loud and crystal clear sound.  \nAnd many more..  \n  \nCons-  \nHybrid sim slot (i.e You can either use the phone as dual sim or can use it as\na single sim with memory card but you cannot use it as a dual sim with memory\ncard)  \nNo headphones 🎧 in the box.  \nNo USB type C port (but as the phone is cheap so not a big issue and doesn't\neven matter).  \nCan't think of anymore cons as of now.\n\n", "Redmi mobiles are good.\n\n", "Got this phone delivered even before, but it was a very harrowing experience,\nwherein the swipe functionality of this phone is totally fractured one.  \nHate the experience and utter dissatisfaction with this purchase experience.  \nBetter had i gone to the shop and purchased in person from a trusted dealer.  \nMany doubts on the viability of the dealer/manufacturer.  \ntotal trust deficit.\n\n", "Hybrid sim which doesn't allow sd card. Phone's memory is very less. After\ninstalling needed apps hardly you will get 2 GB.  \nI am not at all happy with this mobile. Also amazon not provided returns on\nthis.\n\n", "Now i used past 3 months always heating issues Ponds near charging and reduce\nthe battery life becomes more heating issues and will take the charging more\nhours for 3to 4 hours to complete orange is Chinese brand inside the I can't\noverall it's ok the camera quality and speaker quality sounds and everything\nbattery's life just 1 days automatically fluter automatically..\n\n", "Worth for what you pay, at this price the best phone that one can afford.\n\n", "Liked this phone\n\n", "Not satisfied with product.  \nWhile rcording a video there is a buzzing sound.  \nI had gifted this mobile to my sister  \nSo I can't return it.  \nSo pls do somehelpful stuff\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 January 2018", "on 29 July 2017", "on 15 November 2017", "on 24 January 2018", "on 26 January 2018", "on 25 January 2018", "on 19 September 2017", "on 29 October 2017", "on 4 December 2017", "on 3 September 2017"], "reviewer": ["Rajkumar Singh", "Ambi", "Harshad Jadhav", "Rishi M", "anubha", "Chiranjeevi Naidu", "viswanathan", "AskBhargavi", "Nikhil Dave", "ankit pandey"]},
{"rating": ["4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Awesome", "Good phone with few drawbacks", "Good quality of camera (Front and rear both) 4", "Redmi 4 beats all in this price range", "No glass protection at all", "i had got it for my mom and she just loves the easy of access", "Don't buy. Just invest more and get something better.", "very awesome..", "Good and reliable phone", "Replacing the defective phone is a headache now"], "review": ["This is a complete phone. Battery life is awesome .with heavy usage(1hour\ngaming 3 hour YouTube and facebook for sometime) it can easily last for a\nday.the camera is good for this price point.And almost no heating issues.  \n  \nWhat it lags is quality. Though it has a metal body yet it gives you a feel of\ncheap quality phone when you hold it a bit tightly.if you press it's back\nhard.,it can get small bumps.\n\n", "Now it's been a little more than 2 weeks I've been using this phone. Its a\nvery good phone in this budget (I got it for 9.5k). Call clarity, camera,\nbattery, interface, colours all great!  \nApart from all the features mentioned, some drawbacks that stopped me from\ngiving more stars are:  \n1\\. It says dual sim & extendable memory. But the catch is, you can either use\n2 sim cards or 1 sim card and 1 memory card. Only 2 slots provided.  \n2\\. The touch screen is not that responsive always.  \n3\\. Phone speakers volume is not loud enough on speaker mode (specially for\nsongs)  \n4\\. The typing speed is lagged.  \n5\\. GPS /location shortcut not provided in taskbar on the top. No idea if we\ncan add it.  \n6\\. No user manual/ warranty card in the box. User manual not easily available\nonline too.  \n7\\. For opening the sim card slot, a small pin-like instrument is provided.\nWhat is expected out of us?? to preserve that pin throughout the phone life\nand carry it whereever we go, as we may need to open slot anytime.  \nStill exploring and hoping not to come across any more glitches.\n\n", "In this. Range no other company provide facilities that Xiomi MI provide. And\nyes now it's totally come with Made In india.  \nThe facilities are :  \n1\\. Volte (4G)  \n2\\. MI cloud Facilities  \n3\\. Good quality of camera (Front and rear both)  \n4\\. Face scanner  \n5\\. Inbuilt Scanner for Visiting card also  \n6\\. MI lab  \n7\\. Split window (you can use two apps at one time)  \n8\\. OTG connection (In samsung only more than 15000₹ phone's work with OTG)  \n9\\. Good RAM and ROM  \n10\\. Best security option (for message, gallery, recording, etc.)  \n11\\. Screen recorder (Inbuilt)  \n12\\. Chat Screen shot (Inbuilt)\n\n", "Redmi 4 beats all in this price range  \nThe ultra stylish look, sleek design, curve pattern edges with smooth grip.  \n  \n1) Battery last for 25-28hrs, just takes 1hr 30 mins of charge  \n  \n2) Ram & memory, mobile works so efficient without any lags  \n  \n3) 2 months so far & certainly no heat issues  \n  \n4) No delay in touch sensor (compared to other brand mobiles like Moto,Lenovo)  \n  \n5) Sexy camera build quality & HD video display  \n  \n6) Awesome volte & LTE support, no issues with sim slot or network  \n  \n7) 4100mah doesn't let you out enjoying the usage  \n  \n8) MIUI interface is awesome tried cracked version of Nougat also...  \n  \nBest budget buy phone & feels better than Moto/Lenovo phones\n\n", "I have been using this for one month. Looks good, performance is average (like\nany phone in this range, nothing special). Battery last for whole day with\nheavy use - full marks. Camera is good . One thing that impress me is GPS\n-quick and accurate (even in indoor). There is no glass protection at all (my\nfriend's phone get cracked in frist drop of two feet , photo shared). Can buy\nbut dont expect much.\n\n", "Functioning smoothly. i had got it for my mom and she just loves the easy of\naccess. It is slightly slippery due to the exterior, so need to put a cover on\nthe back to prevent disasters. Although, the phones are very sturdy, multiple\nfalls also dont create functional problems. The only glitch I noticed was that\nwhen you multi-task or run apps too fast, it sort of hangs for a few seconds.\nThis is something that my mom would never bother about because she doesnt make\nheavy use of the phone. But for people who use their phones more than their\npersonal laptops, a small hang also matters.  \n  \noverall it is a great use\n\n", "Almost 4 months or so has passed after I purchased this phone. The overheating\ngoes crazy. Some 44°C. Maybe coz I use Bluetooth. The phone usually hangs and\nlaggs. Sometimes even apps stop working unexpectedly. The 3GB RAM is no\nadvantage as I still get performance issues.\n\n", "very awesome....fullfill ur expectations...plz go for it... I'm using it\nnearly abt month...no any issue...great 🔋 life.. great 📷... great 🔊... great ✋\nling....white colour looks great than black one...some people says that it\ntook so much time to charge battery bt trust me guys it not takes so\nmuch...then finally miui interface is awesome features and also they provide\nupdates regularly...so dont think so much and place ur order and enjoy ... ,,😍\n\n", "We got this phone with a lot apprehension on its performance but it’s a good\nbuy, it’s processor is good and fast, feel and finish is awesome 👏🏻 It’s\ndisplay is also good, battery is awesome and it doesn’t drain out fast but\ntakes time to charge, mobile doesn’t heat up after lot of use overall it’s\ngood but only con is with its camera ..\n\n", "Phone is good but i got defective one. it fingerprint sensor is not working.\nNow amazon is first sending a technician to check the phone before replacing\nit not happy with the way how they doing unnecessary wasting the time for\nreplacement.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 December 2017", "on 1 November 2017", "on 28 November 2017", "on 10 October 2017", "on 21 September 2017", "on 2 September 2017", "on 10 September 2017", "on 7 August 2017", "on 24 November 2017", "on 16 November 2017"], "reviewer": ["Amazon Customer", "Mugdha Karmakar", "Alfaz Mankad", "Gurbachan Singh", "Sunil", "Amazon Customer", "Vishnu", "Amazon Customer", "Ashwin Raveendran", "dipesh singhal"]},
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Dabba phone", "Initial impressions", "Best phone in hand", "DONT THINK JUST GO FOR IT", "There is a hybrid sim slot (sim+sim or sim+memory card) ...", "Best build. Perfect design.", "... got the product and till now it is working fine no issues found", "Not a proper dual SIM phone with expandable storage!", "I like this Amazing phone", "Heats with in 1 minute of use"], "review": ["Not sure how people can give 5 star rating to this phone. Really dissapointed\nwith the phone looks and working when compared to other phones. The phone I\ngot was a defective one and I had to return it. However my friends are also\nusing this phone and have given me a 2/5 feedback where they were majorly\ndissapointed with the phone's camera. Xiomi - I am not sure, why you were\nselling this in sale earlier. This is a dabba phone.\n\n", "Out of the box, the build quality is very impressive .  \nWhite with gold colour looks awesome  \nUi is snappy . Works like lightening......  \nBest build quality in a budget  \nEkdum Jhakaas!  \nWill write detailed review after a week of use\n\n", "Honestly, I am a great fan of Build Quality of MI. It feels so good in hand.\nBut as everything has Pros and cons... talking about prons of this Redmi 4,\nits MIUI has its own unique small benefits and Cons include the themes...\nstock android will always be fast than samsung and MI because it makes it\nsimpler faster and themes make a jam in RAM creating effects and icons...  \nI got a problem in charger too it disconnects automatically.. need to replug\nso it starts again..  \nCamera is quite good but need to keep stable in HDR mode... I have clicked\nsome photos which you can see here. Overall a good phone... RAM management is\naverage but in this price segment cool MI...\n\n", "Guys agar aaplog is phone ko khareedne ke baare mein soch rahe ho to bilkul\naankh band karke khareed lo.... After using it for 1 week ye gain meree nazar\nmein iske pros and cons  \n  \nPROS:  \n1) Super Camera even with Low Light under 10K  \n2) Mic Quality (FEELS LIKE CONDENSER MIC/STUDIO QUALITY)  \n3) Powerful RAM  \n4) Fast Charging(WHOLE BATTERY CHARGES FROM 0 TO 100% IN JUST TWO HOURS AND 15\nMINUTES)  \n5) Powerful Battery (LASTS FOR FULL DAY WITH HEAVY USAGE)  \n6) NFC AND IR BLASTER( You can control your TV, set top box, AC, fan and many\nmore with just your phone)  \n7) One Handed Mode(You Can Use Your Mobile By Minimizing Your Screen To 4 and\neven to 3.5 inches to use it in a better way while laying on the bed or your\ncouch)  \n8) Easy And Simple USER INTERFACE  \n9) 2.5D CURVED GLASS WILL GIVE YOU A FEEL OF MINI INFINITY DISPLAY  \n10) Build Quality Is Awesome  \n  \nCONS:  \n  \n1) You have to update your MIUI 8 to MIUI 8.5 or maybe MIUI 9  \n  \nThat's all for CONS  \nBut Its REALITY  \nAFTER ALL I RECOMMEND YOU TO BUY THIS UNDER 10K  \nSERIOUSLY WORTH IT.......\n\n", "There is a hybrid sim slot (sim+sim or sim+memory card). In specification, it\nwas not mention.  \nNo earphone  \nNo front flash.\n\n", "1) Performance - Not Hanging, Can handle heavy gaming to (go for 3gb ram)  \n2) Battery - 2days (normal use) 6hrs (heavy).  \n3) Build quality - Good design. Solid build.  \n4) Screen - Bit yellow, go for NOTE 4 for better screen.  \n5) Camera - Best for this price.(see pic)\n\n", "From when i got the product and till now it is working fine no issues found,\nthere are some minor issues which got fixed on a reboot. Phone looks good and\nit is fast enough to do some casual works and games. But one thing i have\nfound as con is the internal memory is written on paper as 16gb but on phone\nit is actually showing as 10gb and usable is like 8gb. I know that phones take\nup some internal memory by default but it should be taken from the 16gb and at\nleast 10gb should be free for user. It is kind of misleading. Beside of that\nit only has single colour led notification light and camera is kind of ok. But\nas a overall package it is a good to go product.\n\n", "Decent phone for the price. Using MIUI for the 1St time. Did not like the home\nscreen and launcher and hence installed a 3rd party launcher. The phone looks\nand feel good. Fingerprint sensor is up to the mark. Lots of blotwares and\ncouldn't uninstall them as well. You cannot use dual SIM and microSD card\ntogether.Sim try is designed to use SIM+SIM or SIM+microSD card! Storage\nproblem is accentuated with the boltware. Wish the product detail indicated\nthis shortfall in design. I would have never give for this phone.If you can\nput up with this one drawback about the sim try then its worth the price.\n\n", "I like this Amazing phone. battery life is similar Redmi Note 4 and design is\nvery attractive. Qualcomm Snapdragon 435 Octa-Core Processor better\nperformance and consumes less power compared to its predecessor. metal frame\nwith tapered edges comfortably in palm, 2.5D curved glass feels delightfully\nsmooth.\n\n", "On the papers this seems to be a good phone, but unfortunately I am not lucky\nenough to get the good product. I received my Redmi 4 3GB+32GB Black phone on\n03rd Aug 17. When I opened the box it's looks good by it's design. After 1\nminute of use the phone heats up. That disappointed me a lot. Returned back\nthe phone. Thanks for the Amazon Team for their quick and no questions\nresponse.  \nMay be only my phone is faulty.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 August 2017", "on 25 July 2017", "on 20 September 2017", "on 29 September 2017", "on 4 December 2017", "on 19 December 2017", "on 27 January 2018", "on 10 November 2017", "on 21 September 2017", "on 11 August 2017"], "reviewer": ["Pratik", "ASK Tech", "Prasad Moradia", "Sarang K. Dubey", "Amazon Customer", "Sumit Saxena", "subhajit sen", "Shinoj", "Vikas Kumar", "PANKAJ DHIMAN"]},
{"rating": ["4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Awesome worked by Multi Talented Mi Team", "Redmi4 - 32 GB - OK", "Perfect buy", "Best phone in the market for around 8-9k", "Best Smartphone", "Over all my experience is excellent strongly recommended", "Go for redmi👍", "The best budget killer phone.", "Overall a very decent and awesome product.", "Redmi 4 is a very good budget phone at this price range"], "review": ["Redmi series all phone are best on features & performance. Redmi 4 looks is\nsame like iPhone 6s.  \nWhat i like from MI brand phone is that lots of pre-built features more than a\nany android phone. You not need install app for ever use, MI team worked hard\nto integrate all features needed to use a smartphone.  \n  \nOne star less only for battery: Battery is not go long in compare of other\nphone's 3000mah like nokia 6. Redmi 4 has 4100mah but it's not better than\neven 3000mah.\n\n", "Its ok. Cant use both sim because 1 sim slot is used for storage space - or\nelse you cant save much and the phone will hang. A normal look. Camera quality\nis also ok. 2space is good so i can differentiate between my official sim &\npersonal sim. So all in all Ok as per the price goes. Posted pic to see the\nquality 1 in my car and second in a room .\n\n", "I am been using this phone from the past 1 month and here is my complete\nreview  \n1)Performance  \nAlthough it runs on Snapdragon 435 it handles day to day usage easily without\nany lag.  \nGames might lag a bit at high graphics but at medium graphics its quite\nplayable. I have played shadow fight 2 on this phone at the highest graphics\nwithout any lag.  \n  \n2)Storage  \nYou get around 8 GB of free storage on first boot which I feel is plenty\nenough to keep applications installed. For multimedia storage like movies and\nsongs I highly recommend you to buy a SD card. This phones come with a hybrid\nsim slot but you can easily convert it using a hybrid sim extender.  \n  \n3)Connevtivity  \nReliance JIO works without any issue and it also supports Volte  \n  \n4)Ram  \nAround 750 mb of ram is available for applications in 2gb ram vairent which is\nsufficient enough to handle around 5-6 applications at a time.  \n  \n5)Battery  \nBattery is just awesome. It easily last around 2 days on medium usage.\nAlthough charging time will take around 2hours 30 mins.  \n  \n6)Camera  \nIts pretty decent at the price point. Low light performance is average rest it\ncan handle every shots and also it can records vedio at 1080p  \n  \n7)Developers Community  \nThere are many custom roms available for redmi 4 based on nougat.  \n  \nDelivery by Amazon  \nExcellent delivery as expected.  \n  \nFINAL VERDICT  \nJUST GO FOR IT YOU WON'T REGRET.\n\n", "I bought this phone for my Dad, he's using for past one month so I though to\nwrite this review for whomever looking or thinking to purchase it.  \n  \n\\- First of all, finish of this phone is quiet nice if you look from price\nperspective although I didn't like the sim tray of this \"bad quality\", till\nnow phone is working smooth and lag free.  \n\\- Now coming to memory, I bought 32gb variant and total available storage was\nonly 24.20gb approx. so keep in mind if you are looking for storing more\nsongs/media/docs you better get 64gb variant.  \n\\- Camera quality is Okay-ish, not that good not that bad.  \n\\- Android you will get is Nougat running on Qualcomm Snapdragon 435.  \n\\- you need to purchase cover for this phone separately because back is quiet\nslippery.  \n\\- you won't get any earphones along with this phone so keep in mind that.  \n  \n>> Overall good phone in this budget range, go for it without any second\nthought!  \n  \nIf you got any query feel free to ask..\n\n", "Best smartphone @Rs 9000.  \n13 MP Rear camera  \n5 MP front camera. Both working fine.  \nNo heating issue  \nGood battery life  \nNo hang problem  \nEnough 32 GB memory  \nBoth SIM slot supports 4G SIM.  \nFast internet.  \nOverall good mobile at this price.  \nNo other company provide these features at this price.\n\n", "Nice & classy look premium not low budget phone and talking about user\nexperience my experience with this phone is excellent no heating problem no\nHanging problem and long battery life and speed charging making this phone\nrecommendable the user interface this mobile is running on miUI beautiful\ndesign no need to download any other third-party software like applock anti-\nvirus etc... And color is pretty awesome I buy rose gold. Looks very\nexpensive. Over all my experience is excellent. So I strongly recommend\n\n", "Iam using 4gb 64 version first of all good  \n+ve -ve are in my experience.  \n+ve 1👍 good battery back up 2days charging time 3 hour  \n-ve 1. 👎Redmi 4 doesn't have navigation button light it more tricky in black colour model but redmi note 4 have this in same price  \n2\\. ,👎Doesn't have Multi colour notification light redmi note 4 have this  \nRedmi 4 4gb at 10999  \nRedmi note 4 4gb at 10999 slashed price  \n👍2.5 D curved glass looks elegant but tempered glass never sticks on ends only\nstick center . If u buy borderd glass it will stick side ways only center side\nno glue  \n..i got a new type temperd from local market at 350 ₹ it sticks both\nside,,👍loooks oe glass\n\n", "I had purchased many products from Amazon but they always satisfied me with\nthere best to deliver the products.  \n  \nNow coming on to the phone  \nThe box contains:- the phone,1 power adapter, 1usb cable, and some papers\nwhich contains the phone basic info.  \n  \nAbout phone:-  \nGENERAL  \nSim Type: GSM+GSM (Hybrid Slot)  \nDual Sim: Yes  \nDevice Type: Smartphone  \nRelease Date: May, 2017  \nDESIGN  \nDimensions: 141.3 x 69.59 x 8.9 mm  \nWeight: 156 g  \nDISPLAY  \nType: Color IPS screen, 16M colors  \nTouch: Yes, with Multitouch  \nSize: 5 inches, 720 x 1280 pixels  \nPPI: ~ 294 PPI  \nMEMORY  \nRAM: 2 GB  \nInternal: 16 GB inbuilt  \nCard Slot: Yes (Hybrid Slot)  \nCONNECTIVITY  \nGPRS: Yes  \nEDGE: Yes  \n3G: Yes  \n4G: Yes  \nVoLTE: Yes (Supports Reliance Jio)  \nWifi: Yes, with wifi-hotspot  \nBluetooth: Yes, v4.1  \nUSB: Yes, microUSB v2.0  \nEXTRA  \nGPS: Yes, with A-GPS Support  \nFingerprint Sensor: Yes  \nSensors: Accelerometer, Gyroscope, Compass, Fingerprint  \n3.5mm Headphone Jack: Yes  \nCAMERA  \nCamera: Yes, 13 MP with autofocus  \nDual Camera: No  \nFeatures: Face detection, Smile detection, Geo tagging, Panorama, Touch to\nfocus  \nVideo Recording: Yes, 1080p @ 30fps  \nFlash: LED  \nFront Camera: Yes, 5 MP  \nTECHNICAL  \nOS: Android, v6.0.1 (Marshmallow)  \nCPU: 1.4 GHz, Octa Core, Qualcomm Snapdragon 435 Processor  \nGPU: Adreno 505  \nJava: No  \nBrowser: Yes, supports HTML  \nMULTIMEDIA  \nSupports: MMS, Instant Messaging  \nEmail: Yes, with Push Mail  \nMusic: MP3, WAV, eAAC+, FLAC  \nVideo: DivX, MP4  \nFM Radio: Yes  \nDocument Reader: Yes  \nBATTERY  \nType: Non-Removable Battery  \nSize: 4100 mAh, Li-ion Battery  \n  \nBest thing I like is that it contains a good processer, it clicks sharper\nimages, metal finish and many inbuilt features like wifi share.  \n  \nIf you like my review please click the like button. Ty\n\n", "Overall a very decent and awesome product..The issue is only with the size of\nthe screen. It can be negotiated ;)  \nThumbs up from my side\n\n", "Redmi 4 is a very good budget phone at this price range,i have using this\nphone during fifteen days with no issue,phone\"s build quality is very very\ngood finger print scanner is working fine with no issue and most important\nredmi has uses this time snapdragon 435 processor which is very fast with no\nlagging even most of the games,screen is vivid and sunlight visibility is fine\nbut dont know they have given in this phone any gorilla glass protection or\nnot .overall in the range of 6999/- its very good phone\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 November 2017", "on 12 December 2017", "on 18 August 2017", "on 10 March 2018", "on 27 August 2017", "on 13 September 2017", "on 26 January 2018", "on 18 September 2017", "on 25 August 2017", "on 14 August 2017"], "reviewer": ["ZAFRUL HAQUE", "LOUIE", "Meet", "Rahul", "KARAN GROVER", "azher khan", "junu", "Satyam Maurya", "Surbhi Gupta", "KOUSHIK BACHCHU MUKHERJEE"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Recieved an updated Jan 2018 made phone , Very happy", "Perfect smartphone in this budget", "He is disappointed. Maximum screen light in redmi is equal to ...", "Its a Gift From Wifey and Its Awesome!", "Redmi 4:Budget killer", "Best choice for the price range less than 10K", "Good Phone, but heats quickly with bit heavy use", "Xiaomi Redmi 4", "Absolutely Amazing Phone for this price.", "Amazing delivery by Amazon got within 2 days"], "review": ["Received it morning. It is awesome. I purchased the phone after reading 100s\nof reviews here and lot more you tube reviews too.  \ni liked the feel of phone a lot , its metallic and stays in hand nicely.  \nHD SCREEN  \nLOOKS LIKE IPHONE  \nAnd to my surprise, i received an updated phone with ANDROID NOUGAT AND MIUI9\n, I was totally shocked . Thank you amazon\n\n", "Best in budget, value for money.redmi 4 focus on great experience for using.a\nlarge 4100mah powerhouse is used for 2 day with single charge.design is most\nimportant factor.excellent battery life.corning gorilla glass protection.best\ngrip when using.redmi 4 is preloaded with many features like dual app, mi\nremote.redmi 4 is 13 mp rear camera comes with pdaf.real time filter used that\nenhance photography.redmi 4 is beautiful metal frame that is made of\naluminium.bright strips\n\n", "Average phone..reminds me of my old intex aqua phone. I use Samsung J7 and my\nhusband bought this redmi 4. Compare to J7 redmi 4 is nothing. He is\ndisappointed. Maximum screen light in redmi is equal to 25% screen light of\nJ7.  \nFacebook videos are dull and overall below average product compare to lenevo,\nSamsung basic sets. RAM looks like 2GB but it shows 4gb RAM!.  \nWhat's app, Facebook, YouTube lovers don't buy this.. Invest 2k extra to buy\nbetter one. Don't believe the positive, promoting reviews of redmi4 buyers.  \nGood thing is the phone is stylish, curvy...  \nYou could see the liquid of Tempered glass in the 4 edges of the phone after\nyou place the glass. Shop keeper said its like that only!!!!...\n\n", "It's a gift from my wife. Have always been an avid fan of Xiaomi smartphones\nand other products. Xiaomi products have never disappointed me. Redmi 4 is\nalready a long player in the budget smartphone market loaded with competitive\nfeatures and a nice battery. The phone looks good too (doesn't look like a\nbudget smartphone if not informed). What is more interesting is that me and my\nbrother in law have earlier used redmi note 3 together. And now we have four\nredmi 4 smartphones in our family. My mom, my wife, my brother in law and now\nme, each of us are having one redmi 4 as our secondary backup phone.  \n  \nLet me tell you this makes an awesome secondary backup smartphone along with\nyour primary one. The jet black colour suits my taste and gives it a more\npremium look.  \n  \nI am also amazed to find Xiaomi has given us a smartphone with all metal\nanodised aluminium body and a massive battery capacity of 4100 mAh at this\nprice.  \n  \nThe phone runs smooth and lag free even with a mere 2GB of RAM. I think most\nof the credit for this should go to the better performing SD 435 octa-core\nprocessor. The display size of 5\" made it a perfect smartphone to hold\ncomfortably on my palm unlike the larger devices (5.5\"-6\") that tends to slip\nout of your hands often. The fingerprint sensor works fast enough.  \n  \nThe only con I have found till now not only about this smartphone but all\nXiaomi smartphones are the idea of a 'hybrid sim slot' that compels you to\neither run for increasing more space (which you'll do anyway considering this\nhas got a mere 16GB of internal memory) or use a secondary sim, but not\ntogether.  \nAnother con is the camera. I won't say the camera is bad but it is decent,\ngiven the price point. Moreover, I have always felt the photographers should\nrun after a professional camera if they want a perfect camera and should never\nlook for a pro level camera in a smartphone. Smartphones are smartphones, not\nDSLRs.  \n  \nTo sum up, Redmi 4 makes an awesome budget smartphone and deserves to give\nSamsung a run for their money in the low-end budget smartphone segment because\nanyway, Samsung smartphones are pathetic in performance in this segment. And\nof course, it is a perfect gift to have! Thank you Wifey!\n\n", "I am using redmi 4 since last 1 month.Redmi 4 was launched two months ago.it\nis the successor of redmi 3s and 3s prime launched last year.It comes in three\nvariants: (1) 2gb ram+ 16gb storage at ₹ 6999 ( 2) 3gb ram+ 32gb storage at ₹\n8999 and last 3gb ram+ 64gb storage at 10999.Here I am going to review it's\n3gb version-Display: it's screen size is 5 inch, size is low but it is more\nconvenient to use from single hand.it looks very much pretty in your\nhand.Performance: I am using it daily almost 18-20 hours.Mostly I prefer to\nbrowse facebook.You can easily run games like injustice 2 or asphalt 8 or\nmodern combat 5 on it.I found no lag while using this phone.let me talk about\nother phones which are available in market.In this range there is no any other\nbetter option than this phone.Memory: Out of 32gb, 25gb is available for\nstorage.it is sufficient enough for any user.Camera: It comes with 13\nmegapixel rear camera whose performance is satisfactory.There is also a 5\nmegapixel front camera without any flash.Camera performance is satisfactory\nnot good.Battery: It is the segment which is specially highlighted by xiaomi\nin advertisement.It comes with 4100 mAh battery.Battery backup is very nice.\nYou can easily use it for 14 hours continusously on 4g network in single full\ncharge.Fast charging is not supported.Only disappointment regarding this phone\nis that it is not available easily in market.Only few stores in delhi have\nredmi 4 in stock.it is available only online exclusively.\n\n", "4 stars for Redmi 4 mobile and 5 stars for Amazon and its delivery.  \n  \nAbout product : It is the best choice for the price range less than 10k.  \n  \nPros:  \n\\+ Slim and easily operate in one hand. Back cover is very slippery due to\nmetal finish, suggested to use case cover to avoid slipping from hands.  \n\\+ 2.5D curved glass and back cover metalic finish give premium look to the\nmobile.  \n\\+ It supports Jio 4G VoLTE. Voice call clearity is good and no issues with\nnetwork signal or wifi or wifi hotspot.  \n\\+ Good performance with the Snapdragon 435 SoC, didnt feel any lagginess.  \n\\+ Rear camera is 13mp shooter and good quality images in natural lighting.\nNot so great in artificial lighting. Front camera is 5mp and good for selfies.  \n\\+ Supports most of the apps and games.  \n\\+ Good finger print response, very accurate always. Built in security app\nused to lock the apps (using both finger print or pattern/pin), no need of\nthird party apps to lock/protect apps. Antivirus app comes built in, top of\nthat we can use other security protection applications also.  \n\\+ Supports OTG devices. GPS and Compass sensors are giving exact location\ndetails to use in the map.  \n\\+ Good battery backup, solidly it comes 1 to 1.5 days of dual sim (3G+4G),\nfb, whatsapp and checking mails usage, still there will be 25-30% battery left\nat end of the day. Heavy gaming - more than 12 hrs.  \n\\+ Custom friendly UI interface, thanks to MIUI developers.  \n\\+ Some people complaining about heating issues, but I did not feel any\nheating issue even with high graphics game usuage (Asphalt 8, Modern combat).\nFeel that they didnt do regular patch update. I do regular patch update\nimmediately when it comes on OTA, that could be reason that I didnt get\nheating issues.  \n  \nCons:  \n\\- No turbo charger with the package. It has regular 2.0 Amp charger only. We\ncan still use fast charger as the mobile has Snapdragon 435 processor which\nsupports fast charging.  \n\\- No screen production like Gorilla glass 3/4 or Ashahi dragontrail. Within a\nmonth, my mobile got hairline crack in screen for accidental drop from less\nthan one feet hieght. So only they didnt mention anything in description about\nscreen protection.  \n\\- MIUI consumes more RAM. Always it shows 1.5GB RAM usage (out of 3GB) even\nthough when no apps running in background.  \n\\- No regular Android OS version upgrade. Still in Marshmallow based MIUI 8.5.\nReceiving regular MIUI patch update for 3 to 4 months once, but not OS version\nupgrade. Shortly we will get Android orea in other mobiles, but Redmi 4 is far\nbehind and stuck with Marshmallow. It is only problem with MIUI based\nproducts. MI has to think about this.  \n  \nAbout amazon.in and its delivery:  \n\\+ It is great as it is always.  \n\\+ Good packaging.  \n\\+ Delivered even before the estimated.  \n\\+ I bought it in Tuesday flash sale, the product claim went 100% within 2\nminutes, but I was added in the queue for waiting list and placed the order\nwhen my turn comes.  \n  \nThis is review of the Redmi 4 mobile after 6 months usage.\n\n", "Well Happy with the phone.  \nFew things I would like if Xioami improves:  \n1) I've Max 2 and redmi 4, both the phone gets scratches on the screen (you\ncan find on high light) even with normal usage. So immediately get a toghened\nglass.  \n  \n2) MIUI is good OS but can improve notification bar to cop up with Stock\nAndroid. Here, you can not see notification extended details using single\nhand.  \n  \n3) Redmi 4 gets heated with slight heavy usage like hotspot. Battery is not\ntoo good as I found on Max 2.\n\n", "The phone is overall good and nice look with premium metal body.Both the\nCamera's are average.Snapdragon processor is also Average.You will get MIUI 9\nAndroid Nougat 7.1.2 update,RAM management is really nice with MIUI 9 which\nwas worse in MIUI 8.Now the free RAM goes around 1.5-1.7 GB which was\npreviously 1-1.5 GB.Speakers are great for the price.Its 2.5D curved glass so\nfinding appropriate Tempered glass is Difficult I recommend Plus Tempered\nglass which covered full Screen.Overall a good choice\n\n", "Pros.  \n1\\. Awsm Battery  \n2\\. Device Take 2:30Hours To Full Charge  \n3\\. No Heating Issue  \n4\\. Jio Working Flawlessly  \n5\\. Sound is more clear and more than REDMI 3S PRIME  \n6\\. Using 64 Gb  \n7\\. Rear camera quality is good. Front camera has got a way better\nimprovement.  \n8.. Double Tap To Wake  \n9\\. Getting Update Around 1.4Gb (Not Update Yet)  \n  \nNo issue till date , best phone i have ever seen!  \nNo other options !\n\n", "Amazing delivery by Amazon got within 2 days. Happy with it.  \npros-  \n1\\. Looks good.  \n2\\. Nice Interface in this price range.  \n3\\. Loved its Matte finish body colour.  \n4\\. Handy with 5\" screen.  \nCons-  \n1\\. No earphone provided , so you have to spend some more bucks. Increasing\noverall cost for this handset.  \n2\\. Heating problem after continuously playing games for 20 mins it get heated\nup.  \n3\\. You can either both sim or one sim and memory Card.  \nOverall a decent phone with this price range with decent features. But if you\nare a brand lover than off course this is not a good deal for you.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 January 2018", "on 16 March 2018", "on 27 December 2017", "on 5 March 2018", "on 15 October 2017", "on 17 October 2017", "on 22 October 2017", "on 7 December 2017", "on 7 January 2018", "on 23 November 2017"], "reviewer": ["Sathvik Shetty", "Akash (TOP REVIEWER) ✔️", "Rekha", "Subho Mitra", "sanjeev suman", "Divya", "Amazon Customer", "Vishal", "Ananth Ram A", "Manish Saini"]},
{"rating": ["2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Serious heating problem", "Thank you amazon for your service but 1 star for redmi phone.", "Surely Worth Product and Good in Performance", "Great phone,Surpasses my expectations.", "Fabulous battery but telephony is a big issue.", "Curve glass and whole finishing is beautiful. Only problem is griping", "Vibrating system is very bad even you normally keep it in your pocket this ...", "Good phone, No Headphones, so buy a decent pair.", "Good looks, Good build quality", "Good phone in this budget but buy 3gb ram varient"], "review": ["Initially when i bought this phone its ok.but later on the phone is produsing\na heavy heat when i put it for charging or sometimes when its idle...and\nsometimes when i put it under my pillow and sleep and when i wake up and take\nmy phone it is sooo much hot...i m afraid that if i put it under my pillow and\nconnect a charger it is produsing heat that im afraid that it will blast of\nthat heat..so every feature is ok but ..too much heat produsing\n\n", "worst phone to buy as its gets heated while you are on call. also i thanks\namazon for so supportive to replace the item but even after replacement i am\nfacing the same issue.  \nwe cannot put this phone near our ears as your ear tends to get heated.  \n  \nThank you amazon for your service but 1 star for redmi phone.\n\n", "Worth Product in price range. ( Used for 10 plus Days )  \n  \nPro :  \n-Good, lightweight and Responsive  \n\\- very handy and speed wise good phone  \n-Battery back up is 1.5 Days for sure with 4G data On  \n\\- UI and additional feature like remote etc great.  \n  \nCons :  \nOnly possible point i found charing time is slow ( specially when Quick\ncharging mobiles are Trends )\n\n", "First off regarding delivery, The product arrived the next day i placed the\norder on. There was no sign of seal tamper or product damage itself. I am\npretty sure most of the people interested in the phone may already have\nchecked its specifications online and review videos so there is no need for me\nto go into details about that. May i also add that i faced no issues of call\ndrops, overheating, random crashes etc. yet, the phone is working fine from\nday one and i am writing this review on 10th day after purchase. The only\nthing that annoys me is it has no backlit menu keys but will get used to it\neventually. Also if you can afford to buy a silicon/rubber (anything with\ngrip) cover for this phone please do so, as being a metal body phone it tends\nto slip from hand and the fact that its sides are curved only exacerbate the\nissue.\n\n", "The best thing about this smartphone is it's battery life which is just\nphenomenal! With bluetooth,gps,4g on all the time, the device is easily left\nwith 30 percent juice when you hit the bed.  \n  \nThe worst part about this phone which is a sheer nuisance is that while\ntalking on phone call keeps going on mute,hold or brings up note application\nand at times dials another number. This is due to the fact that screen turns\non randomly while talking or when you place your finger on the finger print\nsensor at back. This is just a deal breaker for me and undermines rest all\ngoodies.  \n  \nApart from that camera is decent and screen is okay given the price point.\n\n", "After two days uses. The product is superb in performance in all.Curve glass\nand whole finishing is beautiful. Only problem is griping, it may slips from\nhand any time.Little heavy for battery and metal body. Required flip/grip\ncover for better grip.\n\n", "I was buy this phone befor one month it's working gud but just two problems I\nfeel  \n1\\. Vibrating system is very bad even you normally keep it in your pocket this\nyou not able to feel vibration and miss urgents calls.  \n2\\. Battery backup is also same like Samsung phons nothing I feel different\njust is fake commitment by MI company they provide best battery backuo.  \n3\\. Some time I feel in this phone also hanging problem for 5 seconds.\n\n", "Initial impression seems good. Phone looks and works like a charm. Slightly\nheavier than i would have liked, (My personal opinion!). Sound quality is\ngood, as well as the touchscreen feel.  \nThe remote app failed to perform, kept on crashing the two times that i used\nit. I will try it out later on and see if it works.  \nOne gripe that i have is that Earphones are NOT included in the package. It\nwas a major oversight on my part for assuming that they are, however, i did\nnot read whats included in the package before ordering, so, no one to blame\nbut me. Still, phone which costs 9k should come with earphones. we are\nobviously not expecting state of the art headphones, but just a basic set\nwould suffice. I'd like to point out that the competition does provide\nheadphones for phone in this price range. Just something to think about for\nXiaomi, assuming they even read these reviews.\n\n", "Pros:  \nGood looks, Good build quality, Good performance (normal use), GREAT Battery,  \nNo overheeating (while using navigation)  \n  \nCons:  \nVery slippery in hand(might need a case), Xiaomi doesnt mention the type of  \ntoughened glass used so screen guard is a must. No OTA update to Nougat/MIUI 9\nyet.  \nCamera not the best.\n\n", "Phone is good.. But don't buy 2 gb ram varient, buy 3 gb varient..  \nPros:  \nVery good battery backup  \nDoesn't heat  \nGood front and rear camera  \nGood for one hand use  \nGood display  \nCons:  \nDont have gorilla glass protection  \nSometimes run slow for 2 gb ram\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 August 2017", "on 30 January 2018", "on 22 August 2017", "on 20 October 2017", "on 10 February 2018", "on 8 October 2017", "on 11 November 2017", "on 28 September 2017", "on 16 October 2017", "on 12 August 2017"], "reviewer": ["Amazon Customer", "Parul", "Manish P", "sandeep", "rohit", "P.N.Mour", "prmaod kumar", "Amazon Customer", "Amazon Customer", "Yoothi"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Good Product", "Speaker stop working after plug in Aux so don plug n play.", "Everything is fine except camera", "Punches well above it's weight", "Must buy phone", "Review after using 3 months.", "The real catogory winner !!!!", "Awesome.............", "Highly recommended", "BEAST AT 4K"], "review": ["Battery back two days although use 4 every time, play you tube. and fast\nworking. but screen size is small, if it come in 5.5'' then may be better to\nwrite emails and text . It screen is also good and strong, it felt two time on\nfloor but still remains undamaged.  \nUmesh Singh  \n7985367485\n\n", "Very nice lite weight..  \nFully functional and IR senson for making remote.  \nBut don't plug with audio woofers it being dump i mean after connecting aux\nspeaker not working.\n\n", "I have been using this phone from last 20 days. Good budget smartphone no UI\nlag till now. Battery life is awesome last almost 1.5 days with normal usage,\n10-12 hours screen on time. If you use it with battery saver battery last for\ntwo days in a single charge.  \n  \nNot mentioning pros as everything is fine except:  \n  \nCons:  \n1) Ambient light sensor not every well calibrated.  \n2) Camera performance good in outside conditions, but poor in low lights and\nartificial lighting conditions.  \n3) sound recorded with video is devastating not usable.  \n4) No EIS  \n5) Sound reduction is not calibrated through volume keys.  \n  \nHope this will help!👍\n\n", "This is decent budget product. Great stuff for the price. Snapdragon 430\npunches well above it's wait in day to day operations. It's decent device for\ngaming but not the best, if u want something better go for redmi note 4. Back\ncamera is decent enough, it's not gonna take pictures like iPhone or Samsung\nGalaxy series devices but justifies the price tag. I am actually impressed\nwith front camera since it has wider lens so u can accommodate more people in\nselfies. Looks are great, looks damn good in black colour and has 2.5d curved\nglass. Battery life is best in the class which is 1.5 to 2 days. Xiaomi is\ngenerally late in software update but MIUI is getting better and better. So go\nfor it.\n\n", "Mini iphone at the price of only 6999...omg...love that....thanks to\namazon..build quality is excellent...camera is very good..sound is adequately\nloud... display is also very good....i will give 8 oit of 10 to this phone as\na king of this price segment....only cons is that flash sale....it is annoying\n\n", "Just don't care about anyone's neg review.  \nI can gurantee you the phone is better than any other phone in this price\nrange.  \nCamera quality is far better than moto or samsung.  \nOnly issue I found it slightly heating while playing an high graphics game or\nusing camera for a long time.....  \nBut you can overlook this little issue.  \nEvery game is running without a single lag.  \nIts truely a great device...  \nClose your eyes,Go for it!\n\n", "I have been using redmi4 3 gb version mobile for more than a week and my\nexperience is...  \nIt looks beautiful and fit well in the palm. As the display is 2.5D, i use\ntempared glass and cover.(easy to broke the display).The disply visibility in\ndaylight is good. I installed 10 more apps and still it working gently and its\nok(don't think it is fast as redmi note4)..I got 1.7 ram out of 3. The power\nof this phone is its battery. 30 minute call,watch a movie, took some video ,\nuse internet 2 house by mobile network..it costs only 45% of battery there are\nplenty to play..he he..  \nThe primary camera is good at daylight conditions. Amost reflecting good\ncolour and saturation is also pretty well. But in bad light conditions its a\nhard game.but I can say below inr 9000 its camera is better than any other\nmobile..and like any other mobile it is also heating up in heavy usage, but\nstill manageable comapare to its defenders. Any way redmi4 is the best mobile@\ninr9000\n\n", "Great Product.  \nEverything I need in one package.  \n  \nBought 3 such products for the whole family. YAH! Redmi 4 Family.......LOL.  \n  \nSeriously though, good product. No issues till date. It come with MIUI 8 but\nhas now got a MIUI 9 update (downloadable). The best part is the \"dual space\"\nfeature. You can literally separate you contacts & other stuff (if you are\nusing two sim. Its not a default scenario. You have to configure it yourself).\n\n", "Superb phone in this price range  \nHere is the detailed review:  \nCons first-  \n(1) metal back is much slippery , you have to be very careful while holding it\nback cover will obviously make it thicker and you will lose the feel  \n(2) miui is not upto my expectation feels laggy if you are android\nenthusiastic  \n  \nNow Pros:  \n(1) first of all its hold and design, most compact phone for a five inch\ndevice, minimal bezels makes it very handy, if you have small palms like mine\n, this phone is for you, weight is light and curved edges makes it feel\nthinner  \n(2)2.5 d curved glass makes it look very beautiful, screen is HD but looks not\nless than FHD , I have lenovo zuk 2 FHD phone , and I dont find any difference\nin resolution  \n(3) yes miui is pIn for me but if you know how to install custom rom and get\nlineage on it , it becomes a killer phone  \nI am enjoying it.. Satisfied and it will remain with me untill it expires..\n\n", "Mind blowing deal and fantastic phone , Thank you Amazon, Got it for 4k upon\nexchanging my used phone. Very. Good deal .  \nCouldn't ask for anymore at this price.  \n1\\. A premium look ( especially the Black one)  \n2\\. The battery, definitely beats any other phone in this price range, Lasts\nfor atleast 1.5 days after heavy usage.  \n3\\. Unlike the predecessors, no heating at all, only little warm while playing\nhigh end games.  \n4\\. You'll definitely feel awesome by the feel and touch of this item that too\nat this price change.  \n5\\. Only con is that it doesn't have a separate , but that isn't a deal\nbreaker, since 64gb is more than enough on a phone.  \n  \nJUST GO FOR IT AND I'M SURE YOU WILL LOVE IT.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 September 2017", "on 31 January 2018", "on 21 January 2018", "on 25 August 2017", "on 22 September 2017", "on 3 December 2017", "on 13 August 2017", "on 23 December 2017", "on 16 September 2017", "on 23 December 2017"], "reviewer": ["Amazon Customer", "T. Vashishtha|vastarun4400@gmaildotcom", "smart shopper", "Amazon Customer", "Arkendu ganguly", "Arg Biswas", "Amazon Customer", "Tufan Saha", "vishwadeep", "Patri Prudhvi Krishna"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Amazing Product and value for money", "Above average phone", "Worth for every penny....", "Best phone under 10K, a must buy !!", "Great deal block buster budget smart phone of the 2017", "Younger brother of RN4", "Xiaomi Redmi 4 is Best Budget!", "Bloatware and above average support", "Beasttt in 9k budget 😈", "Good Value for money. Not an El Cheapo."], "review": ["Amazing Product and value for money. Amazon shipping service is awesome as i\ngot the order the next day. The product was perfectly packed and works\namazingly good. The camera quality is okay but the in-build features are\nwonderful. Overall user friendly and super cool product. Worth every penny and\nrecommended to other buyers. 8/10 rating for product.\n\n", "This phone is above average in build quality, performance, sound and display\nquality. If they have added backlit keys then it will make the phone looks\neven better. Also I advise Xiaomi to provide screen protectors with their\nphones always. Very difficult to find screen protectors for such type of\ndisplays.\n\n", "Pros  \n-Perfect as a daily driver  \n-Call quality is premium  \n-No heating ,but gets slightly warm  \n-UI is user friendly and transitions are smooth  \n-MIUI is very customisable  \n-Build quality is amazing  \n-Supports JIO VOLTE  \n-Great battery backup  \n-Clear and accurate enough display with good viewing angles.  \n-Super fast and very accurate fingerprint scanner.  \n-Good pair of cameras for the price. PDAF works flawlessly  \n  \nCons:  \n-No gorilla glass protection(I know it's too much to ask for this price tag, But at least the 10k version should have had it)  \n-Battery takes time to charge because of its mammoth 41000mAh battery. Although ,faster than I expected it to be.  \n-Hybrid sim slot can be a con for some people.As you can't use Two sim cards and 1 memory card at the same time.  \n\\- Speaker- audio bit low.\n\n", "Pros:  \n1\\. Best phone in this price range, I bought it after doing loads of online\nresearch and reading through thousands of reviews and I am not at all\ndisappointed. Go for the 32 GB model priced at 8998, don't buy the 16 GB\nmodel.  \n2\\. This phone looks awesome too, similar to iPhone 6S just without the home\nbutton. Its pretty sleek and stylish.  \n3\\. Camera is pretty good, good colour reproduction in proper light.  \n4\\. Screen quality is good, bright and vibrant. Touch is smooth, accurate and\nfast, no lag.  \n5\\. Doesn't get slow because of the 3 GB RAM, great performance.  \n6\\. Battery life is good, about 1.5 - 2 days if you use wisely and charge\nwisely.  \n7\\. Have not experienced any heating problems so far.  \n8\\. Finger-print sensor is fast and accurate.  \n9\\. MUI on top of Android looks pretty decent and attractive, doesn't slow\ndown the phone. MI has added many extra features on top of Android which are\nuseful for aggressive users like me.  \n  \nCons:  \n1\\. Speaker loudness is bit less, but that shouldn't be a problem. If you want\nto hear very loud music use bluetooth speakers!  \n2\\. Low light photos are bit poor, but better than most mobiles in this price\nrange. It serves the purpose perfectly fine. You can't expect photos like\ndigicam from a budget mobile!  \n3\\. The home, back and menu buttons at the bottom of the phone doesn't glow.\nThis isn't much of a problem as you get used to the keys in a few days and you\nknow where they are.  \n4\\. Some preloaded apps can't be removed. This also doesn't matter much\nbecause the ram and processor is enough to keep the phone running blazing\nfast.  \n6\\. This phone has 2 SIM slots, 1 nano and 1 micro. The micro sim slot is\nhybrid which means you can either insert SIM or Memory Card in it. I hear\npeople complaining about that, which is foolish because 32 GB is a lot and\nthink if you really need memory card even after that!  \nAlso only 1 SIM can have 4G network activated, other will run in 3G/2G which\nshould be also fine because usually only 1 SIM is used for internet (like Jio)\nand other SIM is kept only as a backup number for calling / SMS.  \n  \nVerdict: Buy this mobile blindly if your max budget is 10K.\n\n", "Multipurpose Phone!!  \nEverything is perfect.  \n  \nDesign :-With a unibody metal construction, the Redmi 4 follows the design\nlanguage of Redmi Note 4. There are curved edges with a curved 2.5D glass on\nthe front which aids the ergonomics. The highlight of the design is of course\nthe compact form factor owing to the 5-inch display. It fits quite well in\none’s palms and single-handed usage is a breeze.  \n  \nThe build quality is excellent and it feels solid, and the matte black variant\nlooks great and gives a very premium feel.  \n  \nHowever, the three capacitive buttons behind the display are not backlit. It\nis disorienting at first, but you impulsively know where your thumb needs to\ngo after a few days of usage.  \n  \nThe Redmi 4 might be a budget phone but there’s no compromise on the\naesthetics. In fact, with this outing – like before – the company sets the\nstandards for what affordable smartphones should look and feel like in 2017.  \nDisplay :-The Redmi 4 sports a 5-inch HD display with a 1280 x 720 resolution.\nThere’s a 2.5D curved glass, similar to the Redmi Note 4. It’s toughened\nglass, although there’s no Gorilla Glass protection  \nThe HD display nevertheless looks fantastic in terms of color reproduction and\nviewing angles. The images and text looks sharp, and it is clearly one of the\nbest displays on smartphones in this price segment. Maintaining a perfect\nbalance, it is a crisp and vivid display without the colors looking\noversaturated.  \nConclusion :-Starting at ₹6,999 ($108) for the base variant, the Redmi 4 ticks\nall the right boxes and there is hardly anything to complain. It’s a great\npackage with solid chassis, Qualcomm’s newer chipset, decent camera, and great\nbattery life. The only shortcoming of the device is lack of Android Nougat out\nof the box\n\n", "My father owns RN4 which is similar to this R4,fews things are missing in this\nlike  \n-5 inch screen  \n\\- notification light is in bottom  \n\\- no double tap to wake  \n\\- only single white LED light for charging, notification, etc  \n\\- no slow motion video recording  \nBut Overall build quality very good, buttons are sturdy, didn't like hybrid\nslot, (tenor is good in this case) I have Exchanged it with my old Samsung\ngalaxy note 2 for Rs. 2k this is my 3rd phone purchase on Amazon\n\n", "Xiaomi redmi 4 is the company's latest model in the sub-rs 10000/- segment.\nXiaomi has so far seen a string of successes with its redmi range with most\nmodels finding place in our periodic list of the \"Best Budget Phones.This new\nxiaomi redmi 4 will not onlyhave to take on the competition,but also live up\nto its predecessor in a lot of ways, and it certainly seems like an improvment\nwhen it comes to specifications.  \nXiaomi Redmi 4 specifications and software  \nXiaomi Redmi 4 features a 5-inch HD (720x1280) IPS display with 2.5D curved-\nedge glass. This seems to be the first time that Xiaomi is using 2.5D glass on\na Redmi smartphone priced below Rs. 10,000. There's a non-removable 4100mAh\nbattery which is the same capacity as the Redmi 3S's battery, and is being\npromoted as one of this phone's highlights. The phone is powered by an octa-\ncore Qualcomm Snapdragon 435 processor clocked at 1.4GHz. There are three\nvariants of the Redmi 4: one with 2GB of RAM and 16GB of storage; one with 3GB\nof RAM and 32GB of storage; and finally 4GB of RAM with 64GB of storage. Our\nreview unit had 3GB of RAM and 32GB of storage. The Redmi 4 supports\nexpandable storage using a microSD card (up to 128GB).You get a 13-megapixel\nrear camera with f/2.0 aperture, PDAF, and an LED flash. There's also a\n5-megapixel front camera with f/2.2 aperture. The new Redmi 4 will support 4G\nand VoLTE along with other connectivity options. When two SIM cards are used,\nonly the primary one will allow 4G calls and data while the secondary SIM\nfalls back to 2G calls only.The phone runs on Android 6.0.1 Marshmallow, with\nXiaomi's MIUI 8.2 skin. This is a stable build which is identical to what we\nsaw on the Redmi Note 4 and Redmi 4A. This means that the Redmi 4 has a lot of\nsoftware features that we have already seen, including Dual Apps, which lets\nyou create a second instance of any app and supports Facebook, Instagram,\nTwitter, WhatsApp, and more. The Quick Ball feature lets users assign\nshortcuts for features. One-handed mode shrinks the display to one corner of\nthe screen so that everything's easier to reach. The phone also gets a\nscrolling screenshot feature that will let you take screenshot of an entire\nWeb page. Child Mode lets users lock apps, and Second Space creates a separate\nprofile to help users manage business and personal data on the same device.  \nXiaomi Redmi 4 camera  \nThe 13-megapixel rear camera is quick at focusing thanks to the phase\ndetection autofocus feature. The camera app also has a face recognition\nfeature that can come in handy. Compared to the Redmi 3S Prime, we found that\nautofocus on the Redmi 4 was a bit quicker. Camera samples were detailed and\nsharp, with colours that were vibrant and truly popped. Landscapes had\naccurate colours for the most part as well as reasonable detail. Macro or\nclose-up shots had a slight haze when seen full-size on a desktop monitor,\nthough the HDR mode helped to some extent.  \n  \nUnfortunately, turning HDR mode on made image capturing and processing really\nslow, and this is one of our biggest complaints with the device. With HDR on,\nusers need to be steady for a few seconds to get a good shot, or else photos\ncome out looking awful.  \n  \nThe rear camera has a tendency to capture a lot of noise when there is no\ndirect light source. Some camera sample shots taken in the dark were very\npoorly defined and had too much motion blur. At night, the Redmi 4 managed to\ntake good photos only when we were close to the subject under a light source\nsuch as a streetlamp.The Redmi 4's camera app is minimalistic and easy to use,\nwith controls for various settings and features occupying only a small part of\nthe screen. HDR mode is just a tap away, as are the live filters. The phone\ncan record video at 720p and 1080p, and the videos came out decent overall.  \n  \nSelfies on the Redmi 4 can be an issue if you want a candid one, again because\nimage processing is slow. We ended up with a slew of blurred selfies just\nbecause we wanted to take one quickly. Other than this issue, our sample\nphotos taken in good light had a good amount of detail and decent colour tone.\nIn low light, we had a tough time, and faces came out looking too grainy.  \n  \nOverall, the Xiaomi Redmi 4's cameras are definitely an improvement over those\nof the Redmi 3S Prime (Review), in terms of focusing and results. There are\nfew issues like poor low-light shots and slow processing in HDR mode, which we\nhope can be fixed - or at least improved upon - with updates.  \nXiaomi Redmi 4 performance  \nGeneral performance of the Xiaomi Redmi 4 is decent, and the device handled\nmost tasks well. The MIUI interface at times felt sluggish, but this doesn't\naffect performance within apps such as when playing games such as Asphalt 8\nand Cut the Rope 2. We had no major concerns during the entire review period.\nThere was also no noticeable overheating.  \n  \nOur unit had 3GB of RAM, and there was roughly 1.2GB free at any given time,\nwhich means those on the 2GB RAM variant of the Xiaomi Redmi 4 might struggle\nwith multi-tasking on their units. Despite roughly 1GB of free memory on our\nunit, we didn't have to deal with any crashes or slowdowns, but we would\nrecommend opting for the variant with 4GB of RAM if you can spend a little\nmore.  \n  \nVoice call quality was decent, and the phone supports VoLTE. The phone doesn't\nship with a headset, so we checked the sound quality using our own earphones,\nand were quite impressed. You get several options to tweak music with the Mi\nSound Enhancer feature when using earphones. The Redmi 4 was also able to play\nour assortment of test videos with ease.The 5-inch IPS display is bright and\ntext appears sharp. The screen is crisp with decent viewing angles. However,\nthis isn't the best HD display we've seen on a Redmi phone. Colour\nreproduction is decent, but in our opinion, the Redmi 3S was better. The\nscreen was readable and usable under direct sunlight. Movies and games look\ngood on the 5-inch display, though some might prefer a bigger screen. There's\na Reading mode on the device that reduces background glare. Users can manually\ncontrol colours and saturation on the device through the Settings app.  \n  \nThe Xiaomi Redmi 4 scored 43,677 in AnTuTu and 22,996 in Quadrant. We also ran\n3DMark Ice Storm Extreme and GFXBench, where the phone scored 5,890 points and\n25fps respectively. These scores are on par with those of other phones powered\nby the Snapdragon 430 processor.  \n  \nThe Redmi 4 lasted for 14 hours and 20 minutes in our HD video loop test,\nwhich is impressive. We can partly credit the battery loop test performance to\nthe low-impact HD screen resolution. With regular use, the battery lasted over\na day. There are also power saving modes to help squeeze more life out of each\ncharge. The phone doesn't come with a fast charging adapter but Xiaomi's Jai\nMani told us that it does support fast charging. We can expect Xiaomi to sell\na fast charging adapter for the Redmi 4 as an optional accessory, or you could\nbuy a third-party one.\n\n", "Two big problems with this phone:  \n  \n1\\. Its filled with google's bloatware apps with no way to uninstall them.\nThey take up to 20% or RAM. I don't know why we are not allowed to uninstall\nthem.  \n  \n2 [FIXED, the transferred me to superviser who helped me :) ]Whenever I\nconnect it my pc for internet tethering, my pc starts hanging and randomly\nblue screens. The problem is with rndis6 drivers. They give you no support at\nall.\n\n", "Beast in this price budget.. great value for deal.. i wish i could get 7k\nvarient but.. unfortunately 7k varient gets sold out in just seconds.. this\nflash sale are really headache.. 😅 In 9k price you can't get a better phone\nthan this.. built quality is awesome and don't go for 11k varient as it is\nslightly overpriced.. Decent option in this budget .. 11k varient is also good\nbut 9k varient is the best.. and don't see negative review of people who are\nfrustrated of this flash sale .. just go for it.. this is best in 9k  \nN also you can use google crome extension like price tracker.. 😎 so that you\ndon't have to waste any tym in this flash sales.. Camera is best in 9k it has\nsnapdragon processor not an mediacore cheap processer, ram management also\nworks good.. tha only negative side of this phone is that the buttons don't\nbacklight.. N it has hybrid sim slot n notification led light is of single\ncolour (white)... Other than this is beast in this price budget.. 😈jst go for\nit..\n\n", "It is a good phone.My regular $500 mobile had become unusable. I ordered this\nafter due diligence as suggested by a friend. Find it superb. One charge lasts\nfor 3 days. And this handy 4GB 64 GB 4000mAh has the same features as any 15k+\ndevices. Very happy. Need to try for at least a couple of months for long term\nstability.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 September 2017", "on 31 January 2018", "on 19 November 2017", "on 20 August 2017", "on 21 September 2017", "on 7 October 2017", "on 17 January 2018", "on 9 October 2017", "on 25 August 2017", "on 23 September 2017"], "reviewer": ["Angel S.", "Gagan Ahuja", "Hariharasudhan", "Ratul", "Raghu Reddy", "Nandita Das", "deeppokar", "Amazon Customer", "Amazon Customer", "N.V.Chalapathi Rao"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Five Stars", "Worth mobile except glass quality .", "the phone looks nice and handy", "Worth the price", "Not as good as I thought ram management and camera is not so good!", "Best phone I've ever used under 10k", "Nice phone", "Exellent phone, highly recommended!", "Its a winning deal", "Wifi Tower coverage is issue by purchasing date onwords"], "review": ["Nice phone in this price\n\n", "I upgraded from mi note 3 to redmi 4 .  \nNice mobile best specificationn with low price.  \nNo other brand gives 4100mah battery in same price. No need to buy power bank.  \n  \nOnly issue is delicate glass not gorilla. Because of curved you can't keep\ntamper glass. If you use without tamper glass it will break in one or two\nfalls. Glass price will be around 4k half of the mobile price and you have to\nwait for 2-3 hours in mi service centre queue. My previous mobile note 3 glass\nbroken 2 times finally sold in exchange after replacing glass.  \n  \nThis time I brought with 1 year insurance and backpanel safety added even I\ndon't like bulky.  \n  \nIf you buy iPhone for 30,000 it will give 3 years life even it falls many\ntimes.  \n  \nIf you buy redmi phone for 10000 it will give 1 year life. Both are same ☺️.  \n  \nMi could give spare parts strong panels with low price glass.\n\n", "From the first look, the phone looks nice and handy. Sleek and not that heavy.  \nAfter using for couple days, excellent phone for the price. Fits pockets\nperfectly and does the job it is supposed to.  \nThe configs are comparatively equal to the high end phones at a very cheap\nprice. Bought this for my son and it seems to be more than enough for him.\nWhen i ordered, though he was not happy due to the cheap price, the moment he\nstarted using it, is could see his smile :)  \nRecommend this phone.\n\n", "Bought this phone during the sale for 9499 and I think it's totally worth it's\nprice the only drawback is heating issue but not to a very high extent... The\ndisplay is a decent size and clear, sound is good, speed is fabulous compared\nto any other phone in the price range finger lock is prompt camera is average\nbut then again considering the price range you can't expect a dual camera all\nin all totally worth the price and a good buy...and yes I did get the delivery\n3 days before the promised date so appreciate the efficiency of amazon\n\n", "The product is decent at its price but one who is seeking a good camera please\ndon't consider it besides this this in spite of 4 GB RAM the ram management is\nnot so good it's disappear from recent activity  \nAbove is a negative side besides this all on.\n\n", "Best phone I've ever used under 10k. Don't know why al people scared of this\nproduct. For one faluty phone don't judge the company. It's still best company\nwith all packages in small price. Used this phone over 2 months. Works fine.\nNo heating problem. Camera quality is excellent. Volte supported. Long lasting\nbattery with rough use spend 1.5days easily.\n\n", "Posting it after 3 months of usage  \n  \nPro:  \nAwesome battery  \nDecent camera and processor  \nValue for money  \nUnlike samsung, Not much space is utilised by system software  \n  \nCons:  \nHangs if space is less  \nHeating...If play heavy games for more than 15 minutes..  \n  \nOver all it is one of the best phones (can also call top phone) in this price\nsegment, value for money and a worth buy\n\n", "As expected from Xiaomi, redmi 4 sets high standards in mobile phone in this\nprice segment, With a fabulous black sleek and operation friendly design, it\nhas remarkably good performance and even long lasting battery life. The phones\ncamera couldve been a little better, but in my opinion this will be one of the\nbest phone in this price segment as of now. I personally recommend it and\nloved it when i got mine. Hope this helps :)\n\n", "Got this one after I water damaged my Moto G3. Love the feel when I hold it,\nvery smooth. The Black color looks really nice with the corner smooth edges.\nBeen using for last 6 months. Come with Marshmallow that was a fall back, but\nrecently got the MIUI 9 update with Nuget. I felt I would die waiting... LOL..\nPerformance is really good, no lag during playing games, display is good but\nnot Full HD. The 3 GB varient is good for 9K, I think you may get it in much\ncheap now. Finger print scanner works flawless and its bundled with lots of\nfeatures that comes with MIUI 9. I really liked the phone, worth the money.\n\n", "Wifi Tower issue, router to mobile 1 meter full tower, but 2 meter distance\ntower is 0,iam not satisfied this product, my 3s prime all so covered same\nWiFi network around 10 to 15meter working good, plus give me a solution, IAM\nnot using mi4 purchase date to 15days,iam Chek normally display and future, no\ntime for backup 3s prime to MI 4, so not use, please replace new handset,\npurchase day to till now this issue ( product production issue) iam veary\nfeeling every time this product seeing\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 July 2017", "on 28 October 2017", "on 30 December 2017", "on 27 September 2017", "on 15 August 2017", "on 17 September 2017", "on 15 October 2017", "on 19 August 2017", "on 24 November 2017", "on 17 August 2017"], "reviewer": ["amit kumar", "venkatesh", "Sasi Kumar", "shyam punjabi", "Amazon Customer", "Anindya Kumar Das", "jack sparrow", "Prerit deshwar", "Amazon Customer", "LAWRENCE Rock Fort Rider"]}
]