[
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "King is back ..", "A Phoenix reborn from the Ashes. 😊", "Best phone made by Samsung till date!", "Note 2 to Note 8", "Very Nice product by Samsung", "Loving My Note 8", "One monster device !!", "\"The perfect phone\" for me", "Marvaleous piece of engineering!"], "review": ["Nice\n\n", "Samsung is back with Note 8 .. I have been using it for the past 9 days ..Its\nvery evident that they have rectified all their previous mistakes esp battery\nissue with note7 .. Note 8 is the best from the note series so far ..\n\n", "Beast of a phone.. A Phoenix reborn from the Ashes (of Note 7 last year) .. A\nnew boss in the Android arena..  \nAlmost all pros and negligible cons:  \n\\+ Premium built and feel.  \n\\+ Doesn't look that big in spite of having an above 6 inch screen.  \n\\+ Superb cameras, hands down one of the best, if not the best. Live focus\nmode is clearly superior to the similar options in other phones. Low light\nperformance is top-notch.  \n\\+ Samsung software looks better than ever.  \n\\+ Bixby requires some getting used to, but it builds over time and has some\nunique features up its sleeve due to its deep integration with the phone\nhardware and software.  \n\\+ S-Pen is one of the key factors that distinguish this phone from the crowd.\nThe pen has some nifty features that make your tasks very easy and convenient.\nLoved it.  \n\\+ In spite of having a somewhat lower battery capacity (compared to previous\nyear note and the S8+), the battery backup is good (if not the best). It's\nsufficient for a day's moderate use and then some in the night. Recommend\none'd charge it each night. It's not a hassle considering the fast charger\nprovided with the phone is a great one. Takes my phone around 1Hr40Mins to\nfully charge from 0 to 100.  \n\\+ Multitasking on this phone is a piece of cake thanks mainly to its advanced\nprocessor (exynos 8895 for India and Snapdragon 835 for US) and mammoth 6gb\nRAM.  \n  \n\\- The front and back is a fingerprint magnet. One has to clean it regularly\nif not using a cover.  \n\\- One handed use of the full screen is somewhat difficult (however, the one\nhanded mode in the settings and some other intelligent provisions provide\nalternative options for that).\n\n", "Another valuable addition to the Samsung family. Upgrading to the Note8 after\nusing the Note II for 4 years and it is a totally different experience\naltogether. Whether or not it is better than iPhone X is arguable, but it is\ndefinitely better than all other phones out there in the market. After having\nused the phone for more than a month now, here are a few pros and cons that I\nfind about this phone.  \nPros:  \n1\\. Huge 6.3 inch Super AMOLED QHD+ Display with a tall 18.5:9 aspect ratio\neasily beats any display in the market and will make you fall in love with it\nalmost instantly.  \n2\\. The S Pen is a Galaxy Note series exclusive stylus pen that has a lot of\nhandy features.  \n3\\. The latest Exynos Octa 8895 processor is a heavy duty performer and gives\nabsolutely no lag at all.  \n4\\. The 12 MP +12 MP Dual Pixel Dual Camera, along with the 8 MP Front Camera\nmake the photography experience one of the best in the market.  \n5\\. USB Type-C Fast Charging makes the phone charge really fast. And it is\nincluded in the box, unlike Apple's latest devices where you have to purchase\nit separately. Wireless charger though is sold separately, which is also a\ncool purchase.  \n  \nCons:  \n1\\. Though the display is mesmerizing, the 1440p display sucks out a lot of\npower and the battery doesn't last long. Note phones were known to be huge\nbattery carriers, but sadly 3300 mAh on this device just isn't enough.  \n2\\. The all glass body, though premium looking, is prone to breakeage. If you\nwant your phone to last long, a case and a tempered glass is a must.  \n  \nDespite a few cons, the pros for this device makes up for it. And the Note8 is\ndefinitely a great phone, which will certainly not disappoint.\n\n", "Well after using Note 8 for 2 weeks plus find it absolutely fit in every\ncondition and phablet shows no lagging or heating during use. Its comfortable\nto use no size issue. Buy it if you are truly multitasking person who uses\nspen a lot.price is high but what to do its samsung.rest is good .\n\n", "Very Nice product by Samsung.  \nMy last note phone was note 3  \nafter that i had purchased this mobile.  \nvery nice product\n\n", "The Phone is awesome. The display is amazing snd so is the camera quality. My\nFirst Note series phone.\n\n", "Coming from stock Android, I would say I am really impressed with this\ndevice...Samsung bloatware has been diluted down to the minimum I have ever\nseen on a Samsung device... !! The S-Pen works great. It is altogether a\ndifferent feeling when you are working with the Note 8. Small nifty little\ntweaks here and there adds to the cherry on the cake... :) The camera is one\nof the best smartphones cameras available as of writing this.  \n  \nI did however notice some lags over my period of usage (been 5 days). But that\ncan be fixed via an OTA update.  \n  \nThe only problem however, is the BATTERY life. During my normal usage it lasts\nfor about 6-7 hrs...Where in I make phone calls...Surf the\ninternet....Whatsapp mesages...Some social networking....etc...I need to\ncharge it once a while...  \n  \nBut I think Samsung played it safe here...After what happened with the Note 7\n!!  \n  \nOverall for people who can afford this device, do it without the blink of a\nthought !!\n\n", "I have replaced my last phone Note 3 with the latest iteration of Note series.\nI purchased the phone last month and my insights are limited to the use cases\nthat any general phone user would have. Following are my thoughts categorized\ninto Pros and Cons:  \n  \nPros:  \n* AWESOME Display: I am love with the crispness, sharpness, and vibrancy of color gamut displayed on the screen. The screen is Big and takes time to get used to, but within 1 week, I felt every other phone around me had a sub-par display (including 1plus5T). It's very hard to like anything else after this.  \n* Performance: I have played a couple of games and often forgot to close apps once I am done using them. Often they are minimized or running in the background. At one point, I had 15+ apps running subsequently and I didn't even notice any performance issues while using the phone. I accidentally noticed the # of apps running and I was pleasantly surprised with the device's performance. I have come to realize that \"A new redefined but familiar Samsung OS+Exynos Processor + 6GB of Ram\" is a deadly combination that's built to last. I can easily foresee that the phone will be relevant for next 3 years at least. This in a way justifies its high price against some lower end phones which start to show their true color within 1yr.  \n* Camera: I have taken stunning pictures of my daughter using Note 8 in broad daylight; and I say this even though I own a mid-range DSLR. The camera has performed brilliantly under natural light conditions. The camera has also performed quite wonderfully in the night as well, particularly under artificial light at home. The Dual Camera takes two images under live view setup and that's a nice to have feature. The Bokeh effect produced by software is very impressive and doesn't look gimmicky. However the camera has been a bit disappointing in extremely low light conditions and that's understandable as I was expecting a lot from a smartphone; then I do have a DSLR which would take over where Note 8 fails. On a side note, I have seen Google Pixel XL2 take great low light images - something that Note 8 can't give you. But as they say, there is nothing called \"a perfect phone\".  \n* Water Proof and Dust Proof: The phone is IP68 certified which means it is dust and waterproof. I play outdoor games and often the corners and edges where the back cover fits attract a lot of dust particles. To freak my wife, I often wash the phone with tap water to clean the dust and screen finger print marks. The look on her face is priceless. Lol ;) But having a phone which can resist elementary conditions around us is a definite plus for me.  \n  \nCons:  \n* Battery Backup: I wish I had more juice in battery which would make 100% charged phone last beyond a day. As I mentioned earlier, I am not hooked on the phone 24 x 7 but I do my share of gameplay, YouTube streaming, texting, browsing on the phone. I start my day with 99% charge and end my day with 13% left on my battery. I would say that's around average given other smartphones comfortably last more than 1 day (for example, Google Pixel XL 2).  \n* The speaker of the phone is a disappointment. I had better and louder sound output from Note 3. I don't know why Samsung didn't give front facing speakers like other phones have. It's puzzling.  \n* Finger Print Scanner: It's virtually nonexistent for me given its position right beside the camera lens. I have mostly used the Facial recognition to unlock the phone. Only in low light conditions or dark conditions, I have tried using Fingerprint sensor on the back to unlock the phone. The facial recognition works like a charm but it's definitely not as fast the one which One Plus 5T has (which is lightning fast).  \n* In order to protect the screen, there are no good screen guards/tempered-glass options available. I have wasted 2k in trying different screen guards only to find that the touch sensitivity of the phone is reduced after putting on the guard. I have found some screen good guards in USA, but those are extremely expensive (~$50). As of now, I am extremely careful while handling the phone especially when I am walking or talking.  \n  \nOverall I am happy with my purchase. I had to choose between Google Pixel XL 2\nand Note 8, and I wanted Note 8 for its bright display and comparable\nperformance. The camera isn't too far behind the Pixel 2. As I said, there is\nnothing called \"a perfect phone.\" All phones have various deltas which can be\nimproved. Somewhere I feel that's a strategy which Samsung, Apple, and Google\nadapt - to release the phone with some obvious flaws and deltas. I mean, \"Does\nit makes sense to put the fingerprint scanner next to cameras? Who was the\ndesign architect of this phone? I want to meet him\" :O :O  \nAnd of course, the next iteration has those deltas fixed and lures the\ncustomer towards them. For me, I​ am not looking at a smartphone for the next\n3 years at least.\n\n", "An amazing piece of Engineering. The Note 8 is a complete package offering the\nfinest display, an amazing camera and utilities for both work and personal\nuse. The S-Pen is an added advantage, with the 4k cash back when you buy it\nwith a HDFC credit card every penny worth. I was an iPhone user till today and\nmy first Android!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 October 2017", "on 8 October 2017", "on 27 September 2017", "on 19 December 2017", "on 13 October 2017", "on 29 January 2018", "on 6 December 2017", "on 29 September 2017", "on 16 February 2018", "on 27 September 2017"], "reviewer": ["Sangam", "Appu john mathew", "ChinmayJSK", "Nikhil", "Nav", "Javed Akhtar Ansari", "Vivek", "Saurabh Mittal", "Vaibhav Sinha", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Five Stars", "Five Stars", "Five Stars", "Mobile size fits nicely within hand", "Superb !!", "Flagship killer", "awesome phone", "Just Awesome", "Samsung Note 8 the beast", "Four Stars"], "review": ["Great experience. i got the phone the next day of launch. It looks great.\n\n", "Beautiful Beast . Just fab.\n\n", "Superb performance.\n\n", "Mobile is getting hanged. I am quite surprise as it's having 6gb ram. Mobile\nsize fits nicely within hand. No size issue. I didn't face any other issue\ntill now although I haven't used it enough. Just it hanged twice.\n\n", "Galaxy Note 8....naam hi kaafi hai 😍😍  \nYeah..slightly expensive but if you love to play with spen..then surely go for\nit.\n\n", "Awesome product camera is amazing and s pen makes it special. I got it on\nright time in one day delivery by amazon. Its one of the best phone of samsung\never made.\n\n", "what a great phone this is, out of the world and i dont think there is any\nphone i the market to compete with this. This is a feature reach phone and a\ngreat camera. as usual the note features are great\n\n", "Phone is really top notch, I am simply loving the new amoled screen-super big\nand super clarity  \nOpted for One day delivery had to call customer care thrice as the delivery\nwas delayed but got it the same day around 8:30 pm\n\n", "The best phone in the market. Excellent design excellent processor and the S\npen is simply outstanding.\n\n", "Great phone. Only con i can think of is battery life.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 September 2017", "on 25 September 2017", "on 25 November 2017", "on 27 September 2017", "on 14 October 2017", "on 27 September 2017", "on 31 January 2018", "on 9 November 2017", "on 14 October 2017", "on 21 November 2017"], "reviewer": ["cool shaikh", "Gopal Singh", "Achyut", "manas", "manish", "Phenomenal", "Anand", "Anas Aslam", "Moin Qureshi", "Sohil"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Phone that defined big just got bigger", "Awesome phone...", "Best Phone Of 2017!", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "nice look.", "Five Stars", "Four Stars"], "review": ["Samsung Galaxy Note 8:  \n  \nPros  \n  \n1)Even after its bigger size, it was easier to hold and reach fingerprint\nScanner  \n2)Dual rear camera with Dual OIS. Live focus portrait mode which is awesome  \n3) Exynos 8895, 6GB RAM . Performance is awesome no lags at all  \n4)Very Good Build Quality.  \n5)Super AMOLED Display with the resolution of 1440 x 2960.  \nS-Pen is more premium in look and feel great.  \nMulti tasking Easy to work with two apps at once  \nAudio is great from the AKG earphones.  \nIP68 Water resistance  \n  \nCons  \n  \nHybrid Sim Slot you can use two sims or one sim + miroSD card  \nBattery draining i get max 4h SOT  \nSlow updates  \nFM radio is missing\n\n", "Best ever note series...note 8...black beast..\n\n", "Apple better get into the dual SIM thing! Till then this is the best! Believe\nme once you start using the S Pen then you will always prefer a NOTE!\n\n", "The phone is awesome\n\n", "Premium feel\n\n", "Excellent.... You have to payextra for wireless charger...Samsung should have\nadded that also??\n\n", "Amazing, awesome, perfect, superb!!\n\n", "User friendly ....nice look....\n\n", "now feel no 1 product\n\n", "good phone\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 March 2018", "on 8 December 2017", "on 2 March 2018", "on 25 November 2017", "on 17 November 2017", "on 28 December 2017", "on 26 February 2018", "on 25 January 2018", "on 2 January 2018", "on 6 February 2018"], "reviewer": ["Aditya", "Mayank Somani", "Paras Padhi", "b v madhusudan", "Parvez Ahmed Shaikh", "P V Hariharan", "Amarendra Kumar", "Ashutoshsingh", "MANISH G GAJJAR", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Upgrading to the Future.", "Every \"Note\"worthy", "Good product and seller.", "Five Stars!!!!!", "but battery life not good and sometimes it gets hanged", "Gorgeous n Best Display ever(according to DisplayMate)", "Five Stars", "Five Stars", "Five Stars", "bigger n better"], "review": ["The Samsung Galaxy Note 8 is the best big phone you can buy. For once, it’s\nmore than just the size of the screen and the power of the S Pen that count.\nIt also captures superior telephoto and bokeh-rich photos with its new dual-\nlens array, and it clocks in faster with 6GB of RAM.  \n  \nThere a price to pay, however. It’s a taller phone with a steeper price tag.\nIt takes a lot of finger-stretching to reach the outer edges of the screen,\nand costs more money than any previous Note phone. You’re also only getting\nall-day battery life that’s lower than expected, probably thanks to last\nyear’s recall. It’s less, shall we say, Note-worthy.  \n  \nThe Note 8 is Samsung’s big phone homecoming, its dual-lens camera debut and\nits 6GB of RAM premier wrapped into one. It makes quite an entrance. Let’s\njust hope it doesn’t make another quick exit.  \n  \nWho’s it for?  \n  \nCan you handle the Note 8 size and price? Yes? Then this phone is for you.\nThere’s more screen than ever, it has the best camera on a phone and you can’t\nslow it down. It’s Samsung’s best – but it can’t be recommended to everyone.  \n  \nUpgrading from an old Note? It’s a big jump from 2015’s Note 5 (well\ntechnically :P), the last Note with more than a two-month lifespan. So it's\nbasically like upgrading to the future with futuristic inflation rates applied\nas well.\n\n", "This Note is surely going to replace PC's... It's humongous, it's powerful,\nit's classy...\n\n", "Good product and seller. Will highly recommend\n\n", "pure Beast!!!\n\n", "Yes,but battery life not good and sometimes it gets hanged!!!  \n  \nKh@n\n\n", "Gorgeous n Best Display ever(according to DisplayMate), Awesome\ncamera(DxOMark-94), buttery performance and decent battery backup(Almost a\nday). You won't regret on buying it although bit expensive. But its full of\nfeatures/gimmicks to give you that premium feel and sometimes utilities. S-pen\nis a great accessory to have, it really comes handy sometimes. Plus Dual sim\nand Headphone Jack, which its competitor are not having(Thank u Samsung for\nthat). The new Samsung experience touchwiz is a great improvement and looks\nclean, refreshing, beautiful and smooth. In a Nutshell one of the best premium\nn flagship device for 2017-18.\n\n", "This is phone of 2017. End of story.\n\n", "Very good product from Samsung and thanks to Amazon for timely delivery\n\n", "Worth spending every penny .\n\n", "Awesome...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 October 2017", "on 27 September 2017", "on 19 December 2017", "on 26 September 2017", "on 27 October 2017", "on 27 October 2017", "on 11 December 2017", "on 27 September 2017", "on 18 November 2017", "on 25 September 2017"], "reviewer": ["Soham Mukherjee", "Bhargav K Phaneendra", "Amazin’ Customer", "Rushabh Amar Shende", "Shoibulla Khan", "Sonu", "Viraj H.", "Sudhakar", "Amazon Customer", "Kartik"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Note 8 is an amazing phone", "Loved it!!!", "Five Stars", "A feature rich phone", "Samsung best flagship phone ever.", "What a Note.", "awsome mobile..... fullfilled my expectatio", "My Samsung Galaxy Note 8", "Awesome phone note 8", "The only phone that u will ever need!"], "review": ["I just love this Phone. I am a fan of Samsung Note Series. I am using note\nsince 2011 and I must say that Samsung is an Innovation in Mobile category.\nYou need to be smart enough to use this phone because if you are an\navg/ordinary user like you whatsapping most of the time then this is not a\nphone for ordinary people. This phone is a feature pack of several other\nthings, it's a powerful multimedia phone.  \nSleek in design and Camera is just awesome, I would say if you are planning to\nbuy a camera under 35K then better purchase Note 8 but you need to possess bit\nof photographic skill to use Pro mode, I have used the pro mode and trust me\nwhat a brilliance Note 8 just clicks.\n\n", "Even though screen is 6.3 inch, its still 75% comfortable for single handed\nuse  \nBattery is only 3300 mAh but easily gets you through 1 day but not more than\nthat!  \nScreen is the major selling point of this phone and damn its gorgeous  \nCamera takes decent shots and I have no complaints  \nUI is bit dull so switched to Microsoft launcher  \nGood reception and crisp sound quality (but not as loud as iPhone)  \nSPen might not be useful for everyone but it definitely helps even in small\ntasks like taking screen clips etc  \nGot December security patch, so is secured from most known vulnerability  \nGot Rs. 8K cashback as Amazon pay balance :)\n\n", "Best smartphone available right now ! (Jan 2018)\n\n", "The smartphone is a feature based powerhouse and a worth to go for  \n1\\. Camera-9.5/10  \n2\\. Speed-8.5/10  \n3\\. Design-9.5/10  \n4\\. S pen-9/10  \n5\\. Screen-9/10  \n6\\. Battery-9/10  \n7\\. User experience-9/10  \n  \nNote 8 has always been special but this one is a feature rich phone. There are\na lot of hidden tips and tricks and customizations in the Samsung UI which\nmake the experience worth while!  \nA worth buy\n\n", "Best phone ... its a beast in the market.  \nGreat photo quality... design is premium, worth the cost. I feel every penny\nis justified.  \n  \nIf you are confuswd with S8 plus and note 8, surely doubtly note 8 is winning\nthe race.. I have S8 PLUS as well but note 8 has far par performance.  \n  \nFast delivery by amazon I got it on 23 rd of September itself after its\nlaunch.\n\n", "The note 8 indeed is the phone of 2017.A good deal with the 8000/ Amazon pay\nback. Enjoying the note for the time being.  \nThe fast charging adapter along with it conked off in 3 days.Let it be known\nhere if anyone has had similar issues with the adapter.\n\n", "Excellent design , feature and screen is fabulous.. proud to being an note\nseries addict..\n\n", "The Note 8 experience is awesome and it’s received today. Great phone and\nwould recommend to buy.\n\n", "Great phone great specification great camera the most awesome phone of the\nyear\n\n", "This phone is all that you need. You won't need a DSLR if you buy this phone.\nIt is loaded with so many software and harware features that other phones dont\nprovide. S pen features are really unique useful and fun. Best display. No\ndoubt the best phone of 2017. No phone has ever made me happier it's worth the\nmoney. I also purchased iPhone X and Google pixel 2. This is the one to buy.\nOverall i feel this is the best. Buy the gold one it's really gorgeous. It's d\nbest golden on a phone\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 January 2018", "on 30 December 2017", "on 24 January 2018", "on 30 December 2017", "on 28 September 2017", "on 25 January 2018", "on 25 September 2017", "on 25 September 2017", "on 26 September 2017", "on 5 January 2018"], "reviewer": ["Kumar Abhinav", "Praj", "Shankar", "Amazon Customer", "Vishal", "sonny john", "Fabulous", "SUMAN", "Zia", "Syed Tanbir"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Just buy it without any thinking", "Note 8 > >>iPhone X", "Fabulous device, one I was looking for a long time", "really a good one", "Whole experience is as usual great.", "Good things: Display Back camera Software S pen Built ...", "Black Beast in the hand..", "Five Stars", "Long time Apple user shifting to Android", "Perfect as expected!"], "review": ["Portrait mode on note 8 is breath taking  \nExcellent camera  \nGreat Display  \nOnly problem is speaker\n\n", "Best decision ever , the new design philosophy of Samsung makes even the s7\nedge look dated , the footprint of the device is not the big but the screen is\ngorgeous. It's. Treat to watch a 2k video  \nThe real deal is the camera : dual camera captures brilliant photos in well\nlit environments , however once it gets dark the live focus uses the primary\nf1.7 lens to induce the depth effect which is not so good, anyways, the low\nlight performance throws iPhone X out of water , iPhone lacks low light\nperformance whereas this one masters it .  \nCamera can also be used underwater but the deal breaker is the screen gets\nrandom touch inputs under water .  \nThe Spen which I thought I would never use ; is quite a useful TOOL ; helps in\ntaking notes at any point in time without reaching for the notepad and a pen .\nOne tight that was not available out of the box was the action memo which was\npresent on note 5 ; and note 8 comes with a 3.5 mm headphone jack where you\ncan plug in the supplied pair of amazing earphones from Harman Kadon's AKG\nwhich retail for 6k ; in the box .  \nAnd you get dual sim and memory expansion slot both of which are missing on\nthe iPhone X\n\n", "I have a dream of having a best flagship phone and this has actually\nfulfilled, everything about the mobile is just awesome, enjoying the mobile\nlike never before, performance is just outstanding, No lag what so ever.  \n  \nCamera is a standout from its competitors, Got wireless charger as well and\njust it is a premium device and proves why note is premium.\n\n", "well i'm really not good in writing review but would like to give simple\nstatements on this product:  \nIt is really great piece of work & worth every penny  \nIts light in weight  \nCamera quality is really good  \nSPen comes in handy, if you use it. I use it alot.  \nbattery life is good as of now  \nits big in dimensions, short hands suffers. And also to reach the finger print\naccess is bit difficult  \nVideo quality is extra ordinary, i bet you will enjoy the youtube quality and\nits sound even at 360px quality  \n  \nSo i give a good thumbs up to this product, and wiswell i'm really not good in\nwriting review but would like to give simple statements on this product:  \nIt is really great piece of work & worth every penny  \nIts light in weight  \nCamera quality is really good  \nSPen comes in handy, if you use it. I use it alot.  \nbattery life is good as of now  \nits big in dimensions, short hands suffers. And also to reach the finger print\naccess is bit difficult  \nVideo quality is extra ordinary, i bet you will enjoy the youtube quality and\nits sound even at 360px quality  \n  \nSo i give a good thumbs up to this product, and wish they could have given the\nwireless charger along. Go for it guysh they could have given the wireless\ncharger along. Go for it guys\n\n", "Delivery earlier than promised. Whole experience is as usual great.\n\n", "Good things:  \nDisplay  \nBack camera  \nSoftware  \nS pen  \nBuilt  \n  \nNot so good things:  \nFront camera  \nBattery backup  \n  \nOverall, best dual sim android phone\n\n", "Writing review after two days of usage..  \n  \nA complete set of package. I must say you never get bored of this phone\natleast till next note😜.This is beast with its looks,performance,power,s-pen\nand overall a great phone.. The best part is samsung have dual operation for\nmessanger,what's app and Facebook that means you can use them with both the\nSims without any third party applications.. Samsung would have make battery\nbetter.Nothing other than that. One can enjoy this phone to the core..\n\n", "Note 8 is beast just waiting for free wireless charger..\n\n", "I have never used an android phone before but after the disappointment of the\niPhone X, decided to take this plunge and I dont regret this for one minute!\nThe screen is a pleasure to watch and the performance is no doubt stellar.\nDon't be fooled by the 3300 mah battery as the phone lasts all day easily even\nwith heavy use. I respond to work mails all day and am still left with 25-30%\nby the end of the day.  \n  \nThe only downside I see is that the wait for the free wireless charger is too\nlong.\n\n", "Everything is as promised and in time delivery as well, but the pre order free\ncharger system is non sense and tedious! Shud have just shipped it together\nbut I am sure its so annoying that they know many would forget or not be able\nto do the entire process due to time constraints and hence will not even take\nit!  \n  \nPhone is excellent and the free case inside the box is also excellent so try\nbefore u buy another case.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 October 2017", "on 10 February 2018", "on 27 September 2017", "on 1 January 2018", "on 28 September 2017", "on 12 November 2017", "on 26 September 2017", "on 25 September 2017", "on 7 October 2017", "on 26 September 2017"], "reviewer": ["aniruddh", "Jaskirat", "Rajesh", "Amazon Customer", "KALYANASUNDARAM SUBRAMANIAN", "Amazon Customer", "Divya Sharma", "Amol K", "Rajiv", "Nikhil"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Delievery & product both brilliant..", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "Five Stars"], "review": ["Should buy\n\n", "Delievery & product both brilliant..\n\n", "The no compromise phone\n\n", "Its amazing .....more then apple\n\n", "\n\n", "Awesome product\n\n", "No complaints on phone\n\n", "nice\n\n", "SUPERB........!!\n\n", "☺\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 October 2017", "on 27 October 2017", "on 26 January 2018", "on 29 October 2017", "on 22 March 2018", "on 31 October 2017", "on 1 November 2017", "on 11 February 2018", "on 30 October 2017", "on 25 January 2018"], "reviewer": ["Manjunath Ramesh", "Kunal Kashyap", "dinesh", "Mahesh V Mhatre", "Farid Uddin", "Vinod P.", "Kindle Customer", "Akkymathur", "Harshe Patel", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["The biggest beast is back with a bang!!", "Poor cashback policies", "Its a Killer Note!", "I am happy with my choice", "Great value, great satisfaction", "Fabulous mobile", "Great flagship present till date-a future generation gadget", "Great phone.", "... Start to the Phone but amazon packing is very poor. Phone wrapped in thin card board", "Best phone of 2017"], "review": ["The titan among all smart phones is back. Note 8 is undoubtedly the fastest,\nsmoothest, performance best android ever. Have been a note user since note 2\ndays and they can never go wrong. And the S-pen is magical... just love how it\ncomes in handy at times when you have to be real quick in jotting down some\nnote.  \n  \nApple fanboys y'all dead meat now😂😂🤣🤣\n\n", "Read all policies before buying anything based on offers like cashback. Too\nmany ambiguous fine prints not favoring the buyers. Watch before you buy..\n\n", "All Samsung Note users are surely going to love it. They do not need any\nreview to buy it. For new users on Note once you start using note you will\nnever like any other mobile. I have personally owned all note series except 4\n& 7\\. The feature this device provides is completely outstanding.\n\n", "As one who shifted from iPhone, I am happy with my choice. Rest of the\nfeatures has already been more than extensively covered\n\n", "I was iphone 7 user but changed to note 8. After using this phone for over a\nmonth and half, I am very pleased with my decision to change from iPhone to\nGalaxy Note 8. I got more than I ever wanted from a phone meant for business\nprofessionals.\n\n", "Got this beautiful mobile by exchanging my old device.  \n  \nThank you Amazon & Samsung for delivering a wonderful mobile\n\n", "Best phone....absolutely the beast....when comes to performance,ram management\nit is the beast in true kind ....camera -u will be surprised its so good n the\nbest till date present....live focus is flabbergasting.....it takes to\npictures at the same time -closeup n wide angle....truly speaking ..it is the\nphone if u r thinking to buy....u will be happy after buying this\n\n", "Great phone love it. It is Dual SIM slot so you can play it with either two\nSIM cards or one SIM and an SD card. Camera and some other features are also\nthe best in its category. Battery life is decent.I assume that software\noptimization works well as Samsung presents. As many of you know it by now,\nthe screen display of this phone is phenomenal. I am pleased with the seller\nand so far so good with the phone. Everything perfect!!! the service and the\nproduct. I recommend!\n\n", "Samsung Note 8 Superb actually 5 Start to the Phone but amazon packing is very\npoor. Phone wrapped in thin card board. I am using iphone since 8 years but\nNote 8 is superb, really as expected lots of customization and S-PEN is just\namazing. worth buying product. infinity screen is awesome.\n\n", "Best phone of 2017. Been a note series user for 5 years now... Upgrading now\nfrom a note 5, the note 8 has a large, beautiful screen; the effect of 6gb ram\nis evident in tasks. Bixby is surprisingly effective (if you don't have a\nthick Indian accent)  \nEveryone knows the pros.  \nCons are the loss of quick launch camera by pressing the home / power button.\n( The govt wants all made in India phones to have default 3 press power button\nto activate emergency SOS service!)  \nAnother problem is getting a good tempered glass that fits with a case to this\ncurved beauty..  \nAmazon shipped it fast as usual, full Kudos\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 October 2017", "on 5 March 2018", "on 10 October 2017", "on 25 October 2017", "on 2 November 2017", "on 26 September 2017", "on 2 November 2017", "on 25 January 2018", "on 4 October 2017", "on 27 September 2017"], "reviewer": ["Shonit Biswas", "Amazon Customer", "GB", "Avinash", "Capt. Watson", "Yuva", "shivam chaurasia", "Harpreet", "Amit", "pavan"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "Five Stars", "Five Stars", "Five Stars", "and it still remains an excellent choice.", "Hi this phone is very good but I need this mobile bill number as I ...", "Five Stars", "Five Stars", "Five Stars", "Excellent product"], "review": ["Excellent?,superb, fantastic....!  \nGo for it.....!  \nNo need to check any more reviews or any tech specs...!\n\n", "Good quality\n\n", "Value for all the money that i paid... luv this phone.\n\n", "Worth the buy, but still pricey\n\n", "The Samsung Galaxy Note 8 is a true phablet, and it still remains an excellent\nchoice.\n\n", "Hi this phone is very good but I need this mobile bill number as I lost it can\nI get any help from u people\n\n", "Excellent\n\n", "It’s cool\n\n", "nothing else to say just superb\n\n", "Excellent product & Delivery before scheduled date\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 March 2018", "on 27 February 2018", "on 24 February 2018", "on 30 November 2017", "on 8 March 2018", "on 21 March 2018", "on 20 February 2018", "on 30 November 2017", "on 18 March 2018", "on 28 October 2017"], "reviewer": ["Jignesh D.", "Sohel", "ashir shareef", "BT", "Amazon Customer", "Kotha chandini", "Sandesh D.", "Pusuluri Venkata Prabhat", "Amazon Customer", "Snehal Chauhan"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "highly recommended!!", "Get what you expect! Note 8 simply amazing.", "Mind blowing 👌✌", "Five Stars", "Four Stars", "Five Stars", "Five Stars", "Best mobile of the year", "Five Stars"], "review": ["Yeah really product is much better than my expectation.thank u so much amazon\n\n", "Superb experience of using this device, highly recommended!!\n\n", "Loving the new member in the world of technology! Just go for it :)\n\n", "The best phone i have ever used. Just amazing. Far better than my previous\niPhone. Loving it😙✌👌\n\n", "This phone has met all my expectations.\n\n", "good\n\n", "Phone of the year\n\n", "Excellent display butter smooth software s pen does a great job\n\n", "Awesome mobile with good battery backup\n\n", "Very good\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 March 2018", "on 20 February 2018", "on 28 October 2017", "on 19 February 2018", "on 18 December 2017", "on 16 February 2018", "on 1 October 2017", "on 24 February 2018", "on 30 January 2018", "on 10 November 2017"], "reviewer": ["Shauket Ali", "AMIT KHATWANI", "kunal", "Narendra Kumar ", "A.Dinesh Kumar", "Nebil Abdulkareem", "Pushkar A.", "Suvankar Chowdhury", "sandhu", "Amazon Customer"]}
]