[
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Works like a charm", "Good for Normal Use.", "Build quality", "Nice mobile at small budget", "Vertical lines on Screen", "Proud to have Samsung mobile", "This shows the poor quality of battery", "I enjoy it.", "Worth for 6490/-", "Good phone at 7"], "review": ["Great phone for the price. Rest all is the spec game that you would not need\nas long as it works like a charm..\n\n", "I am writing this review after using the mobile for 2 days.  \n  \nPros:  \nNo heating problem.  \nThe display is ok. But we cannot compare with J-series(AMOLED).  \n2GB Ram. 16GB ROM (Around 9GB user space).  \n  \nCons:  \nIt takes little longer for charging.  \n  \nOverall it is a good buy at Rs.6490/-.\n\n", "Phone is good at this price range, but phone body and back panel was very\ncheap. Back panel should be remove carefully otherwise it could break.\n\n", "This review after using it over one month  \nLook wise very nice.mobile performance also good, battery also not bad,\nallover experience is good against mobile,  \nbut Amazon HDFC debit card offer is very irritating because no cash back\nreceived yet and no update received from related HDFC offer, so I can't\nunderstand what's the status of my cashback, it's will be debited to my\naccount or not. as compared Flipkart is very fine Instant Cashback.\n\n", "Screen had issue in 2months\n\n", "Love,  \nProud to be a samsung buyer  \nBuy without any doubt if looking for under ₹7000 range\n\n", "Writing this review after 1 year of usage. Phone is average in this price\nrange. it hangs sometime and touch is also not that responsive as others in\nthis segment. The major issue for this rating is that battery is swollen after\n1 year of usage. In fact, I purchased 2 On5 Pro mobiles at the same time and\nbattery is swollen for both of them. This shows the poor quality of battery...\n\n", "Cute. Weightless. Fits well in shirt pocket without a feel of weight. Awesome\nproduct.\n\n", "Worth for the money. I got this Product as exchange for my Samsung Mobile. I\npaid extra 2100 bugs. My Dad uses this 4G Mobile. He is pretty much okay with\nit. Touch sensitivity is a bit slow but this is what a 7000 rs range mobile\ncan give u. Appearance and Display is worth the money. Instead of getting\nother brand mobiles you can go with this Budget Samsung Mobile which is good\nquality product\n\n", "Good phone at 7.5k. Saw a lot of negative reviews on amazon. But I have not\nfaced any issue. Runs pretty cool and smooth. Very good backup. Camera is\ndecent. Would have given full marks if fast charging option was there.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 September 2017", "on 26 September 2017", "on 11 October 2017", "on 24 October 2017", "on 1 September 2017", "on 3 February 2018", "on 6 March 2018", "on 26 December 2017", "on 28 October 2017", "on 2 September 2017"], "reviewer": ["See VALUE, Buy", "Ganesh", "Akashdeep Kumar", "Tanmoy", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Nilavarasu Kannan", "GEETHANJALI", "Chethan"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["I love it", "After 4 months of use..", "Good slim look, fits in hand, nice touch, clear screen", "Otherwise it's a good phone.", "WORTH THE MONEY.", "Satisfactory Product from SAMSUNG", "Best phone ever at this price", "Value for money product.", "Camera not good as it should be with 8 MP and 5 ...", "Good one at this price"], "review": ["Super phone and worth.Battery pickup is aweapme. Camera is also good. And\ncatch the jio single very well and I am happy this phone with me.\n\n", "I'm writing this review after 4 months of use...  \nIt's the best phone to gift for your parents and if you are a simple user..  \nAfter using it for few months I never faced any issues with this phone..  \nI hv received android nougat and it has improved it's performance a lot..  \nIf you are a simple user definitely go for it..\n\n", "Phone delivery on right time. Touchscreen is smooth. Screen is bright and\nclear like all Samsung phones. By using offers running on Amazon, it costs me\nvery less. I also like earphones provided by Samsung. It's not like other\nChinese products. Service center available everywhere. No finger print feature\nbut suggesting to buy this phone. Enjoy.. :-)\n\n", "It charges really slow and drains fast.. Not sure if this is the product's\nlimitation or just a problem with this particular set. Otherwise it's a good\nphone.\n\n", "Very Nice phone. Bought it for my Aunt. Light to hold. Fits in her palm. The\nrose Gold gives it an elegent look. Good internal storage. Camera quality is\nnice, front & back. Battery charge stays long, but constant internet usage\nmakes it deteriorate faster than normal.\n\n", "A good budget phone. Using for last 3 months without any software problem.\nRear camera is pretty good but Selfie camera is okay type. The battery back-up\nis not so impressive. If you have a power-bank then On5 Pro could be your\nchoice.  \n  \nOverall I am satisfied with this phone. It has an elegant look, so that you\ncan keep it on your palm without any hesitation.\n\n", "This is the best budget phone at this price.  \nI really really happy with this phone.  \nSome cons are present in this phone like camera quality is decent.but this\ndevice is able to recorde video at 1980×1280(fhv).  \nIn my openion  \nI will strongly recomemded to buy it at this price.  \nI am fully satisfied with this product.\n\n", "Already purchased 2 numbers from Amazon, one in march and in august. It's a\nvalue for money product. Working perfectly fine when I'm writing the review in\nOctober. Only thing which I feel missing is the gorilla glass screen.\n\n", "Camera not good as it should be with 8 MP and 5 MP.  \nHeadphone cheap quality, wire is also hard.  \nCharger average quality and USB cable lenght is too small.  \n  \nInvoice does not have IMEI number printed on it. Had to download invoice from\nthe link provided by Amazon, box does not contain invoice provided by\nmerchant.\n\n", "It's a good phone at this price from Samsung.  \nI have been using since past few weeks and working performance is smooth ! But\nit's not good for one who uses a lot of app because it lacks if many app are\ninstalled.  \nBased on features provided it's good !!\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 August 2017", "on 16 January 2018", "on 15 October 2017", "on 18 September 2017", "on 24 September 2017", "on 16 August 2017", "on 25 September 2017", "on 4 October 2017", "on 5 October 2017", "on 25 November 2017"], "reviewer": ["Amazon Customer", "Anilkumar Nair", "Umang", "Prerna", "Mahboob H.", "Tamal G.", "Harshit bansal", "Niladri Bose", "Amazon Customer", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["I had bought it for family member who wanted non chinese phone with 5\" screen and he liked it very much", "Good", "worst exchange policy", "worst samsung device", "Better buy Mi", "Poor quality phone", "Good", "found no easy way of returning it", "Better phones available in the market with better faetures", "Recommended to buy, Good performance budget phone"], "review": ["Got it for 6490. I had bought it for family member who wanted non chinese\nphone with 5\" screen and he liked it very much.\n\n", "Excellent phone but with one serious flaw for which I deducted a star in my\nreview: Poor battery backup. Good otherwise\n\n", "worst exchange policy..... if ur not stating your policies clearly why did u\naccept the order.... VERY WOST ....... as per the policy you have mention in\nyour site my phone display is intact and working properly.. the power button\nof the phone is not tight so u have to press it harder to switch off .. people\nare exchanging the mobile for small defects.. And u people need brand new\nphones for exchange...\n\n", "worst product i ever used only problem i am facing is touch response is worst\nspecially when u r typing any message.dont buy this device go for any other\nsamsung product for example on 7 pro.  \nand amazon after sale support is terrible.\n\n", "Not satisfied with the performance. Always asks for memory clean even though\nmy memory card is having 22GB of space. I have to transfer data every now and\nthen from phone to memory card. Battery backup is also not good. Drains fast\nand takes too long to charge.\n\n", "This phone in my opinion is just not expected from Samsung. Samsung phones are\nknown for their smooth running but this phone hangs repeatedly. Poor quality\nphone.\n\n", "Have been using the phone for close to a year and found no major issues with\nit. The camera is good for the level and the sound system is pretty decent.\nThe phone does not hang up or heat when used extensively and it gives an\noptimum performance. Worth the price.\n\n", "Wifi mobile hotshot was not working ... thought of returning, found no easy\nway of returning it .. was stuck with faulty set. Tried every thing from\nupdating to settings ... at last opened it up, unplugged the wifi cable then\nplugged it firmly it worked at last... don't they check properly before\npacking it up!\n\n", "Too costly just for the brand name. Better phones available in the market with\nbetter features. Samsung is lagging much behind its chinese counterparts in\nbudget smartphones category\n\n", "I have been using this phone for over a month. Its a good reliable phone from\nsamsung.  \nRam, Camera, Memory, Battery backup etc evrything is fine. No hanging problem.\nSmooth response and with Android 6 u can restrict permissions of different\napps to only portions u want them to access.  \nOnly thing lacking is a flash in front camera. Bt overall at under 7.5 k i\nthink it is a very good and safe option to go by if u want durability along\nwith decent specifications.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 October 2017", "on 12 October 2017", "on 13 February 2018", "on 21 August 2017", "on 6 February 2018", "on 24 September 2017", "on 20 December 2017", "on 14 September 2017", "on 30 December 2017", "on 28 September 2017"], "reviewer": ["Manish", "aMo", "vicky", "tushar srivastava", "BHARAT KHATRI", "Dr Rupesh tiwary", "Balaji", "Amazon Customer", "The Genuine Reviewer", "Amit T."]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Good one for normal use.", "It is a nice product with good camera quality", "Good phone", "Excellent phone in this price range", "Justifies it's tag of a bestseller....", "Not a Worth purchase..", "Nice and good product from Samsung", "Really good value for money", "Good phone", "Three Stars"], "review": ["Gifted it to my mother. Very handy and good speed. Camera quality is nice.\nOnly thing is after applying tempered glass screen guard have to press a\nlittle bit hard.I think it's issue of screen guard quality.  \nFor normal use great product at this price\n\n", "It is a nice product with good camera quality.As being one budget smart phone\nit is quite better than other handsets provived by the other brand though its\nbattery back up is not satisfactory.fro less to moderate uses the battery only\nremains for hardly one day.rather than that it is a good budget friendly smart\nphone\n\n", "The is phone is a good deal at 7.5k...but there is one big problem with the\nphone, it rings very very slowly the max. Volume is so low that many times my\nmom misses a call or two. I ordered this phone for my mom and she is loving\nit.The only problem is with the volume.\n\n", "Excellent phone in this price range.... But camera is average.,photograph and\nvideo quality is average, earlier I had Samsung grand 2 which was superb in\npic/video clarity... Everything is fine except camera..good for 4g entry level\nbuyer's\n\n", "At 7250 (@Big Season Sale), it was a good buy and my father is happy about it.\nI would say this to everyone that if you have got a budget of 7000+, then pls\ngo for any Samsung phone instead opting for a Chinese manufacturer phone.\n\n", "Specifications are good but this is not a good phone at this price... Don't\nbuy this... Now I am realising why I select this phone after a long survey...\nSlow processor... Bad front camera.... and a very slow processing... It's take\na long time after getting a finger touch.... Worst Battery life... It's\ndraining like hell.... But it has one good thing that it has dual 4G support\ndual SIM... Other it is not a worth purchase....Go for Moto E4 or MOTO C\nPlus....\n\n", "Samsung phone no complains. Little high price according to the specifications\nand compare to other companies. But still after sell service and quality of\nproducts are just awesome. I will recommend this product to everybody.\n\n", "Really good value for money.5 inch screen is very comfortable in pocket and\nalso handling is easy.os also upgraded to nougat.samsung build quality is\ngood.dont expect too high in this range.No comparison with chinese brands like\nMI etc because this phone is so durable with zero complaints.\n\n", "I bought it for my mom. She is a first time smart phone user. So this is phone\nis good from that perspective. It's been one month. No issues with the phone\nso far. Not a bad phone if you're looking to buy for about a 1.5 year useful\nlife.\n\n", "Good ....no problem yet......  \nCharging cable is so small .....not even 1 meter...-1...  \nHeating problem ....-1\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 October 2017", "on 11 December 2017", "on 22 August 2017", "on 31 October 2017", "on 7 December 2017", "on 20 October 2017", "on 10 March 2018", "on 8 February 2018", "on 4 September 2017", "on 18 September 2017"], "reviewer": ["Prasad", "Krishnendu Das", "INDRAJA", "ameen", "Vivek Dwivedi", "ASHISH", "Amazon Customer", "Sam", "Giriraj Rathi", "Amazon Customer"]},
{"rating": ["1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Pathatic product", "No stock music player, except google music play..., didn't expected from a brand like Samsung", "First day experience good", "Best buy over chinese brand", "Five Stars", "PLASTIC COATED BATTERY CASE", "O.K", "One of the best phone in this range", "Good but voice calls not audible", "AMAZING SMARTPHONE @ LOWEST PRICE"], "review": ["I brought a mobile from amazon one of the best online shopping Web but it's\nhaven't been reach my expectations and the mobile phone is very bad it's\nhanging nothing like any thing.  \nit's so funny the screen is jumping one to other side with out touching\nscreen.  \nMobile is troubling me lot ..i never buy this Samsung mobiles in future that\nto from amazon....  \n  \nSo bad experience from mobile and the amazon....\n\n", "Everything is fine, except no music player & screen is dust & fingerprint\ncatchy.  \nGood battery backup & no handing issues.  \nCamera good only for daylight.  \nI don't know why Samsung has removed its stock music player and gave google\nmusic player, which is just a crap.\n\n", "First day experience is good with good touch..but wait to see how long it\ncould satisfy me with its features and touch panel.now I have not inserted any\nsim card in to it.\n\n", "I have 3 on5 mobiles. First phone bought in Dec2015 so my experience for this\nphone awesome. So i bought anather 2 on5 pro phones for my family members.  \n  \nThis phones full fill all my requirements such as browsing,casual gaming,full\nday battery backup,4G support,decent camera etc.  \n  \nI can't see any type cons because it gives me more features with lower price.  \nIf u think to buy a phone under 8k then close u r eye's and go for it finally\nit's brand SAMSUNG.\n\n", "nice phone. features are enough for the budget and use of a normal man.\nperforms well. happy with spec\n\n", "ALL OVER PRODUCT IS FINE. ONLY 1 THING SEEMS STRANGE TO ME THAT THE BATTERY\nCASE IS DIFFERENT FROM OTHER SAMSUNG MOBILES,I.E THE INNER PLACE IS PLASTIC\nCOATED AND THERE IS AIR IN BUILD TO IT.\n\n", "Since from the use of 5 months, I did not faced any problem from this phone.\nThe only disadvantage from this phone is IN-BUILT applications consumes more\nthan 1GB ram. it has only 2GB RAM.\n\n", "The phone is really good. It has nice battery life, performance is\nsatisfactory and camera quality is decent. Overall, good value for money.\n\n", "Pretty good product. Good smart phone in this price range, liking it. But very\nvery less sound quality, calls are hardly audible, need to close the second\near to listen to the other person.\n\n", "samsung smartphone is best smartphone brand ever becoz i received my galaxy\non5 pro today from amazon and i m happy for that device was awesome runs\nsmoothly no lacking no problem in device camera, processor,ram, screen was\ntotally amazing and best thing in device was new Android mashmellow was\nupdated and device is perfect for that people who find lowest price android\nsmartphone and i m really suggest that people was go for this......thanks to\namazon for fast delivery to me...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 11 March 2018", "on 15 October 2017", "on 13 October 2017", "on 3 September 2017", "on 13 August 2017", "on 2 November 2016", "on 12 August 2017", "on 13 December 2017", "on 8 December 2017", "on 12 October 2017"], "reviewer": ["Bharath", "Kitto", "Ayandip sar", "Shiv Patil", "Er.John.", "PRITAM DAS", "balaji", "A M", "sushma", "MD.ZABIR"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Not for gaming", "THIS IS BEST PHONE FOR ALL PEOPLE BECAUSE CHEAPER RATE", "Too many unnessary preloaded apps affects speed", "Good Product. Got this set six months back and ...", "Worst, don't buy it", "Satisfied", "Handset is good but charger cable length is very short", "Very poor product", "Good for calling and net purpose", "Very good phone."], "review": ["Every thing perfect except gaming...  \nAt this price point\n\n", "THIS IS BEST PHONE FOR ALL PEOPLE BECAUSE CHEAPER RATE, 16GB INTERNAL MEMORY,\nGOOD BRAND, GOOD CAMERA QUALITY, NO HANG PROBLEM, WORK VERY SMOOTHLY .  \n  \nI REFER TO ALL BUY THIS PRODUCT WITHOUT ANY DECISION\n\n", "Too many preloaded apps, which are unnecessary and would be never used, occupy\ntoo much internal memory.This is affecting the speed of the response. Only\nSamsung knows the motive of such act. Sound is very low.\n\n", "Good Product. Got this set six months back and since then I did not see any\nproblem with the phone. Voice quality, Image quality battery backup are all\ngood.\n\n", "Worst, don't buy it. I ordered my phone on 24th September and within 7 days it\nstopped working properly, touch as bad, and phone and manufacturing defect. I\nasked for replacement and again the same problem with the second phone. Now\nAmazon says they cannot give me the new phone at 6.5k and they are asking me\nto buy it with additional 1k of my own. This is ridiculous. This is unfair\ntrade practice\n\n", "I am a normal user.Satisfied with product.all the functions working well after\nthree days.  \nI found corp image of bill in the box. Sending you photo of that. So please\nsend me full details bill by mail order any other way.\n\n", "Handset is good but charger cable length is very short, problem create during\nthe charge,  \nTherefore sumsang company manufactures long length charger cable.  \nThanks\n\n", "The product is under service. First up all the speaker is not working and\napproach the nearest service center they won't accept it and referred to an\nanother service center which is far away. We approach the service center they\nhave accepted and will take at least one week to examine it. The quality is\npoor, poor battery and poor service options in Chennai like Metropolitan City.\n\n", "Got it for 6000, and excellent for a phone sold at such price but not worth\n7000 as it is being sold now as camera quality is below average and storage\ncapacity is low. Not good for gaming\n\n", "Very good phone...From a well known brand...Good display , good battery, good\nprocessor, overall it is a very good package at Rs.7490...Thanks to Samsung\nand Amazon..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 September 2017", "on 21 December 2017", "on 27 October 2017", "on 1 August 2017", "on 22 October 2017", "on 18 January 2018", "on 3 August 2017", "on 25 October 2017", "on 28 December 2017", "on 13 September 2017"], "reviewer": ["Subhakalyan", "DEEPAK", "BRCR", "Amazon Customer", "Ramesh Joshi", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Pankaj", "jayakumar"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Just One Thing - Smasung Phone", "Good budget phone", "Phone has good User Interface", "I ordered same product last month which was far better than this recent one", "About on5 pro mobile.", "Redmi 4 is far better. Don't go with an Euphoria of buying branded ...", "Worth buying if your budget is below 8k", "Got defective product", "Lack of ram to use touch and processor slow battery ...", "Good specifications Best phone under budget"], "review": ["Good Specifications + Good Service\n\n", "Good budget phone. Almost like a stock android phone with very less bloat\nware. Did find a small lag in the touch sometimes. Good for basic operations.\nCamera - ok, thats all.\n\n", "After using 10 days of the phone, find below my review:  \n  \nPros:  \nPhone has good User Interface.  \nScreen resolution is good.  \nSmart sensor  \nBigger Screen size  \n  \nCons  \nBattery is very poor (after 30% battery, the phone suddenly gets switched off,\nalthough complained it to Samsung Service centre)  \nCharging time is very lengthy.\n\n", "Touch response doesn't meet expectations from Samsung. Phone Started hanging a\nbit in just couple of days of purchasing. I ordered same product last month\nwhich was far better than this recent one. Camera quality of 8 MP doesn't seem\nto be of exact 8 MP. It's like of those 5MP hardly.\n\n", "Camera is worst and speed is ok and battery backup is awesome sound and mobile\nnetwork & signal is so bad if one sim is 4g then other will be support only 2g\nbut mentioned both sim support is 4g that correct but these conditions are\nhidden by samsung that is so worst.\n\n", "Redmi 4 is far better. Don't go with an Euphoria of buying branded product it\nwas made in China. We have lot of fecilities like finger print sensor,\n4000+battery etc., in other China phones. Buy only if it is below 6000 then\nonly it is worth\n\n", "Brilliant phone below 10k  \nSamsungs phones are known for its quality.  \nBetter than other phones for sure.  \nDecent spects  \nGood for day to day primary device  \nAnd surprising long battery life :)\n\n", "I got defective product, microphone is not working, speaker is not working.  \nPlease don't sell defective product on Amazon.  \nAnd amazon has very long and bogus method to check smartphone is working\nproperly or not.\n\n", "Lack of ram to use  \ntouch and processor slow  \nbattery decent  \ndisplay ok  \nslightly heated  \nall about in this range average product  \nI bought this product at 6999/-\n\n", "Good specifications  \nBest phone under budget, best for network,best for storing data,easy access to\ninternet,best media quality,charger is good , headphones are also good , not\nhave any complaint about this product ,you can gifted this phone to any one in\nyour family or anyone else , best part it provide 4G network...from my size it\nis good phone to you under budget...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 August 2017", "on 25 October 2017", "on 25 October 2017", "on 19 August 2017", "on 26 November 2017", "on 22 October 2017", "on 12 August 2017", "on 27 September 2017", "on 22 August 2017", "on 3 March 2018"], "reviewer": ["Om Prakash", "Rajesh V", "Samrat", "Sudhanshu", "Rajesh Kumar Parida", "Rama subramanyeswara rao Gurazala", "Sumo", "Vikash Gupta", "PRASENJIT SHAW", "Anjali"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Its A good phone from samsung", "Best mobile from Samsung in budget phone segment", "Screen mirroring to TV and Remote Control with Teamviewer works great.", "AWESOME MOBILE. I love this product", "Good value and product", "Mobile is not working, for every minute it's restarting ...", "This handset from Samsung is very good as per around 4 months approx use I can ...", "Best Budget Phone to Buy Which fits Your Budget", "not good not bad", "Good phone under 7000 budget for average daily usage"], "review": ["Gifted To My Sister . And She Loved It . Its A good phone from samsung and its\nbeen one year i didnt faced any problem. It has got 2gb ram and 16 gb internal\nstorage which is enough . Also i got android nougat update too. Overall a good\npurchase\n\n", "Best mobile from Samsung in budget range. Best because  \n1) You will get android 7.1.1 version with this device, currently no mobile\nphone from Samsung is running on this OS compared to same price tag.  \n2) You will get Samsung experience version 8.5 which is provided by Samsung\nfor high end devices.  \n3) Other specifications are also better than same price range mobile phones in\nJ series.  \n4) Using from more than 1 year and faced no issue, so if you are planning to\nbuy a stable initial/entry level device then it is best choice.\n\n", "All the positive things everyone said so far...  \nplus  \n\\+ Google Chromecast + Screen mirroring to TV works even though Home app says\n\"may not be supported\"  \n\\+ Teamviewer Host + Remote Control works perfectly  \n+\n\n", "AWESOME MOBILE. I love this product. I am giving this review used mobile after\n1 week. I bought this product for 6,590/- on Diwali offer along with the cash\nback offer 500. So total my investment (6000/-) only. Now it's available for\n7,590/-. As per price i am very satisfied with this mobile and also i am\ngetting 5\" screen with 2GB ram. The touch and and performance is very good.\nJust camera also good but we need to take photos in the good lighting\ncondition. Front camera also ok. Only minor thing is the charging. The battery\ncapacity (2600 mah) is ok but try to avoid un necessary games, more apps to\nsave the battery. Remaining all is perfect. SEE ONE THING I WANT TO STRONGLY\nSHARE IT'S VERY VALUE FOR OUR MONEY. THANKS TO AMAZON.\n\n", "Good value and product , but screen is susceptible to breakage on normal fall\non hard floor. SO do not use it without a screen guard.\n\n", "Mobile is not working, for every minute it's restarting.  \nI bought last week and oust started using it.  \nDisappointing product from Amazon,  \nEven the customer care also, they are least bother.  \nIam very much disappointed\n\n", "This handset from Samsung is very good as per around 4 months approx use I can\nsay it's better to go for Samsung rather than going for any other Chinese\ncompanies bcoz they give pathetic customer service... if you are a light user\nthan this one is for you if you are a heavy user like to play many apps than\ntry to go for other mobile of Samsung which have more RAM\n\n", "Nice Delivery service and shipping by Amazon.  \nProduct I got From Amazon with a good deal.  \n1.Nice Display  \n2.Good Battery life  \n3.User friendly  \n4.Impressed with Camera  \n5.Ease to use\n\n", "AFTER USING FOR FEW DAYS, OBSERVED EARPHONE DISTUBED IN MIC THOUGH CHANGED BY\nSERVICE CENTER. BUT IF LOOK AT PHONE SOFTWARE IT USED TO BE HANGED BEFORE\nSOFTWARE UPGRADE AND AFTER UPGRADE TOUCH CALIBER MISS SOME TIME.\n\n", "Good phone for day to day use. Currently running on Android 7(downloaded the\nupdate).  \nAntutu benchmark says medium level gaming had played few games no problem\ndetected so far.  \nMobile is light weight the back panel is made of some kind of light material\n(plastic).  \nBoth the cameras are ok.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 February 2018", "on 22 February 2018", "on 27 August 2017", "on 26 October 2017", "on 13 November 2017", "on 3 September 2017", "on 12 February 2018", "on 6 December 2017", "on 22 September 2017", "on 25 January 2018"], "reviewer": ["Gaurav", "kaushlendra", "Nikhil Mathew", "Saleem Shaik", "Rajeev Pandey", "Nageswara rao VV", "saurabh pareek", "Swarup kumar mall", "SK AFTAB ALAM", "Akash Chaudhary"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Terrible phone", "Awesome phone with exceptional battery life", "Great phone! Given the price", "One Star", "Two Stars", "fabulous", "Good product, but it has some con's just like ...", "Three Stars", "Phone is good but getting heated very fast", "This phone is very good pbone this price and performance is good and battery ..."], "review": ["The touch is pathetic and inaccurate. Just bought the phone anticipating top\nnotch quality from Samsung. But it's just a branded brick. Not recommended at\nall.\n\n", "Awesome phone with exceptional battery life. I have a Redmi Note 3 and the On5\npro battery life surprised me even after it has half the battery capacity of\nRedmi. This phone is highly recommended for an alternative for Redmi.\n\n", "Great phone!  \nGiven the price.. Great hardware... good software...  \nlooks and feels premium especially due to the leather back cover..  \nSamsung is a great brand when it comes to warranty and service.  \nAlthough I recommend you guys use tempered screen protector with this handset\n\n", "Speaker's are very poor in quality.\n\n", "Video call is not good\n\n", "Samsung galaxy on5 pro is the one of best product in 16gb 2gb variant. this\nproduct is value of money. amazon delivered this product very fast.\n\n", "Good product, but it has some con's just like  \n''weak camera in night, low intensity flashlight, fast draining battery ,\nearphone does not work properly at radio application.''  \nIt lags sometimes in multitasking and takes large RAM area. Hence MEMORY\nMANAGEMENT is not good ,  \nIts loud speaker is not loud it is average.  \nBut it is good, decent, satisfactory phone under RS. 6000.00\n\n", "Phone is awesome it's a budget phone with a good Configuration & the camera\nquality also good battery backup is nice ...\n\n", "Phone is good but getting heated very fast. I've been using Galaxy J5 for 2\nyears and it would never get heated while using even long.but this phone is\nnot in the very few mins of a call\n\n", "This phone is very good pbone this price and performance is good and battery\nbackup is really superb good camera quality are very very good no hanging\nproblem this phone\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 September 2017", "on 23 September 2017", "on 17 November 2017", "on 10 September 2017", "on 27 July 2017", "on 18 August 2017", "on 18 October 2017", "on 13 October 2017", "on 18 August 2017", "on 23 September 2017"], "reviewer": ["raunakroy", "Augustine Joseph", "Shreejith Nair", "Rahul", "Amazon Customer", "Abhishek Tiwari", "dipax", "Amit Bhandari", "Sowmya", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Its a brilliant phone, except its Camera", "Great phone under Rs", "I AM HAPPY...... :D", "Excellent Product for the price", "Good one.", "value for money if usage us minimal", "GOOD MOBILE", "Good", "Good..", "Thanks Samsung & thanks Amazon"], "review": ["Its a brilliant phone, except its Camera, but still....  \nSpecs are good...  \nI got 500 cashbackk so technically phone is on same price with 4A.  \n  \nPros-  \nProcessor and RAM are working as expected.  \nNo heating issues.  \nNo hanging issues (Not used as pro. Gamer, but for Normal operations)  \nDual SIM with Dedicated Memory Card Slot (No hybrid bull****).  \n  \nCons-  \nBattery backup is small. (But battery is not draining much on standby.)  \nCharger is 5V 1A. (Should be 2A for fast charging).  \n  \nOverall, build quality is better than China.\n\n", "Great phone under Rs.10000. I got my phone around 6 months before through\namazon. Good battery back-up. Smooth performance with multitasking. No lags\ntill now. I am not a full time gamer. But i could run games such as sniper\nassassin smoothly without any lag. No heating problems till now. It would be\ngreat to have a slight improvement over the camera and build quality. I would\nrecommend this to anyone who wishes to buy a smartphone under Rs.10000.  \nI have had this for 6Samsung On5 Pro (Gold) months or so now. and last week my\nbattery started getting fat. but no problems. now it just shut downs at 20\npercent or 30 percent. and reboots.\n\n", "Its an excellent phone. And the price is soooooooo in-budget... I am really\nhappy...  \nAlthough a little sluggish, but within this price all the features are\nsooooooo great.... I am HAPPY....... :D\n\n", "Excellent budget product from Samsung. I gifted it to my father and he loved\nit. Reasonable internal memory (16GB) and RAM (2GB). Camera quality is average\noverall but can be called good for the price point. Struggles to take good\npictures without flash in poor lighting conditions. Otherwise very good.\nOverall a good budget smartphone.\n\n", "Gifted it to my Father in Law and he finds the features simple and easy to\nuse. A basic smartphone appropriate for anyone looking in this budget range.\n\n", "One of the best budget phone with good build quality and lasting battery. Good\nfor basic use. not meant for gaming and photography and editing purpose. 4\nstar just bcuz samsung doesnt provide updates . or else it would have been\ngreat phone\n\n", "For the price, it's a good mobile. The touch screen is slightly slow to\nresponse. Rest it's good. Using it for over three months now.\n\n", "Got this mobile for my dad.. Look wise the mobile was good. But I feel in\nperformance wise it is bit slow when compared to other samsung products.\n\n", "Good.....but not value for money  \n....  \n  \nAlmost every sensor is missing  \n  \nBut having after sale support offcourse during the warranty period after then\nthey charged a lot\n\n", "Development is still going on, excellent software, security patches every\nmonth.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 October 2017", "on 27 September 2017", "on 21 November 2017", "on 13 November 2017", "on 9 September 2017", "on 15 August 2017", "on 29 January 2018", "on 19 September 2017", "on 12 December 2017", "on 20 July 2017"], "reviewer": ["Amazon Customer", "ashish", "Neeloy", "Ananda Vardhan Chagamreddy", "Durga Sunil", "MH12", "S Chatterjee", "Nivedhitha G", "THE HONEST", "Amazon Customer"]}
]