[
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["ByAmazon Customeron 22 August 2017 It's one of worst phone.", "Beware my s7 edge got damaged", "I have been using it for 3 days till now ...", "It's a very good mobile but Samsung use lower grade Processer (Exynos 8895 ...", "It is very bad i returned this item immediately and I am thinking ..."], "review": ["ByAmazon Customeron 22 August 2017  \nIt's one of worst phone... Don't Invest too much of money...  \n1.It doesn't give much battery life... Hardly half a day it dries out.  \n2 .single SPEAKER is worst...you can't listen the songs  \n3.phone contacts list is MERGING or overlapping with the different names with\ndiffrent numbers.. One of the worst part.\n\n", "Beware my s7 edge got finerprint damaged and display lines are there. Lagging\nand hanging. 2nd class product\n\n", "I have been using it for 3 days till now and it started lagging down ...The\nbattery drains up very fast....Thinking of replacing it with an upcoming\niPhone 8 ❤️❤️😍😍😍...Suckssss 🖕🏻🖕🏻👎🏻👎🏻👎🏻\n\n", "It's a very good mobile but Samsung use lower grade Processer (Exynos 8895\nProcessor) its really very bad thing\n\n", "It is very bad i returned this item immediately and I am thinking to buy\niPhone 8 much better than this\n\n"], "verification": [], "date": ["on 22 August 2017", "on 1 December 2017", "on 23 August 2017", "on 17 August 2017", "on 13 August 2017"], "reviewer": ["Shivappa Bangalore", "Thee boyyy", "Rongkim", "jay", "Wasim"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["I Like samsung", "Best phone just on paper", "Go for i phone", "Five Stars", "Five Stars", "It has an amazing design.", "Value for money", "One Star", "Meet the 4 hour battery life Phone....", "Three Stars"], "review": ["It's a really good phone\n\n", "Best phone just on paper. In reality it sucks. Phone started lagging just\nafter a month. iPhone 6s is far better than this if display is not an issue.\nThe one good thing about the phone‘s camera Is awesome. Three stars only for\ncamera\n\n", "Awsome phone. But once u purchase this phone, u dont need to keep press at\nhome coz this phone becomes iron hot after few minutes of video call.\n\n", "Great product\n\n", "Gr8 phone\n\n", "It has an amazing design....camera.....nd display.....bjt its performance is\npoor....battery drains out quickly....hangs a lot....heats up while\ncharging....i am not satisfied with samsung.....the s7 edge is better then\nthis....or else opt for an iphone 7 plus or any iphone\n\n", "Great Phone, love it\n\n", "original price Rs.53,900\n\n", "After spending around 50K I managed to get a revolutionary phone of which\nbattery last for just 4 to 5 hours.  \nPhone heats up like an Iron without much apps being loaded in the same.  \nNo doubt why iphone beats the same easily.  \nIn spite of being the flagship phone the company has not decided to give its\nAndroid 8.0 Oreo update.  \nPlanning to root the phone even if its voids the warranty.\n\n", "Doesn't charge with regular charger  \nNo separate slot for memory card\n\n"], "verification": [], "date": ["on 11 August 2017", "on 22 October 2017", "on 19 October 2017", "on 13 August 2017", "on 13 September 2017", "on 18 December 2017", "on 17 August 2017", "on 10 December 2017", "on 14 October 2017", "on 13 January 2018"], "reviewer": ["Ashwani", "Anand R Naik", "Amazon Customer", "Amazon Customer", "Sanjeev K.", "Romil s.", "Shrey", "Amazon Customer", "Adil Ahsan Shaikh", "Caroline Samuel"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Five Stars", "So far so good and overall phone is good and value for money", "Outstanding phones - s8, s8+ and Note8 - take your pick.", "The design is pretty good and stylish", "Technically the most beautiful phone I 've ever seen.", "The Next Gen Heavenly Smartphone !", "Fantabulous hats off to this device", "Gorgeous phone with good perfomance", "BEAUTY AND THE BEAST", "It's beautiful phone and amazing experience"], "review": ["Better than iPhone X  \nBetter performance\n\n", "Two weeks over. So far so good and overall phone is good and value for money.  \n  \nJust disable lot of software which comes pre-installed with S8. Battery is\nlasting more than 15 plus hours with charge once a day and which looks good\nand hope it will continue to perform like that over a course of time in\nfuture. Keep you all posted.  \n  \nI have a put a case to protect the phone as it is delicate in case it falls\ndown. Not sure what to put to protect the screen, if anyone has good\nsuggestion then please share.\n\n", "To be truthful, based on professional reviews, I discarded this tall, narrow\nphone with an awkwardly placed fingerprint scanner and a smaller battery than\nS7 edge, a phone I found inconvenient and sold off in a month. So, it was\niPhone 8, but all the hype evaporated when it was unveiled. So it was back to\nscouting around. I shortlisted OP5, Nokia 8 and S8. As S8 had been in the\nmarket for 2 months I went to a nearby store, handled it and asked for\nfeedback. I was cautious - S8, S8+ and Note 8 looked too good to be true.\nReluctantly I ruled out the larger ones, as the are not handy for those\nwithout jackets most times.  \n  \nStill, it was the last day of an offer, better than Amazon, so I bought S8 for\n49.9k with 12 interest free EMIs and a screen replacement. My preferred color\ngold wasnt available, but I liked the black too, so went ahead.  \n  \nOther reviews have already covered the tech elements, so let me share my user\nexperience of 1 month, that made me fall in love with this phone - easily the\nbest phone I've owned after iPhone4.  \n  \nI use my phone primarily for communication (calls, SMS, WA, SM and utility\napps}, though I do entertain myself on trips, waiting time with videos, high\nend games etc. I havent and dont think I'll enjoy a 2 hr movie on phone. (Must\nadmit I'm watching longer videos more frequently on s8 though)  \n  \nThis phone worked beautifully out of the box - calls, music, videos, GPS\npositioning, mobile network - everything is fast and flawless. No need to\nfiddle with settings, no lagging, heating, hunting for charger all day. I've\nstarted using My galaxy assistant and now Bixby, and I like the look, feel and\nnon intrusive convenience. BTW, I love that its actually easier to hold than\n5.5 in phones, fast charging, battery life, the photo quality and the\nheadphones. On top of that, both colors of the phone look classy. So, I guess\nI'm really saying whats not to like?  \n  \nI hate changing phones and shifting data, which Samsung Switch made short work\nof.  \n  \nIf S8 has any drawback, its the super intrusive google, but thats ubiquitous\n:-(. If only this phone was on IOS, it would be perfection.  \n  \nSome nitpicks that you should know :-  \n(1) hard to find quality tempered glass and cover, which is a must as this\nphone is glass on both sides. The samsung original one is gimmicky and the one\nsalesman was using looked scruffy, so I didnt pay 3000 for it, but bought a\nexpensive 3rd party flip cover (picture enclosed) Not ideal but it doesnt look\nhideous.  \n(2) It comes with a small USB-C to micro-USB adapter, but I just bought an\nextra cable for office, and its all good. Thankfully, Samsung retained the 3.5\nmm headphone jack.  \n(3) Only a hybrid slot. But thats all new phones and iphone doesnt even have\neither, so this is much better.  \n  \nIf Samsung folks are listening, please - SIM cards and memory cards are NOT\ninterchangeable, they do different things, so please be a trendbreaker and\nbring back a separate memory card on S8S oops S9.  \n  \nHope this helped you decide. Good luck with your decision.\n\n", "The design is pretty good and stylish.\n\n", "When i saw it for the 1st time, fell in love with it and made my mind that\nthis is the one i was looking after using HTC One M8 for 3 long years. If want\nsomething different then this will impress you badly.  \nSo finally made the purchase and got it for 40k bucks as my wife is working\nwith samsung so got some employees discount.  \nAfter using for couple of weeks this phone is fast (no lag at all) , easily\nholdable, and midnight black is just beautiful.  \nCamera is aweaome, screen is one of the most refined, speaker is\naverage(compared with HTC m8) , overall built is great.  \n  \nThree cheers for Samsung !!  \nThanks :)\n\n", "The best android out here by samsung ,first of all the design is eye catchy\nand surely makes you go head over your heels , many companies are making bezel\nless displays but samsung has nailed it ,the screen feels like liquid and\nmesmerizes you with WQHD display , the camera is top notch and is a treat to\nclick pictures , the phone works like godspeed and isnt sloppy at all . Buy\nthis and you wont be disappointed !\n\n", "Its an amazing phone. I ws using apple since last 6 years and i was really\nscared in switchin to android n samsung. I had already ordered iphonr 8 n then\ni cancelled that for S8. But trust me guys buying S8 was the bestst decision.\nIts fsntabulous phonee lovly appearance no lag awesome.camera and the best\namazon. Go fof it guyss its worth every single penny. I have added some of my\ncapture pics from this device itz amazing. I am using iphone since lst 6 years\nbut switching from iphonw to S8 my best decision.  \nONE MONTH is over n till now not even a single time it got stuck anywhere.  \nHats of the seller too. Very good keep up the good work.\n\n", "THE LOOKS IT MAKES TO GET LOVE WITH IT ALL GOOD I GET 1 DAY BACKUP WITH HEAVY\nUSAGE.  \nONLY ISSUE IS THST IN PAPER IT IS 4GB RAM ONLY EVEN THOUGH GETTING GOOD\nPERFORMANCE THAN MY PNE PLUS 8GB RAM VARIANT.  \nOVERALL GOOD ONE ONLY ISSUE OS THE PRICE ANYWAY IT IS FAR FAR BETTER IF\nCOMPARED IPHONE FOR MORE THAN THIS PROCE AND NTHING NEW FEATURES\n\n", "Undoubtedly the best phone in the game\n\n", "I am writing genuine review. The phone is revolutionary and it has stunned the\ncompetitors, no doubt about that. Iphone had to release iPhone X just to stay\nin competition. This time Samsung has played its part very well.  \n  \nI love the phone as I switched from iPhone. Android gives you more liberty. I\nwas able to transfer my contact, photos etc. from iPhone without any hassle,\nsmooth transfer.  \nProcessing, Battery life and charging are good to amazing.  \nDisplay is just beyond anything available. Compare it with IPhone.  \nWater resistant phone.  \n  \nThere are few improvements which can be done:-  \n1\\. Speakers can be made better.  \n2\\. Screen is susceptible to break so you need to invest on screen guard and\ncover if you really want to save it.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 February 2018", "on 5 February 2018", "on 5 October 2017", "on 1 February 2018", "on 15 September 2017", "on 28 October 2017", "on 24 January 2018", "on 21 October 2017", "on 9 September 2017", "on 16 October 2017"], "reviewer": ["Amazon Customer", "Biju Vasudevan", "Manoj K", "Amazon Customer", "Daleesh Singh", "Raghav Kamalia", "Abhishek", "Ajay", "venkatesh pragada", "Dev Shri"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["The Piper, the trend setter. True definition of bezelless.", "Best Android of 2017", "Holding and using it in one hand is very comfortable. Display", "Samsung Galaxy S8 Awesome Phone", "Wow !!!!!", "Best in Galaxy S series", "Five Stars", "Best phone ever", "Amazing display and camera with no lag or overheating", "burnt my fingers buying this product..."], "review": ["its an evolution. the design is trend setting, rival companies trying hard to\nget the curvy 18:9 right. Yes the battery is not for heavy user but its better\nthan note 8 though. True bezelless with heavy touchwiz features. Careful with\nthe drops though, it got glass on its back.\n\n", "Using this beautiful device for the past 2 weeks amid am writing this review\nfrom the phone only. It's a splendid machine. Screen, speed overall feel is\npremium and fantastic. Was using HTC M8 eye for the past 2.5 years and this\nbeat is a perfect replacement.  \nPros:  \nGreat looking  \nScreen is one of the bests, if not the best  \nPerformance is top quality, no lags at all  \nBattery back up is quite good. With 2 sims and always 4g mode, normal gaming\nand an hour of calls, battery lasts for more than a day  \nUI is quite simple  \n  \nCons:  \nSpeaker quality is no match to HTC s  \nGetting quality screen guard is very difficult  \nExpensive  \nSamsung galaxy s normally slows down over time, let's wait and watch for this\nbeauty\n\n", "Not sure if it justifies the price tag, but ignore that bit and the phone\nsatisfies you immensely. Holding and using it in one hand is very comfortable.\nDisplay, battery backup and other basics are all up to what you expect from\nthe flagship S series. Knowing that it is the gadget of choice for most tech\nYouTubers and bloggers also helps. The Orchid grey colour I own is the best\nfollowed by black and then blue. Not using any cover or screen guard but\nthinking of ordering a two piece cover given its fragility. The Gorilla glass\nisn't invincible since I have caught minor scratches already and my friend\neven broke it on the edge by dropping it once. Free screen replacements should\ncome handy, though I'm wary of replaced screens after a pathetic experience\nwith Mi. Note 8 is way too large and expensive for me to be comfortable with.\nIphone X would've been a good choice had it been launched when I bought this.  \nOf all the things, the only gripe is the very average 4gb ram. Regardless of\nwhether it'll come in use or not, its premium price tag begs at least 6gb of\nram to keep up a fair game. In fact, I had my Gallery force close quite some\ntime and apps getting stuck in between too. All that could've been saved by\nupgrading the ram.\n\n", "Hello, friends if you want to buy good built quality and sexy phone then\nSamsung Galaxy S8 perfect for you. If you want to know the sound quality of\nthis phone so for me, it is very good, Because It provides very sharp and\nhigh-quality audio. I bought this phone with 4 GB RAM and 64 GB internal\nmemory. You can store the large amount of data like movies, videos and also\naudios without inserting any SD card but can insert up to 256 GB SD card. S8\nhas Quad HD+ Display made with SUPER AMOLED glass which I love and It\nprotected by Corning Gorilla Glass 5. Its display size is 5.8 inch. It also\nhas Exynos 8895 Octa Chipset and 12 MP primary camera and 8 MP front camera.\nThis phone comes with Android 7.0 Nougat software version. Because It's huge\nand giant display I like to see high-quality movies and it's feeling amazing.\nIf I talk about the camera so the camera is very good both rear and front.\nThis phone comes with 3500 MAH Li-ion battery so you can say for this giant\ndisplay this battery is not good. But after my usage battery performance is so\nmuch good. The lightweight and beautifully slim design make this phone very\nunique and stylish compared to other phones available on the market. But I\ndon't like one thing of this phone that it's fingerprint sensor placement. But\nsensor quality is good and It has Iris Scanner which I don't use in my regular\nusage. If I talk about service and support so I didn't face any problem with\nthis phone. And the last thing I should say for me It is value for money\nproduct.  \nI bought this phone and using for one month then only am giving my review.  \nThankyou\n\n", "This phone is epic. Everything on the phone is too good perfect. I have been\nusing this for 2 months now and loving it every bit.\n\n", "\n\n", "Best camera phone ever.\n\n", "Amazing phone for its price range...You get hell lot of features with which\nyou can play with... Amazing size brilliant handling and all these miracles\ncan be only seen in Samsun phones..iris works perfectly in the sunlight as\nwell.Dont listen to the crap that people tell you.....Go for it\n\n", "I have been using it for almost 5 months now very beautifully built the camera\nand display are amazing and there is no overheating or lag in the phone truly\na flagship device worth every penny\n\n", "one of the worst phones you can possess. absolutely not durable ,,, nothing in\nthis phone can substantiate its price, The curved screen is more of a\nliability. there is no guaranty for screen replacement and i have had to pay\n14000 to replace my screen within a week of buying it, there is no screen\nguard available even with Samsung that protects the scree,  \nSamsung is making its money on the screen by ensuring that  \n1\\. the screen is fragile  \n2, there is no guard available in the market  \n3\\. the case for the phone makes it difficult for us to use the side screen\nthat they say is their USP  \n4\\. other sites are offering a much better discount (10000 )on the phone along\nwith screen protection  \nv v v disappointing is my experience.\n\n"], "verification": ["Verified Purchase"], "date": ["on 8 December 2017", "on 22 October 2017", "on 22 November 2017", "on 3 December 2017", "on 31 October 2017", "on 25 November 2017", "on 20 September 2017", "on 5 October 2017", "on 27 November 2017", "on 23 February 2018"], "reviewer": ["SithLordReviews", "DD", "Shubhendu P.", "Sairam", "Customer ", "Deepam", "I M R A N", "Ebrahim", "hassan", "rajesh"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Great product", "Five Stars", "Am writing this review just to let all u know that it's an amazing phone.", "Five Stars", "Five Stars", "Five Stars", "DONT THINK TOO MUCH N GO FOR IT....U WONT REGRET.....!!!", "Five Stars", "A perfect mobile to rule the smartphone industry", "About Processor"], "review": ["Hello Guys  \nReally its a best phone till now i have seen on my life  \nI has a wonderful look bezel less display  \n4gb of ram , Edge screen,fingerprint and the new iris scanner\n\n", "Awesome phone\n\n", "I am using this phone but I did buy it from local store.. Am writing this\nreview just to let all u know that it's an amazing phone.. When u hold it, it\nfeels if u r holding a paper with some painting on it... It's a wonderful\nphone with amazon features.. Yes it's costly but..... U will stand out of the\ncrowd when u own it... I personally love this phone  \nTapaswini\n\n", "Lower price\n\n", "Absolutely stunning gorgeoud. It makes u feel special.\n\n", "Best\n\n", "Although i have not purchase S8 from amazon rather i bought it from local\nsamsung store for Rs. 55k.  \nNo doubt it is the new sexy..eye catching and great feeling while holding it\nin hand. Best screen in the smartphone industry, awesome camera and not a\nsingle lag in performance.  \nThe edge feature is very useful and whatever the people says about battery is\ngarbage. It last for whole day with heavy usage.  \nThe best part of this phone is their is NO HEATING ISSUE at all.  \nIf u r waiting for iphone 8(X)..pls dont bcoz it will be for more than 90k in\nindia.  \nSamsung has already sold 20 million S8 worldwide till now and it was the\nhighest selling smartphone in Quater 2nd 2017.  \nIf u have enough budget- dont give a second thought & go for it....  \nCheers.\n\n", "Ultimate phone.. got at rs 45900\n\n", "I am using galaxy s8 from 15th May 2017.. Some pros and cons...  \nPros  \n1\\. Big screen in such a compact size... Only Samsung can do this.. Just hold\ns8 in ur hand than u will realise how compact it is..  \n2\\. Best qhd Amoled screen  \n3\\. Fingerprint reader is very quick and I love the placement of\nfingerprint.... Its easy to use in s8 but difficult in s8+  \n4\\. Iris scanner... Its best security feature of s8  \n5\\. Camera.... Samsung is king in camera department of smartphones...Best\nresult in daylight and night... In night no smartphone camera comes near to s8  \n6\\. Speaker are loud and clear  \n7\\. UI is mostly stock with samsung flavour... Its buttery smooth..  \n8\\. Battery life is good. It gives me around 5 hr screen on time with Always\non display..  \n9\\. Charging time... It took 90hr to fully charge the mobile... Its not\nfastest but fast enough  \n  \nThere are two cons...  \n1\\. Iris scanner not work in sunlight... It works perfectly in indoor and dark\nsituation but in outdoor with bright light it fails..  \n2\\. Wireless Charging... Its very slow... It takes 2hr40min to completely\ncharge the mobile.  \n  \nSo guys s8 is king of 2017...Just go for it☺️👌👍\n\n", "Frnds dot be confused EXYNOS version which is sold in india is Better than\nSnapdragon version .  \nIt Also Gives More benchmarks than snapdragon one\n\n"], "verification": [], "date": ["on 29 October 2017", "on 21 September 2017", "on 8 December 2017", "on 18 September 2017", "on 10 November 2017", "on 5 December 2017", "on 11 September 2017", "on 9 December 2017", "on 19 August 2017", "on 29 August 2017"], "reviewer": ["Sayaan alam", "Amazon Customer", "Tapaswini", "shubhamingole", "raj kumar bairwa", "Amazon Customer", "CHIRAG JAIN", "yogesh", "mitra", "Amazon Customer"]}
]