[
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Five Stars", "Speed is low, but OK at this Price", "It works", "No 1 can Beat !t", "Sandisk is sans any issues.", "Reliably fast...", "Affordable Pendrive and not an amazing build quality", "Heating issue rest is nothing special", "sandisk 16 gb pendrive review", "An amazing Value for money product"], "review": ["Good product\n\n", "Pros:  \n1\\. A Value for money. Best pendrive at this cost.  \n2\\. Performance is good- as expected within this rate.  \n3\\. A Trusted & Safe storage device for files by Sandisk- there is minimum\nchance of device malfunction and losing your data.  \n4\\. I have been using this for more than 3 years and its still giving Good\nperformance. So, its very Long-lasting.  \n5\\. Delivery by Amazon was very good- delivered on-time and very well packed.  \n  \nCons:  \n1\\. Slow data transfer speed- 25 mbps export & 4 mbps import ( it's bit low,\nbut OK within this budget)  \n  \nSandisk is one of the most Trusted & Popular companies for storage devices in\nthe world. This product by them is also Good. I was fully satisfied with this\npendrive at this low price. You can undoubtedly go for this device within this\nBudget.  \nIf you like this review please give a Helpful vote...it helps.\n\n", "THE GOOD: Reliable brand, acceptable read speeds averaging at 32MB/s\n(considering it's USB2), stability check passes with no errors (see attached\nscreenshot), have another 8GB cruzerblade that's been used for like 2 whole\nyears and it still performs as new- hope this will turn out to be as durable.  \n  \nTHE BAD: Slow write speed. The device writes at 4 to 6 MB/s maximum (using a\nWindows 10 laptop with i7 5500U CPU, Nvidia GTX 940M GPU, and 16GB RAM, with\nthe drive plugged in a USB 3 port). The drive tends to heat up during\noperation which my older cruzerblade doesn't. The older 8GB cruzerblade stays\ncool even when used constantly for moving data (hours at a time), but this new\ndrive heats up within 10 minutes of ANY read/write operation using the same\npair of computers. The good news (I guess) is that I have an HP w220v flash\ndrive and that heats up as well- it's been heating up for like 4 years, and it\nstill works- heat will probably not damage the device (unless it's heating\nlike a stove,, which it isn't).  \n  \nTHE UGLY: The seller called me and asked me to cancel the order, claiming his\nwarehouse has burned down and if he cancels the order on his own he will be\n\"fined\" by Amazon for not fulfilling his commitment. This is very weird- I've\nbeen shopping online for years and no seller has ever called me up. I called\nAmazon to check, Amazon customer care asked me not to cancel the order. I did\nnot cancel and the product was eventually delivered (before promised date).\nThis was an unique incident, and the chances of this repeating with your order\nis infinitesimally small.  \n  \nUSABLE CAPACITY: 14.5 GB  \n  \nBOTTOM LINE: At this price, you cannot lose. Even if it goes bad, SanDisk is a\ngenuine brand and it comes with a 5 years warranty- you can always call up\nSanDisk and request assistance. Go for it.\n\n", "The speed is amazing and best in this class.  \n#Best in Price  \n#Best in Budget  \n#Compatible to all\n\n", "16Gb pen drive and I got it for 250 bucks during the Great India Sale. Sandisk\nis sans any issues so according to me it's the Best Buy if you do not wanna\nspend a lot and get maximum worth as well. Comes with a security option as\nwell so I don't think it can get any better..handy piece of tech and very very\ncompact as well.\n\n", "Sandisk the best in storage devices I feel..  \nThey offer a reasonable price for their product and also provides good\nlifetime of the pendrive.  \nI bought this product for my friend...I can blindly recommend this to any\nnormal user... It's writing speed is fast so does reading speed...Transfer\nrate is decent...  \nThis is me buying this product for the 3rd time...I grabbed it on a lighting\ndeal...  \nDelivery is super fast, it did delivered me before 24 hrs...  \n#One incident to share:  \nMy mum washed this pendrive not just once but twice...But to my amazement it\nreally worked super fine . THUMPSUP to SANDISK👍  \nI thank Amazon for super fast delivery...Nice work...\n\n", "Sand disk is known for affordable pendrives and this is just an example of\nthat.  \nThe build quality SUCKS to be honest but that's what you get when you pay\nsomuch for a 16 gigs storage.  \nSand disk pendrives are known to break at the insertion tip and hence wouldn't\nrecommend this is you are looking for a pendrive with a good build quality.\nThe read write speeds are on par with the standards of USB 3.0 and may change\nbased on the type of file being copied.\n\n", "Bought it during sale but paid pretty much the same amount as i would have\nwithout the sale.  \nNext coming to the product  \n1\\. works no issues there,  \n2\\. read and write speeds are as they should be - Never expect the highest\nspeeds that are written as that depends on may other factors,  \n3\\. the drive itself is extremely tight at this point maybe it will loosen up\nafter constant use. This is not a bad or good thing for me personally its a\nbit of a nuisance to have to pull it with force  \n4\\. the only CON i found was heating - It heats up regardless of the size of\ndata transfer. I transfer a 56kb image it heats up, i transfer 400 mb it heats\nup.  \n  \nDo not know if this is gonna cause issues in the future because this is the\nfirst flash drive that has heating issues that i have used.  \nIf i had an infra red camera i would should you in pictures but i don't have\nthat.\n\n", "This is the sandisk pendrive 16 gb variant And i am a user of sandisk from a\nlong time.  \n  \nThe products are cheap,easy to use and are durable.  \nThis pendrive has a good copying or transfering speed and i am again happyto\nuse it.  \n  \nAnd above it the amazon shipmemt is also awesome.i got my product on time\nwithout any distraction or any faulty things.  \n  \nYou shop shop with amazon as it is a trustworthy site and i am amazonian now.\n\n", "I bought this Pendrive from Amazon seller-Appario Retail Private Ltd and got\nthis within 3 days. This product was packed compactly as expected from Amazon.  \nNow we only have to talk about product -  \nWriting speed 4-5MBPS  \nReading speed 15-18MBPS  \nIt's writing speed(from PC to Pendrive) is only 4MBPS that's really bad as\ncompare to SanDisk Cruzer Blade 8Gb it gives writing speed somewhere 9-10MBPS.  \nWhile Reading speed has almost no difference in 8GB and 16GB SanDisk Cruzer\nBlade Pendrive.  \n  \nBut if we compare price of 8gb and 16gb Pendrive there only 50-60 rupees\ndifference. you get double of storage at just 50-60 rupees. 16GB Pendrive is\nbetter buy if we compare price and Value 4 money\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 February 2018", "on 3 February 2018", "on 6 March 2018", "on 4 December 2017", "on 25 October 2016", "on 1 November 2017", "on 10 February 2018", "on 16 August 2017", "on 9 January 2018", "on 19 September 2017"], "reviewer": ["Iqbal Afzal", "Top 5 Originals", "oxymoron", "#pRem...", "RatedR", "Srinivas nayak", "Adarsh Hatwar", "Avik", "Rutvik", "Vivek Muskan"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Time tested.", "Works well", "Best for this Budget! Surely I say..", "its a good product...", "Use it nicely, with caution.", "Good storage device", "Value for money", "Phadu deal at 279 inr", "Received a fake product", "One plus born froud company"], "review": ["Your standard Sandisk falsh drive at USB 2.0 speeds. Trustworthy and durable.\nThe lack of a cap is a boon and a bane. One less thing to loose but at the\ncost of leaving the USB plug unprotected, Time tested product. Go for it if\nyou don't want any risk and are looking for a cheap yet reliable flash drive.\n\n", "I've used this for several weeks now on a variety of computers, and it works\nfine. It's quite small and convenient to use and carry.\n\n", "Hello Buyers,  \nBefore going to this review, I try my best to give my review for this product\n. I buy this pendrive before 10 days. I really enjoy with this pendrive at\nthis price range. As this is a usb 2.0 (DDR3 SD)pendrive it transfers file\nupto the speed of 40-50 Mbps in my pc. This is quite good for usb 2.0 pendrive\nparticullary with this price range. Also speaking with its built quality i\ndropped 5 or 6 times at a height of around 50 ft but this pendrive works for\nme perfectly without any scratches. I feel good to recommmend this pendrive\nfor all peoples. You also feels happy with this pendrive performance.. Hope\nthis review is helpful, If you find this helpful hit the helpful button too!  \n  \nBuy AT : SanDisk Cruzer Blade SDCZ50-016G-135 16GB USB 2.0 Pen Drive\n\n", "Hello guys  \nThe product is very good i like the quality and packing is primiume  \nPros- 1.bulid quality is very good it made with hard plastic  \n2\\. its is very small so everyone can carry it  \n  \nCons-its say 16 gb but u will only get 14 gb  \nOveral the product is good you can buy it.IF THIS REVIEW HELP U PLZ CLICK THE\nHELPFUL BUTTON  \n  \nTHANKYOU\n\n", "This is 2.0 pen-drive and performs in a typical way. Nothing so great but a\nsmall & handy thing for our digital storage. After using it for so many\nmonths, the sides of the USB which goes inside the PC (or any device) breaks\nand we find it hard (jammed) while inserting or ejecting it.  \nI used a scissor to remove that broken plastic which got folded inside and now\nI'm using it without any problems.\n\n", "Good storage device. Already one using since more than 3 years. Need second\none. Hence, now, I bought it again for second time. The inbuilt security\nsoftware is not working with windows10-64bit. Else, rest is fine.\n\n", "Using this product for more than a month. The design is very good. Even though\nits plastic and has low weight its durable for fair use. The read/write speed\nalso complies with the transfer speed supposed to have for a usb 2.0 spec.\nConsidering the prize this product can be freely bought and used.\n\n", "Hi all ,  \nWantes to get something cheap as laptop was giving problems so needed a cheap\npendrive for bootable os purpose and i got this sandisk pensrive at 279 in\nlightening deal. Its working super awesome according to my purpose easy to\nplug and use .  \n  \nPros - best for low purpose use as well as having data stored in a portable\nplace .  \nEasy to carry anywhere.  \n  \nCons -speed is little slow as it is old model but it is a great buy\nconsidering price of 279 and 16gb and fullfills multipurpose .  \n  \nColashooter\n\n", "I received this product more than a month back and since that time I never\ntried to insert the data more than 5gb. Yesterday when I was loading the data\nabout 10Gb, only 7GB was inserted and after that I was getting an error like\nno size left on device however total size was showing something around 14. Gb.\n\n", "Never trust this Chinese brand. Wold's worst service provider. Born fraud\ncompany. I regrets like anything. They kill people in Africa , not having E -\nwaste policy till d noate. Repairing cost is 32k of the mobile which cost is\n28k. Born cheater. Hate like anythink. You snatch my hard earn money. You\nrobber. They make profit in mobile spare parts. They charged 18k for screen\nwhich is easily brakeble , even if you put your phone in Jeans pocket. This\nproduct is design to dump. #SayNoToOnePlus\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 October 2016", "on 30 November 2017", "on 27 January 2017", "on 23 June 2016", "on 7 November 2017", "on 3 September 2017", "on 17 November 2017", "on 25 February 2017", "on 22 September 2017", "on 28 September 2016"], "reviewer": ["Ajay A P", "Abhijit Menon-Sen", "Aravind Naveen", "Gandharv Gautam", "Aasit Sable", "V. SARMA", "Daredevil", "UMANG NEGANDHI", "Akshay M.", "Dhrudip Thakkar"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Good Product, Pen drive is metallic one so some ...", "Cruze blend", "Good Pendrive", "It is simple and good if you are not looking for military grade encryption", "Pen drive not working..  data on the usb for first time. In second time, i was copying some setup error. Dont buy Sandisk usb", "best device. even though I dropped it in tub ...", "Genuine 16GB pendrive", "It does not deserve 1 start as well", "The common for the Commons!!", "Nice tiny delicate pendrive"], "review": ["Good Product, Pen drive is metallic one so some time you will get light shock\n,and it's 2.0 pen drive it will take 3 - 4 mb/s to transfer files from system\nto it.but we will get a better storage at a reasonable price\n\n", "Cruze blend\n\n", "I was formatting and installing xp on my old laptop with pen drive. I have\ntried every brand trancesnd, hp and other but none of them worked so I started\nreading the blogs about it then I came to know that Sandisk works great when\nyou need to istall OS with usb drive.  \n  \nSo I would say it is a great pendrive.  \nPros: Fast data transfer, attractive price (thanks to amazon) I bought it in\n485 bucks  \nCons: No Cap and plastic body.\n\n", "The brand name says it all. A tiny piece can hold 16 Gb. The secure software\ncomes bundled. It is simple and good if you are not looking for military grade\nencryption.\n\n", "Allowed to copy data on the usb for first time. In second time, i was copying\nsome setup file to move it across systems and the sandisk pen drive turned\nwrite-protected all of a sudden. Now i hv a 16 gb pen drive which cannot be\nformatted. I cant delete or add anymore data. Anything i try to do, it just\nkeeps giving disk is write protected error. Dont buy Sandisk usb if u want to\nreuse it.\n\n", "best device. even though I dropped it in tub of water several times and mom\nwashed it with clothes along times...still it works and Data transfer speed\nhaven't decreased till now\n\n", "Got it from cloudtail india @249, checked the pendrive originality with\nRMpreusb quick size test and with h2testw which proved pen drive size of\n14922MB, read speed 4mbps and write 27Mbps on FAT32, for improving speed u can\nformat it as NTFS, use Fastcopy software(with buffer more than or =\n1023Mb,depends on your RAM) default is 64Kb. BOOM! Big files are copied in few\nseconds or minutes. Package was made in Malaysia, and 16GB pen drives are\nnever 16GB, it is approx 14.5 or 14.8GB, same logic goes for 32 or 8Gb, plz\ndnt post misleading reviews.\n\n", "Worst Product , Worked for a single day, I moved most important data to the\npen drive, and next day i found its not working. not detecting.  \nCannot give it for replace bcoz i might get new device, but will lose the data\nfor ever.  \nWondering how to make it detectable.\n\n", "Its the most common year phone that we see almost in everybody's hand. It\nserve the normal purpose of storage...give Tye decent copying speed of 2.0.\nThis the second one of the same kind I'm buying and this is for my car music\nplayer.\n\n", "Pen drive is as usual comes from sandisk products  \nHas the total of 14 point something gigabytes capacity  \nSpeed id roughly 5 to 16 mbps  \nI specially bought for the car musicplayer  \nBecause of its tiny size  \nBeware of plastic material that used in this pendrive easily broakable..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 17 November 2017", "on 19 August 2017", "on 20 April 2014", "on 22 February 2018", "on 16 February 2018", "on 26 January 2018", "on 15 October 2016", "on 14 August 2017", "on 11 May 2017", "on 29 October 2017"], "reviewer": ["Amazon Customer", "Mahesh Lathiya", "Tarun Dhobi", "N. Raghavendran", "Amazon Customer", "john paul", "Aniket", "Franky Dsouza", "Sandeep", "King BLZ"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Four Stars", "Worst pendrive ever!", "FAKE... FAKE... FAKE", "Go for it. Price is to High.", "Three Stars", "Look for \" Moserbaer Zap\" pen drive, It's like credit card and carry in your wallet", "Tiny and tough", "A good pen drive from sandisk.", "Slow transfer speeds..", "Works Exactly for what it was meant ..."], "review": ["There is only one problem that its head gets cracked and then its of no use.\n\n", "There was a problem in opening the disk. It always showed some error whenver I\ntried to open it. Not at all recommend. The replacement pendrive was also very\nbad. Go for Transcend or Kingston pendrives.\n\n", "Don't buy FAKE... FAKE... FAKE. Yes this is fake pendrive, although the\ngraphics are real, quality is not good and when taken on hand it doesn't feel\nreal.  \nBUT i am not relying in my gut feeling, i can tell it's fake because my pc\nmotherboard only boots from sandisk or adata pendrives(it's a defect...) and\nthe mb didn't recognizsd it and hence it's a FAKE PRIDUCT. DON'T BUY.  \nAltgough the pendrive is working fine and storung data, but i can't boot from\nit.\n\n", "Go for it.product is Good. Pricing is High. Pricing should be reduce.\nOtherwise it easy to use. Comact. It fits in u r pocket.\n\n", "The speed drops drastically if you are doing a bit heavy file transfer. Also\nheats up a lot\n\n", "Excellent delivery..as expected..as I'm in Bangalore.  \nThe speeds are as usual USB 2.0 speeds.  \nCompact and easy to carry.  \nBut I'll prefer metal cased pen drives and pocket pen drives.  \nYou can search for \" Moserbaer Zap\" pendrive which is easy to carry in your\nwallet.\n\n", "I just got this product just a few hours ago and I must say its really small,\nyet rugged. It is so small that if you are not careful enough to slide a\nlanyard around it, you are likely to lose it. My primary purpose of buying the\nflash drive is to play music on my TV and the bundled encryption software was\ninitially a hassle. There was an easy remedy - just place the files outside\nthe encryption vault and you are good.  \n  \nI decided to buy this on Amazon after I compared price of this product on\nFlipkart. It was around Rs 50 cheaper on Amazon. Having experienced Flipkart's\nspeedy delivery service before, I wasn't sure if Amazon would be able to match\nit but I was willing to give it a try. And to my surprise, it reached me in\ntwo days(though it was estimated to arrive three days later). Thank you,\nAmazon. You saved me time and money:).\n\n", "Hi guys,  \nIts Eddy here, I have been using San Disk pen drives for a long time, San Disk\nCruzer Blade is a nice pen drive for anyone, have nice quality and its easy to\nhold not a slippery one. But I have to say the negatives also, the writings on\nthe back side of the drive will gone after 2 days so I\"m confused right now\nwhich is the one( I have lots of same model and colored Pen drives). It gives\nme 21mb/s of download speed and 7 mb/s of upload speed.  \nThank you.\n\n", "You get what you pay for... I suggest spending a extra 100 bucks or so to buy\na different product that will hv better transfer speed.. transfer speed is not\ngud in this model\n\n", "Since it is a 2.0 pendrive one can't expect the speed.. but really durable and\nworks perfectly, as I doubted for performance cause I brought it for a\ndiscount price I checked the device with several formatting of the drive. But\nI found no issues. Great one and better low speed device than others.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 26 December 2017", "on 28 September 2017", "on 5 November 2016", "on 9 May 2017", "on 27 April 2017", "on 13 October 2015", "on 4 April 2014", "on 15 November 2015", "on 21 February 2017", "on 25 July 2016"], "reviewer": ["Aakash Kumbhat", "Amazon Customer", "ThunderBell", "Amazon Customer", "SR", "Jagadeesh", "Shuttersight", "Eddy", "Pawan Agarwal", "Prem"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["its compact and has a good life. Never had a problem with this", "Its a very good product. I have buy it for only Rs ...", "amazing", "well product.........@artbindu", "nice product. never seen any problem", "Nice product", "Average performer cap less design", "The pendrive is really cool. It is a nice one", "i am happy", "USB drives of other manufacturers of relatively higher price are better. My personal opinion is - \"Try to avoid ..."], "review": ["nothing to write about. Its light, its compact and has a good life. Never had\na problem with this. Own more than 4 of this item.\n\n", "Its a very good product . I have buy it for only Rs 299 on Amazon great Indian\nsale.It is very good ,giving 14.58 GB writable space & the brand SANDISK of\ncourse have a great name in storage devices now a days. One of the most\nimportant thing is that it has a warranty of 5 years.Its writable speed is\nabout 7.5 mb/sec.\n\n", "oh love this pendrive. its very good, this pendrive supports otg in my phone.\nm really happy. It came in the evening on time. am so happy with this.\n\n", "wow nice beautiful product. get it in a beautiful moment i.e. in super deal.\nBut I think the price of this product (i.e. a 16 GB flash drive with USB 2.0\nPorts) is costly now in online. Few month ago I buy same product form Snapdeal\nonly in 315/-. But now I buy it in price 375/- also in Lighting Deal. How\nbuffo. But not a bad............\n\n", "nice product. never seen any problem. using from last 3-4 years.  \nOnly once while downloading torrent movie directly into pendrive in suse\nlinux, corrupted the pendrive(became readonly).  \nI have 3-4 pendrives from sanDisk, they are running fine from long time.\n\n", "Best product 5 year guarantee within 5 year some damage internally replacement\nof product but only one conditions if you have bill and on that pendrive never\nswip serial number\n\n", "Pen drive came is excellent condition thanks to Amazon. The pen drive is very\nsmall hence there is chance it might slip out from the pocket easily.  \nThe performance is not great the read write speed are way too slow compared to\nmy Sandisk usb 3.0 drive I lost. I think USB 2.0 limitation. It does not have\na cap so very sturdy robust design.\n\n", "The pendrive is really cool. It is a nice one. It reached me in safe\ncondition.  \nIt is working properly now.\n\n", "sandisk has always worked well and no problems at all. I have more than a\ndozen from 4Gb to 32Gb.\n\n", "These pen drives eventually get hotter even when used for a very short span.\n(Please check the official website of sandisk too for product review). USB\ndrives of other manufacturers of relatively higher price are better. My\npersonal opinion is - \"Try to avoid Sandisk Products.\"\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 September 2017", "on 25 January 2017", "on 6 October 2016", "on 27 April 2017", "on 14 March 2016", "on 9 March 2017", "on 4 July 2016", "on 10 March 2017", "on 21 May 2017", "on 22 May 2017"], "reviewer": ["Bimal", "Ankur Arora", "Azazeal", "@rtbindu", "Bidyapati", "Delta Corporation", "SaswataB", "aswini", "muralidhar", "Sagar Das"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Small, compact and stores a good amount of data", "Must buy. Best for regular usage.", "So I'm not satisfied. Steel pen drive is more advantageous than plastic ...", "Please support if you agree with the comment. Specifying Manufactured country and expiry date for the product necessary.", "The plastic is not strong", "SanDisk is perfect choice", "Great at this price from such a brand.", "Read Write Speed Is 4-5MB/sec only.", "It working fine after purchase of a month", "Good quality pen-drive delivered quickly and well packaged."], "review": ["Small, compact and stores a good amount of data. For its price its good enough\nto give to friends when you need exchange videos or movies as entire seasons\ncan fit in one of them\n\n", "I have attached it to my dish TV set top box.  \nGood product for rough and tough use. I suggest to buy who use pen drive on\ndaily basis.  \nBecause it stronger design. Cheaper cost.\n\n", "Made up of plastic. So I'm not satisfied. Steel pen drive is more advantageous\nthan plastic one. Already we bought a 4GB san drive which worked for some six\nmonths.  \nLater it's broken and was not loading. Felt sad that all files gone. You can\nbuy this , since good cost but handle properly.\n\n", "Three stars as it have heating issue and slow speed.. And I have already\nmention the detail issue regarding the pendrive in Sandisk ultra dual usb.. I\nforgot to add up few things in that is, It's working good and delivery was on\ntime.. You can go for it.. But product is made in Malaysia..  \nmade in Malaysia or any other country.. \"country manufactured or made in\" it\ntells the quality of the product. So please mention expiry date n made in\nwhich country, so that customer don't get fooled when they receive product in\nhand. Give an open option to the customer for best purchase from the Amazon...\n\n", "The front side of the product is very feeble or weak, it could break easily if\nnot handled with care.  \n  \nI like the product for it's reasonable cost, but i dislike it since it's front\nside has got a weak plastic.  \n  \nYes i can recommend to people who wants it for reasonable cost and who can\nhandle things with care.\n\n", "SanDisk pendrives are really awesome, i bought this a year back and still its\nworking fine... Though the material is plastic, but its shock proof, nd very\nlight weight, easily can carry anywhere... Never lost any data so far....\n\n", "I've been using the product since around 2 years. Got it here for 50 ₹ cheaper\nthan other websites. It is still good as new and I haven't faced any problems\nyet. Tiny and lightweight, go for it without any doubts.\n\n", "SanDisk Cruzer Blade SDCZ50-016G-135 16GB USB 2.0 Pen Drive  \n.  \nProduct is good. But read & write speed is too low as not accepted 4-5MB/s.\nDoesn't accept from sandisk. Totally disappoint me.\n\n", "It's working fine after purchase for a month . i installed Kali Linux and\nParrot Linux for live practicing and its working well without any problem or\ncrash.\n\n", "Very little to praise such a basic item. SanDisk pendrives are household\nbrands and mostly don't go wrong.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 September 2017", "on 19 October 2017", "on 17 August 2017", "on 29 April 2016", "on 9 April 2014", "on 20 October 2017", "on 20 March 2018", "on 20 January 2018", "on 25 February 2018", "on 1 June 2017"], "reviewer": ["Aditya Shanbhag", "ABHISHEK KANDARE", "Amazon Customer", "Viral Fever", "chandrasekar", "Saddam Hussain.S.A.", "Mohammad Jaffery", "Abhishek", "Rajesh Kumar Singh", "Rajveer"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Functional as described.", "Worthy purchase", "Slow speed for current OS versions but still reliable", "Works Great !! Review after 2 years.", "techie product", "Very Genuine Product", "Sandisk does the job!", "Rahul Pareek", "Awesome product at very effective price", "100% original product."], "review": ["Functional as described.  \nreasonable transfer speed. Depends on file sizes. Large files transfer at\nfaster MBPS, (due to disk management overheads).\n\n", "Cheap and easy to handle great customer service as well... Pendrive is great\nfor regular usage but is not a 3.0 so slower speeds. Transcend jetflash is\nfaster but more costly then this\n\n", "Quite delicate so need care to handle. Supports usb2.0 supported in age of\nwindows XP but much slower for windows 7 and onwards. Better go for usb\nsupporting higher version. However it's reliable with no connection issue and\ndetects fast.\n\n", "I purchased this 16GB on 21st August 2014 at the price of 370rs. It was the\ncheapest pendrive available at that time. I use this pendrive regularly for\ncopying movies, installing softwares and OS etc. I partitioned the drives for\ninstalling kali linux as live. And recovered the pendrive. So after these\nheavy usage also this works fine. It did't show me an error message till this\nday.  \n  \nSpeed :  \nI tested the speed of the pendrive in my Macbook pro and attached the\nscreenshot. It shows me 8mb/s for writing and 23mb/s for reading the data.\nIt's not bad. You will get 4-10mb/s as write speed.  \n  \nAt this cost this pendrive gives lot of advantages. You can buy without having\na second mind.  \nIf you want more speed than this,then you can go for USB 3.0 drives.\n\n", "I would like to tell you about the advantages of this product  \nIt is best as in price.  \nIt contains a Password Secure Software.  \nDisadvantages  \nvery small in size  \ncan be easily lost  \nstorage capacity is good\n\n", "Very Genuine Product  \n  \nI ran benchmark on it using Disks tool that comes with Ubuntu.  \n  \nResults were pretty good as you can see them in picture.  \n  \nAverage Reading Speed 33.0 MB/s & Average Writing Speed 13.1 MB/s  \n  \nI hope this will help you to trust this product even more.\n\n", "Well, the pendrive is good for its word plus its Sandisk so completely\nreliable. The pendrive itself is really tiny, more like a thumbdrive. My wife\nhad one earlier which got lost. So to ensure this one stays visible, I added a\nlittle chain to it and personalised it with a alpha sticker. A little DIY\ndoesnt harm, right :)  \n  \nSpeed of the pendrive is good. Its a class 4 drive, if i remember correct.\n\n", "I bought it when the price was 289 and what more can you get in rs.289? The\npendrive is working fine for the last 6 months and I've encountered absolutely\nno problems so far.  \n  \nPros:  \n  \nCheap  \nReliable  \nRelatively Fast  \n  \nCons:  \n  \nNo \"cap\" like kingston\n\n", "Love the performance of the SanDisk flash drives just awesome with any type of\nOS also provides five years replacement guarantee which have willing to buy it\ngo for it awesome product at effective cost don't compare with any other\ncompany because they won't provide replacement guarantees sandisk always\nrockzz\n\n", "I loved this pendrive.I got a 32GB variant from Reliance Digital and that was\nslower and also no proper branding and high rated price.  \nBut when I used this 16GB variant , I found a very large change/difference in\nterms of speed, branding, and also the price.  \nI totally love this product.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 September 2017", "on 15 November 2017", "on 9 January 2018", "on 26 August 2016", "on 2 October 2017", "on 6 December 2017", "on 18 June 2014", "on 26 September 2016", "on 10 November 2017", "on 22 September 2017"], "reviewer": ["A_T_Blr", "Shubham", "IndoGodX", "Raneesh Ravi", "vaishali chauhan", "Sam Daiya", "Renny V", "Rahul", "Ankur", "Amazon Customer"]},
{"rating": ["2.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["It's USB 2. 0. Already mentioned in description ...", "Not bad", "Average product at Good Cost", "One of the best", "Good", "Total capacity: 15,631,122,432 bytes; Bad customer care", "Go for it", "Good in the price range", "Amazing product", "Worth the 💰 price"], "review": ["It's USB 2.0. Already mentioned in description but I realized I was fool to\npurchase this in the world of USB 3.0, USB 3 pen drives are much faster than\nthis one.\n\n", "Speed low compared to usb 3.0 as usual\n\n", "Bought this second time.  \n* Good product for 1-2 years.  \n* My previous flash drive is not working after 2 years approx. (Showing not initialized on the disk management utility even after initializing the drive it is still hidden from My Computer window.  \n* Not able to replace it because product details are not visible on the back side of the drive.  \n* Must have to handle the cover comes with the drive or you'll not be able to replace it.\n\n", "I personally feel that this is one of the most economical and practical usb\npen drive online.  \nWas delivered on time in original packing\n\n", "Best pen drive compared to all available in the market.\n\n", "The flash drive I've received is having total capacity of 15,631,122,432 bytes\nas reported by Linux's \"fdisk -l\" command. I ran the test suite downloaded\nfrom usb.userbenchmark.com (ran it on Windows) and it gave my flash drive rank\n366 vs average rank 383 of SanDisk Cruzer Blade 16GB (\nhttp://usb.userbenchmark.com/SpeedTest/1349/SanDisk-Cruzer-Blade ). I'm having\nproblems with behavior of SanDisk customer care, they have wasted a lot of my\ntime and seems like they don't care.\n\n", "SanDisk has always been my first choice. They have never proved me wrong.\nSanDisk Blade is an indestructible product.\n\n", "Available space is 14.5 instead of 16 GB.It comes with San disk encryption\nsoftware with 15 MB space used.Plactic body build is ok but needs care in\nhandling.It can be broken if used rigorously.Overall ok in the price range\n\n", "Excellent pendrive in such a low price. Delivery of this product was fulfilled\nby AMAZON TRANSPORTATION SERVICES thats why i got it next day. Overall\nperformance of this pendrive is very good. But my one humble request to\nsandisk officals . That is to make a software that can repair any corrupted\nsandisk sd card or pendrive. For example strontium has its own software and\ntransend has also its own software for corrupted devices.\n\n", "Worth the price... For 370 rupees... It's totally worth it... Except for the\ntransfer speed cuz its 2.0...but compared to many other 16GB pendrive\"s which\nare expensive...i would surely suggest this one... Cuz all are just the\nsame... Except for the price..\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 6 September 2017", "on 26 October 2017", "on 30 May 2016", "on 25 May 2017", "on 24 July 2017", "on 15 September 2015", "on 6 September 2017", "on 21 August 2016", "on 5 April 2016", "on 1 February 2018"], "reviewer": ["Yogendrasinh", "The Verdict......@IND", "Prakhar Gupta", "Vikram Kapoor", "ENGINEER, SMART BUYER & YOUTUBER", "Mihir", "Sunny Issac", "Shobhit Gupta", "Mohd Raza Zaidi", "Rajavelu soundar raj"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["SANDISK CRUZER BLADE 16 GB PENDRIVE REVIEW", "its good for the price", "Not recommended if you are looking for best product", "Product is Good, Recommended.", "16 GB SanDisk Cruzer Blade - Value for Money", "Sandisk is the Gold Standard", "its the best. Quality and performance", "Wonderful product.", "Bang for the buck", "Good pen drive"], "review": ["HEY BEFORE WRITNG THE REVIEW LET ME TELL YOU ALL THAT I GOT THIS PRODUCT\nAROUND A WEEK AGO.SO THIS IS AN HONEST REVIEW.THIS PEN DRIVE SOLD BY CLOUDTAIL\nINDIA IS TOTALLY AMZING.THIS THING HAS A NICE AND SLEAK DESIGN AND YOU CAN USE\nIT FOR AROUND 6HOURS OF COMPLETE WORK.THIS THING IS ALSO AT A N AFFORDABLE\nPRICE,NOT TOO CHEAP NEITHER TOO EXPENSIVE.BUT IF YOU COMPARE IT WITH ALL OTHER\nPENDRIVES THIS ONE IS THE CHEAPEST AND IS BETTER THAN THEM ALL.  \n================================================================================================================IF\nYOU WANT TO BUY THIS PRODUCT I HAVE GIVEN THE LINK SO GO CHECK IT OUT.IF YOU\nARE STILL THINKING OF BUYING THIS PRODUCT OR NOT,THAN YOU ARE COMPLETELY\nWASTING YOUR TIME.GUYS GO FOR IT.IT WILL GIVE YOU A BETTER EXPERIENCE.  \n================================================================================================================ONE\nLAST THING,THIS PENDRIVE IS ALIKE OTHER PENDRIVES THAT GETS HOT AFTER A FEW\nUSE OF HOURS.THIS THING CAN BE USED FOR AROUND 6 HOURS WITHOUT ANY SUCH\nPROBLEMS.  \n================================================================================================================YOUR\nHONEST REVIEWER,  \nJAI\n\n", "nice and it has good speed\n\n", "Very bad experience, tested as soon as I received product today. I was copying\n4gb files around 200mb of files successful copied at average 10mbps speed and\nlater poped up error saying cannot copy as it's write protected. Not able to\nformat also..  \n  \nIt's getting to much hot within no time.\n\n", "The SanDisk Branded Cruzer Blade Pendrive.  \n  \nTHE GOOD  \n\\- Good Packaging  \n\\- Reach on Time as expected  \n\\- No quality issues after using for quite few months yet.  \n\\- Quite competitive price.  \n  \nTHE NOT SO GOOD  \n\\- No Warranty / Guarantee card included, not sure it would be any seller\nwould entertain with Amazon Invoice.  \n  \nP.S. I review products on amazon to help fellow customers in taking wise\ndecisions and try to ensure that everyone's hard earned money get its full\nworth. It always makes my day to know that people find my reviews helpful.\nFeel free to mail me for any queries,or leave a comment to know more about\nthis product I use.\n\n", "SanDisk Cruzer Blade 16 GB USB 2.0 Pen Drive: Value for Money  \n  \nAfter 2+ years of usage, I'm writing the review for it.  \n  \nGood product at this Price  \n  \nPros:  \n1) Really Value for money. Good pen drive at this cost.  \n2) Performance is good.  \n3) Pocket-friendly, weightless & small in size.  \n4) I have been using more than 2 years and its still working fine.  \n5) Comes with Sandisk Secure Access software inbuilt  \n6) A Trusted & Safe storage device. Sandisk is one of the most Trusted &\nPopular companies for storage devices in the world.  \n  \nCons:  \n1\\. Slow data transfer speed, but overall GOOD\n\n", "Have used sandisk for a long time and i can say this one won't disappoint\neither! Heated up a little more than usual during formatting once but now\nseems to work just fine...  \nEdit: Now that it has been 6 months, I thought maybe I should update my\nreview. Sandisk still works well but the heating is becoming an issue. Data\ntransfer for a couple of minutes and it starts to heat up. On the contrary, my\nfriend's HP pen drive works very cool and you won't even feel it's temperature\ndespite it have a metallic body. In conclusion, Sandisk is good but if you\nhave already had one I would prefer to look for other options and experiment a\nlittle to find my perfect pen drive\n\n", "REMEMBER : Its not 3.0 OR Class10  \nSo if you can compromise on speed, its the best.  \nQuality and performance : 100% SATISFACTION  \n  \n1\\. The very first day my mom put it in the washing machine along with my\npant.  \n2\\. I lost it on the road near my house. A week after that my friend found it\ncrushed by some vehicle, bathed in rain and mud.  \n  \nProudly Announcing STILL WORKING FINE\n\n", "I had a confusion after purchasing this product how many days it would work\nwithout any damage. I had been shocked after using four months by its\nwonderful service. Till date it is serving well. I like this product very\nmuch. Actually it is fulfilling all my demands without any damage.\n\n", "Works very good. Size is small enough to carry around in your palm easily,\nthough that same size allows you to easily lose it. Even though 16GB might\nlook small these days, it's still a modest size, not too small, not too\noverboard. I've had it for almost two years now, and haven't had any sorts of\nissues with it. I prefer this over my Kingston flash-drive which I have as\nwell.\n\n", "Does what it is supposed to do. Works well, isn't the fastest pen drive out\nthere, but then again you know what you are buying at this price point. And\nfrom that aspect this is damn good.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 August 2017", "on 22 October 2017", "on 1 January 2018", "on 20 February 2017", "on 16 February 2018", "on 18 August 2017", "on 9 July 2017", "on 6 March 2018", "on 10 January 2018", "on 22 September 2017"], "reviewer": ["jai", "Dave", "Rakesh", "Kush Patel", "Anand Singh", "Manish Sinha", "Arun Barua", "Arpan Ghosh", "Aman Harwara", "Smok3y"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Second purchase after 2 years of trouble-free usage", "Good pen drive. but for everyday use buy a USB 3.0 version ~Rs50 more", "GOOd at this COSt", "Great deal. To get deal notification", "It body is easily broken even when it is fallen on the floor.", "data files or using for OS recovery as bootable the perfect pen drive it is in all needs", "Its Good Product and value for the money I like it", "Good", "Bang for the buck", "Very good pen drive with high data transfer speed"], "review": ["I have been using a similar drive of 4GB capacity from last 2 years. The drive\nwas purchased for my office and its working absolutely fine with several\nwrites each day. I was using this drive to test the software developed for our\noffice product where I had to write huge amount of machine data every 1 hour.\nThe tests were done for almost 3 months. The drive is still working fine after\nso much of writes.  \n  \nThe plastic quality is bit cheap and the USB socket is prone to break quite\neasily as the corners of the plastic are very slim. All in all, if you use it\nwisely and does not get it crushed beneath heavy objects, it will work\nsuperbly.  \nRead and Write speeds are well for a normal day to day work. Nothing special\nin it, but its build to last electronically quite a few years.  \n  \nBeing a satisfied user of the 4GB version which was for office use, I ordered\na personal one of 16GB just recently because I had to consume the amount in my\nprepaid card.  \n  \nIf you are looking for simple, build to last (functionality wise), for day-to-\nday copy needs, normal size of data transfers, go for it.  \nIf you want metallic finish, robust build quality, or a large data transfer\nevery now and then, look for Kingston Drives. They are tough in structure, but\nR/W speeds are less compared to similarly priced products.\n\n", "the pen drive is ok.  \nits been reliable. but speed is slow for a 16gb pen drive.  \nmore than 8gb you should buy a USB 3.0 Pen Drive to get good speeds, unless\nits for archiving something important band you wont be writing to it again and\nagain.  \n  \nPS: I didnt know this before but i have observed that USB 3.0 drives function\nfaster even on USB 2.0 ports, so there IS an advantage even if you dont have\nUSB 3.0 port on your desktop/ laptop.\n\n", "Compact Design for Maximum Portability.  \nStore more with capacities up to 16gb 5-year limited warranty.  \nHigh-Capacity Drive Accommodates Your Favorite Media Files  \nSanDisk SecureAccess Software Protects Drive from Unauthorized Access  \nThe models are different because production is from different countries.\nOtherwise both are sandisk cruzer blade models.  \n  \nbut iTs sPeed is not that good..  \n  \nbt small..  \nIts good at this COST\n\n", "Great deal. To get deal notification, you may add to your wishlist and you\nwill be notified time amd time again when it goes under a lightning deal\n\n", "It is a good one speed wise. But this type of Pen drives have a major problem\n. Its body is prone to cracks quite easily. It may crack even when it is\ndropped on the floor from our hands. The part which we plug into the USB port\nis more easily broken and small pieces are fallen off so we cant plug it into\nthe port anymore. I bought two pendrives last month, one has already become\nuseless already. So never buy this type of Pendrives.Buy only the ones with\nmetal body.\n\n", "I look for reliable pen drive as frequent user I am... I count on it. It gives\nme less waiting time while copying or accessing data where I feel it is faster\nthan others.  \n  \nSo, SanDisk Cruzer 16GB is fast in speed and moreover provides encryption for\nfiles which works on Mac and Windows both whether keeping pics, mp3, videos,\ndata files or using for OS recovery as bootable the perfect pen drive it is in\nall needs... Thanks Amazon for cost saving deal and thanks for protecting via\nAmazon Fulfilled which I always look for.  \n  \nI recommend SanDisk Cruzer 16GB and I like ordering on Amazon always.\n\n", "Its Good Product and value for the money I like it. Packing was good .Perfect\nsize . Thanks To amazon and cloudtail\n\n", "You will not be dissatisfied with this product.It works well.It does the job\nwell.At this price is a mouth watering treat.I am happy.The speed is ok,No\nworries.The necessary softwares were provided by the vendor.A string to it\ncould have made it excellent.You are looking for a pendrive at his range\"this\nis it\".\n\n", "If you are searching for a pendrive for watching movies on your tv or your\nmobile via otg than this is the best pick for the price. The speeds are quite\ngood not the best but nice for daily use. It can be washed if it gets\ndirty..lol.  \nI got it washed by mistake as it was in my washing machine for 2 days.  \nAlso dide drop tests it is a good deal go for it.  \nIf the review is helpful than click the helpful button below.  \nThankyou.\n\n", "Superfast data transfer speed, compact design and easy to carry, and if the\nbrand name is Sandisk, you already know it would be good. :)\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 31 October 2016", "on 15 December 2014", "on 12 April 2016", "on 4 January 2018", "on 21 July 2015", "on 20 December 2014", "on 8 June 2017", "on 20 September 2015", "on 2 September 2016", "on 1 December 2017"], "reviewer": ["Gurpreet Singh", "vishal", "Saumili Mandal", "JRG", "J John", "leo", "Ankit Kumar", "Maya", "vinay", "Ashutosh Kushwaha"]}
]