[
{"rating": ["2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Its working fine now.", "It is easy to use", "BEST PORTABLE H", "However the packing was poor. The item was as described", "Digital Inventory", "Don't Buy... if you want to live tension free", "Excellent portable storage.", "Broke within 6 months", "5 star product", "Fantastic Harddisk"], "review": ["I got a defective piece so had to exchange it at seagate service center. Its\nworking fine now.\n\n", "I got this at the cost of 3999 from amazon.  \nIt is easy to use.  \nAppearence is not cool  \nOuter body is made of plastic... It compresses on  \nSlightly compressing  \nData speed transferring on 2.5 usb port is 100 to 125 mb per second.  \nStorage given is 938 gb  \nI am partially satisfied with this product.  \nWorking properly.. In good condition.  \nThanks amazon\n\n", "BEST PORTABLE H.D....GOT 3 YRS OF WARRANTY AS I REGISTERED ON SEAGATE... ONLY\nISSUE... PATHETIC PACKING.. DIDNT EXPECTED THIS BAD PACKING FROM AMAZON\n\n", "The Product was delivered within expected time)less than 24hrs from the time\nof order. However the packing was poor.  \n  \nThe item was as described. I had 2 unsuccessful attempts in registering the\nwarranty in seagate website. I was able to register successfully on 3rd\nattempt after I installed the seagate software and run the setup.exe file\ninside the HDD.  \n  \nI also got confirmation email from Seagate with serial number/prod number\nconfirming the successful registration.  \n  \nThe disk is very compact and I was able to copy 10gb in 12mins flat.\n\n", "Most effective storage gadget from a reputable brand gives immense relieve.  \nThe capacity is more than sufficient to accommodate all digital inventory,\nsafety  \nand securely. The compact looks add value to the product and can easily fit to\npocket.  \nGreat performance when it been activated, responsive with illumination sign.  \nA personal companion and essential tool to manage self, data and profession.\n\n", "Worst product by Seagate. For the first time i have bought Seagate hard disk.\nUsed WD and Transcend hard disks in past, but this one stopped working in just\n15 days. Called customer care, they are ready to replace the hard disk but\nsince they do not have data recovery centre in india so hard disk has to go to\nNetherlands and they can even charge 30-40,000 rupees for this.\n\n", "This review is for the new Backup Plus Slim 1TB. Amazon packing and delivery\nwas awesome. Received in time.  \n  \nThe drive is very small and justifies the slim name. The first think I did was\nto register the product at Seagate website by creating a new user account. I\nwas delighted to see that the drive has 3 year warranty upto 27 May 2020.  \nThe drive has 930GB free out of the box I with NTFS partition. Idid some file\ncopying and found an average write speed of 70MBps with large files often\npeeking at 99MBps. I didn't test the read speed.  \n  \nThe drive has no disk encryption which is a letdown.  \n  \nGo for this drive if you are looking for a good cute slim HDD.\n\n", "HDD started making beeping sound.  \nBought on 20th January 2017  \nHDD broke on 21 August 2017  \n  \nNow What is the warranty policy?\n\n", "Excellent product at a great price. It is very slim and looks awesome. Works\nfinely both in Windows and Mac. Got a valid Seagate India warranty and also\ngot 200GB of free Cloud storage for 2 years. Overall a nice experience with\nthis product. Its a really 5 star product.\n\n", "It's a Good Hard-disk at this price I got it at Rs.3700 and several things I\nwant to clarify the buyers  \n  \n1.The size is not exactly 1024 gb it's 931 gb  \n  \n2.The packaging was not so good ,but it is not damaged  \n  \n3.Copying speed is an average of 30 Mbps  \n  \n4.Warranty is 3 years and You have to register the product on Seagate website  \n  \nThank you team Amazon for this wonderful product\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 April 2017", "on 26 February 2018", "on 28 July 2016", "on 31 May 2016", "on 4 March 2018", "on 20 January 2018", "on 21 April 2017", "on 19 March 2017", "on 28 March 2016", "on 12 December 2017"], "reviewer": ["Amazon Customer", "Ajay kumar", "Amit", "Sathish Kumar", "Atanu Chatterjee", "Rajat Gupta", "baijuxavior", "Amit Parrikar", "Basab", "Praveen Panishetti"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Defective product delivered, Please check all when you receive the product immediately.", "Ultra Slim in look 😋😘", "Defective product", "Good Product from good brand", "Wrost", "Seems like hardware issue", "Do not buy it", "SEAGATE BACKUP PLUS SLIM I1 TB PORTABLE  EXTERNAL HD .....MY REVIEW.....", "Excellent Product", "*NEVER BUY THIS PRODUCT*"], "review": ["Delivered defective product, when i connected to my system, its not at all\ndetecting, and the Hard drive spin is making very noisy. nornally seagate is a\ngood company in manfacturing Hard drives. not sure without proper testing this\nproduct delivered.\n\n", "Best Hardisk must prefer this ....it give final 923gb to use... its slim\nHardisk so i like it..\n\n", "Ordered it a few days back and it didn't work from the first day itself. The\ndevice, after connecting to the laptop, made a weird clicking and beeping\nnoise for 2 mins. The light didn't glow and HD couldn't be recognized on the\nlaptop. Tried using on different laptops - windows and mac, as well as on\ndifferent usb ports - still no luck. Returned it the next day. Amazon was very\nhelpful in the return/refund process.  \nI had read some negative reviews about the HD but then since the positive out-\nweighted the negative, I went ahead with my purchase. The recent negative\nreviews about the product not working is true. Kindly be cautious before\nbuying.\n\n", "Its good. But now after a year, my harddisk is not opening when I connect to\nany laptop. I am worried all my valuable data should not be lost. Any\nsuggestion/help asap, will be appreciated. Thanks!\n\n", "Transferring speed 10MB sec\n\n", "My PC did not detect the product. The light indicator blinked once and then it\ndid not light up again. Seems like hardware issue.\n\n", "I got it and now it is not working. Not recognized by any computer simply\ncorrupted.  \nSeagate Do not have any simple way to replace it. We have pack it and send it\nto Chennai.  \nand No one bear responsibility if it lost during sending.  \nDo no buy it.\n\n", "I got my pack of Seagate 1 TB Back up plus HD yesterday from Amazon. Packing\nis well. The packet comes with HD+ 3.0 USB CABLE+Instruction Manual.HD\napperancewise is good & small in size. I connected HD through u.s.b 2.0 port\nvia my laptop & backup my 120 GB data within 3 hours & 45 minutes. I think\ndata transfer rate is acceptable with 2.0 usb port. The HD comes with usb 3.0\nport & cable. When using with usb 3.0, the rate of data transfer may be vary.\nThe HD comes with a usable space of 931 GB & utility software Seagate Dash\nBoard for Windows & Mac system. The utility software is useful one. A pop up\nwindow of for warranty registration will come & we can also see the time\nperiod of warranty.(Internet connection needed) Seagate will also giving an\nevaluation version of Seagate file recovery software with this .When comparing\nwith other HD, Seagate giving a vibration & noiseless operation.(Compared with\nmy Toshiba 500GB HD which one crashed recently) As a long time operation Hd\nbody not heating up too much. The body of HD is made up of plastic material &\nfinishing beauty is good also. Mean, overall performance of the HD is looking\nvery well now & acceptable data transfer speed is also. I hope and believe\nthis HD will give the return for the spended money. Overall we can give 98%\nmark for this HD.\n\n", "worth of money. I have got 200GB storage in onedrive cloud for two years &\nregistered product in seagate website it is genuine product. one thing which i\nmost like that the product date of manufacturing was one month before the\npurchase, v new and delivered with in two days. excellent experience, this HDD\nis very slim not heating looks great. highly recommended.\n\n", "Never buy this product .it works only 3 times.I go to Seagate care. then they\nreplace new product in 7 days. Then it works only one time.  \nNever buy a *CHINA PRODUCT*.YOU MUST HAVE A THIALAND PRODUCT.  \nAnd I prefer *WD ELEMENT* THIALAND PRODUCT.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 September 2017", "on 28 April 2017", "on 26 February 2018", "on 25 September 2017", "on 10 June 2017", "on 24 October 2017", "on 4 July 2017", "on 24 February 2015", "on 9 September 2016", "on 10 July 2017"], "reviewer": ["kondareddy", "Arpit Patel", "Priyanka", "Gaurav Dhoble", "Syed Anjilangadi Kerala", "Amazon Customer", "Roshan R Wakode", "BIJUVISWANATH", "SUBHASH KUMAR SINGH", "bharat p."]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Defective product", "It doesn't have any inbuilt password protection like wd passport hard drives", "One Star", "this seagate 1tb harddisk is very good product.", "Didnt even last 20 days.", "Worth Buying at Rs.3990/- GO FOR IT.", "Must Read before you buy", "Best service from Amazon and Seagate ......Satisfied as no issues as of now (with some past experience as I've 1 old 500Gb)", "A decent USB 3.0 external hard drive", "Seamless working with Linux"], "review": ["Delivery was one day before as mentioned ... so good delivery system, but\ncoming to the product, extremely disappointed, the HDD gave just 8-15 Mbps\ntransfer speed and moreover when I registered it on seagate website, it had an\nexpired warranty date \"Warranty Valid till 21/Apr/2016 \" even-though I bought\nit on 17/Jun/2016 instead of a 2 year warranty period,also it didn't have a\nlink of the 200GB Onedrive link as is mentioned.  \nI assume that the product was defective.\n\n", "No i want to put it password protected but i am unable to apply it. It doesn't\nhave any inbuilt password protection like wd passport hard drives.\n\n", "fake detail.... DON'T BUY...  \nI GOT ONLY 931 GB.. but in detail its written 1000 GB capacity..\n\n", "this seagate 1tb harddisk is very good product.. i dont know about other\nsellers but i bought it from CLOUDTAIL seller.  \nmy observations are...  \n1,delivery is very fast. i got with in one day and no delivery charges.  \n2\\. i bought it in devali offer sale. i got it fr 4100/-  \n3.before buying i saw many are complaining about warenty, registeration is not\nproper and it is not giving warenty for india as they got produt imported from\nsome other country. but i got it fron CLOUDTAIL seller. igot proper warenty\nregisteration. i got even 1 month extra warenty that is 3year 1month, upto nov\n2019. i bought it in oct 2016.  \n  \n4\\. i think the problem for others is some time when we first register for\nwarenty it shows invalid warrenty for this product (something like that). i\ntoo got same problem while registering. but if we go back and again submit\nwith same detials you will get warenty got successfully. you can try like this\nif facing registeration problem..  \n5.the only negative i observed is packing can be much more better, as these\nare elecrtronic products which needs safety  \n  \nOver all i satisfied with this product. everythig is fine. no heavy\nvibration,no excess heating etc.. thank you AMAZON, CLOUDTAIL(seller).\n\n", "I recieved this thing on 26 September 2017. In USB 2.0 it was really slow and\nhanged my computer several times (My computer works Fine when the Drive is not\nplugged in). And the Hard Disk didnt even last 20 days. Its corrupted now. Its\nmaking noises and not detected by my PC. Its light is not glowing. My data is\nlost. Now to recover my data i have to pay Seagate huge money. I am opting for\nwarranty replacement. I believed that Seagate was the best brand to choose,\nbut the Trust has been broken. Maine to iska Plastic cover bhi nai nikala tha\npiche ka. But after all its a Product of China and what do you expect from\nChinese products. Although I didnt expect that from Seagate.\n\n", "I ordered it on 31st December 2015 and it delivered on 5th Jan 2016 through\nATS. Price-3990/-. Packing was Awesome. I unboxed the 1TB HDD and connected it\nto my laptop. Firstly the driver installed. Available space 931 GB. When you\nhave to check the warranty simply click this link:-\nhttp://support.seagate.com/customer/en-US/warranty_validation.jsp and just put\nyour serial number and model number from the box. After submitting you'll see\nthat the warranty for 3 years has already been activated by the seller you\npurchased. Warranty has already been activated for 3 years from the date of\norder but the registration of the product you have to do yourself. To register\nyour 1TB HDD simply click this link:- https://myportal.seagate.com/consumer-\nidentity/product-reg/product-reg-base.jsp after you submit your details and\nthen you'll get a option for signup. Better option will be you do signup.\nAfter registering successfully, a THANK YOU windows opens and below it you'll\net a CLICK TO GET ADDITIONAL SPACE OF 200GB FROM ONEDRIVE MICROSOFT. Then you\nclick the link or if it is not opening you simply click this link:-\nhttps://preview.onedrive.com/seagate/en-\nUS?key=6bg7j0cpDdiNCdpow3oHzcahjSvKi3eYfsELKVK0PcjYuHwTd3oC5EIc0eINNu8GTEXE8BaA%2FOq7Q6LlvscHSXqFPN2376P4d77pIhF7YyHpGQtcGwIwVCytUS18W9kuKjYUUUrq0wNyV5PbAiMDeA%3D%3D\nif you already have a Onedrive account fine it's well and good otherwise you\nhave to signup after completing this process you have to accept the T&C of\nOnedrive. After signing in you'll see that 200GB has been added to your\naccount for 2 years. I got this on 5th Jan 2016 and I registered the product\nand signed up a Seagate account, after it I automatically got the 200GB in my\nOnedrive account. You can download Seagate Dashboard by clicking this link-\nhttp://www.seagate.com/in/en/services-software/apps/seagate-dashboard-\nsoftware/ for computer and mobile backups. This product is great go for it.\nThe new Seagate logo has been changed and I got the new logo product. If any\nfurther queries regarding warranty or registration of 1TB HDD, contact me at\nemail- abhinabapal@ymail.com\n\n", "I bought this Seagate hdd few days ago, after receiving it I found that the\nhdd has some issues.  \n1.the hdd automatically ejects itself though the cable is connected to my\nlaptop as well as to the hdd.  \n2\\. Seagate back up software sometimes cannot detect the hdd, and back up\nnever completes, getting stuck at certain percentage.  \n3\\. heats a lot during copying files.  \nThen I decided to run the 'seatools' program, which is a harddrive test\nprogram by Seagate. After running the test, my hdd failed the Short Drive Self\nTest. Thanks to Amazon return service, I returned the item and bought a WD my\npassport ultra. Which is working fine as of now.  \nNow here are few things to remember-  \n1\\. Seagate after sale service is not very good, WD offers pick up service,\nbut Seagate wants you to send the product to the service centre, WD replaces\nthe product within warranty, but Seagate repairs the defective product, which\nrequires more time.  \n2\\. Seagate recently bought Samsung's hdd division, therefore in most cases\nthere is a Samsung hdd inside a Seagate hdd casing. That means you are\nactually buying a Samsung harddrive. (you can check in YouTube).  \n3\\. I advice all of you to run the seatools test as soon as you get the\nHarddisk, if it fails any of the tests, then return the hdd.  \n4.two stars only for the looks, it has better looking than WD my passport.\n\n", "About Amazon (for 2nd purchase of HDD) :  \nPROS-  \n# Appreciate quick delivery (3rd day as promised) by Amazon.  \n# This is my 2nd HDD as I had return one before due to confusion in Part\nnumber mentioned on box and actual HDD (will explain you below).  \n# The refund by Amazon was very quick and I appreciate Amazon for their quick\nresponse without any hesitation. Amount was refunded in my account on the 3rd\nday of returning the Old HDD (which I ordered 1st time...a month before in\nJan'15). This is one of the reason I dare to order 2nd HDD again from Amazon.  \n# Amazon Customer care are very assistive.  \n  \nCONS-  \n# Packaging Quality has to be improved as I found the HDD box was wrapped in\nsimple hard board without any air cushions. 1 rating less only for this (or\nelse it stands for 5 stars)  \n  \nAbout Product:-  \n  \nPROS:  \n# A nice very light weight HDD i ever purchased (Blue Color).  \n# Used hardly yet, but found no heating after 45min of use. So I uess Seagate\nkeeps the quality standard.  \n# Make no noise and silent compare to one I have old 500GB of HDD that I\nbought 4 yrs before and is working fantastic.  \n  \nCONS:  \n# This is my 2nd HDD I ordered from Amazon within difference of a month. Blame\nto the confusion/difference of Part number printed on the HDD box and on\nactual HDD (though serial number was same). I returned it thinking this could\nbe some problem and I may get into trouble in case of warranty (though Seagate\nwebsite was showing the warranty of 3yrs based on part and serial number as on\nbox)  \n# Found the same for second ordered HDD also (Though serial number of HDD is\nsame, Part number mentioned on the Box and Actual HDD was different).  \n# I called Seagate to know this and they confirmed that they consider the\nwarranty based on serial number only and I need not to worry about part\nnumber.  \n# Hats Off to Seagate Customer care, that they even helped me to recover 3\nmonths of my warranty period as the product was shipped to Distributor 3\nmonths ago and I got it now in Feb'15.  \n  \nFinal Verdict :  \n# Appreciate Seagate's and Amazon's service quality.  \n# For Product, as of now looks cool without any issues, will repost in case of\nany issues that can help you.\n\n", "Seagate's Backup Plus = you may use the Seagate's backup software to\nautomatically backup your computer data to this hard drive on schedule basis.  \nSlim = it really is a slim ext. hard drive.  \n  \nApart from being a decent, slim, backup, external HDD, there are a few other\nthings that are worthy of mentioning about the device. It operates on your\nComputer's USB power with the help of a supplied, short USB 3.0 cable\n(backwards compatible); no other external power source needed. Despite\nextended periods of data transfer between a computer and the hard drive, the\nHDD wasn't very hot.  \n  \nThe 3 years limited warranty by Seagate is kind of a life saver, should the\ndevice malfunction. How effective their support / service is, only the ones\nwho contact them will know.  \n  \nData transfer rates are only bottlenecked by your computer's USB port /\ncontroller. This is a USB 3.0 device, and connecting it to one such port is\nwhat gives you the best performance; whatever it is capable of.  \n  \nUnfortunately, I haven't run a benchmark test on it to analyze its data\ntransfer speeds. I will update the same when I do it.  \n  \n\\---------------------------------------------------------------------------------------------------------------  \nUPDATE (20-Jan-2016)  \nIt has now been 10 months since I purchased this hard drive. A problem has\narisen and the problem is that the drive does not populate in the \"My\nComputer\" window in order to access the drive. The volume does not populate in\nthe device properties under \"Device Manager\" (on both, Windows XP Pro 32 bit\nand Windows 7 Ultimate x64). I have written about the same to Seagate support\nand I'm waiting for their response. I'm not sure if it is the fault of the USB\nport on the computer, or if it is actually the hard drive.  \n  \nI will update my review again in a few days to let you all know what happens.  \n  \nP.S. I was able to register my hard drive on Seagate's product registration\nsite. Although it displays a different model number during the registration,\nit did not reject the serial number.\n\n", "It works alright on USB 2.0. Got speed upto 27 MBps. I had to format the\ncontents to add my personal data and it works nice.  \n  \nNow it's partitioned into 2 500 GB partitions.  \n  \nI hope it doesn't die on me soon. Then this review is a waste.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 June 2016", "on 29 August 2017", "on 11 February 2017", "on 9 November 2016", "on 11 October 2017", "on 8 January 2016", "on 15 July 2016", "on 30 March 2015", "on 19 August 2015", "on 1 August 2016"], "reviewer": ["Shashank", "Arun Kumar", "Amazon Customer", "venkat vaduru", "Kaushal Kumar", "Abhinaba Pal", "smn", "Jay", "Avinash Krishnamurthy", "Subin Siby"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Slim, handy and useful", "0 the transfer rate is very good, it is very slim matte look totally it ...", "Great product & Great performance", "Five Stars", "Embarrassed....Product is good but can't say about the connector...", "I love this product", "Good One", "Five Stars", "Not working", "HDD is best"], "review": ["Useful product, you get 931gb available space.  \nSmall, fits into pocket and can be carried around easily.  \nHeats up a bit on prolonged use but I guess that won't be much of an issue.  \nHit \"Useful\" if you find helped you!\n\n", "I own this, I am using it for the past two months it is working very well it\nsupports USB 3.0 the transfer rate is very good, it is very slim matte look\ntotally it an awesome a small white light will glow whether it is connected\nnot it is very helpful.\n\n", "Seagate Backup Plus Slim 1TB Portable External Hard Drive with 200GB of Cloud\nStorage & Mobile Device Backup (Black)  \nHello Guys,  \nI'm using Seagate external hard drives since 2010. Generally I used 1,2 and 4\nTB external drives of seagate. I think seagate hard drives are most efficient\nand more reliable with compare to other external hard drives. This new arrival\nBackup Plus Slim is awesome, because size of the drives are very compact. so\nyou can easily carry your drives with you anywhere. So I think it is superb,\nIf you want to buy any external hard drives than please use Seagate drives.  \n  \nOther features like,  \n  \nHardware Platform- You can use this drives with your pc and mac also. The\nawesome thing of this drive is it will not need any software on your pc and\nmac for backup and stuff. so this thing i like most about it. So you can\ndirectly connect your hard drive through usb cable to pc or mac.  \n  \nHardware Interface- SuperSpeed USB 3.0 & USB 2.0 and they provide the 18 inch\nUSB cable.  \n  \nIf you are mac user than you can easily download the NTFS software from\nseagate website.  \n  \nThey also provide 200GB Cloud Storage with OneDrive for 2 years.  \n  \nWeight of this hard drive is around 222gm. So very light weight and more\nefficient.  \n  \nYou will also get 3 year manufacturer warranty from Seagate.  \n  \nThey also provide Seagate Mobile Backup. Requirements: iOS 7 or higher android\n2.3 or higher.  \n  \nPC Requirements: Mac OS X 10.7 or higher, Windows 7 or higher operating system  \n  \nSo. overall very good product. Thank you Seagate and I also thankful to Amazon\nfor great deals and effectively low price compare to market price.  \nThank You.\n\n", "Good\n\n", "I brought this product a year ago with the different logo(seagate had a\ndifferent logo earlier). No doubt about the product as it matches the\ntechnical description. It's really a good piece to keep with you as it's\nlightweght and not at all bulky....smaller size(you can put it in a shirts\npocket).  \n  \nBut here comes the embarrassing point...after using it for around 2 months\nit's connector cable got loosened. But it was working if you adjust a\nbit(which shouldn't be the case). After another 2-3 months it was very hard to\nget the device detect in my laptop or computer (may be the wire has something\nfault). And today morning just now it is not detecting at all which made me to\nreview the product. I've already tried several times to connect and it took my\nalmost 1 hour, yet not detecting the device. Now i don't know what to do.  \n  \nI can buy another connector to connect the HDD but the problem is i don't know\nexactly where is the problem (HDD port or the connector). Again if i am\nspending my 4.5k on a HDD (i got for this price) then i should get a connector\nwhich should work fine atleast 2-3 years (i still think problem is with the\nconnector but i am not sure). It seems that the connector's pin is a bit\nsmaller than port of the HDD since it does not fit at all. I hope seagate will\nkeep this in mind.  \n  \nNo issues with Amazon.  \nHowever Amazonis doing a great job. Looking forward to see new products and\noffers.\n\n", "Oh god! I love this product. Slim, sexy and lightweight it is. Talking about\nspeed, on an average you will get 60- 70 mbps. Sometimes it goes above 100\nmbps and sometimes it remains on 40 - 50 mbps. But overall it will be in range\nof 60-70 mbps. It also depends on your port and device. Talking about heat\nproblem after a long time of 1 - 2 hour of use it is getting little bit heated\nbut not that much. It's too less. Even the processing sound and vibration is\nnot too apparent. A must buy product if you are comparing it with other hard-\ndisks.\n\n", "Awesome  \nBest product to buy, working fine with a good speed rate\n\n", "\n\n", "I have bought this product 4 months back .  \nNow any computer is not detecting this harddisk and some beep sound is\noccuring . I have raised the complaint for replacement but still i will loose\nall my data\n\n", "HDD working good, slim and comfortable to carry\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 May 2017", "on 1 October 2017", "on 8 December 2016", "on 13 October 2017", "on 22 October 2016", "on 3 March 2017", "on 15 August 2017", "on 27 September 2017", "on 25 October 2017", "on 28 February 2018"], "reviewer": ["Vivek", "lakshmi Narasimha", "Mac Specialist", "Amazon Customer", "Pritesh", "Kumar Sanu", "Amazon Customer", "Kapil Joshi", "Amazon Customer", "PRADEEP Kumar kushwaha"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Please don't go for this product", "Faulty Device sold", "call seagate india for any problem", "Works for ps4 game save.", "Easily go for it", "Got few hours before...Satisfied with the product..", "Total waste of money", "DONOT buy Segate Hard Drives if you want your data SAFE.", "Failure model", "GOOD BUT NOT THE BEST....😁😁😁"], "review": ["Seagate Backup Plus Slim 1TB Portable External Hard Drive with Mobile Device\nBackup (Black) - Please don't go for this product, really not worth. At first\ntime itself, the device was not detected. I have struggled with Accel\nfrontline for warranty claim to get new hard disk because there is no direct\nservice centers for seagate. Again the new hard disk which I got from warranty\nclaim also not working fine. At first time it is detected, from the second\ntime it was not working.\n\n", "I am an NRI resident abroad. After a long research I selected this slim\nportable external hard drive to back up my data. The WD external hard drive I\nam using is only 250 GB and became full , so I decided to go for this 1TB\ndevice. With much enthusiasm, I purchased this product and brought it through\nmy wife travelling after two weeks of its purchase. Three days , i tried this\ndevice to get it worked in different systems, different USB ports but all in\nvein. The period for its return also expired in the meantime. I am so\ndisappointed with such a faulty device.\n\n", "Contact : 0008004401392 language : english no hindi they will ask you about\nyour problem and then if you want to replace the hard disk they will ask you\nyour serial number which you can see at the bootom side of your hard disk it\nlike SN:NA..... Its same for 1 tb or any other version when you call they will\nask you to press 1,2,3 option enter 1 fist then enter 1 again your call will\nbe transferd to seagate seacare you get a refrence id that id is your like the\ncomplint id then you have to give your e.mail to them so they e.mail you so\nyou can make a coustomor id that id you have to give to the service centre so\nthey can replace your hdd or ssd  \nI HOPE THIS HELPS YOU\n\n", "Works as ps4 game application save.  \nLooks great. Amazon delivered it in just one day for banglorites.  \nOne star less, for I can't find the onedrive cloud storage option.\n\n", "\n\n", "Got it for Rs.3999 (from festival sale). Its great.. Price is low when\ncompared to other websites. But the packaging was not good. Just a sheet like\nthing is used no boxes was used. The product was good and new and it is just\nmanufactured a month ago. Its with new logo in which Seagate changed few\nmonths back. The speed is maximum of 86 mb...but mostly it is around 75 mb..\nwhich is little less when compared with transcend and wd elements bcz they\nboth will be around 80- 85 mb mostly. And too the speed reduces to 30 for few\nseconds.. I dont know why it is like that.The drive is too small than i\nexpected...Registeration of the product is quite easy. A slight disturbance\nwill dusconnect the drive from computer. It is getting heated after usage of\n20 minutes.. I think it is common. After registering the warranty is 3 years\nand 2 months. Very happy with this. Keep it safe using HDD protector. Length\nof the cable is small.\n\n", "Total waste of money. Within first 2-3 use, it stopped working. Had to run to\nthe service center to get a replacement.\n\n", "A complete NO NO.  \nThis product has an epidemic failure.  \nBought this product jest a week back and Read/Write head failed to work.  \nAll my data is lost as Segate is asking almost Rs 50,000 - 60,000 and that\nalso I need to ship my product to some country in Eurpoe on my cost.  \nJust dont buy any Segate product. Most of the SME's in this field have\nconfirmed that Segate has this problem and asked me to keep away from this\nbrand in Future for their poor quality of product and service.  \nDont get carried away with old legacy of Segate.  \nIt is over..\n\n", "This is a failure model guys. More than 60% of the hard disks that arrive at\nthe Seagate service centers in Chennai are of this model only. I am telling\nthis because even my hard disk became unresponsive after just shaking it. Data\nrecovery is very costly(10k-30k). So please don't buy this model and for\npeople who have already bought it, don't store anything important in it\nwithout having a backup of it.\n\n", "READ THIS BEFORE BUY...  \nI'll keep it simple...  \n  \nPROS:  \n  \n-The product works fine, has the advertised amount of space, the transfer speed is okay. But in my opinion,,it could be more better...  \n  \n-The packaging was fine, product undamaged and so on. I haven't had any problems with Amazon India sellers' packaging so far so that wasn't unexpected for me...  \n  \nCONS:  \n-The connecting cable was looped, and the loops still remain at angles even now. I like my cables smooth and non-angly, and I don't know if this will affect the device's functioning in the future. So far it has not caused any problems..  \n  \n-I have used other brands' external HDs, and am used to a certain amount of padding on my HDs for protection..The couple of times I **have** dropped it, seemed to have caused no damage.  \nI would say, go for it. Also invest in a HD case if you can, or just learn to\nbe careful :)\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 7 March 2018", "on 10 November 2017", "on 27 January 2018", "on 29 April 2017", "on 29 January 2017", "on 19 October 2015", "on 16 June 2017", "on 1 November 2017", "on 10 March 2018", "on 22 August 2017"], "reviewer": ["Amazon Customer", "thomas mathew", "AMAN MIYAN", "Ace", "Amazon Customer", "MOHAMED ASIK", "Amazon Customer", "Kumar Dev", "dhanush", "Sudip Mandal"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Great Product at a reasonable price!", "Four Stars", "Nice handy product.", "Nice Product", "Bad product with worst service.", "Excellent drive, but the first piece was defective", "Five Stars", "One Star", "Worst experince with this Seagate drive", "THIS PRODUCT IS FAKE..!!!! ..."], "review": ["Just awesome!\n\n", "Good product, speed 70 mb/s in usb 3.0\n\n", "Now its works good. And im expecting its long lasting. Nice handy HDD. Speed\nim getting is upto 80mbps when moving files from computer to HDD. For copying\nspeed is upto 50mbps, even I used usb3 port.\n\n", "Very safely packed and genuine product.\n\n", "Guys...please do not buy this HDD. I bought this HDD and immediately after a\nmonth, it stopped working. now I am going to vashi for replacement\nprocess.....bad service from Seagate and bad product too...invest your\nvaluable money elsewhere and buy other HDD like WD, Toshiba, hp.\n\n", "The first piece I received was actually dead on arrival. I contacted Amazon\nfor a replacement and they sent me one in 2 days (Pune) and had the\nmalfunctioning piece picked up the very next day.  \n  \nThe replacement was actually a different color (a shade of brownish-black),\nbut this didn't really didn't bother me even though the one I had ordered was\npure black. In terms of performance, read/write speeds can be a bit\ninconsistent even over USB 3.0. However, if you mostly work with large files\n(500MB+) you can be assured very good transfer speeds, almost close to\nadvertised. I was getting around 80MB/s transfers from this drive on to my\nlaptop's SSD. The size is also a huge plus as this is one of the smallest USB3\n1TB drives out there.  \n  \nFor comparison's sake, I had a 1TB WD My Passport before this which\nunfortunately died on me. The old drive, while pretty good, did not peak at\nthe same transfer speeds, and the build quality while decent, was not as good\nas this Seagate drive. I'll have to see how long this one lasts though, since\nthe old one lasted roughly 2-3 years. I'd also like to add that the WD drive\nwould randomly disconnect from my laptop (Alienware M17x R4) while plugged in,\ndue to a weird driver issue which can be a pain to resolve. However, this\nSeagate drive has no issues with any device I've used it with.  \n  \nI'd recommend buying a hard drive case for this, as taking good care of it\nwill prolong its life. If you're using it for music/movies and other media\nfiles which frequently access the drive, I also recommend copying them on to\nyour laptop/desktop first and then watching the copied files instead of\nwatching them directly off this drive, as that reduces disk life.\n\n", "Excellent product too slim and very fast\n\n", "Instead of receiving an external hard disk, I received just the circuit board.\n\n", "Worst experince with this Seagate drive, I bought two 1 tb's, but they took my\n113gb data into a mess. As they both crashed after 3 days of start using.\nPlease never ever bought this product I do have the receipts of those but they\nare worth less\n\n", "THIS PRODUCT IS FAKE..!!!! DONT BUY..!!! YOU WILL GET USED HARDDRIVE THAT TOO\nNOT PORTABLE> SOME OLD USED PC\"S HARDDRIVE\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 28 February 2018", "on 25 January 2018", "on 11 September 2017", "on 17 January 2018", "on 20 July 2017", "on 6 October 2016", "on 16 November 2017", "on 16 October 2017", "on 14 August 2016", "on 15 March 2018"], "reviewer": ["Bhrgav Das", "Amazon Customer", "Sourav", "Amazon Customer", "Amazon Customer", "N. Dev Varma", "Rohith ealuri", "Shrobona", "Amazon Customer", "sunil"]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Device went unrecognised after one time use_ only beeps", "Best 1TB HDD - True Value for money", "Low storage", "Real disasters of my life!!! No More Seagate afterwards :(", "At starting it was working fine. But after 20 days it was not connecting ...", "Must Read Before Buy All Pros And ConS After One Year Of Usuage", "Overall good product.", "this is the worst product i hv ever used", "How bad is that", "Worth Purchasing Best HDD"], "review": ["Worst product.  \n  \nGot the product yesterday. Used it for the first time to transfer the files\none time only. Then second time it stopped in the middle.  \n  \nPlugging in again_ the device is not recognised and a beep sound is only\ncoming from the HDD.  \n  \nIn any PC I could resolve the issue. This is being a regular issue , I bought\nit without knowing the seriousness.  \n  \nNow I suffer with my data begin lost in the harddisk.  \n  \nNot even a day the Device worked properly. Cheating...........\n\n", "I was in confusion whether to buy WD-Passport Ultra or Seagate Plus Slim.\nAfter reviewing/receiving feedbacks in Blogs/friends on both products. Decided\nto go with Seagate Backup Plus Slim. As always Amazon was prompt in delivery,\ni received the product within 2 days & it was well packed. I was initially\nafraid of product not getting covered under warranty, but to my surprise it\nwas for 3 yrs :) :)  \nThe finish of the product is really good,classy & compact. It is easy to carry\n& very handy. I'm using this drive for a week now & the speed is good\n(approx.coping speed 28-35 MB/s for videos & 12-25 MB/s for photos). The space\nyou get to use is 931 GB. Seagate Dashboard software is included where you can\nbackup your PC/Mobile.\n\n", "Product has nit given storage as description I ordered 1TB but actual get\n931GB only need clearance for it.\n\n", "It's not at all worthy if you have some important data. For my precaution, i\nkept around 300GB data but yes correct for me also it's not working. Actually,\nwhen I am connecting to the laptop some sounds like the fan is working but I\nam not able to see the connected drive option in my pc or Hard disk\nnotification light also not showing any status. I have around 300GB data\ninside so may be it will be real disasters about buying this product. Any\nhelpful reviews regarding this issues will be greatly appreciated.\n\n", "I got my harddisk. At starting it was working fine. But after 20 days it was\nnot connecting to my pc. I couldn't return also. Poor quality product. Afraid\nto use it in future..\n\n", "I have purchased this product from amazon before one year and in this review i\nwill tell my whole experiance  \n  \nAs we know amazon delivers product in just 2 days and the packeging was too\nsafe and qulity is awesome  \n  \nIn the box :- there is a hard drive of red color ,,a bill , a warranty card ,\nand a usb 3.0 cable  \n  \nNow move to the harddrive  \nFirst time when i use it i was amazed it give me 300 mbps transfer speed and\nnow it was approx 120 mbps that is too great .  \n  \nBuilt quality of this product is too good and it can actually absorbs shocks\nas i have dropped it many times.  \n  \nThe usb 3.0 cable is also a good quality cable with a good strength as 1 year\nspent cable is still functioning well  \n..  \n  \nAnd also hardisk cover is made up of good material  \n  \n..  \n  \nHarddrive ia very light weighted and produce no sound ...  \n  \nYou can actully connect it with mobiles via otg.  \n  \n..  \n  \nSome cons..  \n  \nSometimes it get a little hot that is not a big issue ..  \n  \nAnd no other cons in this product  \n  \nShould you buy it ....  \n  \nDefinately go for it now because its a awesome and prefectly made product\n\n", "I was surprised to see the size of it, as it's really small and compact that\nfits in the palm of your hand.  \nSpeeds are fairly decent which you would get in a standard usb 3.0 connection.  \nOverall good product.\n\n", "I purchased the product few months before and now the hard disk is not\nresponding at all. i tried contacting with the customer care but they are not\nresponding too , this is the worst product i hv ever used. all of my data is\ngone and the hard disk is not responding too. what am i supposed to do with\nthis thing now.. u guys want me to make noodles in it... get it fixed ASAP\n\n", "I bought this Hard Drive just a month back and i had hardly used it two times\nand it simply stopped working. It is not even detected on laptop. It was just\nkept in Almirah and it stopped working. How bad is that. Dnt know how I can\nreturn this? One should not buy any electronic item online. We should always\nprefer retail shop where you can go and get it replaced.\n\n", "Best of all\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 December 2017", "on 1 August 2015", "on 23 May 2017", "on 5 November 2017", "on 8 March 2017", "on 11 October 2016", "on 8 June 2016", "on 9 January 2018", "on 25 January 2018", "on 31 October 2016"], "reviewer": ["Mohan B", "kalyan", "Amazon Customer", "Amazon Customer", "Amazon Customer", "rohit garg", "Prateek  Ojha", "Amazon Customer", "arushi", "joshinadh"]},
{"rating": ["3.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Warranty is big issue.", "Unreliable company", "Product which you can never ever trust", "**BEST PORTABLE HARD DISK WITH EXCELLENT SPEED, BUILT QUALITY & CUSTOMER SUPPORT**2017 FULL REVIEW WITH READ WRITE SPEEDS**", "reasonable price, good product", "SEAGATE IS THE GATE TO EXTERNAL DRIVES", "It is a good product. Very light and easy to handle", "BAD product.Be aware. It doesn't work. Way too many software defects.", "great performance", "It's an older version product (older logo)!!!!"], "review": ["I got my harddisk on timely but there is issue regarding warranty. If u ask\nseagate india for warranty they declined. They said as by mail me  \n\"Dear Vikas Jajpuria,  \n  \nThank you for contacting Seagate Support.  \n  \nI understand that you want to revise the warranty period of your drive as per\nthe purchase date. We are very sorry to inform you that your drive doesn't\ncarry warranty in India. Your drive was shipped from UAE and so we may not be\nable to provide warranty support for your drive in India. This is for your\ninformation that Seagate does not provide international warranty. As per\nSeagate warranty policies \"Drives distributed outside of India must be\nreturned within the original country of distribution\".  \nSo product is genuine but warranty is big issue.\n\n", "Pls pls pls Don't buy this product utterly waste of ur money and totally\nunreliable company , I brought this product this Oct that's 2 half months back\nand transfered all my memory in other pendrives to this Seagate external\nhardisk that will come about 130gb and I plugged the device again after a\nmonth for some files that I was in need and I was struck by my first shock\nthat external hard disk is not rectifying, I tried downloading the software\nand checked and plugged it on other devices and checked nothing is working,\nmeanwhile I had not taken back up as my broadband connection was not working\nand had placed complain and thought onece it's repaired I will take the\nbackup, so when I plugged the device after a month to check for the file I\nwanted I was struck by my first shock, so I went to the sevice center for\nrectifying my problem my second shock revealed itself, and Seagate doesn't\nhave exclusive service center it's a service Centre which deals with other\ncompany products Aswell and doesn't even have the name of Seagate company and\nI had to Rome around same place searching for the address using my GPS in\nbanglore , and the service Centre Executive asked me whether I want to recover\nmy data I told yes and in return she told it will be charged I was like, it's\nur fault the product comes with 3 years warranty u should do recovery of the\ndata as its just 2 and half month old, she is like no we will charge for data\nrecovery, so I asked how much will u charge, she is like Rs 3500, I was like\nshocked, I brought this product on amazon for 4000 Rs and I have to pay 3500Rs\nfor recovery my data, just because I decided to put all my memory in to one\nplace which was actually very safe in my different pendrive, so I told if I\ndon't get my recovery then I will go to court, they r like call Seagate\ncustomer care we can't help u regarding this, so I called Seagate customer\ncare service and asked their help regarding this and they have no care at all\nand don't have any care for our judicial system , the executive on the call\nsays we don't cover warranty for data and I have to pay for recovery and I\nwaited for Diwali so their will be some good offer so I can avail good\ndiscount and brought it for 4000 Rs and now I have to shell out more 3500 Rs\nwhich I can't Offord now, so I decided to let go off all my memories from\nchildhood days to now,so I repeat pls pls pls don't buy and become Fool like\nme... Thank u\n\n", "Used just for 2 times and this hard disk went kaput. All my valuable memories\nand data was lost. I went to service center immediately and got to know that\nif I need by data to be recovered, they will charge around 4000Rs if it is\nsoftware issue and no less than 10000Rs if it is a hardware issue. If I dont\nneed data recovery they will simply replace the hard disk. It is absolutely\nsenseless that the product it self is costing less than 6000Rs and for data\nrecovery issue we need to spend so much of money out from our pockets.  \n  \nI will not at all suggest seagate products to anyone. Its totally waste of\nmoney and the service is worse.\n\n", "\\---] I wanted a HARD DISK for storage because storing movies, games, music\netc. in laptop and CARRYING them to my work place, picnic, vacations, etc.\nmade my LAPTOP VERY SLOW, so one of my friend suggested me to transfer all\nthis data in an external hard disk(portable one) and carry the hard disk\nwherever I wanted. I was confused between 500 GB and 1 TB but seeing it as a\ndevice which one purchases in 5-7 years(normally), I made my mind for buying\nthis 1 TB version.  \n______________________________________________________________________________________________________________________  \n\\---] As far as the quality of the hard disk goes, I am REGULARLY using this\nhard disk and it works like it worked on the first day of buying it, but with\nsome scratches on its body. Trust me, you will have NO COMPLAINTS regarding\nits DURABILITY.  \n______________________________________________________________________________________________________________________  \n\\---] It weights only 222 grams and is a USB 3.0 device. It requires just one\ncable TO WORK which connects the hard disk to your computer and NO EXTERNAL\nPOWER CABLE or POWER SUPPLY is required. I also used it with OTG Cable with my\nsmartphone and it WORKED!  \n______________________________________________________________________________________________________________________  \n\\---] As far as READING and WRITING speed goes, it copied my 1.2 GB folder in\naround 25 seconds. The drive scores 1,595 points on the PC Mark 7 disk test\nand the drive has 114 Mbps READ and 112 Mbps WRITE speeds. So, all in all, it\nis FAST!  \n______________________________________________________________________________________________________________________  \n\\---] To conclude, I RECOMMEND you buy this hard disk. It also comes in FUNKY\nCOLORS like RED, BLUE, etc. so you can buy the one which MATCHES YOUR TASTE.\nYou will definitely NOT HAVE any issues regarding quality, durability and\nperformance of this hard disk.  \n______________________________________________________________________________________________________________________  \n\\---] Thank You for reading the review. If you have any DOUBTS or QUERIES,\nPLEASE write them in the COMMENT SECTION below and I will SURELY answer them\nas soon as I see them.  \n  \n[...]\n\n", "I ordered this (colour: black) during the recent lightning sale and got it for\nRs. 4,299. Although I only opted for regular delivery, I received it within 2\ndays, and that too on a Sunday. Another example of Amazon's prompt and\nefficient delivery service. I have been using it for less than a week, so I\ncannot comment on how it will turn out in the long term. As of now:  \nPros: 1. Looks classy, operates quietly, and requires no additional batteries\nor power source. Just plug it into the laptop and it's good to go.  \n3\\. It is light and does not heat up much even if plugged in for a long time.  \n4\\. People have been complaining about the difficulty in registering the\nwarranty. But I had no problem with the registration at the Seagate site.\nMoreover, I got a full 3-year warranty.  \n5\\. I have backed up 2 laptops on this hard disk, without any glitches. The\nwhole process is easy, the backed up material is kept in separate folders for\nthe two laptops and is easily accessible. There are many options to choose\nfrom (i.e. automatic backup at regular intervals, manual backup, etc.) Your\nphone may also be backed up, but I haven't done so as yet, so cannot comment\non it.  \n6\\. If you're still unsure of what to do, there are several excellent\ntutorials on You Tube that are clear and lucid and will guide you through the\nprocess.  \nCons:  \n1\\. The first-time backup takes hours. You can still continue to work on your\nmachine but it could slow down till the backup is over.  \n2\\. The subsequent backup took me just about 15 minutes for my husband's\nlaptop. For mine, where I have more data, the second time around it took 1\nhour 15 minutes. (The time taken was more than twice that the first time. This\ndifference occurs, I presume, because it's an incremental backup. i.e., what\nyou have already backed up remains on the external hard disk, and each time\naround, only new files or files that have been changed in some way are backed\nup.) Still, there's not that much additional data on my machine, between\nbackups. so this seems like a lot of time for that.\n\n", "HELLO GUYS & DOSTO  \n= = = = = =  \nBEFORE STARTING OFF THE REVIEW I WANNA MENTION THAT THE PRODUCT SEAGATE ULTRA\nSIM WAS PROVIDED BY THE AMAZON SELLER AND AFTER USING IT FOR 3 WEEK’S AND I AM\nHERE TO GIVE A DETAILED REVIEW OF IT.  \n  \nSEAGATE IS IN THIS FIELD FOR MANY YEARS AND YES THEY ARE ONE OF THE BEST\nEXTERNAL DRIVE COMPAINES MANUFACTURERS AVAILABLE.  \n= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =\n= = = = = = = = = = = = = = = = = =  \nSO STARTING WITH THE REVIEW  \n= = = = = = = = = = = = = = = = = = = =  \n  \nWHAT'S INSIDE THE BOX  \n= = = = = = = = = = = = = = =  \nSEAGATE ULTRA SLIM ITSELF  \nUSB TO HARD DRIVE DATA CABLE.  \nDOCUMENTATION.  \n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  \n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  \nATTRACTIVE FEATURES AND STUFFS  \n= = = = = = = = = = = = = = = = = = = = = =  \nULTRA SLIM  \nGOOD BUILD QUALITY  \nPLUG AND PLAY. - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  \nMY OPINION  \nThe external drive is compatible with  \nWindows XP, 7, 8, 10.  \nOS X 10.6.8 OR higher  \nANDROID 2.3 OR higher  \niOS 6 OR higher  \none thing that I found missing was that the carry case was not there and they\nshould have provide it so that the the customers are fully satisfied regarding\nthis but that’s fine the look and feel of this hard drive is just the best I\nwould say the slimmest hard drive I ever seen .  \nVery durable.  \n  \n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n- -  \nCONCLUSION  \nBuy it if you want sleek design and performance it just that good  \n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  \n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  \nIf find it help full please click the helpful button.  \nThank You.\n\n", "It is a good product. Very light and easy to handle. But, I strangely received\na product with three different manufacturing date. The outer box of the\nproduct also looked quiet old and faded. The PN number printed on the box\nmentioned manufacturing date as August 2016 . Then there were several retailer\nstickers on the product. One of the stickers mentioned November 2017 as\nmanufacturing date. Another mentioned December 2017. The serial number when\nchecked online says it is guaranteed till 2025. But, we cannot risk our data.\nGuarantee is only in repairing the product and not for data. It looked like a\nfake or refurbished product in a sealed packet. We placed order with Appario\nretail. They had quiet good rating.\n\n", "i ordered Seagate Backup Plus Slim 1TB Portable External Hard Drive with 200GB\nof Cloud Storage & Mobile Device Backup (Black) on 1st October 2016 on amazon\nprime(guaranteed deal). It was supposed to be delivered on 3rd but it didn't.\nWhen it was delivered and i checked the drive it detected once and stopped\ndetecting.  \nI ordered a replacement which arrived today. This product is so bad, it didn't\neven install the drivers properly. Tried in my system and also on my friend's\nlaptop. All the time the driver fails to install. its 17th October now. I paid\nthrough net banking for the product. 17 days, two products and plenty of calls\nto amazon and still i don't have a hard drive which works properly.  \n  \nYou guys should ask the seller to sell only tested product.\n\n", "I bought Seagate Backup Plus Slim 1TB in red color and will divide the\ndifferent aspects of the device and it's service and then write my feedback\nabout them to make it more readable.  \n  \n1\\. In the box: I received the Seagate Backup Plus Slim device along with a\nUSB cable to connect it with a laptop and a quick startup guide in the box.  \n  \n2\\. Performance: The product functions very smoothly. When you first plug it\nin, you can register it online and download the seagate dashboard for a more\narranged functionality but downloading this is completely optional.  \n  \n3\\. Available Space: The device has a storage space of 931GB out of which\n930GB was free as there were some files like the warranty PDF, initial setup\nguide etc already stored in the device. Along with this product I got 200GB of\nfree cloud storage.  \n  \n4\\. Warranty: This harddisk has a warranty of 3years and you can view the same\nby visiting the site: support.seagate.com/customer/en-\nUS/warranty_validation.jsp after you complete the registration of your product\nonline.  \n  \n5\\. Registration: Do register your product before starting to use it to view\nyour warranty and other cloud storage. Visit: [...] for the same.  \n  \n6\\. Size/Dimension: The dimension of the product is 11.4 x 7.6 x 1.2 cm and is\nvery light weight. I'm uploading some pics of this device alongside an iPhone\n6 for you to compare the size.  \n  \n7\\. Look: I bought this product in red color. The look is very sleek and has a\nmatte finish on the body. It has an LED on the front, top left corner and a\nseagate logo on the front, bottom right corner.  \n  \n8\\. Price: I paid Rs. 4,590 for 1TB in red color which is a complete value for\nmoney keeping in mind the performance and design of the product.\n\n", "It's not an original product... The package has different information and the\nproduct is different inside the box.... I checked.... The P/N written on the\nbox doesn't match with the P/N on the HDD.... This one is definitely repacked\nor refurbished hdd....\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 5 October 2015", "on 8 January 2017", "on 30 May 2017", "on 5 July 2017", "on 22 June 2016", "on 23 November 2016", "on 25 January 2018", "on 17 October 2016", "on 24 February 2017", "on 1 January 2016"], "reviewer": ["vikas", "prajith mannadial", "Abhiram Bavisetty", "Simple Person", "Raji", "Ritesh Mudicha", "Ajesh", "Amazon Customer", "Kaustubh", "Manas M"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Very bad", "Value for Money 💰", "Best HDD", "I got only 930GB", "Four Stars", "Sleek and sturdy", "Hard disk for memory rickers", "Superb 1TB slim hard disk.", "Buy unhesitatingly", "Perfect Combination of Design & Performance. No.1 External HDD in India !!"], "review": ["Not even a year and the port is not working\n\n", "Very good product...it’s slim and lightweight..you can easy backup your mobile\ndata and PC data..ordered this product yesterday in amazon sale 😎..\n\n", "This hdd is so compact, its so light and pocket sized, this image wont justice\nbut hdd is compact.\n\n", "The thing is I got only 930GB ..70GB is missing donno y ..nice one I just got\nnow .hope it would do good in future ... will fit in pocket easyly can carry\nany where .\n\n", "Nice ....Less weight....slim looks good...  \nCompact\n\n", "Using this product for two years now. No problems with the hard drive apart\nfrom the cable provided which you may need to buy a new one after a year and\nhalf. The build quality is excellent no cheap plastic material. The file\ntransfer rate is awesome with usb 3.0 which is around 70-109 mbps depending\nupon your file. Overall a better product compared to others at this range.\n\n", "Best hard disk which is available on Amazon or flip cart and a good product by\nSeagate. Enjoy this product by using this and it can back up all files just in\n1min.and there are many features for this product. As a computer graphics\neditor I must suggest this product to every one who use high memory and I am\nusing this product from 4 months no reports for this. I am giving 5 stars\nbesause it's an amazing, marvelous product by Seagate and I like its slimness  \n  \nBrief Description:  \n  \nBack Up your Stuff - Anytime, Anywhere  \n  \nThe Backup Plus Slim Portable Drive is the simple, one-click way to protect\nand share your entire digital life. At 12.1 millimeters thin for up to 4TB of\ncapacity, it’s ready to take with you and go.  \n  \nEasy Manage your Favourites Wherever  \n  \nAll your photos, movies, and videos can be backed up using the downloadable\nSeagate Dashboard software, including the ones you’ve shared on Facebook,\nFlickr, and YouTube. Run a one-click backup or schedule an automatic backup\nplan to protect your files on your Backup Plus Slim Portable Drive at your\nconvenience.  \n  \nPlug-and-Play High-Speed Connectivity  \n  \nHigh-speed USB 3.0 and 2.0 connectivity offers plug-and-play functionality on\nyour PC without the need of an external power supply.\n\n", "I am writing this review after using for more than two and half year. It is\namazing and perfectly working. I got this item for Rs 3999 with 10% cash back\noffer. It is too slim and no problem of crashing and data loss ever happened.\nand it's too easy to carry. So, go for it. :)\n\n", "Awesome...just go for it blindly\n\n", "After long research & Analysis of Performance & Price, I finally chose Seagate\nBackup Plus Slim 1TB.  \n  \nBuilt : Sleek & Slim. People with frequent use & rough handling should think\ntwice before choosing this because you cant afford to drop it quite often.  \nThe exterior surface has somewhat Matt finish which captures ur fingerprints.  \n  \nSpeed: It has USB 3.0 connectivity where i got around 50 Mbps transfer speed\nwhich i found it handsome enough.  \n  \nStorage: One gets 931 Gb user available space. Additional benefit is of 200 Gb\nCloud storage for 2 years. I am not sure whether i would be using it or\nnot...But still its something extra.  \n  \nWarranty : Registering the product was very easy. It took me just 5 mins to\nregister for my product & warranty.  \n  \nWhat I found it was lacking : In built Encryption or Password protection to\nsave your data from voyeurs. I think such protection is very much inevitable\nin today's time.  \n  \nOverall: 4 Out of 5. Seagate lose 1 star for not providing Encryption. And\nalso for not providing Case/Pouch for product as delicate as this & I had to\nshell out another 300-400 bucks for the same.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 March 2018", "on 25 January 2018", "on 29 January 2018", "on 12 July 2016", "on 19 March 2018", "on 11 June 2017", "on 14 March 2018", "on 15 July 2017", "on 21 February 2018", "on 10 March 2016"], "reviewer": ["Amazon Customer", "Nitin mudgal", "#OM", "Kalyanam harish Kumar", "Ajay Kajale", "Amazon Customer", "Mandik Goyal", "Anurag", "Amazon", "Satvik Patel"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Great external storage device", "Sagate's Gate closed after Warranty period.PATHETIC & IRRESPONSIBLE SERVICE", "MUCh BeTTER THAn OTHer HArdDisks!!", "Best 1TB  Backup Plus with  read/write speed of approximately 100MB/s and a spindle speed of 5400rpm.", "Budget & considerable speed. 2018 review", "One Star", "Product number mismatch", "Excellent Product !!! Don't think just buy...", "100 percent waste", "935.5 GB  Storage capacity"], "review": ["Using it for around 6 months but till now didn't come across any issue.  \n\\- It's lightweight.  \n\\- Fast I/O speed as 3.0 USB supported.  \n\\- Pricing is ok, you didn't gonna get any better in 3.8k around.  \n\\- Better than WD I must say because I also used WD hard disk which is quiet\nheavy than this comparatively plus a thick than this for the same price.\n\n", "I purchased it in 2013 and had used it sparsely..One day, while transferring\ndata, the cable accidentally got dislodged from the drive,I replugged the\ndrive,it started showing an error msg \"cyclic redundancy error\".I called up\nSeagate customer care, downloaded its remote assistance pack, followed their\nguidelines and did a series of tests which was of no use.The customer care was\nhelpless and by knowing the fact that it exceeded the Warranty period, they\nwere keen to disavow their services.  \nI gave it to one of my friend who's a geek in these stuffs, was able to format\nit and restore it to working conditions at the cost of losing all my data.Few\nmonths later, the cable got dislodged accidentally (my bad) and i was in no\nsurprise when i saw the Error message popping up once again.  \nOne thing i understood with this so delicate product is that Seacare ends with\nits Warranty period.Any trouble later with it, you will be shown direction of\na nearest Waste bin.Pathetic\n\n", "I bought the Seagate Backup plus 1TB Hard DIsk from an electronic mall as i\nfound the price was less there. The Product comes up with 3 years warranty. I\nam using it for 10-13 days and now i am writing this review. I found this hard\ndisk is much better than the other hard disk at this price range. Previously i\nused Lenovo 1TB hard disk and also WB Element 1TB. This hard disk also comes\nwith Backup function so you dont have to worry about losing your important\ndata in your hard disk. I also compared the data transfer speed and writing\nspeed of the device with my old 2 hard disk. This one gives a much better\nresult in speed compare.  \nIF This product fits your budget then close your eyes and go for Seagate. You\ncan trust Seagate.  \n==========================================================================================================  \nPros;-  \nStylish & Slim  \nVery Light Weight  \nComes with High Speed 3.0 transfer cable  \nHigh Transfer Speed  \nNo Heating Problem  \n  \nCons;-  \nNo Cover Case  \n  \nAfter Buying this product don't forget to Register the Product online!  \n==================================================================================================  \nAlso check My Youtube channel \" Android Mechanics\" & Please Subscribe to\nsupport me!  \n  \nTHANK YOU\n\n", "Hi ....this is best product 1TB Seagate Backup Plus. Easy to use lightweight\n(Lithium battery Weight 5g).Provide maximum sustained read/write speed of\napproximately 100MB/s and a spindle speed of 5400rpm.come 3 year manufacturer\nwarranty.  \n  \nSome important informations are given below:-  \n  \n1 TB PORTABLE SLIM HARD DRIVE USB 3.0  \n  \nFeatures & details:-  \n  \nCreate easy customized backup plans with included Seagate Dashboard software  \nUSB powered - no power supply necessary  \nQuick file transfer with USB 3.0 connectivity.Dimensions(L x W x H mm)-114,5 x\n76 x 20,35 mm  \nCompatible with PlayStation 4 (Requires PS4 System Software Update 4.50 or\nhigher)  \nWorks interchangeably on PC and Mac computers-without needing to reformat  \nFree Mcafee Internet security for 1yr (Exclusive Online Partner - Amazon) for\nany query please contact 0008004401392  \n  \nProduct information:-  \n  \n*Brand Seagate  \n*Series Backup Plus Slim  \n*Colour Black  \n*Item Height 11.4 Centimeters  \n*Item Width 21 Millimeters  \n*Product Dimensions 7.6 x 2.1 x 11.4 cm  \n*Item model number STDR1000300  \n*Hard Drive Size 1 TB  \n*Hard Drive Interface USB 1.1  \n*Hardware Platform PC, Mac  \n*Lithium Battery Energy Content 3.5 Watt Hours  \n*Lithium battery Weight 5 Grams  \n*Number of Lithium Ion Cells 1  \n  \nIncluded Components Backup Plus Slim Portable Drive, 18 inch USB 3.0 Cable,\nQuick Start Guide, Seagate Dashboard Backup Software,NTFS Driver for Mac  \nAdditional Information  \nASIN: B00GASLJK6  \nBest Sellers Rank: 16  \nTrouble Shooting Steps Click Here [PDF 436Kb]  \nWarranty & Support  \nWarranty Details: 3 year manufacturer warranty  \n  \nSo, if this review helpful plz...... vote helpful\n\n", "*Package good. (Bubble wrap)  \n*Speed ceilin'- 20-30mbs with usb 3.0 port( transfer(cut & paste) large chunk files - movie collection.  \n*Quiet as mouse.  \n*Max use heats, gradually not instant.  \n*Noise less audible not distractive though.  \n\\-------KEEP THE PLASTIC CASE THAT COMES WITH IT--------\n\n", "Rarely used for 3 months...it is not working anymore. Please do not buy this\nproduct. Almost 100gb data lost... They ask 3000 to 10000 rupees for data\nrecovery.\n\n", "Product number (PN) on HDD does not match with the Product Number on the box\npacking.\n\n", "Perfect Product with good price..1tb hdd with more than 25 to 35 Mbps data\ntransfer speed , slim and easy to carry very compact ,easy to connect.. thanks\nto Amazon for providing good product with good price and on time delivery...\n\n", "I purchased segate hard disc on June 30 . I didn't even use it for 1month it\nis not detecting for any laptop I don't know what to do. So when I am checking\nfor warranty the product number is showing as fake. So it is 100percent waste\nof my money. Please do not purchase this hard disc. This is my humble request.\nI don't even like to give 1 star rating but it didn't allow me without that\nfor writing review.I lost total hope on amazon product. worst experience ever.\n\n", "931.5GB available storage.  \nWorks fine n PC,can made to be used with android phones by formatting it to\nFAT/FAT32 file System.  \nCompact size,beautiful looks nice product.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 March 2018", "on 23 February 2018", "on 22 December 2016", "on 30 January 2018", "on 23 November 2017", "on 23 January 2018", "on 14 March 2018", "on 27 November 2017", "on 20 October 2017", "on 11 January 2018"], "reviewer": ["Rahul", "naveen", "Priyankar Dz", "Madhukar Trivedi", "Samuel", "Amazon Customer", "Yogesh Sharma", "Arun", "Gnana Bharathi.V", "Amir Salim"]}
]