[
{"rating": ["1.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["No service or warranty at all", "Long Term Review - Average", "My honest review this product", "Good heaphones😃", "REVIEW AFTER MY HEAVY USAGE", "This Sony is Secondary Headphones Why? Reason below", "Beware of difference between Sony MDR-ZX110A(New Model) and Sony MDR-ZX110(old model)", "DETAILED STUDY,ALL WHAT YU NEED(go through the review)", "STYLE BUDGET AND QUALITY KEPT IN PROPORTION.", "Best budget headphones from SONY !!"], "review": ["Within 15 days the left earpiece is not working. Only used 3 or 4 times.. They\nsays 1 year warrant, but you never gonna get that... The authorised sony\ndealers said they wont repair or replace online purchased items... And the\namazon customer service also said they cant do anything... Don't buy this\nheadphone... just wastage of money..\n\n", "What I liked is the fold-able design. Sound quality is average but OK for\nheadphone in this range. These lasted around 6 months. After around 2 months\nthe gold plating on connectors faded away. After around 6 months the\nconnections on the headphone jack connections became loose and sounds became\nintermittent and I had to open and see what went wrong. That is when I noticed\nquality of build and material used inside.  \n  \nOpinion after use for 6+ months -  \n1\\. Average build quality  \n2\\. Not sure if it is original Sony. The quality of soldering and connectors\nindicate cheap quality parts used and poor assembly quality which is not as\nper Sony or any good branded product.  \n3\\. See pictures of connectors and original soldering on joints which is\nsubstandard.  \n  \nOK if you get it in a sale around Rs 500 and if you can do minor repairs in\ncase it fails for you.\n\n", "I used this product around 1 month nice head phone  \nDesign, specifications and comfort  \nThe Sony MDR-ZX110 looks fancy and expensive from a distance, with a\ncombination of matte and gloss finishes on the body that comes across as more\npremium than anything else we've seen at this price. However, up close it\nfeels strictly budget. The plastic is flimsy and bendy, and does not look or\nfeel like it can take too much abuse, so careful handling is advised.  \n  \nThis headset has a rather unique folding mechanism that allows the ear cups to\ntwist inwards, into the headband. This makes the MDR-ZX110 a bit easier to\nstore when not in use. Apart from this, the Sony MDR-ZX110 has 30mm dynamic\ndrivers, with a frequency response range of 12-22,000Hz, 24Ohms impedance and\na sensitivity rating of 98dB. The MDR-ZX110 doesn't have an inline mic or\nremote control, but Sony does sell a nearly identical model, the MDR-ZX110AP\nwhich does, for Rs. 700 more.  \n  \nThe ear cups have very slight padding, which is enough for an acceptably\ncomfortable on-ear fit. The headband has no cushioning, but is designed well\nand feels secure and comfortable in place. The MDR-ZX110 also has a thick,\ntough cable that looks like it can take a fair bit of strain. Past the\nY-splitter, the 1.2m cable splits into two separate and somewhat flat cables\nthat aren't quite as sturdy as the lower half. The design and thickness makes\nthe cable somewhat tangle resistant, and extremely resistant to cable noise.\nOn the whole, apart from the flimsiness, we're happy with how the Sony MDR-\nZX110 looks and feels.  \n  \nPerformance  \nWith the Sony MDR-ZX110 being an entry-level on-ear headset, we did most of\nour testing using an Android smartphone. We also tried it with our Fiio X1\nhigh-resolution audio player and a Windows laptop. Focus tracks for the review\nwere BT's Somnambulist, Skrillex and Diplo's To U, and Passenger's Circles.  \n  \nStarting with the bass-heavy Somnambulist, we found that the Sony MDR-ZX110\nhad a meaty sound, with lots of emphasis on low-end attack. The bass can\noccasionally be overpowering, but is usually controlled thanks to the not-so-\ntight fit. The sonic signature has been tuned toward promoting the lows, and\nthis makes for a very warm sound. This also tends to show a bit in the lower-\nmid ranges, but there is a clear sensitivity drop towards the upper end of the\nfrequency range.Next, we cued up To U, which despite being a dubstep track,\nhas plenty to offer in terms of the mid-range and detail. While the Sony\nheadset is impressive in low-end detail, it seems to trail off going up the\nrange. The result is a sound that isn't quite as open and detailed as we'd\nlike, even at this price. Other products such as the Sennheiser HD180 offer\nbetter levels of detail at this price, so the MDR-ZX110 isn't something we'd\nrecommend if you're looking for sonic clarity.  \n  \nFinally, with Circles, we kept our ears open for imaging and soundstaging.\nWhile the Sony offers a full and aggressive presentation in the sound, it\nfalls a bit short in terms of openness and width. The sonic stage feels narrow\nand specific, rather than properly spread out. However, the MDR-ZX110\ncertainly does its bit to make your music immersive and entertaining,\nespecially if you like your headphones bassy and aggressive.  \n  \ncarry forward the typical aesthetic that makes Sony a popular headphone\noption, but it falls a bit short in terms of build quality. It feels cheap and\nwe were always worried about damage during our time with the review unit.\nHowever, it offers an immersive, full sound that excels in its handling of\nbass. Detail and clarity suffer a bit, but bass-heads will not find too much\nto complain about at this price. If you're looking for a pair of on-ears with\nserious attack and drive at under Rs. 600 the Sony MDR-ZX110A should be on\nyour wish list.\n\n", "Well sony is all about music as we all know and the sony mdr zx 110a fulfill\nthis requirement among music at this price specially, if u are looking for\ngood or normal bass then you all go for it but not for heavy bass then g o for\njbl t series. But I am satisfied with this range of headphone that sony\noffers(₹610).vocal are so much clear or I can say crystal clear that you can\nhear every lines clearly even if it English or Hindi both.Now coming to the\nwire it is tough can't be get easily damaged if you keep safely. So all I want\nto say don't compare to ₹1500 headphones like jbl,or sony. l have used jbl\ntempo(₹1500) it was awesome at bass and vocals but it doesn't mean that this\nsony headphone is bad no not at all, go for it friends as it is at low price\nat present and at this price you will be happy to get this, I love the\nheadphone and I hope you will love it too.Thank you😃\n\n", "I am using this product for 4 months.  \nThere are lot of PROS ,in this price range the product is really good and the\naudio output is decent .  \nIts easy to fold and carry .  \nIts very light weight and even after listening to music for lot of hours you\nwon't feel any discomfort.  \nNow the CONS : Its made up of cheap plastic.  \nWhile listening to music you can still hear the outside sound and the thin\ncovering over the sponges will tear easily.  \nAccidently if you place any heavy object above that , like your laptop and i\nam sorry your headset will broke.  \nIf you found this review helpful please mark it as HELPFUL .\n\n", "I'm a sound Engineer of good experience so i would like to share a good\nreview.  \nValue for money.  \nPros.  \nLight weight.  \nSound quality is not bad. Lack of tight punch but does its job good.  \nThe Brand Sony.  \nGold plated 3.5mm jack.  \nTangle free cables.  \n  \nCons.  \nNot For long time listening.  \nEar cups are not so durable and will get dirty soon after a period of rough\nusage.  \nSound quality is not that great. For sure a muddy Mid is a drawback.  \nNot for BASS lovers definitely.  \nShould handle with care without dropping it.  \n  \nVerdict.  \nFor this price point its a good buy, It should be a secondary headphones if\nyou are a music lover.  \nBut definitively not for audiophile. Watching youtube listening to soundcloud\nthis headphones are worth a try.  \nNOTE : All this review is based on my testing.\n\n", "I ordered Sony MDR-ZX110A. When I received the package outside the box it was\nmentioned Sony MDR-ZX110A but inside I got the old version i.e. Sony MDR-ZX110\nwith an year old manufacturing date and that too defective piece with sound\ncoming only from right side.  \nLooks like a fake product.  \nI have created the return request for this.\n\n", "Usually I'm a critic and I found few points on this product. But before\ncritising this product let me explain the complete and detailed experience\nwith this.(with the pros and cons mixing and comparing)  \nFirst of all. this product has owned it's \"trademark\" style and grabbing\neveryone's attention on it with its \"appeal look\"  \nNext point is. The bass. Yes,the bass is not very pulsive but yeah...it has\ngot some decent bass wch is very much safer than other \"extra bass\" products.\nSo this product is good at providing some bass and at the same time protecting\nour ears.  \nNext comes to the sound. Sound is very decent and loud enough for people who\nloves more sound. But the sound is also likely the same as bass. Bit lower\ncompared to other \"very expensive\" products. As I said this product is giving\na decent sound wch is not much irratative like other expensives!  \nComing to durability, this Device is good at durability and reliability too.(\nNot with miscellaneous cases like forcing to break,etc)  \nThe wire length. Is also a good length. As most of the ppl are worried about\nthe length these days. This product is given with a decent amount of length\nfor traveling.  \nAnd finally the \"justice to money\" . I think this product is scoring full\nmarks on this point. 600/- odd (prices may vary from seller to seller and also\non the offer season, and I found 600/- is the average cost ) I think the\nstyle,the sound,most importantly the company branding and the warranty are\noffering a great justice to this price.  \nSimply.. best opt for the low\" budgeters\" with a high class look! Good luck!\n\n", "I’ve been using these headphones for about 3 months now.  \nI’ve purchased it from Amazon and I got it for INR619.  \nNow the price seems to be bit lower still there is a price difference of\naround 100rs which is a good deal,  \nit is now priced at 539 INR at Amazon. I read reviewers saying they brought it\nunder 500INR.Comparing it with other headphones in and around this price\nrange, I wouldn’t recommend this as the best buy for everyone.  \nBut if you’re looking for some style blended with satisfactory audio quality\nand insist about going for an over the ear headphones,  \nthen this ones for you guys  \n  \nSONY MDR-ZX110 is one of Sony’s most popular over the ear headphones .  \nIts brilliantly priced at a price range where there isn’t much competitors\nthat can  \ncompete with Sony’s brand value and the stylish design of the product.  \nIt has got a stylish and functional folding mechanism that allows the ear cups  \nto twist inwards into the headband, making it travel friendly .  \nIts Made entirely of plastic and the plastic quality feels premium.  \nIt's light and comfortable, which can be used hassle free over long periods.  \n  \nBranding:  \n======  \n  \nWhen it comes to Brand recognition, there is only a handful of audio\nmanufacturers can compete with Sony. It has got a brand name that has been\nbuilt up over the decades of quality products. These headphones prove no less\nin terms of branding, be it in case of the iconic design or be it the minimum\nstandard kept in not sacrificing the audio quality for satisfying budget\nrequirements  \nStyle: This is totally a style iconic product, it has got the iconic Sony\ndesign. It has got a stylish and functional folding mechanism that allows the\near cups to twist inwards into the headband. With the combination of matte and\ngloss finishes on the body, it gives a premium feel right away.  \n  \nComfort  \n======  \nproduct is just a bit tight on ears, as far as long time usage is concerned\nthis headset doesn’t give you quite a comfortable feeling. Anyways its much\nlighter than its competitors. The cushions for the ear cups gives you enough\ncomfort ,but the headband has no cushioning at all ,which was required for the\ncomfortable over-head fit, but it is compensated to an extent by the brilliant\ndesign by Sony. The cable has got adequate thickness and is of 1.2m length\nwith 3.5mm pin which is not gold plated  \n  \nSound Quality : “Adequate”  \n===========  \nBass -7/10  \nTreble -6/10  \nClarity -6.5/10  \nComfort -7/10  \nOverall -6.5/10  \n  \nValue For Money :  \n=============  \nAs far the 600INR price point is considered the product is a worth the money.\nvalue for money proposition is maintained. Sound quality may not be premium,\nbut for this price range you can’t easily find a better over the ear headphone\nwith a this much style and attitude.  \nThis is indeed a very good product. I got it for under ₹600 and at that price\npoint I believe that's not money wasted.  \n  \n********  \nPROS:  \n********  \n# BRILLIANT PRICING  \n# Stylish, Comfortable and Functional Design  \n# Bass-driven sound with adequate sound quality  \n# Premium quality and finish of material used  \n# Much lighter than its competitors  \n  \n********  \nCONS:  \n********  \n  \nSONY MDR-ZX110 is one of the highest selling audio products in Amazon for a\nlong time, but it has got its own flaws too.  \n  \n# 3.5mm pin is not gold plated  \n# Prone to breaking if not taken care properly  \n# No cushioning provide for headband  \n# A carrying pouch would’ve helped  \n  \nMY VERDICT:  \n===========  \nThis one is a good budget buy over the ear headphones priced brilliantly at a\nprice range of rs.500-600, where there isn’t much alternatives to go for if\nyou want a stylish product without compromising much on the music quality  \nwill these head phones serve your purpose ?,  \nwell that solely depends on what type of user you are.  \nIf you're someone who is looking for a stylish branded product with which you\ncan express you attitude and at the same time you don’t want to compromise\nmuch on the quality front, then you can surely consider this product.  \nBut if you're all into hardcore music then this one may end up disappointing\nyou.  \n  \nAnyways DO SURF,COMPARE AND DECIDE what’s the best one for you before you\nswipe your card of  \n  \nBe cautious while selecting the seller and make sure that your seller has\nminimum rating and if the Amazon fulfilled badge is there its better to opt\nfor that seller even if the price is a bit higher .Do surf and check for any\nbetter deals available  \nSHOP WISE ,SAVE BUCKS  \nHappy Shopping  \n  \nhope you found this review helpful\n\n", "Hi Guys !!  \n  \nThis review is about the SONY MDR-ZX110A headphones.  \n  \nI am writing this review after two months of usage as on date 25th Oct'16 as I\npurchased the headphones on Amazon during the August sale for Rs 499 only .  \n  \nTo watch the detailed video of the headphone after two months of usage head to\nthe link on youtube: [...]  \n  \nLook and Feel :  \n  \nThe headphone looks great , I have a white one and it feels good in hands,\nwhile it feels more of plastic, this does not come in the way of the feel\nwhile on ears. The headset is great for long hours of use and is lightweight.\nIt may feel a bit small for people with big head sizes but does the job for me\npretty well.  \n  \nPerformance:  \n  \nThe headset is from SONY and the sound quality is outstanding looking at the\nprice range that the headset comes for , this one performs really well when it\ncomes to sound quality. Mids are clear, Highs are perfect while lows could\nhave been a bit more better, but for around 500 bucks , this one gives a tough\ntime to its competitors in the same segment.  \n  \nDurability  \n  \nThe headset is durable and I have no issues what so ever with the product\nsince past two months, detailed video over here  \n  \n[...]  \nPros:  \n  \nLightweight, good build quality, good sound quality, tangle free wires, budget  \n  \nCons:  \n  \nCatches dirt(White One ), Bass could be better, Plastic feel  \n  \nFinal verdict:  \n  \nA very fine pair of headphones for daily use, SONY won`t disappoint you,\ndefinitely recommended for people on a tight budget and looking for a branded\npiece of headphones.  \n  \nThank you , hope this helps !\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 December 2016", "on 4 December 2017", "on 24 January 2017", "on 26 July 2017", "on 19 February 2017", "on 5 October 2017", "on 30 September 2015", "on 14 August 2017", "on 5 November 2016", "on 25 October 2016"], "reviewer": ["Amazon Customer", "NS", "Abhishek", "Amazon Customer", "Kapil", "KARTHIKryo", "Vinay Kumar", "Vishnurakesh sathyala", "Nikhil Soman", "Kamal"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Quality", "Awesome headphones for the best price", "Best Budget Headphones.....", "Really good this one", "Proud purchase", "Three Stars", "Good product but delivery and packaging is worst.", "Good", "Five Stars", "Not Bad."], "review": ["Nice and good product. Very very affordable price for that product. Nice and\nbest quality\n\n", "Awesome headphones for the best price!  \nPros:  \n#best in class built quality for the price  \n#best in class sterio sound clarity  \n#good material durable high quality cables  \ncons:  \n#less padding which makes it uncomfortable for long use  \n#hindges make noice when it is adjusted or moved  \nBut those who are looking for a budget headphone with great value for money\nand performance u should suerly go for this one.  \nplease hit the like button if u find this review and photos helpful.  \nthankyou.\n\n", "I Love this SONY MDR ZX110A Headphone, they are very comfortable and provide\nhigh qulity base and sound. Best Budget Headphone.\n\n", "Thanks a lot Amazon\n\n", "Sleek design and foldable system is great. Very light weight. Colour looks\nfresh and cool, though being white this thing needs extra care. Sound is great\nvery clear . Has a good base and buffs outside sound 95% the instant on\nwearing it. Overall really value for money and brand trust on sony as always.\nHappy!\n\n", "\n\n", "Product is quite good in built quality and sound but dont expect too much from\na budget headphone. But at this price it is awwsome.  \nDelivery is too late received after 9 days and need to call 5 to 6 times then\nreceived.  \nBut overall nice. Product except delivery and packaging.\n\n", "Good headphone in price.  \nBut made in china product\n\n", "Very good quality and light weight.I carry it everyday everywhere with\nme.Worth my money.\n\n", "Not bad. Rate ke hisaab se badhiya hai.. 😜\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 January 2018", "on 21 April 2017", "on 30 December 2017", "on 9 March 2018", "on 28 July 2017", "on 25 March 2018", "on 19 August 2017", "on 11 February 2018", "on 20 January 2018", "on 3 February 2018"], "reviewer": ["Raees Reyi", "Gautam Anilkumar", "Manish Udesing Rathod", "Kashim lxk", "Amazon Customer", "Amazon Customer", "Satvik", "Rahulks", "Amazon Customer", "Vishwajeet M."]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["pros and cons", "Value for money", "When you get it for 500/- or below don't miss it ❤", "This is the budget headphone⁠⁠⁠⁠", "Great Bass Headphone at Low Budget", "Excellent for the Price Point of view. Simply unstoppable.", "U will not get better headphones than this at this price point", "BEST BUDGET HEADPHONE...", "The cable is too short", "Value for money headphone."], "review": ["Pros  \nComfortable on-ear design  \nGood low-end response  \nSturdy cable  \nFull, exciting sound  \nCons  \n  \nFlimsy build  \nWeak mids and highs  \nRatings (Out of 5)  \n  \nDesign: 3.5  \nPerformance: 3.5  \nValue for money: 4  \nOverall: 3.5  \nSony MDR-ZX110 Review  \nWhen it comes to name recognition and market reach, few audio manufacturers\ncan match the Sony's capabilities. Using a brand name that has been carefully\nbuilt up over the decades, Sony is one of a handful of companies in India that\ncan sell headphones by the thousand. This is thanks to a huge portfolio\nspanning various price ranges, from as little as Rs. 590, going up to Rs.\n41,990.  \nOne of Sony's most popular on-ear models is also one of its cheapest: the Rs.\n990 MDR-ZX110. Boasting Sony's iconic design, the ZX110 is a budget champion\nand one of the best selling personal audio products in India. Can Sony deliver\nat such a low budget? We find out in our review.  \n  \nsony_mdr_zx110_earcup_ndtv.jpg  \nDesign, specifications and comfort  \nThe Sony MDR-ZX110 looks fancy and expensive from a distance, with a\ncombination of matte and gloss finishes on the body that comes across as more\npremium than anything else we've seen at this price. However, up close it\nfeels strictly budget. The plastic is flimsy and bendy, and does not look or\nfeel like it can take too much abuse, so careful handling is advised.  \n  \nThis headset has a rather unique folding mechanism that allows the ear cups to\ntwist inwards, into the headband. This makes the MDR-ZX110 a bit easier to\nstore when not in use. Apart from this, the Sony MDR-ZX110 has 30mm dynamic\ndrivers, with a frequency response range of 12-22,000Hz, 24Ohms impedance and\na sensitivity rating of 98dB. The MDR-ZX110 doesn't have an inline mic or\nremote control, but Sony does sell a nearly identical model, the MDR-ZX110AP\nwhich does, for Rs. 700 more.  \n  \nThe ear cups have very slight padding, which is enough for an acceptably\ncomfortable on-ear fit. The headband has no cushioning, but is designed well\nand feels secure and comfortable in place. The MDR-ZX110 also has a thick,\ntough cable that looks like it can take a fair bit of strain. Past the\nY-splitter, the 1.2m cable splits into two separate and somewhat flat cables\nthat aren't quite as sturdy as the lower half. The design and thickness makes\nthe cable somewhat tangle resistant, and extremely resistant to cable noise.\nOn the whole, apart from the flimsiness, we're happy with how the Sony MDR-\nZX110 looks and feels.  \n  \nsony_mdr_zx110_hinge_ndtv.jpg  \nPerformance  \nWith the Sony MDR-ZX110 being an entry-level on-ear headset, we did most of\nour testing using an Android smartphone. We also tried it with our Fiio X1\nhigh-resolution audio player and a Windows laptop. Focus tracks for the review\nwere BT's Somnambulist, Skrillex and Diplo's To U, and Passenger's Circles.  \n  \nStarting with the bass-heavy Somnambulist, we found that the Sony MDR-ZX110\nhad a meaty sound, with lots of emphasis on low-end attack. The bass can\noccasionally be overpowering, but is usually controlled thanks to the not-so-\ntight fit. The sonic signature has been tuned toward promoting the lows, and\nthis makes for a very warm sound. This also tends to show a bit in the lower-\nmid ranges, but there is a clear sensitivity drop towards the upper end of the\nfrequency range.  \n  \nAds by ZINC  \n  \nsony_mdr_zx110_padding_ndtv.jpg  \nNext, we cued up To U, which despite being a dubstep track, has plenty to\noffer in terms of the mid-range and detail. While the Sony headset is\nimpressive in low-end detail, it seems to trail off going up the range. The\nresult is a sound that isn't quite as open and detailed as we'd like, even at\nthis price. Other products such as the Sennheiser HD180 offer better levels of\ndetail at this price, so the MDR-ZX110 isn't something we'd recommend if\nyou're looking for sonic clarity.  \n  \nFinally, with Circles, we kept our ears open for imaging and soundstaging.\nWhile the Sony offers a full and aggressive presentation in the sound, it\nfalls a bit short in terms of openness and width. The sonic stage feels narrow\nand specific, rather than properly spread out. However, the MDR-ZX110\ncertainly does its bit to make your music immersive and entertaining,\nespecially if you like your headphones bassy and aggressive.  \n  \nsony_mdr_zx110_cable_ndtv.jpg  \nVerdict  \nThe Sony MDR-ZX110 might look good and carry forward the typical aesthetic\nthat makes Sony a popular headphone option, but it falls a bit short in terms\nof build quality. It feels cheap and we were always worried about damage\nduring our time with the review unit. However, it offers an immersive, full\nsound that excels in its handling of bass. Detail and clarity suffer a bit,\nbut bass-heads will not find too much to complain about at this price. If\nyou're looking for a pair of on-ears with serious attack and drive at under\nRs. 1,000, the Sony MDR-ZX110 should be on your wish list.\n\n", "I got the white one..Ordered on 23 Rd Jan Tuesday.. Scheduled delivery time\nwas next Tuesday..But got it on Sunday...  \nThe product was neatly packed in a cardboard box... Inside was the product,\nuser manual and on the box was 1 year guarantee written..  \nGot it in the lightning deal in just ₹550..  \nSince 28th Jan (the receiving date) till today, 1st feb, have faced no problem\nso far.. The sound quality is quite good...  \nAll in all, in such a cheap price, it is a great buy...\n\n", "Pros:  \n\\+ Great sound quality for the price  \n\\+ Light-weight  \n\\+ Affordable  \n\\+ Foldable design makes it easily portable  \n  \nCons:  \n– Glossy plastic finish can get scratches easily  \n– Carrying pouch is not provided  \nBottom line:  \nThe sleek, minimalistic design and elegant colors of the Sony MDR-ZX110 will\nnot only look good but make your music sound a lot better with its 30mm\ndrivers. The wide frequency response can make every note loud and clear\nbringing the music alive. In short, these headphones are a great fit for those\nwho want style and good sound quality together.\n\n", "This headphone is not of worst and also not a very good this is average\nheadphone I use this headphone this headphone is a budget headphone I love\nSony products and I also love this product under 700 rupees headphone wire\nquality was very good very nice wire and no microphone for calling this is the\nbig issue 4 budget headphones and sound quality was an average and bass its\nnot good but average all over well quality is good made by plastic this\nheadphone is average headphone and also budget headphone it's very comfortable\nand easy to carry and nice cushioning And also gold plate it Jack to connect\ndevices you can easily connect to any device like mobile phone iPod and some\nother music devices like PC laptop etc. all over this headphone is average\nheadphone not a very good\n\n", "Probably the BEST headphone at this low budget. I liked this product very much\nbecause even at this price, bass and volume range is Awesome. The ear cushions\nare EXCELLENT and are really comfortable to my ears (they are very very Soft).\nI am fully satisfied with this headphone of Sony at such a low budget. Thank\nyou Amazon for the great offer. And as usual, delivery was also good and on-\ntime.  \nIf you find our review helpful, please give us a 'Helpful' vote below- it\nreally motivates us to provide more such great reviews for you.\n\n", "First of all I want to start my review by taking the price in consideration. I\nbought it for Rs 549. Now there are hardly some quality headphone under Rs\n800. Like Moto Pulse 2, Philips SHL4400/00 and SoundMagic P11s.  \nNow I have used Moto and Philips one. Now comparing it with them. Moto has a\ngood bass but vocals are not crisp and Treble is not so smooth. While Philips\nis a kind of Balanced one. Now MDR zx110A is quiet a complete package. It has\na Punchy Bass, Incredible High and Dipping Low. Vocals are crystal clear. I've\nhave tested all most of the Genre Like Metal core, EDM, Progressive, Classic\nand some others. Leaving EDM all the Genre were extremely good in Sony. While\nMoto triumph the EDM, thanks to the 36mm Driver. But Sony is best n most of\nthe scenario.Now about the build quality, Both of them are made from plastic.\nMoto looks a bit fragile, as the top bar is very thin. And it has only one\nwire, so if the headphone strap breaks, then wire will be damaged. While for\nSony they know how to make Cheap and Durable product. Padding are ambient in\nboth of them, but sony is a bit more comfortable, as the shape of the ear cup\nis circular and not oval like moto.  \nAs its Sony After Sales Service will not be a problem, as their service\ncenters are omnipresent. Nothing left to comment. Just if you want a Headphone\nin good Budget which sounds great, and not giving boasting about Bass. Then go\nfor Sony. Otherwise if you want a Headphone with High Bass and which has MIC\nthen Moto is go to choice.  \nThats all Folks. If you like my review dont forget to hit that LIKE button,\nand show support.\n\n", "Just bang for the buck... U will not get better headphones than this at this\nprice point. I have used other headphones like Phillips dj shl3000 & JBL\nheadphone of this price segment but I was most impressed with this.  \nBass is great, voice and treble are sometimes overshadowed by bass.  \nSo I will recommend to buy this if you are in tight budget and loves rock,\nEDM, rap, metal songs. Otherwise I might be disappointed.  \nAlso the wires are long enough to be used conveniently.\n\n", "HEY HELLO GUYS...  \nI WOULD LIKE TO SHARE SOME HELPFUL INFORMATION ABOUT THE : Sony MDR-ZX110A On-\nEar Stereo Headphones  \n  \n🤔​ MY OPINION :  \n  \n1)Good Points :  \nSony knows that how to made a good headphones...  \nThey made really nice headphones.  \nBuilt quality of these headphone is good according to its price.  \nIt is good to carry because of its \"Swivel folding design\".  \nSound quality is really great & it gives good quality of sound.  \nPrice is also low compare to the other headphones.  \nIt's really nice & perfect budget headphone.  \n  \n2)Bad Points :  \nThere are not much bad points in these headphone but, the thing that\ndisappoint me is, it is not scratch proof.  \nscratches is the big issue for me & I think for other users also...OR they\nalso don't provide any kind of case for the headphone.  \n  \n3)Rating : 4.6/5  \nMY OPINION IS THAT,  \nMUST BUY IF YOU'RE LOOKING FOR THE HEADPHONE FOR THE DAILY USE OR IF LOOKING\nBUDGET BEST HEADPHONE.  \nI ALSO HAVE ONE HEADPHONE FROM THE \"MDR\" SERIES,  \n& THEY ARE REALLY GREAT ...  \nSO MY OPINION FOR YOU GUYS : \"JUST BUY IT\"  \n  \n💳 ABOUT PRODUCT :  \n1\\. What’s in BOX…🎁 ??? :  \nHeadphones  \nGuarantee Cards...  \n  \n2\\. Sound Quality :  \nThe wideband frequency range—spanning 12 Hz to 22 kHz—delivers deep bass, rich\nmid-levels and soaring highs. Hear the detail in every track and stay in-tune\nwith all your music.  \nLightweight 30 mm neodymium dynamic driver units enable the headphones to\ndeliver a punchy, rhythmic response to even the most demanding track. Combined\nwith a highly sensitive diaphragm, you'll be able to turn the headphones up\nlouder—without the need for an amp—and still enjoy clear, precise audio across\nthe spectrum.  \n  \n3\\. Comfort :  \nListen in total comfort. These headphones have a self-adjusting headband and\nsoft cushioned earcups that cover the whole ear. Enjoy the long-lasting\ncomfort you need for listening to your favourite albums back-to-back.  \n  \n4\\. Noise cancellation & sealing the sound :  \nThe closed-back, enfolding design wraps around the ear, helping to seal in\nmusic and keep distractions out. Acoustics are reflected back towards your\nears, so you hear even the subtlest of sounds. You'll also feel every beat, as\nthe closed-back design helps to maximise the bass signatures in your music.  \n  \n5\\. Built Quality & Easy to carry :  \nTake these headphones anywhere you go. The headphones’ swivelling earcup\ndesign enables easy storage when you’re not using them, and enhances\nportability when you’re travelling. The earcups swivel flat, so you can pack\nthem into a suitcase or a bag without worrying about them taking up too much\nvaluable space.  \n  \nHOPE SO THIS REVIEW IS HELPFUL FOR YOU GUYS...  \nENJOY YOU'RE PRODUCT...!!!\n\n", "Don't buy, the cable is too short. If you keep your CPU on the table only then\nit will work. If you keep your CPU under the table then it will not reach your\nears. Why do these stupid people give such a short cable? I am doubtful if\nthis is real Sony product...! See the short length of this headphone cable in\nthe photograph.\n\n", "Sony MDR-ZX110 Review  \nWhen it comes to name recognition and market reach, few audio manufacturers\ncan match the Sony's capabilities. Using a brand name that has been carefully\nbuilt up over the decades, Sony is one of a handful of companies in India that\ncan sell headphones by the thousand. This is thanks to a huge portfolio\nspanning various price ranges, from as little as Rs. 590, going up to Rs.\n41,990.  \nOne of Sony's most popular on-ear models is also one of its cheapest: the Rs.\n990 MDR-ZX110. Boasting Sony's iconic design, the ZX110 is a budget champion\nand one of the best selling personal audio products in India. Can Sony deliver\nat such a low budget? We find out in our review.  \nsony_mdr_zx110_earcup_ndtv.jpg  \nDesign, specifications and comfort  \nThe Sony MDR-ZX110 looks fancy and expensive from a distance, with a\ncombination of matte and gloss finishes on the body that comes across as more\npremium than anything else we've seen at this price. However, up close it\nfeels strictly budget. The plastic is flimsy and bendy, and does not look or\nfeel like it can take too much abuse, so careful handling is advised.  \nThis headset has a rather unique folding mechanism that allows the ear cups to\ntwist inwards, into the headband. This makes the MDR-ZX110 a bit easier to\nstore when not in use. Apart from this, the Sony MDR-ZX110 has 30mm dynamic\ndrivers, with a frequency response range of 12-22,000Hz, 24Ohms impedance and\na sensitivity rating of 98dB. The MDR-ZX110 doesn't have an inline mic or\nremote control, but Sony does sell a nearly identical model, the MDR-ZX110AP\nwhich does, for Rs. 700 more.  \nThe ear cups have very slight padding, which is enough for an acceptably\ncomfortable on-ear fit. The headband has no cushioning, but is designed well\nand feels secure and comfortable in place. The MDR-ZX110 also has a thick,\ntough cable that looks like it can take a fair bit of strain. Past the\nY-splitter, the 1.2m cable splits into two separate and somewhat flat cables\nthat aren't quite as sturdy as the lower half. The design and thickness makes\nthe cable somewhat tangle resistant, and extremely resistant to cable noise.\nOn the whole, apart from the flimsiness, we're happy with how the Sony MDR-\nZX110 looks and feels.  \nsony_mdr_zx110_hinge_ndtv.jpg  \nPerformance  \nWith the Sony MDR-ZX110 being an entry-level on-ear headset, we did most of\nour testing using an Android smartphone. We also tried it with our Fiio X1\nhigh-resolution audio player and a Windows laptop. Focus tracks for the review\nwere BT's Somnambulist, Skrillex and Diplo's To U, and Passenger's Circles.  \nStarting with the bass-heavy Somnambulist, we found that the Sony MDR-ZX110\nhad a meaty sound, with lots of emphasis on low-end attack. The bass can\noccasionally be overpowering, but is usually controlled thanks to the not-so-\ntight fit. The sonic signature has been tuned toward promoting the lows, and\nthis makes for a very warm sound. This also tends to show a bit in the lower-\nmid ranges, but there is a clear sensitivity drop towards the upper end of the\nfrequency range.  \nsony_mdr_zx110_padding_ndtv.jpg  \nNext, we cued up To U, which despite being a dubstep track, has plenty to\noffer in terms of the mid-range and detail. While the Sony headset is\nimpressive in low-end detail, it seems to trail off going up the range. The\nresult is a sound that isn't quite as open and detailed as we'd like, even at\nthis price. Other products such as the Sennheiser HD180 offer better levels of\ndetail at this price, so the MDR-ZX110 isn't something we'd recommend if\nyou're looking for sonic clarity.  \nFinally, with Circles, we kept our ears open for imaging and soundstaging.\nWhile the Sony offers a full and aggressive presentation in the sound, it\nfalls a bit short in terms of openness and width. The sonic stage feels narrow\nand specific, rather than properly spread out. However, the MDR-ZX110\ncertainly does its bit to make your music immersive and entertaining,\nespecially if you like your headphones bassy and aggressive.  \nsony_mdr_zx110_cable_ndtv.jpg  \nVerdict  \nThe Sony MDR-ZX110 might look good and carry forward the typical aesthetic\nthat makes Sony a popular headphone option, but it falls a bit short in terms\nof build quality. It feels cheap and we were always worried about damage\nduring our time with the review unit. However, it offers an immersive, full\nsound that excels in its handling of bass. Detail and clarity suffer a bit,\nbut bass-heads will not find too much to complain about at this price. If\nyou're looking for a pair of on-ears with serious attack and drive at under\nRs. 1,000, the Sony MDR-ZX110 should be on your wish list.  \nPrice (MRP): Rs. 990  \nPros  \nComfortable on-ear design  \nGood low-end response  \nSturdy cable  \nFull, exciting sound  \nCons  \nFlimsy build  \nWeak mids and highs  \nRatings (Out of 5)  \nDesign: 3.5  \nPerformance: 3.5  \nValue for money: 4  \nOverall: 3.5\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 24 January 2017", "on 3 February 2018", "on 7 December 2017", "on 30 June 2017", "on 23 November 2017", "on 17 September 2017", "on 7 January 2018", "on 10 December 2016", "on 21 February 2018", "on 14 November 2016"], "reviewer": ["ruchika(niku)", "Debangana G.", "Somanth Geddam", "ASHISH PANDEY✔", "Top 5 Originals", "Prabir Sur", "Kanhaiya", "THE AK", "sanoshin", "Harshit Bhatia"]},
{"rating": ["4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Awsome😎😎", "packaging is terrible. before i offer it i decided to return ...", "Adorable headphones", "Good product form sony witha an excellent sound quality", "Excellent Bass............", "Not too Good..", "Super jii", "GET it today. FIRST: it s a CHINA ...", "Best stereo headphone in this range", "Bad Experience"], "review": ["I would luve to give this headphone 5 stars , only if it had a microphone. But\notherwise sound quality is superb& audio is sharp, if you carry your phone in\nyour pocket and listen songs, then its your go to choice because its jeck is\ndesigned espicalily for versatility.\n\n", "got it at rs 549.packaging is terrible.once i openedr it i decided to return\nit so that's a thumbs down. After i opened i somehow decided to keep\nit,considering price  \nThe sound quality is good, bass is better then sennheiser hd 180. but clarity\nand treble is better in sennheiser. wire is very long in sennheiser but sony\nwire is great. both the wire is not very durable.\n\n", "What many person don't understand - a good ear phone or speaker have their\nprurpose. Like if you want to play it in bar or maddening house party or just\nfor personal use. Headphones are for personal use and this SONY MDR-ZX110A\nworks fantastic when you love hearing sound with proper balance and good\ntuning. Don't just look for bass. Bass is just optional enhancement. The most\nessential features is when you can hear all sounds with equal clarity with\nsame precision and accuracy. It balances everything. Good for listening songs\nand best if you wear these headphones while watching movie.\n\n", "Guys thus sony MDR ZX110A is best headphone with an amazing sound quality.\nBass is not much but the sound quality which provide is supper.  \nWhen you watch movies with this headphone you might feel that the sound is a\nlittle bit low, yes it is a little bit low and also have a low amount of bass.\nBut the quality of the sound is super. When you listen music with this one you\nfeel much better because the it will provide a excellent sound quality with\ndecent amount of bass. The quality of the sound is really great you can hear\nevery detailed sound.  \nYes this is not for bass lovers but it is for one who listen sound in quality.  \nGut guys every headphones have its own problems. Like philips, jbl, Motorola..\netc.  \nAnd considering this price i think this is a best headphone. Because i get\nthis product for 549 rupeed so it's half of one thousand.  \nFirst i plan to buy philips headphone  \nBut i faced some problems while adding it to cart so i made up my mind and\npurchased sony with out much bothered about the prose and cones. Because i\ntrust in sony brand.  \nWhen you have a headphone which named SONY it will never disappoint. And it\nwill give you a proud in center of a crowd. Thit is the power of sony brand.\nThe style ths provide by this one is awsome stylish look with foldable option.\nSo guys if you love to buy a sony product with out bothered much about the\nprose and cones. And if you want headphone which provide a good quality sond\ndefinitely go for it\n\n", "Original Sony headset. Actuary the selling price normally is 649 Rs only, so\npeople consider buying this gadget only if it is less than 600 Rs. I bought\nthis beast at around 501 Rs. Also there is One year Sony warranty. I hope this\nproduct wasn't available less than this price to my knowledge.  \n  \nPros:  \n* Sony logo on the headset.  \n* Excellent bass  \n*With 1 year Sony warranty.  \n  \nCons:  \n*Mic not available\n\n", "It doesn't have a Microphone, please be aware of that...  \nBetter to go for Ear phones because of inconvenience..  \nJust OK product..\n\n", "Been 6 months but nothing has stopped me in listening music, tq u Sony for the\nawesome product and as always tq amazon for delivering my crown to me...\n\n", "GET it today. FIRST : it s a CHINA product . SECOND : model is ZX110 not\nZX110A. THIRD : THERE IS NO ANY LEBEL ABOUT IT ON THE PRODUCT BODY , ONLY\n\"SONY made in china .\" FORTH : GOOD by PREMCHAND\n\n", "Best stereo headphone in this range.  \nThere is no defect at all.  \nGo for it.  \n1\\. Light weight  \n2\\. No pain in ear  \n3\\. Sound is very good.  \nI hope it will help you to buy this product.  \nOfcourse it is made in china but you know that if we are on Earth we cannot\nlive without Oxygen. Today we cannot be separate ourselves from Chinese\nproducts\n\n", "My friend had bought same headphones. I listened them and their voice is very\ngood. Bass experience was also very good. But when I bought them Its sound\nquality was very bad. It looks like someone used them before. Also the packing\nwas not proper. It just packed in cardboard box. While I am uploading proper\npacking picture.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 December 2017", "on 10 October 2017", "on 16 May 2017", "on 24 October 2017", "on 19 August 2017", "on 17 March 2018", "on 15 February 2018", "on 7 October 2017", "on 17 September 2017", "on 13 October 2017"], "reviewer": ["AKOIJAM A.", "Avijit Roy", "Shubham sanyal", "Anoopcbose", "Arun", "Harish J", "Amazon Customer", "Amazon Customer", "Amit Chaudhary", "Raman Garg"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Excellent Product.", "Amazing product in 500 price range", "Five Stars", "Very good product.", "The Audio quality is awesome and Price Rate is very Chep", "Best sound quality and look according to its price", "Four Stars", "Sony MDR-ZX110A Headphone Unboxing and Review", "Good one with low budget, good sound quality not one of the best", "Just WOW!!!!!"], "review": ["Excellent Product & the sound quality is unexpectedly very good, the only\nthing i find troublesome is u cannot use it while workout coz it ll slide off.\nIt is very handy u can travel or take it with u anywhere u want, at this price\nthe product quantity is really good. You can't expect more in this price\nsegment.\n\n", "I am giving 5 stars. I am writing this review after using it.lets discuss Pros\nand Cons points wise.  \n  \nPROS :-  \n1) It is comfortable, and stylish.  \n2) Its a long lasting product ,material used is very good.  \n3) Sound is superb, you can feel the music.  \n4)As you know it's from Sony so it will not disappoint you.  \n5) price is reasonable, I bought it in lightning deal in 501 Rs only.  \n6) As they have already mentioned that this product is not coming with mic. So\nyou can listen the phone call but can't respond.  \n7) you can easily fold this headphones.  \n8) if you are waiting for this price range headphones then must go for it.  \nCONS : No  \n  \nIf you feel my review help you in making decision to purchase the shoe ,then\nplease click on helpful under this comment. I will be thankful.  \nFor any other query feel free to contact me on my email id -\nss4u89cool@gmail.com\n\n", "i got this product at 499 and it is good product\n\n", "First lets talk about the look of the headphone . Look wise it is a good\nproduct shiny white color suits the design. Speaker base is national. The flat\ndesign at the speaker base give a good touch to the product .  \nNow. The sound it produce is amazing . You can actually lost in its sound. It\nfeels relaxed when I hear music in it. It gives a good sound quality with good\nnoise cancelation.it produce a good bass and I love it.it comes with 3.5mm\naudio jack so it fits every device . But one thing which I think it lacks, is\nthe volume control button.  \nOverall it is a very good product on such an affordable cost. I personally\nrecommend you to buy this product as I am using it and enjoying my music\nlistening time.\n\n", "The Audio quality is awesome and Price Rate is very Chep...  \nAnd As Aspected From Amazon Alwaze gives Early Delivery that's Another Best\nthing From Amazon.  \nI Use This Since Last four Day But It does not give Any kind of Problems.  \nVery Best Product For Daily Use.  \nBut If Your Are Bass Lover so it does not for you.\n\n", "I was uing this headphons before. In which left speaker has stoped working. I\nbought this again because if any foult occurs in it again then, I can repair\nit by using old headphone's parts. It is budgetfriendly and gives much\nsatisfaction as per its price. & yes it is mad in china, but it is original\nproduct (with barcoad no.). It's wire is also good in quality. My same old\nheadphone has stoped working in 1 year (left speaker has gone).  \nPrepaid on any product in amazone has much fast delivery then COD.\n\n", "very good\n\n", "\n\n Sony MDR-ZX110A On-Ear Stereo Headphones (White)  \nSony is a king as far as the brands in music are concerned. However, their\nZX110A budget headphone without mic is awesome in sound but very friendly on\nthe pocket. It comes at less than ₹700 but packs a dynamite. If you need\nsomething inexpensive yet branded for listening to music and watching movies\nthen this is it.\n\n", "Not that much good as I expected. The sound quality is not the best - looks\nlike you have got a duplicate product. Yet it serves good as it costs, so 4/5.\nThe joints are so fine, so should be handled with care. Sometimes it looks\nlike those joints may get broken anytime. The wire should have more length. I\nam not telling you all the other specifications and good things, you can check\nthat online. Special price Rs. 599, Diwali Season.\n\n", "Very Good Product by Sony. Good quality sound. Base is adequate. Sound is a\nlittle bit low for my smartphone but for laptop sound is very great and high.\nI love the tangle free wire (Very Good quality),pretty design,very comfortable\nand crystal clear sound. I read many bad reviews before buying but after\nbuying I found them totally wrong. I am loving It. Go for it.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 February 2018", "on 19 August 2017", "on 24 January 2016", "on 28 September 2017", "on 29 January 2018", "on 8 September 2017", "on 2 December 2017", "on 19 November 2017", "on 17 October 2017", "on 25 November 2017"], "reviewer": ["Kunal Mazumdar", "Sanjit", "gurdit", "Arpit", "Krunal Makwana", "Dhruv Rudani", "Amazon Customer", "Mandeep Sahni", "MD. AMIR", "Amazon Customer"]},
{"rating": ["3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["No Box? No warranty card?", "Excellent for the price", "Best Bass Music \"Headphone\" under 1k i wud say although the sennheiser Cx180 is better", "Amazing Sound Quality. Highly Recommended", "Good for rate in offer", "This product is worth every penny being spent!! Amazing product. True Value for money.", "A steal for the price", "Left side works but not the right one!", "Poor product from Sony", "Wow.. too good"], "review": ["This just came like this today, it was in plastic pouch, was not even In the\nSony box. And there's not even warranty card or something. Sound is good\nthough,... And headphones looks new. (Not used). So I'm pretty happy. I got\nthese for 649, so let's see how much it works.\n\n", "Arrived on time.  \nI was very sceptical about these headphones first looking at the price. I got\nthe deal at 500₹.  \nThese really do deliver a good performance to price ratio. The bass is just\nawesome. The treble notes are not very audible and can be adjusted with\nequalizer. The cups don't flip but fold inside in a compact fashion which is\ngood.  \nI'd suggest anyone who is looking for a budget headphones without mic. to go\nwith these.\n\n", "Amazing sound.... Extreme Bass for all the Bass lovers out there..... Great\nsound output...really comfortable ...what elese do u huys want me to say ?Just\nget it its just 500 bucks...no further dicussions to be made... Although the\nSennheiser CX180 has better highs, this has the Bass that wud easily win ur\nHeart !!\n\n", "Very Good Quality and Handy Headphone. Foldable and Easy to carry. SONY always\nprovides Quality Products so, No second thought and Purchased it. It is\nComfortable and Amazing Sound Quality also. Received it's box in damaged\ncondition but Product inside was Alright so, I am totally satisfied. Highly\nRecommended.\n\n", "Good product but i want little bit more if it is a real sony brand's product.\nBase is good but not as i thought.Sound quality is good but some problem i\nseen in some kind of music\n\n", "This product is worth every penny you spend on it. At this price range, the\nsound quality it offers is exceptional. The trebles and the bass are well\nbalanced. You can hear the rhythm of every vocals and instruments. I read some\nreviews that bass is not good and sound creaks sometimes. Well guys, What more\nyou want from a ₹600 headphone? For those who want more bass they can use a\ngood equalizer from playstore and enjoy bass boosted sound.And regarding the\ncreaking sound there may be several reasons three of them are,  \n1) The product you received my be a damaged one. (I think you'd know what to\ndo next! Simply replace it!)  \n2) The audio jack of the device you're using may be damaged. (Change device or\nuse different one!)  \n3) The sound quality of song is terrible. (Now, you can't listen a 90kbps song\nand complain it's creaking! I recommend to use 190/250 or 360kbps at best!)  \n  \nAnd many people also complain that the sound coming from headphones is not\nloud. Regarding this I would say that the loudness of the sound depends on the\ndriver of device you're using. Simply put PCs have powerful sound card and\nMobiles ain't much powerful. So that's obvious that on pc it would sound\nlouder. (In mobiles too loudness of sound varies from phone to phone)  \n  \nNow comes the build quality. The build quality of these headphones is also\ngood, but it would have been better. Even tough with this build it should last\nfor at least 1 to 1.5 years. And its obvious that it won't even last a week if\nyou're swinging them around whenever you're carrying them!  \n  \nSo my final verdict on Sony MDR ZX110A headphones is that, if you are on tight\nbudget and want to enjoy quality sound and build at a low price then this\ndevice is surely for you. Don't over think guys just go for e'm!  \n  \n*FINALLY I ALSO READ THAT THE PRODUCT MENTIONED HERE IS OF MODEL zx110a AND WHEN THEY OPEN THE BOX ON THE INSTRUCTION MANUAL AND ON HEADPHONES ITS WRITTEN AS ZX110 WITHOUT \"A\" IN IT. CHILL GUYS ZX110A AND ZX110 ARE BOTH ONE AND THE SAME PRODUCTS.. FOR EG: IN SOME COUNTRIES IT'S BEING SOLD AS ZX110NC OR ZX110N. SO THEY ARE ALL THE SAME! SIMPLY PUT FOR THE PRICE ITS BEING OFFERED THIS PRODUCT IS AWESOME!!!\n\n", "These headphones are a steal for the given price.  \nSony has hit the right chord with this I have been using this for around 2\nWeeks now and they work flawlessly the sound is pretty amazing.  \n  \nYou can use it for long times without any problems and they adjust\nspectacularly on your hear the flexible headband is more than what one can ask\nfor.  \nThe cable is strong so don't worry if it gets pulled or damaged a bit it's\nhardwired and you'll not face any problems while running or doing workouts.  \nEarcups are very comfortable and will give no problem during prolonged usage\nhours.  \n  \nIf you liked the review please vote helpful\n\n", "So bad.. at 1st it's ok but after sometime it's not working properly, not only\nmine but many products under this model.. better consider any other. The rate\nof being not working is more in this product model.\n\n", "These headphones broke after a couple of weeks Of usage. Also the broken\nearpiece doesn't work anymore so even if I glue it on it will be of no use.\nPoor product from Sony. Pls avoid. I have uploaded pictures for reference.\n\n", "Good sound quality, comfortable on ears. I love the way you can fold it. It's\nan awesome feature. I had 2-3 JBL and other headphones earlier and they were\nbroken because of this (I am not denying my fault as well). Now with this you\ncan put it in a bag or on a table in a safer way. I love the color and the\nlook as well. Totally recommended\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 January 2018", "on 27 September 2017", "on 1 January 2018", "on 16 January 2018", "on 26 February 2018", "on 28 July 2016", "on 30 April 2017", "on 18 February 2018", "on 2 October 2016", "on 3 October 2017"], "reviewer": ["Roh", "Afiya Q.", "Amazonian", "Vipul", "Sanjib D.", "Ajinkya Bhede", "Akshat", "jaswanthrock", "Vijay", "Avinash Tiwari"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Good HeadPhone... But Not BEST [CAN BUY...OR GO For JBL/Seisanheir Headphones]", "One of Best Headphone in this price Segment", "Value for money..Good quality music experiance", "not looks genuine", "Sony as usual.. a big thumbs up!", "It has very good quality. I took one from amazon and after ...", "9cc", "branded @cheap rate", "One Star", "Best for the price. No comparison."], "review": ["I brought this product from offline market and it performing well till now.  \n  \nits a very good headphone and looks a stylish with a frequency response range\nof 12-22,000Hz, 24Ohms impedance and a sensitivity rating of 98dB. Ear cup has\nslight padding which could be uncomfortable when used for a ling time. Cable\nis thick and tough and its length is almost 1mtr.  \nI Found that the it has a meaty sound, with lots of emphasis on low-end\nattack. The bass can occasionally be overpowering, but is usually controlled\nthanks to the not-so-tight fit.  \n  \nIts good headphone you have to slightly compramise on Mid and High... But low\nits very good\n\n", "One of best on ear headphone in this price segment.  \nSound Quality is Above Average.  \nSimple design & Light weight.  \nAnd most importantly, branded company headphone.\n\n", "Personally check it all my and friend mobiles in FullHD 1080p videos and high\nend 320kbps songs...  \n  \nPros:  \n1.good sound  \n2.clear bass and clear music deatails  \n3.foldable design..  \n4.ear cuff fits very well..  \n5.light weight and adjustable..  \n  \nCons:  \n1.folding was little bit tricky..  \n2.mic nil(no) (see in product details)  \n3.this headset sound quality was different in various mobile models..  \n  \ni. High end mobiles give full effects and higher volume sound..great Bass and\nsurrounding effects  \n  \nii. Middle end mobiles give good clarity and medium bass.. Some mobiles gives\nlow sound volume..  \n  \niii. Low end some mobiles give mixed effects and low bass another low end\nmobiles gives low sound volume  \n  \nChecking mobile list below..  \nXiomi redmi 2, xiomi Mi4, lyf flame 4, lyf wind 7, lyf water 1, lyf water 10,\nmicromax bolt, lenovo a6000 plus, lenovo k5 plus, samsung on5 pro, samsung on7\npro, samsung j7nxt, htc one E8, LG G4, xperia xa ultra, Xperia Z2, zopo ,\nmotorola g4\n\n", "the product doesn't seem genuine in the box there it has printed Sony MDR-\nZX110A but in the item there is only written Sony MDR ZX 110 also the bar code\nof the box and the product inside are different it looks like a copy of sony\nproduct\n\n", "Amazon never ceases to amaze me.. Good packaging. But not satisfied with the\n'prime' delivery system..  \nComing to the product, Sony is by far the best brand when it comes to pure\nblissful music enjoyment. This headphone is quite good. One simple thing I\nwant to say.. About this product is - it gives clear, bass enhanced music\nquality. Overall. . One won't be disappointed to own this at such a great\nprice!\n\n", "It has very good quality. I took one from amazon and after 2 to 3 months it\ngot one side audio problem. Sound was coming from one side and not from the\nother side. Gave it in sony care. They replaced it. And from the old one the\nsound was not coming very amazing but from the new one it is coming\nincredible. Best in price and quality !!\n\n", "Value for money product\n\n", "I am already using this headphone from long time. It is very ligjt weight and\nsound quality is good. Best of it is foldable...can be carried\neasily...coushon is of little bit teary after regular use...I got it @450 and\nis a nice deal.\n\n", "very poor quality they rrr give me old product  \nnow i will not buy frm amazn wtf\n\n", "Arrived on time. No damages.  \nHeadphones are decently good for the price. Comes with a manual in a cardboard\nbox. No case provided. Audio clarity is amazing at this price range. Doesn't\nhave volume rocker on the headset.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 July 2017", "on 7 January 2018", "on 11 February 2018", "on 25 September 2017", "on 11 September 2016", "on 23 December 2017", "on 24 March 2018", "on 4 October 2017", "on 18 January 2018", "on 21 October 2017"], "reviewer": ["Devdatt D", "shaikh sfa", "pravinKumar", "Amazon Customer", "DeeZ", "Amazon Customer", "Sayan Koley", "Amirul Islam", "SWAPNIL BANERJEE", "Amazon Customer"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Better not to but it the original Sony MDR ZX110A ...", "Great sound quality at a cheap price!", "So i purchased JBL C300SI On-Ear Dynamic Wired Headphones awesome headset (link http", "Not bad", "Sony headphone.", "Great Headphones At Below Rs:999/-", "Sony MDR-ZX110 Review", "... written on box bother me but the product is good according to the price", "This headphone is very good and good quality of sound is produce I am ...", "Loved it :)"], "review": ["Mene socha ki logon ne mzaak m esse reviews likhe honge but they were right !!\nThis Sony is fake I'm telling you not to buy it !! My cousin bought it from\nthe authorised Sony store but the outer box was completely different from\nthose I got !! I got them in brown cardboard box with h Sony sticker on it !!\nBetter not to but it the original Sony MDR ZX110A doesn't come with that kind\nof outer packing and also THERE IS NO WARRANTY CARD! which clearly shows that\nit's fake because in original ones they have written clearly that this\nwarranty card is provided from the authorised Sony product seller only !!! And\nin the instruction pallet the model no. Is only MDR-ZX110 where as the\noriginal ones is MDRZX110A!!\n\n", "Please hit the helpful button if you find the review to be helpful! It helps a\nlot guys....  \nHere is the detailed review of the headphones!  \n  \nDESIGN :  \nThese headphones have a swivel design and this makes it incredibly portable.\nIt is constructed into an ergonomic and intuitive form, which makes the cups\nfoldable so you can fit it anywhere. Easy to carry around with you.  \n  \nCOMFORT:  \nIt feels like any other In-Ear Headphone but the good thing is that it does\nnot get uncomfortable after hours of usage. Music lovers rejoice! It is light\nweight ( 120 grams) and does not feel heavy. Soft padding is also provided to\nenhance comfort.  \n  \nSOUND QUALITY :  \nThis is arguably the most important aspect of a headphone. For this price, it\nprovides a decent experience and you should surely grab it under the lightning\ndeal. It delivers high quality audio with deep bass and clear treble.  \n  \nSome pros and cons of this headphone are listed below :  \n  \nPROS  \n+Great sound quality at cheap price  \n\\+ Light weight  \n\\+ Affordable  \n\\+ Foldable design which makes it portable  \n  \nCONS:  \n\\- Can scratch easily  \n\\- No carrying pouch is provided  \n\\- Padding could have been better  \n  \nI hope I helped you. Have a nice day!\n\n", "Recently i have purchased this product after 2 months ear buds part totally\ndamaged so i can't able to adjust the head set properly and sound range is\navg. So i purchased JBL C300SI On-Ear Dynamic Wired Headphones awesome headset\n(link http://amzn.to/2yvlYon) having best built quality with low noise level.\nso i highly recommend to you to purchase that one.\n\n", "Sir,  \nThis product is not working properly  \nAs it is under warranty please do the needful ASAP.  \nMy contact number is 8767450954  \n7977387051\n\n", "Wire - best quality  \nJack -gold colour  \nComfort- very comfort  \nBass-very good for a good phone bass doesnot only depend on the head phone but\nboth the phone and the headphone together if the bass of your phone is good\nthen it will give good base event with the cheapest head phone.  \nIf you want the cheap sony head these is the only one I found for music and\nmovies only not for calling.  \nThankyou  \nI have add two new photo after 5month it is still look like new .  \nI add these new photo to tell the truth that the cusion doesnot get torn even\nI use every day.\n\n", "I normally write reviews on products after at least 3 months of usage.So let's\nbegin,  \n  \nWhat's Inside The Box :  \nJust The Headphone And A User Manual.  \n  \nHow Comfortable Actually It Is :  \nAs Expected You Can Listen Songs Or Whatever Using This Headphone 2-5 Hours\nWithout Any Pain On Your Head Or On Your Ears.But It Became Uncomfortable When\nYou Try Sleep On A Bed Wearing This,Because Its A Over The Ears Headset.It Is\nFairly Light Weight And When You Hold It In Your Hands You Should Feel A Good\nQuality Texture And Good Built Quality.  \n  \nLet's Talk About It's Bass And Should Quality :  \nThe Bass Is Really Good,And You Can Easily Compare It With Any Other\nJBL.Treble Is Average,You Can't Complain This Cause Of It's Price.Based On My\nExperience When You Listen A Song Using This Headphone You Should Feel A Great\nQuality Audio.  \n  \nFinal Words :  \nYou Can Blindly Buy This If You Are Not A Heavy Gamer And Love To Listen\nSongs,Actually It's A Best Product At This Price Range.  \n  \nLast But Not Least,If Found My Review Helpful Take A Moment And Thank Me By\nVote This Review Helpful.Thanks :)\n\n", "The Sony MDR-ZX110 might look good and carry forward the typical aesthetic\nthat makes Sony a popular headphone option, but it falls a bit short in terms\nof build quality. It feels cheap and we were always worried about damage\nduring our time with the review unit. However, it offers an immersive, full\nsound that excels in its handling of bass. Detail and clarity suffer a bit,\nbut bass-heads will not find too much to complain about at this price. If\nyou're looking for a pair of on-ears with serious attack and drive at under\nRs. 800, the Sony MDR-ZX110 should be on your wish list.  \n  \nPros  \n1\\. Comfortable on-ear design  \n2\\. Good low-end response  \n3\\. Sturdy cable  \n4\\. Full, exciting sound  \n  \nCons  \n1.Flimsy build  \n2\\. Weak mids and highs\n\n", "The 'made in China' written on box bother me but the product is good\n(according to the price), bass in not great but good, sound quality in nice,\ncomfortable and fits nicely. Earpads are not so good and looks cheap.  \nNow the thing I don't like at all is the packaging it came in a cardboard box\nwith no bubble wrap just the headphone inside it, and the box was partially\ncrushed and damaged, fortunately the headphones are in working condition. The\npackaging are like getting worse and worse with every purchase with Amazon.\n\n", "This headphone is very good and good quality of sound is produce I am see this\nheadphone to my friend. Quality of this headphone are given below :-  \nEarphones with a user-friendly design and a life-like rhythmic reaction can be\na great accessory for music enthusiasts. The feature-packed Sony MDR-ZX110A\nStereo Headphones come with a responsive diaphragm that helps in delivering\ncrisp, clear and precise audio, effortlessly. These MDR-ZX110A Stereo\nHeadphones are lightweight and manufactured tactfully with a folding design.\nThis particular design helps in storing them easily in your handbag or\nbackpack while you are travelling.  \n  \nEnclosed Back, Wide Frequency Range  \nThe MDR-ZX110A Stereo Headphones come with enclosed design and can be wrapped\neasily around ears, leading to a distraction-free sound. Also, acoustics will\nbe reflected back to your ears and you will be enabled to hear a detailed\naudio. Enfolded back design also helps in maximizing the bass balance in\nmusic, so that you are able to hear every beat clearly. The frequency range of\nthe MDR-ZX110A Stereo Headphones is 12Hz to 22kHz, delivering a deep bass and\nelevated sound quality.  \n  \nCushioned Earpads and Other Features  \nUsually, music lovers like to complete their everyday tasks, with earphones\non. That is why, it is important listen with total comfort. The MDR-ZX110A\nStereo Headphones come equipped with self adjusting headband and cushioned\nearpads. This type of earcup covers your entire ear without leaving any room\nfor uneasiness or irritation. With such kind of comfort, you can spend a whole\nday listening to your favorite tracks back to back. Additionally, these\nearphones come ready with 30mm dynamic driver unit and neodymium magnets that\nhelp in delivering clear and powerful audio.  \n  \nFeatures & details  \n30mm dynamic driver unit for clear sound  \nHigh energy neodymium magnets deliver powerful sound  \nSlim, folding design for easy portability  \nPressure relieving earpads for extended comfort  \nWarranty: 1 Year\n\n", "Amazon says its 110A but I recieved 110? Anyways...I loved this product...I\nwas afraid of getting defected one but I got the perfect one(thanks amazon)!\nWell these headphones have a really good sound quality...but the bass is not\nsatisfying. but may b you should go for it at such a low price :)\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 2 November 2017", "on 4 October 2016", "on 7 October 2017", "on 22 July 2017", "on 29 November 2017", "on 25 February 2017", "on 25 September 2017", "on 28 January 2018", "on 18 February 2018", "on 12 August 2017"], "reviewer": ["Rabia", "Mehak Sachdeva", "Amazon Customer", "Amazon Customer", "khrawborlang ryngkhem", "Vishal", "Sanchit Singh", "Anurag", "Himanshu Kashyap", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Best in this range", "Amazon and Sony Rock's", "Best in price", "Value for money", "Awesome product", "Five Stars", "Good for the price", "Nice product.", "Good quality and genuine product but Sony service centre didn't accept the warranty of the product from Amazon.", "Broke within a month"], "review": ["This product is worth every penny you spend on it. At this price range, the\nsound quality it offers is exceptional. The trebles and the bass are well\nbalanced. You can hear the rhythm of every vocals and instruments. I read some\nreviews that bass is not good and sound creaks sometimes. Well guys, What more\nyou want from a ₹600 headphone? For those who want more bass they can use a\ngood equalizer from playstore and enjoy bass boosted sound.And regarding the\ncreaking sound there may be several reasons three of them are,  \n1) The product you received my be a damaged one. (I think you'd know what to\ndo next! Simply replace it!)  \n2) The audio jack of the device you're using may be damaged. (Change device or\nuse different one!)  \n3) The sound quality of song is terrible. (Now, you can't listen a 90kbps song\nand complain it's creaking! I recommend to use 190/250 or 360kbps at best!)  \n  \nAnd many people also complain that the sound coming from headphones is not\nloud. Regarding this I would say that the loudness of the sound depends on the\ndriver of device you're using. Simply put PCs have powerful sound card and\nMobiles ain't much powerful. So that's obvious that on pc it would sound\nlouder. (In mobiles too loudness of sound varies from phone to phone)  \n  \nNow comes the build quality. The build quality of these headphones is also\ngood, but it would have been better. Even tough with this build it should last\nfor at least 1 to 1.5 years. And its obvious that it won't even last a week if\nyou're swinging them around whenever you're carrying them!  \n  \nSo my final verdict on Sony MDR ZX110A headphones is that, if you are on tight\nbudget and want to enjoy quality sound and build at a low price then this\ndevice is surely for you. Don't over think guys just go for e'm!  \n  \n*FINALLY I ALSO READ THAT THE PRODUCT MENTIONED HERE IS OF MODEL zx110a AND WHEN THEY OPEN THE BOX ON THE INSTRUCTION MANUAL AND ON HEADPHONES ITS WRITTEN AS ZX110 WITHOUT \"A\" IN IT. CHILL GUYS ZX110A AND ZX110 ARE BOTH ONE AND THE SAME PRODUCTS.. FOR EG: IN SOME COUNTRIES IT'S BEING SOLD AS ZX110NC OR ZX110N. SO THEY ARE ALL THE SAME! SIMPLY PUT FOR THE PRICE ITS BEING OFFERED THIS PRODUCT IS AWESOME!!!\n\n", "Best experience by Amazon as well as Sony bcz the headphone I bought is\ndealiver very fast.This headphone is a a very clear sound and bass was amazing\nit is my first headphone and it is comfortable with all phone, laptops as well\nas computer. And the sound is not going out of headphone. Wire is also long 1\n$1.5 meters\n\n", "Product is awsm ...in this price (550)...its the best headphone ...built\nquality is good ...sound is crystal clear ..bass is loud ... Overall I am\nhappy with it.\n\n", "The cushion pads are very comfortable but the plastic body has a little bit of\ncreaking sound. But to conclude I can say that this is worth buying a budget\nfriendly headphone from Sony.\n\n", "Amazing product got by Amazon if u listen music at max volume their is no\ndisterbance in music because it is crystal clear sound and u get 1 year\nwarranty and they r too much flexible and I confused why u r not buying that\nproduct guys go for it, it's of Sony guys in this price ho n get it now\n\n", "Best in budget headphones.  \nWorks with all smartphone ( eg: REDMI3s )\n\n", "I got this headset during a sale for just ₹549. I would say, this is the best\nyou can get for even price upto ₹800. Noise cancellation is not as much as in-\near headphones. The inner packaging (by Sony) was not at all appealing (see\nthe pictures)\n\n", "Nice product ...u can't get a headphone better den than this one in this\nrange.... Not up to my expectations but wat more u can get in 6-7\nbucks....sound quality is gud but no mic. . So I'm my opinion it's a genuine\nproduct u can go for it...\n\n", "Awesome headphone with decent quality sound.  \nUsing it since a week and it's working absolutely perfect. Cable quality is\ngood and the cups are very comfortable and adjustable. The adjustment of the\near piece is very friendly and easy to carry with any issue of breaking.  \nGenuine product as usual from Amazon and delivery was also on time.  \n  \nThe 1 star is less bcoz the authorised service centre didn't accept the\nwarranty of the product from Amazon. That's really bad to say. So it's typical\nto say of the product goes faulty then whom to contact.?  \nRest all everything is perfect.\n\n", "the headphones worked very well for the first month or so, and then one day i\nplugged them out of my iphone and the little end that goes into the headphone\njack detached! So i was left with headphones that were in perfect condition,\nbut with no plug...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 September 2016", "on 16 September 2017", "on 28 January 2018", "on 26 December 2017", "on 4 September 2017", "on 23 March 2018", "on 21 October 2017", "on 3 October 2017", "on 13 March 2017", "on 9 October 2017"], "reviewer": ["Pulkit jain", "SUNIL KUMAR SRIVASTAVA", "Subhasis jana", "Paulami", "Mamta", "kuldeep", "Varshith", "Jhanvi dogra", "Tanveer", "Chaitali"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["The best the money can buy for cash-strapped fella like me!!!", "Best middle class budget Branded Headphones:", "Sound quality is fine but product is suspicious", "SONY MDR-ZX110A FULL REVIEW", "SO PACK YOUR GEARS AND ENJOY IT.", "Inexpensive headphone with expensive sound", "Headphones at ₹399/-", "A PRODUCT MUST BE LIKE THIS", "Good in price", "Nice Headphone at that Price Range - Good for Music Lovers and Long Time User..."], "review": ["I just don't get it people!! You pay 600 for this pair of phones and expect\nthem to work like some professional audio device that costs 25,000!!! (yes, I\nam talking about some Bose headphones out there). C'mon guys!!! This isn't\nfair. This is entry-level budget headphones and yes, these the drivers don't\ndisappoint. In fact at this price range, it is a steal and complete value for\nmoney. Sure, the quality of the material itself is a little delicate and\nthat's understood considering the price. I am only commenting here because I\nhave read quite a lot of bad reviews here which are misleading the potential\nbuyers. I won't go into the review of the headphones itself as there are\nplenty here. I am more than happy with it. I recently bought a pair of Philips\nPhilips SHP1900/97 Over-Ear Stereo Headphone (Black) and I returned it at\nonce, since it was very uncomfortable for long use, but bought it again as the\nlength of the wire was longer and it was enough for my needs (meaning I can\nnow sit a little farther from my Desktop PC and watch a movie). Now, this Sony\npair is better than that. Bass and Treble are well balanced. Voice is clear.\nL-shaped jack. White looks awesome for my white Asus notebook. More than\nanything, they are very comfortable. Honestly, I just bought this for my\nnotebook only. For the desktop I use Philips, and for my phone I use Amazon\nearbuds.  \nSure, these aren't the best the money can buy, but if you are like, me hard-\nstrapped for cash, (most of my budget goes for buying literature classics from\nAmazon) then buy this. Even if it comes for a year (yes, this has a 1-year\nwarranty) it is worth the penny (I meant rupee)!\n\n", "***Writing this review after using these headphones for a month****  \n  \nJust go and search for a headphone on any of the websites and you would\nencounter this as one among the top recommended ones with lesser cost(I got it\nfor Rs.499.00). If you talk about the cost of the product this is much lesser\nthan few earphones like Sennhieser cx 180 and other. This shows the importance\ngiven by all the customers in purchasing this.  \n  \nConsidering the above, I could confirm this as a hot cake in headphones\nsection. Now, let me give you the pros and cons in a clear way.  \n  \nSound quality: Of course this is the most important reason why we go for\nheadphones over earphones. At the price, this headphones actually does its job\nreally well. I have been using this for last 1 month and I didn't find any\nproblem with this.  \n  \nFor Normal Listeners: This sounds like a God-sent (Majorly taking budget into\nconsideration).  \nFor Experienced Listeners:Can't explain but FEEL the bass at this cheaper\nprice.  \nFor Audiophiles: Pay more and go for better one like Sennheiser HD 202.  \n  \nDesign: This has an amazing design where you could even fold it easily. Never\nfeel so heavy and portable too with huge comfort. This weights around 110\ngrams which is very easy to carry.  \n  \nOn ear experience: This is the first headphone where I felt a great comfort\neven after using it for hours.  \n  \nHere are the top points of both pros and cons.  \nPros:  \n1\\. Less weight- Easy to carry(portable)  \n2\\. Wonderful sound clarity(minimum expectations from sony)  \n3.Less cost  \n  \nCons:  \n1\\. No cover or pouch to keep and carry  \n2.Can get scratches easily  \n3.Plastic feels so sensitive and breakable for rough usage.  \n  \nOverall, This is an affordable best quality headphones from Sony for a middle\nclass who can afford not more than 600 rupees along with Brand Warranty. What\nelse you need for this price. you may use this for an year and then upgrade\nyourself for a higher one.  \n  \nIf you found the review helpful please do press YES. :)\n\n", "Sound quality is fine but product is suspicious.  \nIt looks like I got duplicate.  \nAs you can see in pictures, in headphone picture, the name engraved is MDR-ZX\n110, but the name on website and package is MDR-ZX 110A. I don’t know if this\nadditional A variant exists or not.  \nThe package is shouting fake. Headphone came in generic gray package, instead\nof Sony package 📦 . On the package no manufacturer details are given. Just\nsimple plain box with black and white sticker with Sony written on it.  \nPackage says “made in China” I believe Sony products as made in Japan.  \nDidn’t find any warranty card in the package.  \nIn all I believe I got the fake Sony headphone, but I’m not returning it for\ntwo reasons.  \nFirst, don’t want to go through all the hassle of return process, and second\nthe sound quality is quite a good so I’m keeping it.  \nUsually in non branded headphones, one speaker stops functioning after six\nmonths or year. But it’s good deal for 100 or 200 rupees.  \nFor this I’ve spend 600, so let see how long it lasts.\n\n", "THIS IS NOT A SPONCERD REVIEW  \n=================================  \n-WHATS IN THE BOX-  \n====================  \n1\\. THE HEADPHONES ITSELF.  \n2\\. A USER MANUAL  \n\\-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \n-THE DESIGN-  \n================  \nThe SONY MDR-ZX110A is fully made up of plastic, but the plastic doesn't feel\ncheap as of its price. The headphones gives a nice premium feel, the build\nquality is great, as what should be expected from SONY. the MDR-ZX110A are\nlight weight and very portable and also very comfortable pair headphones,. The\nheadphones also gets folds which makes it easy to carry around, the 1.2m 3.5mm\ncable is also of good quality it not too long neither too short, also the\n3.5mm jack is gold plated which gives nice sound flow firm device to\nsmartphone.  \n\\----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \n\\- SOUND QUALITY-  \n=====================  \nThe sound quality of these headphones are adequate, don't expect them to be\nsound great as they are of SONY brand, the 30mm driver deliver nice sound\nquality, the bass is ok and the treble is also nice, these headphones have\n12Hz to 22KHz frequency response which gives it a nice wide sound stage, the\nmids and the highs are also great of these headphones. the 98 dB/mW\nsensitivity allows powerful playback from several devices.  \n\\---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \n\\- THE COMFORT-  \nThe SONY MDR-ZX110A are a very comfortable pair of headphones. the headphones\nweighs only 120gm which makes them very lightweight, because of the light\nweight design the headphones doesn't feel like bulky while putting it on, the\n30mm ear cups are very soft and very comfortable while wearing, It doesn't\ngets uncomfortable while wearing for long music sessions. The 1.2m 3.5mm cable\nis also great and the 3.5mm jack is also gold plated which makes also very\ndurable.  \n\\---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \n-THE PROS-  \n1\\. GREAT BUILD QUALITY ALTHOUGH ITS MADE UP OF PLASTIC  \n2\\. GREAT SOUND PLAYBACK FOR THE PRICE  \n3\\. NICE BASS AND TREBBLE BUT NOT THAT GREAT.  \n4\\. FOLDABLE DSIGN MAKES THEM EASY TO CARRY  \n5\\. LIGHTWEIGHT DESIGN FOR GREAT COMFORT.  \n6\\. GREAT PRICE  \n-THE CONS-  \n1\\. NO CARRYING CASE INCLUDED  \n2\\. GETS SCRATCHES EASILY  \n3\\. THE PADDING ON THE DRIVERS COULD HAVE BEEN BETTER.  \n\\--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------  \n\\- FINAL VERDICT-  \nThe SONY MDR-ZX110A are a great pair of budget headphones with nice sound\nquality, nice build quality, lightweight design. and great comfort. I can\neasily recommend these headphones to anyone who have a tight budget. And wants\ngreat headphones.\n\n", "HEY GUYS.THIS IS THE DETAILED REVIEW OF SONY MDR-ZX100A ON- EAR STEREO\nHEADPHONES (IN DEPTH).SO PACK YOUR GEARS AND ENJOY IT.....!!!!  \nWhen it comes to name recognition and market reach, few audio manufacturers\ncan match the Sony's capabilities. Using a brand name that has been carefully\nbuilt up over the decades, Sony is one of a handful of companies in India that\ncan sell headphones by the thousand. This is thanks to a huge portfolio\nspanning various price ranges, from as little as Rs. 590, going up to Rs.\n41,990.  \nOne of Sony's most popular on-ear models is also one of its cheapest: the Rs.\n990 MDR-ZX110. Boasting Sony's iconic design, the ZX110 is a budget champion\nand one of the best selling personal audio products in India. Can Sony deliver\nat such a low budget? We find out in our review.  \nDesign, specifications and comfort  \nThe Sony MDR-ZX110 looks fancy and expensive from a distance, with a\ncombination of matte and gloss finishes on the body that comes across as more\npremium than anything else we've seen at this price. However, up close it\nfeels strictly budget. The plastic is flimsy and bendy, and does not look or\nfeel like it can take too much abuse, so careful handling is advised.  \n  \nThis headset has a rather unique folding mechanism that allows the ear cups to\ntwist inwards, into the headband. This makes the MDR-ZX110 a bit easier to\nstore when not in use. Apart from this, the Sony MDR-ZX110 has 30mm dynamic\ndrivers, with a frequency response range of 12-22,000Hz, 24Ohms impedance and\na sensitivity rating of 98dB. The MDR-ZX110 doesn't have an inline mic or\nremote control, but Sony does sell a nearly identical model, the MDR-ZX110AP\nwhich does, for Rs. 700 more.  \n  \nThe ear cups have very slight padding, which is enough for an acceptably\ncomfortable on-ear fit. The headband has no cushioning, but is designed well\nand feels secure and comfortable in place. The MDR-ZX110 also has a thick,\ntough cable that looks like it can take a fair bit of strain. Past the\nY-splitter, the 1.2m cable splits into two separate and somewhat flat cables\nthat aren't quite as sturdy as the lower half. The design and thickness makes\nthe cable somewhat tangle resistant, and extremely resistant to cable noise.\nOn the whole, apart from the flimsiness, we're happy with how the Sony MDR-\nZX110 looks and feels.  \n  \nPerformance  \nWith the Sony MDR-ZX110 being an entry-level on-ear headset, we did most of\nour testing using an Android smartphone. We also tried it with our Fiio X1\nhigh-resolution audio player and a Windows laptop. Focus tracks for the review\nwere BT's Somnambulist, Skrillex and Diplo's To U, and Passenger's Circles.  \n  \nStarting with the bass-heavy Somnambulist, we found that the Sony MDR-ZX110\nhad a meaty sound, with lots of emphasis on low-end attack. The bass can\noccasionally be overpowering, but is usually controlled thanks to the not-so-\ntight fit. The sonic signature has been tuned toward promoting the lows, and\nthis makes for a very warm sound. This also tends to show a bit in the lower-\nmid ranges, but there is a clear sensitivity drop towards the upper end of the\nfrequency range.  \nNext, we cued up To U, which despite being a dubstep track, has plenty to\noffer in terms of the mid-range and detail. While the Sony headset is\nimpressive in low-end detail, it seems to trail off going up the range. The\nresult is a sound that isn't quite as open and detailed as we'd like, even at\nthis price. Other products such as the Sennheiser HD180 offer better levels of\ndetail at this price, so the MDR-ZX110 isn't something we'd recommend if\nyou're looking for sonic clarity.  \n  \nFinally, with Circles, we kept our ears open for imaging and soundstaging.\nWhile the Sony offers a full and aggressive presentation in the sound, it\nfalls a bit short in terms of openness and width. The sonic stage feels narrow\nand specific, rather than properly spread out. However, the MDR-ZX110\ncertainly does its bit to make your music immersive and entertaining,\nespecially if you like your headphones bassy and aggressive  \n  \nVerdict  \nThe Sony MDR-ZX110 might look good and carry forward the typical aesthetic\nthat makes Sony a popular headphone option, but it falls a bit short in terms\nof build quality. It feels cheap and we were always worried about damage\nduring our time with the review unit. However, it offers an immersive, full\nsound that excels in its handling of bass. Detail and clarity suffer a bit,\nbut bass-heads will not find too much to complain about at this price. If\nyou're looking for a pair of on-ears with serious attack and drive at under\nRs. 1,000, the Sony MDR-ZX110 should be on your wish list.  \n  \nPrice (MRP): Rs. 990  \n  \nPros  \nComfortable on-ear design  \nGood low-end response  \nSturdy cable  \nFull, exciting sound  \nCons  \n  \nFlimsy build  \nWeak mids and highs  \nRatings (Out of 5)  \n  \nDesign: 3.5  \nPerformance: 3.5  \nValue for money: 4  \nOverall: 3.5  \n  \nTHANKS FOR READING THIS FULL ARTICLE FOR FURTHER INFORMATION YOU CAN VISIT ON\nOUR CHANNEL \"TECH HARSH TALKS\" THANKS (ONCE AGAIN).\n\n", "**********  \nDESIGN  \n**********  \nThe headphone features a swivel design that folds flat for portability. The\nentire headphone is made out of somewhat cheap feeling plastic, but the glossy\nand circular sides add a nice effect. The headphone jack isn’t gold plated by\nthe way, some of you might care about that.  \nThe construction of the headphone is very intuitive, and you’ll open up the\ncups like…  \nAs you would expect, you can adjust the length of the band to fit your head. I\nfound the range of lengths to be perfect, still with extra length to spare for\nmy head that came with 6′ 1″ body. You can also see that it comes with a\nY-type cord. While I personally prefer a one sided cord for less interferance,\nits tangle-free material makes up for it.  \n  \n*****************  \nEXPERIENCE  \n*****************  \n  \nWhen you put on the headphone, it honestly feels like any other on-ear\nheadphone at first. Its lightweight body doesn’t put any pressure on top of my\nhead, and sits as expected with some padding as you can see. As long as you\ndon’t go running with it, I could see this to last long before wearing out.  \n  \n*********************  \nSOUND QUALITY  \n*********************  \nListening to some pop songs at first left me speechless, and couldn’t believe\nhow such a cheap headphone could deliver the bass and clear vocal I was\nhearing. It sounds quite amazing for its value. The 30 mm driver is able to\nproduce not just noticeable but pleasant bass.  \nIt sounds incredible with rich bass. Maybe I expected much less from an\ninexpensive headphone, but Sony did a great job with this headphone that\ndoesn’t disappoint with its sound.  \n  \n*******  \nPROS  \n*******  \n  \n\\+ Amazing sound for the price  \n  \n\\+ Affordable  \n  \n\\+ Lightweight  \n  \n\\+ Folds flat, easily portable  \n  \n*******  \nCONS  \n*******  \n  \n– Plastic may feel cheap  \n  \n– No carrying pouch or case  \n  \n\\---------------------------------XXXXXXXXXXXXXXXXXXXXXXXXXXXXX-----------------------------------------\n\n", "5/5 Rating Nice Headphones and Cushions are good. Got it at Rs.399/- what else\ndo I need...\n\n", "HEY GUYS  \n  \nThe Sony MDR-ZX110 looks fancy and expensive from a distance, with a\ncombination of matte and gloss finishes on the body that comes across as more\npremium than anything else we've seen at this price. However, up close it\nfeels strictly budget. The plastic is flimsy and bendy, and does not look or\nfeel like it can take too much abuse, so careful handling is advised.  \n  \nThis headset has a rather unique folding mechanism that allows the ear cups to\ntwist inwards, into the headband. This makes the MDR-ZX110 a bit easier to\nstore when not in use. Apart from this, the Sony MDR-ZX110 has 30mm dynamic\ndrivers, with a frequency response range of 12-22,000Hz, 24Ohms impedance and\na sensitivity rating of 98dB. The MDR-ZX110 doesn't have an inline mic or\nremote control, but Sony does sell a nearly identical model, the MDR-ZX110AP\nwhich does, for Rs. 700 more.  \n  \nThe ear cups have very slight padding, which is enough for an acceptably\ncomfortable on-ear fit. The headband has no cushioning, but is designed well\nand feels secure and comfortable in place. The MDR-ZX110 also has a thick,\ntough cable that looks like it can take a fair bit of strain. Past the\nY-splitter, the 1.2m cable splits into two separate and somewhat flat cables\nthat aren't quite as sturdy as the lower half. The design and thickness makes\nthe cable somewhat tangle resistant, and extremely resistant to cable noise.\nOn the whole, apart from the flimsiness, we're happy with how the Sony MDR-\nZX110 looks and feels.  \n  \nPerformance  \nWith the Sony MDR-ZX110 being an entry-level on-ear headset, we did most of\nour testing using an Android smartphone. We also tried it with our Fiio X1\nhigh-resolution audio player and a Windows laptop. Focus tracks for the review\nwere BT's Somnambulist, Skrillex and Diplo's To U, and Passenger's Circles.  \n  \nStarting with the bass-heavy Somnambulist, we found that the Sony MDR-ZX110\nhad a meaty sound, with lots of emphasis on low-end attack. The bass can\noccasionally be overpowering, but is usually controlled thanks to the not-so-\ntight fit. The sonic signature has been tuned toward promoting the lows, and\nthis makes for a very warm sound. This also tends to show a bit in the lower-\nmid ranges, but there is a clear sensitivity drop towards the upper end of the\nfrequency range.\n\n", "Design, specifications and comfort  \nThe Sony MDR-ZX110 looks fancy and expensive from a distance, with a\ncombination of matte and gloss finishes on the body that comes across as more\npremium than anything else we've seen at this price. However, up close it\nfeels strictly budget. The plastic is flimsy and bendy, and does not look or\nfeel like it can take too much abuse, so careful handling is advised.  \n  \nThis headset has a rather unique folding mechanism that allows the ear cups to\ntwist inwards, into the headband. This makes the MDR-ZX110 a bit easier to\nstore when not in use. Apart from this, the Sony MDR-ZX110 has 30mm dynamic\ndrivers, with a frequency response range of 12-22,000Hz, 24Ohms impedance and\na sensitivity rating of 98dB. The MDR-ZX110 doesn't have an inline mic or\nremote control, but Sony does sell a nearly identical model, the MDR-ZX110AP\nwhich does, for Rs. 700 more.  \nThe ear cups have very slight padding, which is enough for an acceptably\ncomfortable on-ear fit. The headband has no cushioning, but is designed well\nand feels secure and comfortable in place. The MDR-ZX110 also has a thick,\ntough cable that looks like it can take a fair bit of strain. Past the\nY-splitter, the 1.2m cable splits into two separate and somewhat flat cables\nthat aren't quite as sturdy as the lower half. The design and thickness makes\nthe cable somewhat tangle resistant, and extremely resistant to cable noise.\nOn the whole, apart from the flimsiness, we're happy with how the Sony MDR-\nZX110 looks and feels.  \nPerformance  \nWith the Sony MDR-ZX110 being an entry-level on-ear headset, we did most of\nour testing using an Android smartphone. We also tried it with our Fiio X1\nhigh-resolution audio player and a Windows laptop. Focus tracks for the review\nwere BT's Somnambulist, Skrillex and Diplo's To U, and Passenger's Circles.  \n  \nStarting with the bass-heavy Somnambulist, we found that the Sony MDR-ZX110\nhad a meaty sound, with lots of emphasis on low-end attack. The bass can\noccasionally be overpowering, but is usually controlled thanks to the not-so-\ntight fit. The sonic signature has been tuned toward promoting the lows, and\nthis makes for a very warm sound. This also tends to show a bit in the lower-\nmid ranges, but there is a clear sensitivity drop towards the upper end of the\nfrequency range.Price (MRP): Rs. 990  \n  \nPros  \nComfortable on-ear design  \nGood low-end response  \nSturdy cable  \nFull, exciting sound  \nCons  \n  \nFlimsy build  \nWeak mids and highs  \nRatings (Out of 5)  \n  \nDesign: 3.5  \nPerformance: 3.5  \nValue for money: 4  \nOverall: 3.5  \nPls vote it as a helpful review\n\n", "Hi friends,  \n  \nI have purchased this Sony MDR-ZX110A about 3 months before, from cloud tail\nIndia at Rs. 499 and now after using I would like to share my personal\nexperience.  \n  \nBefore sharing pros and cons of the product I would like to share some info\nabout the product.  \n  \nThe Sony MDR-ZX110A comes with 1 Year company warranty  \n  \nI like this because:  \n  \n1\\. Very light weight approx 100gm - ease to carry.  \n2\\. Cups having very nice folding features after folding less space required.  \n3\\. Made of good quality raw materials.  \n4\\. This Headphone is strong and flexible enough for rough use.  \n5\\. No extra pressure on the ears so can be used regularly for 4-6 Hours.  \n6\\. Long Life Headphone in my opinion.  \n7\\. 3.5 mm jack that supports almost all type of devices.  \n8\\. Cable length is 1.2 meter  \n  \nSOUND QUALITY:  \n  \nCrystal clear sound, better than expectation within this price range.  \n  \nI don't like this Because:  \n1\\. I don't have a single reason.  \n  \nI have also used the Logitech H110 Stereo Headset but its quality is not good\nas compared to sony headphone. and the product looks like imported from china\nbut it's originally from sony due to low price sony has compromised with\npacking.  \n  \nI hope you like my review.  \n  \nThanks  \nVijender Singh\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 April 2017", "on 28 November 2016", "on 11 December 2017", "on 15 November 2016", "on 16 October 2017", "on 9 December 2016", "on 29 November 2017", "on 21 September 2017", "on 29 May 2017", "on 4 February 2017"], "reviewer": ["The Amazing Prince", "Voruganti", "Nikul Moradiya", "YASH GUPTA", "HARSH SHARMA", "Arunagiri", "TheUnknownUser", "Manmadha", "Divyam", "Vijender"]}
]