[
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Fast Delivery.. Good Product.. Pathetic Packaging..", "Sound delivery is very sweet. Loudness is not too high", "\"Cheap tricks for sell\" by Amazon", "Value for money product.", "Sony has always produced great stuff. No wonder why they are always on ...", "best one I've used,best on market", "Best budget headohone", "No Box? No warranty card?", "Superb sound and quick delivery good bass confontable to listen long time for this range ...", "Sony! Always...."], "review": ["Amazon is always known for its great delivery.. As expected received before\nthe expected delivery dat and as we all know Sony is known for its headphones\nsound compare to other product but really disappointed with the Sony headphone\npackaging.. It was in box and with and bag but no other packaging to keeo it\nsafe from outside impacts it can easily break in the box and when I received\nthe box was already got pressed by weight kept on it.. Even the packaging from\namazon was pathetic..\n\n", "Just bought it on discount! Sound delivery is very sweet. Loudness is not too\nhigh. Good bass boost system. Sound quality is clear with bit surround effect.\nBut if you expect dj concert like bass and orchestra type treable, then it\ncan't fulfill your requirement, then go for over 1200+ bucks range. It meets\nmy requirements. Previously I used various headphones of high and mid range. I\nbought it for my gaming laptop. Its too comfortable for long usage and again I\nrepeat its too cool to be with sony!!!\n\n", "I would have given 0 star but giving 1 star as I am very disappointed by\nquality of Sony head phone MDR-ZX110A delivered by Amazon.Writing the review\nafter 1 year , left ear pad is gone no sound coming and right ear pad causing\nmigraine,very bad sound quality,no so called \"sony\" bass effects,ear cushions\nare not comfortable at all.It's not worth to buy this product rather I would\nsuggest the buyer's to go for better models of sony even though they are\ncostly its worth the money to purchase those but not this item.  \n  \nIts my advice to Amazon not to employ cheap selling strategy and deliver low\nquality in the name of Sony.Value your customers time and money.\n\n", "Fast delivery. Comes in original sony packaging. very comfotable ear pads. but\nnot for prolonged used. Material quality is ok , not for rough use. Clear and\nvery good sound. Bass is average. I goy it for 600 excluding 60 cash back.\nover all a nice product.\n\n", "Sony has always produced great stuff. No wonder why they are always on top\nwhen it comes to manufacturing any goods. Although the price may look high but\nyou will not bother when you start using the product. This fast charging cable\nis another classic example of what Sony is all about. There is nothing that\ncan match Sony products and they have been consistent. I have used other stuff\nsimilar to this but was never pleased with the results.  \n  \nKudos to entire Sony team for making their products world class! I'm having a\ngreat time using their products.. Sony TV, Home Theater, Smart Phone, Adapter,\nCharger and now this Stereo Head Phones.\n\n", "Sony headphones are top quality I've benn using them for 6 months now and the\nsound is just perfect the colour is still bright i also found out they are\nwater resistant ( i wore them in heavy rain,they are still perfect), awesome\nproduct an music lover must have\n\n", "It is a nice headphone it is one the ear and cones without mic color is nice\nshining but let's see after some time as I've recently bought them sound\nquality is good but there is little noise leak when there is silence which\ndoesn't affect you and if you are listening audio in good quality then this\nwill give you best performance I bought them in 600 as some amazon offer was\ngoing on if you are looking for budget headphone go fir this I've researched a\nlot and got the best result amazon gave product on time only two day delivery\nhere in pune .\n\n", "This just came like this today, it was in plastic pouch, was not even In the\nSony box. And there's not even warranty card or something. Sound is good\nthough,... And headphones looks new. (Not used). So I'm pretty happy. I got\nthese for 649, so let's see how much it works.\n\n", "Superb sound and quick delivery good bass confontable to listen long time for\nthis range this is good ₹ 600 TQ Amazon I loved it\n\n", "One of the best headset I've purchased. Good sound effects and quality wise no\nbad comments though it was made in china as mentioned on the headset itself.\nSome says it has inbuilt mic but I haven't seen any kind of it. And for phone\ncalls the other end person can easily get my voice clearly even without the\nmic. Totally I'm happy with this headset.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 November 2017", "on 10 August 2017", "on 6 November 2017", "on 22 January 2018", "on 26 January 2017", "on 7 October 2017", "on 14 March 2018", "on 16 January 2018", "on 26 October 2017", "on 24 November 2017"], "reviewer": ["Sohail Talwani", "SAYAN GUPTA", "Amazon Customer", "manu prathap", "Chakravarthy", "Amazon Customer", "Wranthler", "Roh", "kunapuli n.", "Karthik R"]},
{"rating": ["1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Within a year on speaker is not working. Right ...", "Long Term Review - Average", "Beautiful stylish sophisticated. Great sound. Great sound buffering and noise cancellation", "This Sony is Secondary Headphones Why? Reason below", "Clear Review", "Sound is satisfactory at this price.", "Duplicate & cheap quality", "Value for money..Good quality music experiance", "Great headset for anime and songs.", "Overall great product 4.5*"], "review": ["Within a year on speaker is not working. Right side. Don't know who is to be\ncontacted for warranty. I feel Amazon should make arrangements to take care of\nproducts within warranty period.  \n  \nwithin warranty period one speaker failed and Amazon dont help to claim\nwarranty. About warranty dont trust Amazon buy at your own risk.\n\n", "What I liked is the fold-able design. Sound quality is average but OK for\nheadphone in this range. These lasted around 6 months. After around 2 months\nthe gold plating on connectors faded away. After around 6 months the\nconnections on the headphone jack connections became loose and sounds became\nintermittent and I had to open and see what went wrong. That is when I noticed\nquality of build and material used inside.  \n  \nOpinion after use for 6+ months -  \n1\\. Average build quality  \n2\\. Not sure if it is original Sony. The quality of soldering and connectors\nindicate cheap quality parts used and poor assembly quality which is not as\nper Sony or any good branded product.  \n3\\. See pictures of connectors and original soldering on joints which is\nsubstandard.  \n  \nOK if you get it in a sale around Rs 500 and if you can do minor repairs in\ncase it fails for you.\n\n", "My god these are such good headphones, over the last three to four years maybe\nI have been buying new in ear headphones and gaming mics but none of the ones\nI bought for music lasted me, these have lasted since september and now its\ndecember and I LUV DEES HEADPHOWNS SOW MUCH! They sound perfect, its a simple\ndesign so the look suits most if not all people.  \nCheers sony!\n\n", "I'm a sound Engineer of good experience so i would like to share a good\nreview.  \nValue for money.  \nPros.  \nLight weight.  \nSound quality is not bad. Lack of tight punch but does its job good.  \nThe Brand Sony.  \nGold plated 3.5mm jack.  \nTangle free cables.  \n  \nCons.  \nNot For long time listening.  \nEar cups are not so durable and will get dirty soon after a period of rough\nusage.  \nSound quality is not that great. For sure a muddy Mid is a drawback.  \nNot for BASS lovers definitely.  \nShould handle with care without dropping it.  \n  \nVerdict.  \nFor this price point its a good buy, It should be a secondary headphones if\nyou are a music lover.  \nBut definitively not for audiophile. Watching youtube listening to soundcloud\nthis headphones are worth a try.  \nNOTE : All this review is based on my testing.\n\n", "1\\. Very good sound by head phones  \n2\\. We can't see microphone in it but I think it is internally present because\nwhen i calling to others by using this headphones they have heard my voice\nalmost clear  \n3\\. We can't almost not hear all surrounding noises while using it  \n4\\. It can be foldable see the pics carefully by which it can be packed in\nluggage at less space  \n5.when I have purchased the sony headphones it is only ₹.500 for this cost\nthis head phone is best  \nI have purchased this product in 2017 but reviewing in 2018\n\n", "The packing carton was like as that of an unbranded one maybe because of\nimporting in bulk at cheaper rates, the cartons are not shipped but the end\nproduct is decent. Is working great. I have been using it since last 2 months.\nThe cable is thick enough to get is going for months without wire damage. If\nyou use it for 2-3 hours daily, it's still cozy and comfortable to wear. A\nlittle bit of extra bass - it's a good thing (don't expect much in the base\nside however).\n\n", "i have purchased this headset on august & just one month this product not\nworking properly as i am not able to listen in right headset now i think i got\ncheated by amazon as i have get duplicate product & service center also not\nhelping me to resolve this issue, very cheap quality & fake product provided\nas now sony service centre refuse to provide service for this item which is\nunder warranty\n\n", "Personally check it all my and friend mobiles in FullHD 1080p videos and high\nend 320kbps songs...  \n  \nPros:  \n1.good sound  \n2.clear bass and clear music deatails  \n3.foldable design..  \n4.ear cuff fits very well..  \n5.light weight and adjustable..  \n  \nCons:  \n1.folding was little bit tricky..  \n2.mic nil(no) (see in product details)  \n3.this headset sound quality was different in various mobile models..  \n  \ni. High end mobiles give full effects and higher volume sound..great Bass and\nsurrounding effects  \n  \nii. Middle end mobiles give good clarity and medium bass.. Some mobiles gives\nlow sound volume..  \n  \niii. Low end some mobiles give mixed effects and low bass another low end\nmobiles gives low sound volume  \n  \nChecking mobile list below..  \nXiomi redmi 2, xiomi Mi4, lyf flame 4, lyf wind 7, lyf water 1, lyf water 10,\nmicromax bolt, lenovo a6000 plus, lenovo k5 plus, samsung on5 pro, samsung on7\npro, samsung j7nxt, htc one E8, LG G4, xperia xa ultra, Xperia Z2, zopo ,\nmotorola g4\n\n", "This headphone is truly efficient.I am a huge anime and Case Closed fan with a\nkeen interest in classical Hindi songs.My headphone excelled in all these\nlevels,thus overwhelming me cuz the earphones start at a price of over ₹800,I\nbought this for ₹600.The only demerit is that it makes some kind of crunching\nsound during use.  \nWell,I would love to give 4 stars to it,at last.\n\n", "At price 501 ...it's the best headphone. Bass is good .. comfortable on ear..\nbut sound intensity is little bit low at full volume using equaliser. but\nthat's not the big deal.. overall it's a great product at this price. Go for\nit\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 September 2017", "on 4 December 2017", "on 28 December 2017", "on 5 October 2017", "on 25 January 2018", "on 26 January 2018", "on 5 August 2017", "on 11 February 2018", "on 3 March 2018", "on 16 August 2017"], "reviewer": ["Lourenco da Fatima Souza", "NS", "Nihir Shah", "KARTHIKryo", "charan", "Aakash Sharma", "Vikash Kumar Raut", "pravinKumar", "MD.Aman Abrar", "KAPS"]},
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["CHINISE PRODUCT", "Very good sound quality, clear vocals.", "Amazon and Sony Rock's", "Sound quality was good for that price and product build and material is ...", "Very beautiful and got for 499/- in l/deal", "don't waste your money on this stupid", "cheap quality", "Decent headphone...", "Product is not good and price is not relevant.", "Best of best"], "review": ["its average chinise product. once you purchased it you can not rturn it. they\ncan only replace product. and they don't give refund. so if you want to\npurchase this item just think 10 times before purchase it.  \nbass and sound quality is average not so much as expacted.\n\n", "Very good sound quality. Actually better than a few higher priced headphones.\nThe sounds are clear and well differentiated, clear vocals.\n\n", "Best experience by Amazon as well as Sony bcz the headphone I bought is\ndealiver very fast.This headphone is a a very clear sound and bass was amazing\nit is my first headphone and it is comfortable with all phone, laptops as well\nas computer. And the sound is not going out of headphone. Wire is also long 1\n$1.5 meters\n\n", "Sound quality was good for that price and product build and material is okay.  \nThank you Amazon and cloudtail for such a great deal.\n\n", "Very beautiful and got for 499/- in l/deal. Worth it. Very good hearing\nclarity and with folding option can be packed in a box when idle.\n\n", "sound stopped coming from one side of the headphone after one month of\nuse.This is the built quality of sony headphones.don't waste your money on\nthis stupid product\n\n", "awful imitation don't trust the 4 star review go for something else like mx\n150 or something\n\n", "Got it for Rs.501/=. It's worth the money spent.  \n  \nHeadphone with decent sound quality. Can't ask anything much better for the\nmoney spent.\n\n", "Amazon is using cheap policies. On the occasion of diwali amazon give the\ndiscount offers and I have purchased this item at rs. 679 and i made prepaid\npayment by using debit card then i got 10 % additional discount on rs 679 but\nnow it is sold at rs 619 only. What a policy.... cheap. And the product is not\nso genuine.\n\n", "These headphones are best in class....people complaining about it should know\nthat as its has high power driver so normal music player won't produce best\nquality sound....use cracked version of jetaudio available on Google ( not in\nplay store) set DPS on in its setting and in DPS set headphone output to Sony\nzx110.... Set am3d on....switch off mobile default equilizer....that's\nit....you won't believe it's quality\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 22 January 2018", "on 20 November 2017", "on 16 September 2017", "on 17 October 2017", "on 11 October 2017", "on 13 September 2017", "on 10 December 2017", "on 14 August 2017", "on 8 November 2017", "on 8 December 2017"], "reviewer": ["Amazon Customer", "Rohit. Navale", "SUNIL KUMAR SRIVASTAVA", "SR.S", "Yatin Gunjikar", "sourabh prasad", "Akash", "BetaVictory", "Bharat", "ABC"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Excellent for the price", "Didnt expect just a bad quality headphone from sony", "Great for the price and do NOT hurt the ears", "just for bass heads", "Brand and quality at such a low price is a great deal", "Mediocre at its best but the Best for its price", "I did this foolishness by buying this for the third ...", "Supplied Faulty product with seal opened box", "Sound and build quality of this headphone is awesome. I have one of those costly headphone that ...", "A Good product for first-time buyers!"], "review": ["Arrived on time.  \nI was very sceptical about these headphones first looking at the price. I got\nthe deal at 500₹.  \nThese really do deliver a good performance to price ratio. The bass is just\nawesome. The treble notes are not very audible and can be adjusted with\nequalizer. The cups don't flip but fold inside in a compact fashion which is\ngood.  \nI'd suggest anyone who is looking for a budget headphones without mic. to go\nwith these.\n\n", "No deep bass and its not acoustic. Could hear outside noise and delicately\ndesigned. Should handle with care. Didnt expect just a bad quality headphone\nfrom sony. Very much disappointed.\n\n", "A really good headset considering the price range, the sound quality's pretty\ngood and they are comfy on the ears. I read some reviews of people complaining\nabout their ears hurting after a while but that only happens when you wear\nthem from the wrong side. There are markings on them saying 'R' and 'L'\nindicating the correct sides and when you use them accordingly, there's no\npain. I use them for hours straight and have no problem at all.  \nSo if your budget is of less than 1000 bucks then definitely go for this\nproduct :D\n\n", "my first pair of headset for my tablet but the thing is that my tablet just\nsucks in sound but when i connected it to my moms phone it just outshined\nevery headset i owned and the quality is good  \nthe bass is good (just great)  \nthe vocals are just average and the mids are just low  \nif you listen to edms this is for you  \nonly for bass heads\n\n", "Got it only for 550 bucks which is really an unbelievable cost for a brand\nlike sony. Sound quality is nice. Comfortable to wear. Overall loved the\nproduct.\n\n", "If can go for the Sennheiser HD 180, then do not buy this. This can never come\nclose to HD 180 but it is a very good headphone for its price. No wows. Just a\nmediocre piece of sound equipment but the best at its price.\n\n", "I did this foolishness by buying this for the third time, earlier two headsets\nwere already dead, as one of their speakers were dead.  \nEven this one didn't last even 6 months. Right speaker was dead again,after\nfour months. Got it repaired by replacing the remaining speaker of the older\nheadset. Then the left speaker gone, and then the jack pin stopped working.\nThey are not selling the product, rather selling the name 'Sony'. I wud\nsuggest to go for new upcoming companies, on the basis of customer review\nbasis, since they are new, they maintain quality and price too to stay in the\ncompetition and market. This is not the same 'SONY' it used to be ten years\nback. Its all mediocre Chinese material. GO FOR IT AT YOUR OWN RISK.\n\n", "I have received the faulty Head phone (Right side is not working), also the\nbox was already in seal opened condition. (hope they done this knowingly)  \nThen returned & replaced later. So i gave only 1 star for supply the faulty\nproduct with the seal opened box knowingly.  \n  \nNote: The replaced sony head phone is working great...!\n\n", "Sound and build quality of this headphone is awesome. I have one of those\ncostly headphone that makes u feel the bass, this product is the same. It\nmakes u feel those hard basses and u can actually sense those crisps of the\nmusic. But why 3 stars? They didn't sent dis product with the 1 year warranty\ncard which they promised before the purchase 3:( . But not gonna return it\nthough. I love this headphone.\n\n", "To be honest, the sound quality is quite decent, not bass-heavy, as can be\nexpected in this segment (entry level)  \nThe build is good (Not for rough use)  \nThe cushions dont hurt your ear even after long use.  \nBUT MOST IMPORTANTLY, this device is compatible with most devices, i.e.- my\nlaptop, mobile, digital piano, etc.  \n  \nThe product packaging was also very good. It came in a hard box-in good\ncondition.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 27 September 2017", "on 20 May 2017", "on 31 August 2017", "on 29 August 2017", "on 1 July 2017", "on 14 September 2017", "on 22 March 2018", "on 25 October 2017", "on 28 September 2017", "on 11 December 2017"], "reviewer": ["Afiya Q.", "Amazon Customer", "Lavanya", "dharma", "Isha Bhardwaj", "Jack Frost", "Rajesh kumar", "BeeKay", "Deadland", "Robin V."]},
{"rating": ["4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Amazed", "Cheap high copy chinese product", "Best for 549₹", "people don't know how to judge", "Worst product purchased till date", "Overall happy  performance  in the price range...", "Price worthy product go for it", "Waste product. I donot know how to dealwith  this product before throghing in the dust bin.. No stars is the best option.", "Value for sound and money", "Price ke hisab se Good product."], "review": ["It's great.. at first I thought vol is low(than mah phone's ear phone) but the\nclarity and detail in sound is great... Worth buying at just 501/- lightening\ndeal.. Thanks for faster 3 day delivery..\n\n", "This is not sony original product, seems like sony high copy chinese product.\nIts doesn't have bass effect however sound clearity is fine. I dont want to\nreturn it because of its price but later regret my decision. Go for jbl\nheadphone instead of this which is original and good bass with sound quality.\n\n", "They are so amazing ,they arrived on time and there bass is up to the mark. I\nordered them for my dad as a Diwali gift this year. Let’s see if he likes ‘em.\n\n", "guys i own both jbl 250 si and i recently ordered these headphones ... i just\nwanted to tell that the wire quality is just phenomenal , sound is above avg.\n(better than jbl) , build quality is superb , you can surely go for it , i was\nalso very confused before buying ... but remember its a sony and noone can\ncompete with it ..even in low segment , brand is brand guys buy it\n\n", "Worst product purchased till date. One headphone speaker stopped to work with\nin 4 month of light usage.  \nDo not waste your money on this headphone there are many other options\navailable within same price range.\n\n", "Excellent product from Sony, color is not 100 % white bit gray shed, use only\nwith mobile for proper performance, However using on PC even with 100 sound\nlevel doesn't giving loud sound. Overall happy performance in the price range.\n\n", "Best product under this price range. Sound quality is good, ear cushions are\nvery comfortable easily you can listen music 1-2 hrs. But built quality is\ndecent if you are a rough user you have to take care of it bcoz it might\nbreak. Overall this product is very good. Thanks Amazon for this\n\n", "Sound effects are poor. Not up to the expectation.  \nI would like to return the piece if eligible.  \n  \nNo improvement even after the replacement.  \nAm i eligible to return the product at once without replacement.\n\n", "Amazon delivers original ...awesome headphones got it in great india shopping\nweek with a mere prize of 501 pure sony stuff great headphone ..mrp 1370/- net\nworth save of 900  \nMay be dealers are off loading old mrp products due to implementation of\nGST... worth a bargain\n\n", "Sony ka ye headphone kuch din pehle hi kharida tha. Kuch offer ke sath Rs. 500\nme kharida. Price ke hisab se thik thak hai. Cable quality achha hai. Sound is\ngood but not very good. Bass bhi achha hai. Actually is price me isse jyada\nkuch expect bhi nahi kar sakte. Overall good.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 14 May 2017", "on 26 February 2018", "on 13 October 2017", "on 10 August 2017", "on 13 January 2018", "on 11 August 2017", "on 23 January 2018", "on 30 January 2018", "on 16 August 2017", "on 11 June 2017"], "reviewer": ["Jayanta", "Saurabh gupta", "Vaibhav Goswami ", "ankit kumar", "Amalendu", "Dipak", "Rajat", "Mr.RAO", "S K Biswas", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Good at this price", "Average", "Good enough. I'm writing this review after using these ...", "Product name sony but sounds like 150 rs earphone", "Excellent Product, Good sound Quality. value for Money.", "Three Stars", "Excellent buy", "Folding design hence easy to carry or store", "Don't think, just go for it!", "packaging is terrible. before i offer it i decided to return ..."], "review": ["This headphone is good but not great in my opinion but you cannot expect more\nat this price point.if you want to buy a headphone at this price point then\nthis is good.i don't like this one for build quality and I think it can not be\nlong lasting if you're using it regularly but I like the sound quality.anyway\nthanks Amazon.\n\n", "If you are a music lover this is not for you but if you have some casual use\nlike few song and movie sometime at your place then it is OK.  \nIn the crowd or noisey place i wont work well i tried to use it in bus but the\noutside sound was still reaching to my ears.  \nBuild quality is very very low it may break if not taken care of  \nSound is crystal clear as the name SONY suggests but it lacks in bass.  \nI got it at effective prize of 371 so it was a gud deal for me but dont pay\nmore than 500 on this better to wait and take a high end product\n\n", "Good enough. I'm writing this review after using these headphones for 11\nmonths and guess what they are broken now.  \nThe wire gave up. The build quality of cable is not that good.  \nTalking about the sound I would say sound I good at this price range.  \nOf you want to use these earphones for a few months you should go for these\nhaedphones.  \nWhat I don't like about these headphones is that they didn't last even for a\nyear.\n\n", "This product does not sound that good and sounds as equal as 150 rupees\nearphone sounds.using the headphone for an hour feels ear pain not internally\nbut externally. The packet doubts me whether it is originial or fake using\nsony's name. Buying it was a wrong decision\n\n", "Performance : The product is excellent. I used the product with an 100% input\nvolume from my Iphone and the speakers of the headphone performed excellently\neven in the loud sound input. Their was no cracking of sound even in high bass\nsetting. It excellent value for money product. The 3.5 mm jack at the end of\nthe wire is in L shape which is an excellent product innovation, to increase\nthe life of the wire at the end as it will not bend and will not break with\nlong use.  \nLooks : The product is pure white, which makes it look good. The inside\nportion of the ear piece has leather covers on the speakers, which looks good\nand if they last longer because of wear and tear then excellent. The speakers\nat the end of the head band are also fold-able and can be folded to make them\nhorizontally parallel to the headband, so it is easy to store and carry while\ntravelling.  \nI bought the product at Rs.499/- during a lighting deal, so its Paisa\nVasool......\n\n", "Over all average product at this price  \nSound is gud\n\n", "Quite satisfied with these headphones. Its been a year now and they work as\ngood as new. I am using it on my dell laptop. Excellent bass and mids as well.\nWill recommend it. Just be careful with use as they are all plastic. But will\nlast long if handled carefully.\n\n", "Bought this at half the price(Rs. 500) in sale for my Kid. Primary reason was\nbecause it is not too loud hence safe for kids as you cannot track and control\nthem all the time. Folding design hence easy to carry or store. Wire length is\ngood enough though not too rugged and malfunctions(My friend reported) in some\ncases.\n\n", "Excellent headphone with clear sound. Feels premium and looks awesome.  \n  \nTotally worth the price of ₹600.  \n  \nDon't give a second thought, just grab it.  \n  \nFound review helpful, don't forget to give thumbs up.\n\n", "got it at rs 549.packaging is terrible.once i openedr it i decided to return\nit so that's a thumbs down. After i opened i somehow decided to keep\nit,considering price  \nThe sound quality is good, bass is better then sennheiser hd 180. but clarity\nand treble is better in sennheiser. wire is very long in sennheiser but sony\nwire is great. both the wire is not very durable.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 March 2018", "on 1 October 2017", "on 12 January 2018", "on 16 August 2017", "on 26 September 2017", "on 18 April 2017", "on 10 January 2018", "on 12 February 2018", "on 1 October 2017", "on 10 October 2017"], "reviewer": ["Amit Mishra", "Praveen Tiwari", "Ankush Negi", "Amazon Customer", "Gagan", "kavish sharma", "Amazon Customer", "Vikas Singh", "Nizam Khan", "Avijit Roy"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["At the beginning it was great, but after some 3 to 4 weeks the ...", "Excellent one, go for it!", "So good I bought 2nd time", "Good Quality of Sound, Cord is Short", "I would not recommend to buy the product from \"Cloudtail India Pvt. Ltd.\"", "Ok", "Awesome headphone. Just go for it", "which have much better audio quality)", "Original product at low cost...", "sponge padding is not good.."], "review": ["At the beginning it was great, but after some 3 to 4 weeks the left speaker\nwas making sound and still it continues to my daily usage at this price range\nquality is good product is good everything is fine but the the sound quality\nis little disappointed.\n\n", "Just received it few minutes back(reached 4 days early)! Very nice built,\ncomfortable to ears due to the cushion, rich and velvety sound, good base and\nas well as crisp. My wife grabbed it after listening to it for a while. So, I\nam here to order the second one now.\n\n", "Very nice. I used same model before. Got it for 500 in lightening deal. Worth\nevery penny. The sound is a bit low but considering the price it's good. And\nit is not a weak build unlike what some reviews claim.  \nAnd last time it broke because of very bad handling by a friend. It lasted 9+\nmonths with moderately harsh handling.\n\n", "Quality of Sound for listen of songs on phones / laptops.  \nLength of Cord must be lengthy.  \nThere is no mic or volume controller.  \nQuality is very sweet, but loudness is quite lower than JBL headphones.\n\n", "Sound quality is amazing though bass is low compared to other brands in the\nprice range. Build quality is okay, but need to be careful as entire body is\nmade of plastic. I would not recommend to buy the product from \"Cloudtail\nIndia Pvt. Ltd.\". The product stopped working properly exactly 2.5 months\nafter I received the product. Although the product is good , the seller is\nmaking some nuisance to make profit.\n\n", "First of all the product is great.  \nIt's not too loud but could have been a little bit louder. This my statement\nand suggestion.  \nPros:  \nIt's light weight.  \nThe 3.5mm jack wire is long enough.  \nThe ear sponge is quit comfortable for short time usage.  \nCons:  \nBuild quality not up to mark.  \nVery Fragile.  \n(Packing not impressive 😂).  \nVolume buttons not available.  \nCLARITY:3.8/5  \nTREBLE:3.5/5  \nBASS:3.5/5  \nOverall a average headphone for video editing and GAMING.And off course for\nlistening to music.  \nNote:microphone not available\n\n", "This gadget is a techno-wonder. Sony has finally come up with a budget-\noriented headphone. The quality of the headphone is a premium one. It's a\ndazzling white beauty. It's very incredible in matter of the sound it\nproduces. Best bass and treble experience in this price segment.\n\n", "Before buy ,just take a look of my experience with this headphone.  \n1.the quality is quite average(it's seem to me that the folding Will break\nanytime soon)  \n2.the audio quality is not upto mark (previously i bought zebronic headphone -\nRs 249,which have much better audio quality).  \n3.i feel some pressure on my ear-whenever i put headphone on about more than\n15 minutes.\n\n", "Awesome quality with cool look\n\n", "this product is good if its available in 500rs but .. if you are buying this\nin more than 500 rs then you have other good option .as the sound quality is\ngood but build quality of padding is poor.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 November 2017", "on 31 August 2017", "on 15 September 2017", "on 18 August 2017", "on 31 December 2017", "on 20 March 2018", "on 19 January 2018", "on 24 October 2017", "on 23 September 2017", "on 23 September 2017"], "reviewer": ["Vinod Pinto", "Dipanjan", "PenguinLover", "PREMANKUR SARKAR", "Amazon Customer", "Z tells", "Mohan Kumareshan", "Pradeep.P", "Amit Singh", "prathamesh sawant"]},
{"rating": ["5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Sound Quality - Amazing", "Amazing Sound but after 3 months right side sound goes off.", "Awesome and mind blowing sound quality", "Awesome product", "He is a music lover and he liked it. I would say at this prize range ...", "Sound and perfomance is good for the price", "Value for money", "Best headphones for  beginners", "Not as expected. I mean \"FAKE PRODUCT\"", "The Audio quality is awesome and Price Rate is very Chep"], "review": ["The sound quality is brilliant. Using this since a few months and its been\ngreat. It works well with both mobile and laptop. Wish the purple black colour\nwas available. White gets dirty very soon and looses the beauty. Still does\nthe prime work. Amazon delivery was fast.\n\n", "After two months of use total in less than 50hrs after of purchase, one of the\nside of side of headfone goes off. Went to sony service centre and the\nprovided complete replacement. To claim warranty you must have Its carton and\nbill. Otherwise they will deny to accept your claim for warranty.  \nThanks. Hope you understand.\n\n", "Awesome and mind blowing sound quality. If there were a mic in it then it\ncould be more fabulous. But only for music lovers it is the best.\n\n", "Amazing product got by Amazon if u listen music at max volume their is no\ndisterbance in music because it is crystal clear sound and u get 1 year\nwarranty and they r too much flexible and I confused why u r not buying that\nproduct guys go for it, it's of Sony guys in this price ho n get it now\n\n", "I gifted this to my collegue as a farewell gift. He is a music lover and he\nliked it.  \nI would say at this prize range this is a good product. I brought it in offer\nat just 499/-  \nThanks Amazon for the good delivery.\n\n", "Sound and perfomance is good for the price..  \nBut the ear cushion is of very low quality..  \nGot worn of pretty fast..\n\n", "I got the white one..Ordered on 23 Rd Jan Tuesday.. Scheduled delivery time\nwas next Tuesday..But got it on Sunday...  \nThe product was neatly packed in a cardboard box... Inside was the product,\nuser manual and on the box was 1 year guarantee written..  \nGot it in the lightning deal in just ₹550..  \nSince 28th Jan (the receiving date) till today, 1st feb, have faced no problem\nso far.. The sound quality is quite good...  \nAll in all, in such a cheap price, it is a great buy...\n\n", "Pls trust me . This is the best headphones for beginners who would like to\nhear songs . Since it is on ear headphones you will get irritated after\nlistening continuously for hours but it's great headphones for this budget.\nIt's stereo so if u play any games in this one u can hear foot sound of other\nplayers and it's like 7.1 surrounded sound . Before I buy this product I used\nto hear songs in my friends iPhone earphone and when I bought this this was\nand is better than that for me . I like this headphones and thanks to Sony and\namazon to keep this product at 650 INR .and one more thing this doesn't hav\nmicrophone .\n\n", "It is a good product but if you don't want to disturb someone next to u while\nlistening music or the persons in the room then don't buy it cause they can\nhear the sound outside the headphone and the most unbelievable thing I saw\nthat the box in which the product came was written that it is made in China\nbut on the headphone it is written that it is made in japan😕😕\n\n", "The Audio quality is awesome and Price Rate is very Chep...  \nAnd As Aspected From Amazon Alwaze gives Early Delivery that's Another Best\nthing From Amazon.  \nI Use This Since Last four Day But It does not give Any kind of Problems.  \nVery Best Product For Daily Use.  \nBut If Your Are Bass Lover so it does not for you.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 13 July 2017", "on 29 September 2017", "on 2 July 2017", "on 4 September 2017", "on 14 October 2017", "on 28 October 2017", "on 3 February 2018", "on 20 February 2018", "on 31 January 2018", "on 29 January 2018"], "reviewer": ["Uzma Zareen", "Rakesh Anand", "SAIF ALI", "Mamta", "Vrushali Sambare", "Eden Hazard 10", "Debangana G.", "Rakesh", "SHREYASH TIGGA", "Krunal Makwana"]},
{"rating": ["2.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["... cover got teared makes noise not much bass but good for causual song listeners if you want high bass ...", "Not sure whether original one, but sound is ok.", "This is an amazing product@ ₹499 Pretty awesome sound quality n delivery within ...", "Good for the price", "... written on box bother me but the product is good according to the price", "Sony headphone.", "But it's good in it's price", "These headphones are good in such a price range", "U will not get better headphones than this at this price point", "Too good for this price range."], "review": ["Used this for 6 months the cushions cover got teared makes noise not much bass\nbut good for causual song listeners if you want high bass go for jbl not\nthese.\n\n", "I doubt whether this is original product from Sony. It is very tight over my\nears and giving me pain around my head and on ears while using for 20\nminutes... Bass and sound quality is good but still I doubt whether it is\ncomparable with original Sony product.\n\n", "This is an amazing product@ ₹499  \nPretty awesome sound quality n delivery within 2-3 days...  \nBut gotta see how it will be after some time...  \nOne side ,one ear piece has stopped working..it didn't last very long\n\n", "I got this headset during a sale for just ₹549. I would say, this is the best\nyou can get for even price upto ₹800. Noise cancellation is not as much as in-\near headphones. The inner packaging (by Sony) was not at all appealing (see\nthe pictures)\n\n", "The 'made in China' written on box bother me but the product is good\n(according to the price), bass in not great but good, sound quality in nice,\ncomfortable and fits nicely. Earpads are not so good and looks cheap.  \nNow the thing I don't like at all is the packaging it came in a cardboard box\nwith no bubble wrap just the headphone inside it, and the box was partially\ncrushed and damaged, fortunately the headphones are in working condition. The\npackaging are like getting worse and worse with every purchase with Amazon.\n\n", "Wire - best quality  \nJack -gold colour  \nComfort- very comfort  \nBass-very good for a good phone bass doesnot only depend on the head phone but\nboth the phone and the headphone together if the bass of your phone is good\nthen it will give good base event with the cheapest head phone.  \nIf you want the cheap sony head these is the only one I found for music and\nmovies only not for calling.  \nThankyou  \nI have add two new photo after 5month it is still look like new .  \nI add these new photo to tell the truth that the cusion doesnot get torn even\nI use every day.\n\n", "It's not that what is in the image, shown by the seller. It's cusion is rough\nand uncomfortable to wear. But it's good in it's price.  \nSome ratings are:-  \nBuild quality :- 5.5/10  \nSound quality :- 6/10  \n( Not for gamers and classical music lover)  \nConfort :- 5/10  \nWire build quality :- 7.5/10  \n3.5 mm jack quality :- 7/10  \nLooks :- 6/10  \nBranding :- 10/10 ( lol!!! )  \nFittings :- 7/10  \nGuys it's not good as accepted. But it's value for price, according to a brand\nSONY!!!!!.  \nGo for it guys if u hv low budget, otherwise go for higher prices headphones.\n\n", "These headphones are good in such a price range.......i bought them in Rs.501\nand they are still working good after 2 months since purchase........the bass\nis good.........but sound may feel low..........though i used to listen music\nin low volume....i keep the volume at a level 5-6 while the full is i think\n12.......at 5-6 it feels comfortable and good to me......so the headphone are\nawesome!\n\n", "Just bang for the buck... U will not get better headphones than this at this\nprice point. I have used other headphones like Phillips dj shl3000 & JBL\nheadphone of this price segment but I was most impressed with this.  \nBass is great, voice and treble are sometimes overshadowed by bass.  \nSo I will recommend to buy this if you are in tight budget and loves rock,\nEDM, rap, metal songs. Otherwise I might be disappointed.  \nAlso the wires are long enough to be used conveniently.\n\n", "Headphones are really comfortable and ur ears don't pain even if u listen\nmusic 2-3 hours. My first impression was: very clear sound bt a low bass. Bt\nafter changing my device settings bass has improved significantly. Overall\nexcellent sound quality and good baas combo.  \n\\- if u are using redmi note 4, then u hve to change ur sound settings to\nheadphones or capsules.  \n\\- if u hve any other device then change ur sound setting from balance to bass\n90% and surround sound to be 60% , then trust me u'll get sound and bass\nbetter then 800rs JBL headphones.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 23 September 2017", "on 27 November 2017", "on 24 September 2017", "on 21 October 2017", "on 28 January 2018", "on 29 November 2017", "on 19 August 2017", "on 11 August 2017", "on 7 January 2018", "on 9 October 2017"], "reviewer": ["Harendra singh", "Jith", "Rakshanda", "Varshith", "Anurag", "khrawborlang ryngkhem", "Amazon Customer", "Amazon Customer", "Kanhaiya", "nishant t."]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Speaker stop working", "Sound quality is very good. And such good looks are a huge plus ...", "More Than What Expected!", "Good buy", "Excellent", "Well my Sony MDR stopped working in like a month after a purchase and it was not ...", "Stopped working after 3 Months, May be chinese(Copied).", "Good", "Best stereo headphone in this range", "Best value for money in this segment"], "review": ["Within 3 month both the speakers stop working, pl do not buy from this seller,  \nSony MDR-ZX110A On-Ear Stereo Headphones, I want it to return back...\n\n", "Sound quality is very good. And such good looks are a huge plus too. My only\ncomplaint (and a serious one too) is that the folding mechanism is not\npractical. It has made the headphone much more prone to breakage. Once, the\nleft ear speaker popped out of the socket. I got scared but after coming back,\nI was able to fix it back in place after I found the tiny needle in my bag.\nThe needle keeps the speakers in place and assists in the folding mechanism.\nIn short, it is more a hassle than a function. I'd rather have a simple non-\nfolding headphone that is more durable. Take good care, and it should be okay.\nNot too me rough handled at all. 4 stars.\n\n", "I have tried this headphones but not bought one for me. As from reviews I\nthought it is not good for Bass. But after buying I can tell you its awesome!  \n  \nYou get good Bass and audio quality. But being a Sony product, the packaging\nwas not quite premium. I bought it in a Flash Sale on Amazon and for that much\nmoney I spent I got a Very Good Deal!!  \n  \nGo for it\n\n", "I've bought this twice and it's always given great sound, and is comfortable\non the ears. However, it's rather warm, so suitable for cool weather or AC\nrooms - it gets a little uncomfortable in hot weather.  \n  \nHowever, I would buy it again, as it's sound is great and the price very\ndecent for the quality.\n\n", "Excellent choice.  \nGreat sound quality.  \nExcellent BASS impact.  \nWorth of the price.\n\n", "Well my Sony MDR stopped working in like a month after a purchase and it was\nnot even used much. I used it like for a week in a month. But the only reason\nI won't rate it too low since Sony and Amazon made my experience a lot less\nworse after it malfunctioned. The left channel stopped working, contacted\nAmazon, they provided me a copy of invoice ASAP and also assured me my model\nwas under 1yr warranty. Then Sony service centre at saltlake, Kolkata replaced\nmy headphones in about a week (though I fought a lil since they asked for the\noriginal packaging box, which I didn't have). The new ones are working fine\nnow\n\n", "After use for 3 months I am giving review  \n  \nLeft side headphone stop working after 3 months of use.  \nYou should go for 110 rather than 110A.  \nSome points are  \n1\\. No warranty card with packing.  \n2\\. Packing in cardbox packet without any official sony packing. All stickers\nlooks like pasted after. When u open it, made in china makes you more\ndoubftul.  \n3\\. The packing makes me suspicious about it's genuinity.  \n4\\. Sound is average.\n\n", "Not excellent but buy it only in offer. Its good but a bit uncomfortable and\nears will start to pain if you listen to through this about an hour. Its good\nif u buy in range between 600 and 800 i bought it for 650\n\n", "Best stereo headphone in this range.  \nThere is no defect at all.  \nGo for it.  \n1\\. Light weight  \n2\\. No pain in ear  \n3\\. Sound is very good.  \nI hope it will help you to buy this product.  \nOfcourse it is made in china but you know that if we are on Earth we cannot\nlive without Oxygen. Today we cannot be separate ourselves from Chinese\nproducts\n\n", "The product looks expensive than it's cost. Build quality is excellent. The\nplastic is sturdy. Earpads are the softest and most comfortable than compared\nto it's rivals. Bass is great. All thanks to the 30 mm driver. It is better\nthan all the headphones that cost you around 2000/. Trust me. You'll not\nrepent. And once again Amazon nailed the overall delivery and buying\nexperience! A must buy.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 August 2017", "on 8 October 2017", "on 16 November 2017", "on 11 December 2017", "on 2 July 2017", "on 2 December 2017", "on 14 August 2017", "on 7 August 2017", "on 17 September 2017", "on 31 January 2018"], "reviewer": ["Amazon Customer", "Nishant Sharma", "Saurav Khare", "Indrajit S", "Donald Maity", "Priyanka sengupta", "Kunal Patidar", "Amazon Customer", "Amit Chaudhary", "Sohan™"]}
]