[
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Disappointed with just the Blue colour", "Excellent product", "My experience was not too good", "Good product", "One Star", "right choice for refrigerator", "Five Stars", "Good life of the product amell in hot summer which ...", "Good product.", "Five Stars"], "review": ["Product was delivered on time today. But like some other reviews blue coloured\nbottles were delivered. Hope Amazon will replace them with all 4 colours as\nshown in the picture. Disappointed with the colour that's why the rating else\nTupperware quality has always been fantastic.\n\n", "Can't go wrong with Tupperware! No doubt their products are pricey. But\nquality comes at a price :)\n\n", "The product shows 4 different colours but I got 2 blue and 2 pink shades\nunlike flipkart I ordered 4 500 ml and they delivered the same colours as\nshown  \nKudos for flipkart\n\n", "Very nice product and equally nice packaging.\n\n", "Very bad. That is spread bad smell. Don't buy . Waste of money\n\n", "good product, no smell in water ,water tight container no spillage, built with\nflexibility and surface stability. great assortment for fridge.\n\n", "After some days the bottles started giving a very foul smell (near it's thread\nand cap)\n\n", "Good life of the product amell in hot summer which snd no plastic smell which\nis irritating during drinking ofwater in summer days\n\n", "Good product...Well worth the price as Tupperware is not available at stores.\nThe packing was excellent and seller response was great.\n\n", "Good product.  \nGo for it.  \nWorth the price.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 1 October 2014", "on 27 October 2016", "on 9 March 2018", "on 6 September 2017", "on 10 February 2018", "on 1 August 2015", "on 3 November 2017", "on 10 March 2017", "on 29 June 2016", "on 10 February 2018"], "reviewer": ["SP", "dg", "Sahil Nakhwa", "DEBENDRA CHANDRA ROUT", "Jeyamurugan", "Satyakam", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Amazon Customer"]},
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["2 bottles are without recycling number >> 2 bottles have  fuzzy number >> Which plastic is used for these????", "Awsome product", "I don't have any complaint", "Much better than the regular bottles", "Amazing original product at comfortable price", "1 bottle ,not upto the mark", "Quality Water bottles", "Big Names selling filth on Amazon", "Excellent bottles but number not mentioned clearly.", "Quality not as expected"], "review": ["Buying plastic ware ? You must Check recycling number.  \nNo brand is above board. For your health and well being you must be vigilant.\nMany premium water bottles are been sold as safe but are actually PET or with\nharmful plastics.  \n>>> The recycling numbers 1, 3, 6 and 7 should be avoided for use as water\nbottles. These numbers are indicated inside the triangular recycling symbol.  \n  \nIn the product description there is no mention of the type of plastic used or\nthe recycling numbers . Virgin plastic and food safe plastic are vague terms\nand don't indicate the kind of plastic used.  \n  \nThe first thing I checked after unpacking the bottles was the bottom where the\nrecycling number is indicated inside a triangle.  \nTwo bottles have the triangle and two don't !!  \nThe number inside the triangle is not easy to read. This is the most important\npart of the bottle meant for water storage. Why is Tupperware not transparent\nwith sharing the recycling numbers. Are they selling inferior quality to us\nIndians? From different angles they appear as different numbers.  \nWhat type of plastic is used for making these bottles? With out recycling\nnumbers there is no guarantee of safety 👎  \n  \nErgonomics, color, looks are all secondary in a water bottle.  \nThe most important aspect is the safety. The water we shall consume from these\nbottles every day has to be free from chemicals that can get leached into it\nfrom the bad plastic.  \n  \nThey are good looking and well designed bottles  \nI received , blue, green, yellow and orange colours. They are transparent and\nthe caps fit well and are leak proof.  \nNo issues with the appearance but quality of plastic ?????  \nI think the Number on two bottles is five. Numbers 2, 4 and 5 are safe\nplastics.  \nI returned H2O bottles from cello as they had recycling No. 1 clearly marked\nin the bottom but the Tupperware bottles don't even show the number clearly.  \n  \nNot expected this from Tupperware. 👎\n\n", "Awsome product had previously given 1 star and on both occassions the review\nwas not posted.  \nThese are not original Tupperware there is no #5 mark which is present in all\nTupperware products.  \nAlso the material seems to be very light will definately break if falls down.  \nHad returned the product and got refund.\n\n", "I had purchased Tupperware Aquasafe Water Bottle Set a year back, and I've\noverall good experience.  \n  \nHere are my observations:  \n  \n1\\. The product looks similar to its pics on Amazon.  \n2\\. These bottles are very durable. Easy to clean. No issue of foul smell. The\nlook is perfect.  \n3\\. The product is as per my expectation, and I don't have any complaint as\nsuch.  \n4\\. Tupperware products have always been costly. So the cost of bottles didn't\nsurprise me.  \n  \nVerdict: I don't have any complaint\n\n", "I received four different colored bottles in a plastic bag but there was no\ndamage or dents to the bottles. The Tupperware logo is embossed on the bottles\nand caps so I think it should be genuine. The quality of the plastic is much\nbetter than the regular bottles found in the marketplace. I personally prefer\nall bottles in the same color but the advantage of different colored bottles\nis that they don't get mixed up when traveling in a group. Amazon should also\ntake care to package them better.\n\n", "All bottles(4bottles) are original and it is original Tupperware at cheap\nprice just 575 rupees. In recycle mark 5 is written so it is original\nTupperware. I have received bottles in 4 different colour green Orange Yellow\nand violet.\n\n", "I ordered 4 sets of these and all bottles were Tupperware brandished however\n,1 bottle even though of Tupperware was of lower quality plastic and i think\nthat's the reason why you are getting it this cheap ,but all in all good\nproduct in good price\n\n", "These are good quality bottles grade 5 plastic manufactured and can be use for\ndaily water consumption, just select cloudtail seller for genuine product\n\n", "The bottle stinks while drinking water from it. Although the product is from\nTupperware, i doubt the originality of the same. Such products are sold by\nAmazon without any verification gives a bad name. Even after several washes\nusing detergents, liquid soaps, the smell remains intact. Amazon should\nreplace the product immediately.\n\n", "I have reduced 1 star because at the bottom of the bottle number being\nmentioned is blurry but it seems to be 5. Under the cap of it is clearly\nwritten 5 inside the triangle.  \nPacking was amazing and I recieved all the caps along with bottle. You will\nneed to wash it properly after purchase because little bit of foul smell was\ncoming out of it.  \nI found it to be durable because one of them slipped out of my hand and not a\nscratch was found on it.\n\n", "Don't know whether it's a genuine product but d quality of d bottles is not\nthat good as we get d Tupperware bottles in local market. It has a embossed\nlogo of Tupperware. Thanks to Amazon as we got d product b4 time. Rated 3\nstars bcoz of Amazon service. But didn't like d product quality.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 October 2017", "on 23 April 2017", "on 9 August 2017", "on 26 January 2017", "on 25 October 2017", "on 3 October 2017", "on 30 August 2017", "on 6 November 2017", "on 22 March 2018", "on 4 February 2018"], "reviewer": ["Karmic Voice", "RP.", "Manoj Krishnan", "Geo", "Anand", "Damini", "dhruvchauhan", "Ninad Pongde", "Amazon Customer", "Kadkade Gauri Gautam"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars"], "title": ["Its good", "But they are great.", "Tupperware Bas Naam Kafi hai", "Excellent Deal !!!", "Good quality bottles!", "Tupperplanet", "Great quality & price", "A poor quality product!!", "Awesome material quality . Fulfil all needs", "Bad premium"], "review": ["No damage or scratches, was packed neatly and delivered promptly. Don't think\ntwice, go for it.  \nThe bottles are of 1 litre and should be preferably used for home use or on\nlong journeys. Its not very suitable as a school water bottle because of size.\n\n", "Packaging for bottles as well as caps was very impressive. I received bottles\nof different colours than shown (orange, light yellow, green and a different\nlighter shade of purple). But they are great.\n\n", "Best one everyone knows... iss se behtar koi aur water bottle nahi...\n\n", "the bottles are genuine 1 lit tupperware and in good condition and are as\nspecified by the buyer got them @ 650 received 4 colors as per description  \nPros:  \nthe plastic was better when compared to other brands  \nBottle cap will not break on fall  \nwaiting to buy another set when the price drops will upload pictures in a\nwhile\n\n", "Got these nice Tupperware bottles for 680 Rs. Bottle quality is as expected\n,really good!  \nPlastic is PP 5 grade.  \n( Frds pl use 2,4 or 5 grade plastic only.  \nDO NOT Use PET gr1 plastic (coldrink ,most water bottles and cans)more than\nonce. Thanks\n\n", "If one wants to use any food grade plastic stuff, Tupperware is the brand of\nchoice (now being made at Dehradun, Uttarakhand). The other well known\nAmerican brand Rubbermaid is still relatively unavailable in India. Great\nproduct and funky colours!\n\n", "Excellent quality bottles at an affordable price! The multicoloured bottles\nadd to the aesthetic appeal. The bottles were well packed and in good\ncondition. Delivery was made before the expected date. Quite satisfied with\nthe product & service.\n\n", "Please don't buy it... It stinks everyday.. Even low grade plastic bottles\nwill not be like this...4 bottles and u cannot even return them..u cannot even\nfigure out what grade plastic the bottle is 5/6. Didn't expect this from\nTupperware.\n\n", "Very best material used in this bottle . Its quality is awesome and it was a\nlifetime use product. I recommended this product to buy it. When we cool water\nin it it does not get normal easily it taks times so it was a amazing item for\nuse.\n\n", "The bottles should be fully prewashed to remove the plastic taste and smell.\nThe product still changes smell and taste of water sheet after weeks.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 November 2016", "on 5 March 2018", "on 16 March 2018", "on 22 August 2015", "on 23 October 2016", "on 3 July 2014", "on 6 August 2016", "on 3 March 2018", "on 31 August 2017", "on 22 January 2018"], "reviewer": ["Vaishnav R.", "Vedant Chandra", "Ankur Shrivastava", "GIRISH", "Nishant", "Suneel", "Mitalee N", "Spoo", "Mamta sharma", "Tarang1"]},
{"rating": ["4.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Four Stars", "Great buy.", "Five Stars", "Three Stars", "Five Stars", "good purchase", "Awsome product and great packing.", "Original Tupperware bottles.", "Five Stars", "Five Stars"], "review": ["good bottles but next time buy glass one for safety of your health\n\n", "Great product..no plasticky smell..sturdy.Only grouse was that all the bottles\nare the same color (fortunately blue and not yellow)...would have preferred a\nmix of colors.Packing was Amaz(on)ing :-D.\n\n", "Great product. Exactly as described\n\n", "Two Bottles are damaged at the bottom. Got for INR. 673 through flash sale.\n\n", "3 bottles i got are good product.... but 1 bottle has a smell inside it.... i\ncleaned it many times but still its there...  \n  \nfast delivery.... looks exactly like in the picture....\n\n", "overall nice products in this price range\n\n", "The product is awesome and the packing was really nice. The bottles are\nexactly as they look on the web site. There are no questions about quality as\nit is Tupperware. The delivery, although happened within promised time span,\ncould have been faster.\n\n", "The quality is great. Not like cheap plastic bottles.just holding these n your\nhands you can tell the difference. Of course you pay a little more but it's\nworth spending the money on.\n\n", "very nice product. Lovely colours. Value for money\n\n", "Nice product.. very strong and recommend\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 19 November 2017", "on 11 September 2014", "on 25 September 2017", "on 19 August 2017", "on 12 August 2015", "on 3 February 2018", "on 6 November 2015", "on 12 March 2016", "on 14 January 2018", "on 19 January 2018"], "reviewer": ["saravanan", "Manoj Basrur", "prem prateek", "NANDHU", "Anju", "DIPAK", "Shashank Rai", "yogi", "Raju", "Amazon Customer"]},
{"rating": ["1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Waste of money all four bottles smelling", "Four Stars", "Very good product. I am wondering what took me so ...", "The colors of the bottles were different when i received ...", "Good service and nice product..", "Not at all good. Plastic quality number is not visible", "doubt whether its orginal......", "best deal", "Not good", "One Star"], "review": ["It's duplicate product it's getting smell.wrote experience with Amazon.y u\npeople selling duplicate product for less cost. Waste of money all four\nbottles smelling.even if we wash also not going bad smell.\n\n", "Good quality but costly.Colour should have been white & blue also.\n\n", "Very good product. I am wondering what took me so long so purchase it. Maybe\ncost But one suggestion, don't look on the cost part. Its one time investment\nand definitely better than any other bottles. Lifetime warranty ultimately\nmakes it cheaper.\n\n", "The colors of the bottles were different when i received the package! I wanted\nin different but got all four bottles in BLUE!\n\n", "Delivered before estimated time. Nicely packed. As the name suggest tupperware\nis very nice brand and bottles are pretty good. I have got all four bottles of\ndifferent color as picture describe and i love that. thanks R.K homeware and\namazon. Really good service.\n\n", "Seems to be not genuine. The plastic quality number is not visible on backside\nand it seems to cheat customer.\n\n", "i got different colours,tat was ok,but only one bottle at its bottom was\nprinted with the triangle marking as 5,y other bottles doesnt have that?inside\nthe cap it is written as pp and number 5......is this product an orginal\none??????\n\n", "its best quality no doubt tupper is best in all brand.. price is little high\nbut you will happy with this product\n\n", "It has little hollow on the sides in the base where the dirt sticks and even\nthe bottle brush cannot remove it. I have to really struggle to clean the\nbottles .\n\n", "poor quality, i doubt if they were original.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 May 2017", "on 4 March 2016", "on 2 September 2014", "on 22 February 2018", "on 8 July 2014", "on 30 November 2017", "on 28 October 2016", "on 4 February 2018", "on 17 July 2016", "on 28 July 2017"], "reviewer": ["saranya", "M S.", "Mohit Dayal Mathur", "Meghana Pujar", "Manish jha", "Frosektn", "Amazon Customer", "prince mall deoria up", "VB", "Nasser"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["I'm happy with my Tupperware", "Can trust tupperware", "Genuine", "I'm very happy with these tupperware water bottle", "Excellent Quality & Worth the money spent", "First time when I washed the bottle the color of ...", "Four Stars", "Recieved the original product.", "Five Stars", "Five Stars"], "review": ["It's Tupperware, and the bottles are all perfect. Four different colors,\nspruce up my kitchen counter! :)  \nThe best thing about them is I can wash them with hot water.\n\n", "Good but one of the bottle( yellow one) turned green at the bottom after some\ndays use.tried cleaning but no use disappointed with it. The rest are fine\n\n", "Genuine Tupperware, Nice Colours\n\n", "I'm very happy with these tupperware water bottle. thanks for amazon, i got\nthese with good discount. looking forward to buy more.\n\n", "Very good quality product. Colour,look and feel is great. Worth all the money\nspent.\n\n", "First time when I washed the bottle the color of water changed. I don't know\nif this happens regularly with other Tupperware products or not. I didn't face\nthis problem when I bought Tupperware bottles earlier\n\n", "Product is good but one of the bottles inside the package is somewhat damaged.\nNot going to replace it.\n\n", "Very good quality bottles. Make sure you buy from Cloudtails to get original\nbottles.\n\n", "Quality is good.pls go for it\n\n", "Good colors as expected\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 December 2015", "on 24 September 2017", "on 16 February 2018", "on 10 March 2016", "on 1 February 2017", "on 1 August 2016", "on 10 October 2017", "on 7 February 2018", "on 13 March 2018", "on 17 July 2017"], "reviewer": ["Asha Tampa", "Amazon Customer", "Shako", "nikhat banu", "Akhil Rane", "ajit", "sandip", "Amazon Customer", "vijaya", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Seller asked for 5 star", "Absolute Quality & assurance of Tupperware", "I like it, thou a bit disappointed", "Tupperware name itself indicates that it is good. All 4 bottle are different colors", "TUPPER IT!!", "The product is sturdy and water tight", "Overall it meets expectations. The only problem I have ...", "Great quality bottles with nice colours", "Awesome product.", "Value for money"], "review": ["Good quality product. But disappointed to a letter inside asking for 5 star.  \nDon't do that. I can't give five star for another 150rs free gift.  \n  \nIf you didn't ask that i would have given 5 stars.\n\n", "I have been using tupperware products and know it's always worth paying a\nlittle more for the high quality product tupperware give which make every\nsingle rupee count it for. This set of 4 bottles is a great deal and is\nabsolutely worth it's price and advantage is it's price lower then market\nprice.\n\n", "Nice bottles, as Tupperware leads as a top brand. A bit disappointed, as all\nbottles were in blue color. I did not get multi-color as was depicted in the\npicture while making the purchase. Apart from that, great product.\n\n", "Tupperware name itself indicates that it is good . All 4 bottle are different\ncolors, nice , I loved it\n\n", "Tupper ware is reliable and long lasting product.  \n  \nThanks to Amazon for making it easy to buy it online.\n\n", "Meeting the high standards set by tupperware. The product is sturdy and water\ntight. Amazon packaging and delivery were, as always, excellent. The product\ndidn't suffer any scratch during transit.\n\n", "Overall it meets expectations. The only problem I have is that the engraving\nat the bottom of the bottle which indicate the plastic quality is not clear,\nfor genuine tupperware bottle I would have expected plastic of grading 5 or 7\nclearly written. It shows a faint 5.\n\n", "Good colours. Solid sturdy bottles. Great quality plastic.  \nBought these in a deal so I am happy.  \nIt's Tupperware, so you don't really need to read any review. Just buy them.\n\n", "Awesome product... quite durable...little expensive but its worth it. highly\nrecommend in case one is looking for the water bottles.\n\n", "I bought via cheapandbest retailer, it was well packed and was in new\ncondition. I am fairly impressed by the pricing, I bought it for ₹715 wheras\nit's available for more than ₹900 in any retail shop.  \n  \nAs for the product it's genuine and of good quality. It is a durable product\nand you wont require to buy again.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 30 January 2015", "on 4 May 2014", "on 25 August 2014", "on 1 February 2017", "on 5 October 2016", "on 16 October 2016", "on 29 June 2016", "on 14 November 2016", "on 13 April 2016", "on 16 May 2016"], "reviewer": ["Mahesh", "Upen", "Dibyesh", "Girishgouda", "Dr P.", "Rishikesh", "Pushpak", "Prakhar Jain", "Sanjay", "Sohel"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Good product and design... 750ml is better for fridge purpose", "Great product !!!", "Quality excellent..", "A must have....", "Great item", "The description says set of 4, 1 litre bottles ...", "Received only two colors not 4 different ones as shown in the picture.", "Its not as good as the ones i hav purchased", "Must buy", "FATAFATI,nothing to say"], "review": ["Great product and design.  \nOnly thing it is a 'bit' wider to fit in easily in side door of fridge.\nAlthough it does fit in but many times you have get right angle to take them\nout from side door. 750ml once are better for keeping in fridge.\n\n", "If you are looking for water bottles, then Tupperware is a brand, don't think\nmuch, just go for it.  \nYou will receive four different colour bottles and bottles are very good.\nPackaging was also good, received well in time. Overall nice buy. Thank u\nAmazon.\n\n", "Different colors were sent... Quality excellent.... Green, Orange, Cream,\nLight lavender....not satisfied with colors.... should not buy during fest\nseason....\n\n", "Good offer, a typical Tupperware product- sturdy, classy a must have product\n... I agree the price is on the higher side, but good things doesn't come\ncheap.... Once you use it, i am sure, you would never like to go back to\nfilmsy water bottle again...  \n  \nQuick delivery by amazon.... 👍\n\n", "UPDATE 2018 Going on into the fourth year of these bottles. I have 8 of them\nnow, 2 of each color. I see a lot of people around me have these bottles now,  \nBut mine looks more vintage ;)  \nReally sturdy & beautiful, all 4 colors are appealing.\n\n", "The description says set of 4, 1 litre bottles. But received set of 4, 500ml\nbottles. The product is genuine Tupperware but wish they had sent me the 1\nlitre bottles.\n\n", "I ordered for two sets (4 bottles each) and expected that I would receive all\nfour colors in a set as shown in the picture. However, i received only yellow\nand purple. This is the only reason I am going with a 4/5. The quality of the\nbottles is excellent off course it is Tupperware and there is no second\nthought about it. Package and delivery from Amazon are good asusual.\n\n", "the quality of the water bottle is suspect. Its not as good as the ones i hav\npurchased. May be the tuppreware hav degraded their quality or the ones i got\nare counter-fake...\n\n", "Awesome Product... First time i bought a tupperware product and i must say\nthat i am really impressed. They are made of high quality plastic and very\nstrong and durable. The large mouth of the bottle allows for easy filling,\npouring and cleaning of the bottle.\n\n", "Today l have received my products and I am 100% satisfied with the awesome\nproducts supplied by amazon.The quality of the bottles is no doubt good. I\nhave received four wonderful amazing, nice bottles (by Tuppperware) with four\ndifferent colours...highly recommended...\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 21 April 2015", "on 8 March 2016", "on 23 October 2017", "on 2 June 2015", "on 28 August 2014", "on 26 January 2017", "on 3 October 2016", "on 13 January 2016", "on 15 May 2014", "on 22 July 2016"], "reviewer": ["Priyank Chandra", "Amazon Customer", "ESZM", "Parvinder", "Chaitanya", "Amazon Customer", "Amazon Customer", "Amazon Customer", "Abhinav Jaiswal", "Kishore  sarkar"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["Tupperware is always good. Here its with discount", "wonderful product", "Very good product", "Delightful and robust", "the feel of the cap etc are great. I got it for 673 during a lightning ...", "Good to buy", "Totally satisfied with Amazon and Tupperware products", "Worst ....fraud....", "No -ve remarks. Both tupperware and Amazon are best in their businesses, I feel.", "Good product"], "review": ["Tupperware is always a quality product when it comes to food grade containers.\nThe matter here is we get in good discounted price when compared to agents\nselling it. When I’m writing this I see the price is much more dropped\n\n", "Thanks a million to Amazon. To brought these quality products to your beloved\ncustomers. Awesome quality.plan the same set of packing in square bottles\nrange. But in square bottle quality and checking should be done properly from\nthe seller.Amazon should concern this too.I received damaged square water\nbottles from Amazon but no action done from Amazon. Please be alert when we\nare spending 300 rupees on it for each bottle. Quality should be great.\n\n", "Tupperware products are good and durable. Ordered set of 4 bottles on Amazon\nand got it as described and in a sturdy package. The quality of plastic is\nvery good, no smell and no leakage of water from the cap. A value for money\nproduct and excellent service by Amazon !\n\n", "The bottles were neatly packed. The delivery was within the deadline period.\nThe products are, as one would expect from Tupperware, top notch. Food grade\nplastic in delightful colours\n\n", "I was confused between H2O by Cello and Tupperware and I went for this one\nafter I found that Cello bottles don't react well to hot temperatures. The\ncolours, plastic material, the feel of the cap etc are great. I got it for 673\nduring a lightning deal :)\n\n", "I have received them in good package and everything looks fine.  \nYou may get cheaper bottles than this, when you consider the quality, do opt\nfor this!. You can self-acknowledge the difference by checking the number\nprinted inside the recycle symbol of any plastic item. number 5 as of far i\nknow denotes virgin plastic and Tupperware has only those.  \nso, This is a nice combo of bottles to buy.\n\n", "I got 4 multicolour tupperware bottles (1 litre each) at very reasonable\nprice.Nicely packed.Very good product and healthy too as recycle tag\nprovided.Received original Tupperware bottles.Amaxon provided this bottles\nLesser than market rate\n\n", "Worst product....duplicate....cheap plastic ..pet not visible...\n\n", "Got the set same as shown.  \nNo -ve comments.  \nTupperware is the best in this segment.  \nI love these water bottles for quality, colors and shape/design.\n\n", "Product is very good, but I wish the price was a little on the lower side\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 20 September 2015", "on 3 August 2015", "on 18 November 2014", "on 20 April 2017", "on 16 August 2017", "on 29 May 2015", "on 5 March 2018", "on 29 March 2017", "on 23 January 2017", "on 12 June 2017"], "reviewer": ["S R", "Vijay kumar", "Rajesh Sharma", "Sreemoy", "Rushabh L.", "Rudhra", "mainak halder", "ansh", "Krishh Na", "Amazoner"]},
{"rating": ["3.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Three Stars", "Quality, smooth and thickness as same as signorware. ...", "Plastic codes are not provided on bottles", "Lives up to the name", "I ordered the product twice n I received Good first time n low quality 2nd time", "Packing is good casing no damage to bottles in transport and service is fast. Bottle quality is good.", "Nice bottles", "Sturdy color storage", "Quality is very good but pricey for plastic bottles", "it's just awesome as mentioned in bottle discription"], "review": ["Not as strong as the bottles I have bought in 2013 but I got them at half the\nprice of course ithese may not be duplicate ones but erosion in standard may\nhave taken place.still a good deal\n\n", "Quality, smooth and thickness as same as signorware .small doubt is this\nproduct is original Tupperware or duplicate? My aunt has Tupperware bottle it\nis sooo hard. But it is not that much thickness\n\n", "Only the bottle caps have a visible 5 rating. The bottle body on the other\nhand have smudged codes which are not readable. I am suspicious about the\nreason why the codes are not mentioned on the bottle body unlike the cap.\n\n", "Received a colourful set; very good quality bottles (it is, however,\nrecommended to not use the same plastic container for too long). They have\nbeen made from high grade plastic (safe for use) and do not leak.  \n  \nRecall one of them had a weird odour that went away after soaking all bottles\nin warm water.\n\n", "I recieved different quality(low) 2nd time. I ordered the product twice n I\nreceived Good first time n low quality 2nd time. If u see the picture I hav\nsent U see the bottom of bottle, its 2 printed on it, all 4 bottles I ordered\n2nd time had this number, the one I ordered first, had a symbol something like\nthis with a fork and thats very good quality ♎. I felt cheated 2nd time. Be\ncareful to order\n\n", "Observed typical good qualities of Tupperware  \n1\\. Sturdy bottles - won't break if dropped by mistake  \n2\\. Leak proof bottle - Water never leaks from bottle and one can safely put\nthem in laptop bags without thinking of water being spilled inside bag.\n\n", "Bottles are as per the shown pics and description. The recycle number is 5.\nGreat deal at 575. Go for it. Thank you Amazon for discounts and timely\ndelivery. Thank you Tupperware!\n\n", "Great product, clear, solid bottles. good bright colors. 1 liter capacity.\nDelivered in perfect condition. very handy.  \nI will recommend them.\n\n", "The product quality is very good, no doubt. But it is pricey. After all for a\nset of 4 plastic (okay good plastic) the max price is Rs 940. I feel even\nafter discount which is Rs 665 for 4 bottles is very high. Otherwise I liked\nthe colours , the quality and design.\n\n", "I haven't single Negative feedback, it's just awesome as mentioned in bottle\ndiscription . Thank you Tupperware & Amazon for such a great deal.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 December 2017", "on 24 July 2016", "on 10 March 2018", "on 14 July 2016", "on 16 March 2018", "on 29 July 2017", "on 13 February 2018", "on 25 February 2016", "on 1 September 2016", "on 15 August 2017"], "reviewer": ["Srinivasarao j.", "himaja", "Vaibhav S.", "Kartz", "mohd Sajid ", "Dheeraj K.", "Dr.Archana solanki ", "Indywrites", "Reliable Feedback", "Prashant jaulkar"]}
]