[
{"rating": ["2.0 out of 5 stars", "1.0 out of 5 stars", "2.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["2 bottles are without recycling number >> 2 bottles have  fuzzy number >> Which plastic is used for these????", "PET-2 not safe for daily water usage,Avoid.", "I ordered the product twice n I received Good first time n low quality 2nd time", "Much better than the regular bottles", "Totally satisfied with Amazon and Tupperware products", "Nice bottles", "Disappointed", "Amazing original product at comfortable price", "Bottles without caps", "One Star"], "review": ["Buying plastic ware ? You must Check recycling number.  \nNo brand is above board. For your health and well being you must be vigilant.\nMany premium water bottles are been sold as safe but are actually PET or with\nharmful plastics.  \n>>> The recycling numbers 1, 3, 6 and 7 should be avoided for use as water\nbottles. These numbers are indicated inside the triangular recycling symbol.  \n  \nIn the product description there is no mention of the type of plastic used or\nthe recycling numbers . Virgin plastic and food safe plastic are vague terms\nand don't indicate the kind of plastic used.  \n  \nThe first thing I checked after unpacking the bottles was the bottom where the\nrecycling number is indicated inside a triangle.  \nTwo bottles have the triangle and two don't !!  \nThe number inside the triangle is not easy to read. This is the most important\npart of the bottle meant for water storage. Why is Tupperware not transparent\nwith sharing the recycling numbers. Are they selling inferior quality to us\nIndians? From different angles they appear as different numbers.  \nWhat type of plastic is used for making these bottles? With out recycling\nnumbers there is no guarantee of safety 👎  \n  \nErgonomics, color, looks are all secondary in a water bottle.  \nThe most important aspect is the safety. The water we shall consume from these\nbottles every day has to be free from chemicals that can get leached into it\nfrom the bad plastic.  \n  \nThey are good looking and well designed bottles  \nI received , blue, green, yellow and orange colours. They are transparent and\nthe caps fit well and are leak proof.  \nNo issues with the appearance but quality of plastic ?????  \nI think the Number on two bottles is five. Numbers 2, 4 and 5 are safe\nplastics.  \nI returned H2O bottles from cello as they had recycling No. 1 clearly marked\nin the bottom but the Tupperware bottles don't even show the number clearly.  \n  \nNot expected this from Tupperware. 👎\n\n", "First of all note that it's PET number is 2 & not 5. The answers in the\nquestions section also misguided me because many have said that it is 5. Also\nthe bottles which are supposed to have that printed on their bottoms are\nmissing the needed info. which raised doubts regarding it's genuinity.  \n  \nPET stands for 'polyethylene terephthalate', which is the resin grade used in\nthe manufacturing of the product.  \n  \nThese bottles are PET 2, which are relativey safer than 1 but it is high\ndensity polyethylene which is generally used for toys, chairs milk jugs etc,\nbut not safe enough for water storage for longer periods. They release\nantimony and phthalates over time so it is better to avoid such.  \n  \nPET 5 is polypropelene which is a thermostatic polymer, which is used in\nmanufacturing of plastic cups, baby bottles, kitchen & microwaveable plastic\ncontainers. So it is better to opt 5.  \n  \nPaying around 900 for these grade 2 bottles is too expensive and not safe.  \nif glass & steel bottles are not possible at least opt for PET 5 bottles,\nwhich are not as carcinogenic as other grades. hope this info. helps.  \ncheers.\n\n", "I recieved different quality(low) 2nd time. I ordered the product twice n I\nreceived Good first time n low quality 2nd time. If u see the picture I hav\nsent U see the bottom of bottle, its 2 printed on it, all 4 bottles I ordered\n2nd time had this number, the one I ordered first, had a symbol something like\nthis with a fork and thats very good quality ♎. I felt cheated 2nd time. Be\ncareful to order\n\n", "I received four different colored bottles in a plastic bag but there was no\ndamage or dents to the bottles. The Tupperware logo is embossed on the bottles\nand caps so I think it should be genuine. The quality of the plastic is much\nbetter than the regular bottles found in the marketplace. I personally prefer\nall bottles in the same color but the advantage of different colored bottles\nis that they don't get mixed up when traveling in a group. Amazon should also\ntake care to package them better.\n\n", "I got 4 multicolour tupperware bottles (1 litre each) at very reasonable\nprice.Nicely packed.Very good product and healthy too as recycle tag\nprovided.Received original Tupperware bottles.Amaxon provided this bottles\nLesser than market rate\n\n", "Bottles are as per the shown pics and description. The recycle number is 5.\nGreat deal at 575. Go for it. Thank you Amazon for discounts and timely\ndelivery. Thank you Tupperware!\n\n", "Got this 4 bottle without cap...  \nReally disappointed..\n\n", "All bottles(4bottles) are original and it is original Tupperware at cheap\nprice just 575 rupees. In recycle mark 5 is written so it is original\nTupperware. I have received bottles in 4 different colour green Orange Yellow\nand violet.\n\n", "Received bottles without caps..want to give negative stars..but they don't\nhave such options\n\n", "Recieved the bottles without bottle caps\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 16 October 2017", "on 27 March 2017", "on 16 March 2018", "on 26 January 2017", "on 5 March 2018", "on 13 February 2018", "on 9 March 2018", "on 25 October 2017", "on 26 January 2018", "on 20 February 2018"], "reviewer": ["Karmic Voice", "Ram ..✒️.....", "mohd Sajid ", "Geo", "mainak halder", "Dr.Archana solanki ", "Payal", "Anand", "Amazon Customer", "Amit S."]},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["One Star", "perfect fit, value for money product", "Five Stars", "Five Stars", "Five Stars", "Five Stars", "the feel of the cap etc are great. I got it for 673 during a lightning ...", "I want to add pictures. This is Grade 2 plastic. Not Grade 5. Seller: Cheapandbest", "Good product", "Five Stars"], "review": ["Very bad. That is spread bad smell. Don't buy . Waste of money\n\n", "Tupperware, the name is enough.. Highly durable, perfect fit, value for money\nproduct..\n\n", "Quality is good.pls go for it\n\n", "its worthy to buy good one..\n\n", "Didnt get any discount\n\n", "Low price. Very good\n\n", "I was confused between H2O by Cello and Tupperware and I went for this one\nafter I found that Cello bottles don't react well to hot temperatures. The\ncolours, plastic material, the feel of the cap etc are great. I got it for 673\nduring a lightning deal :)\n\n", "I want to add pictures. This is Grade 2 plastic. Not Grade 5. Seller:\nCheapandbest\n\n", "Good quality and genuine product.\n\n", "Excellent product. I'm very much happy.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 February 2018", "on 4 February 2018", "on 13 March 2018", "on 13 March 2018", "on 25 March 2018", "on 19 March 2018", "on 16 August 2017", "on 17 August 2016", "on 13 March 2018", "on 8 March 2018"], "reviewer": ["Jeyamurugan", "shivam", "vijaya", "Daya", "Anurima Bera", "Amazon Customer", "Rushabh L.", "Amazon customer", "Yuvraj singh", "Amazon Customer"]},
{"rating": ["4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Color differnece", "Big Names selling filth on Amazon", "I am extremely sorry that I ordered for 4 bottles ...", "Feeling fraud..... Very very unsatisfied ...", "Ok", "amazon has done great job. At such 575 INR", "Three Stars", "The colors of the bottles were different when i received ...", "Tupperware Water Bottles", "Loved the colors!"], "review": ["I have received different colours of bottle ... red n lemon green has been\nreplaced by yellow n orange 😓😓..I specially wanted lemon green ... but now not\nsure if can I get same colour\n\n", "The bottle stinks while drinking water from it. Although the product is from\nTupperware, i doubt the originality of the same. Such products are sold by\nAmazon without any verification gives a bad name. Even after several washes\nusing detergents, liquid soaps, the smell remains intact. Amazon should\nreplace the product immediately.\n\n", "I am extremely sorry that I ordered for 4 bottles of size 1litre, all the four\nbottles has come with out lids. Kindly send four lids immediately.\n\n", "Feeling fraud..... Very very unsatisfied with the item... Cos i got the whole\n4 bottles without uper nob..... Thaugh i was shawn it with nob in the order\npicture\n\n", "Ordered on 24 sep 2017 @675 and recieved on 28 sep 2017.  \n  \nPros:  \n\\- ok quality  \n\\- i recieved 4 one litre bottles of red, yellow, violet and green color  \n  \nCons:  \n-poor packaging  \n-doubt regarding genuine product, as there was no seal or box packing. It was just wrapped in plastic  \n-all bottles are different colour\n\n", "trust me - my package of bottles got delivered on time . the bottle colour is\ntrue as mentioned online in the picture. Just wash the bottle in & outside\nwith clean water and then use\nit..............................................................amazon has\ndone great job. At such 575 INR. cheap price i got 4 bottles of 1 ltr.\n\n", "Not as strong as the bottles I have bought in 2013 but I got them at half the\nprice of course ithese may not be duplicate ones but erosion in standard may\nhave taken place.still a good deal\n\n", "The colors of the bottles were different when i received the package! I wanted\nin different but got all four bottles in BLUE!\n\n", "Using for last three months and pretty good for keeping hot/cold/mixed water.\nMaterial and color combination also quite good.\n\n", "Liked the bottles and loved the colors too.. pretty nice 1 litre tupperware\nbottles at a reasonable price.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 29 January 2018", "on 6 November 2017", "on 5 March 2018", "on 20 February 2018", "on 29 September 2017", "on 30 September 2017", "on 18 December 2017", "on 22 February 2018", "on 13 March 2018", "on 28 February 2018"], "reviewer": ["Arti Mudaliar", "Ninad Pongde", "RANJAN PATI", "sunil pala..", "Shriniwas", "Akshay Birajdar", "Srinivasarao j.", "Meghana Pujar", "Soumen", "Kanika Bhatia"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Value for money", "Five Stars", "Five Stars", "Four Stars", "Really excellent", "Five Stars", "good product and service by", "Thanks to Amazon", "Four Stars", "Another great experience from Tupperware"], "review": ["Good quality..genuine product..good deal\n\n", "excellent\n\n", "awesome\n\n", "GOOD\n\n", "Excellent.\n\n", "Good\n\n", "Original product.. good product and service by amazon\n\n", "Excellent product\n\n", "I use it as hot water bag and I can drink the water as well.\n\n", "As amazing as always. Product and packaging are impeccable. Delivery is good\ntoo.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 8 March 2018", "on 17 March 2018", "on 16 March 2018", "on 19 March 2018", "on 25 March 2018", "on 25 March 2018", "on 14 February 2018", "on 14 March 2018", "on 10 January 2018", "on 19 January 2018"], "reviewer": ["Amazon Customer", "ranga", "Amazon Customer", "Amazon Customer", "J. Singh", "Amazon Customer", "Mavlik parmar", "Amazon Customer", "Agnes", "Mahesh"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["The product is 100% original", "I have purchased Tupperware twice in the past and never have had this bad quality of bottles", "Quality not as expected", "I don't have any complaint", "Plastic codes are not provided on bottles", "A poor quality product!!", "My experience was not too good", "But they are great.", "Good quality", "D colrs wich I got r worst.. I thought I would get d Sam ..."], "review": ["I dont need to say anything more.  \nBest product us delivered\n\n", "AVOID PURCHASE!  \n  \nPlease be aware this is definitely not original Tupperware. I have purchased\nTupperware twice in the past and never have had this bad quality of bottles.\nThus concluded that is surely not the original.  \n  \nEven after washing multiple times and with hot water there is a stench which\nis similar to petroleum products in the water in like 30 mins after filling\nit.\n\n", "Don't know whether it's a genuine product but d quality of d bottles is not\nthat good as we get d Tupperware bottles in local market. It has a embossed\nlogo of Tupperware. Thanks to Amazon as we got d product b4 time. Rated 3\nstars bcoz of Amazon service. But didn't like d product quality.\n\n", "I had purchased Tupperware Aquasafe Water Bottle Set a year back, and I've\noverall good experience.  \n  \nHere are my observations:  \n  \n1\\. The product looks similar to its pics on Amazon.  \n2\\. These bottles are very durable. Easy to clean. No issue of foul smell. The\nlook is perfect.  \n3\\. The product is as per my expectation, and I don't have any complaint as\nsuch.  \n4\\. Tupperware products have always been costly. So the cost of bottles didn't\nsurprise me.  \n  \nVerdict: I don't have any complaint\n\n", "Only the bottle caps have a visible 5 rating. The bottle body on the other\nhand have smudged codes which are not readable. I am suspicious about the\nreason why the codes are not mentioned on the bottle body unlike the cap.\n\n", "Please don't buy it... It stinks everyday.. Even low grade plastic bottles\nwill not be like this...4 bottles and u cannot even return them..u cannot even\nfigure out what grade plastic the bottle is 5/6. Didn't expect this from\nTupperware.\n\n", "The product shows 4 different colours but I got 2 blue and 2 pink shades\nunlike flipkart I ordered 4 500 ml and they delivered the same colours as\nshown  \nKudos for flipkart\n\n", "Packaging for bottles as well as caps was very impressive. I received bottles\nof different colours than shown (orange, light yellow, green and a different\nlighter shade of purple). But they are great.\n\n", "I just bought the Tupperware Aquasafe water bottle set. Here are the things\nthat I noted.  \n  \nPros:  \n1\\. The water bottles look and feel very sturdy.  \n2\\. According to the Tupperware's description about this product, looks like\nthey are made from bpa free plastic which is a huge plus.  \n3\\. They are leak proof as long as you close it properly.  \n4\\. Colors are pleasant. Not too bright.  \n  \nCons:  \n1\\. There was a very slight plasticky smell initially. But once it was washed\nand kept open to let it air dry for a few hours the smell went away.  \n2\\. The biggest con according to me is the price. It costs more than double\ncompared to Cello bottles. I haven't tried Cello bottles so can't say anything\nabout their quality.  \n  \nOverall, if you are very specific about quality and bpa free bottles,\nTupperware Aquasafe bottles are the best option.  \nI'm happy with my purchase.\n\n", "D colrs wich I got r worst..I thought I would get d Sam colrs wich is dr in d\npic..don feel lik usin it at all\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 August 2016", "on 15 December 2017", "on 4 February 2018", "on 9 August 2017", "on 10 March 2018", "on 3 March 2018", "on 9 March 2018", "on 5 March 2018", "on 10 August 2016", "on 27 March 2018"], "reviewer": ["Amazon Customer", "Mahesh", "Kadkade Gauri Gautam", "Manoj Krishnan", "Vaibhav S.", "Spoo", "Sahil Nakhwa", "Vedant Chandra", "Sujithra", "dr.sirisha"]},
{"rating": ["5.0 out of 5 stars", "4.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Five Stars", "Thickness is less compared to old bottles from Tupperware", "About the quality", "One Star", "Awesome material quality . Fulfil all needs", "GOOD PRODUCT BUT BLAH!!! BLAH!!!! READ MY REVIEW", "Four Stars", "Five Stars", "Recieved the original product.", "Bottle without cap"], "review": ["Usually tupperwere is good quality, I got good products,\n\n", "Compare to previously purchased bottles to new bottles thickness is less\nquality. Everything is fine.\n\n", "Even I noticed the difference in quality,not happy if we purchase with the\nlocal delar quality is defnitely good please concerned people check with this.\n\n", "Waste product I think it is duplicate\n\n", "Very best material used in this bottle . Its quality is awesome and it was a\nlifetime use product. I recommended this product to buy it. When we cool water\nin it it does not get normal easily it taks times so it was a amazing item for\nuse.\n\n", "Great product as it is a tupperware. But A COMPLAINT FOR AMAZON UR DELIVERY\nBOYS R VERY RUDE N ARROGANT. UR DELIVERY MAN CALLED ME N SAID UR LIFT IS NOT\nWORKING SO HE ASKED ME SHOULD I GIVE IT TO UR WATCHMAN IN VERY ANGRY N\nFRUSTRATED WAY, I SAID ALRIGHT N I ENDED THE CALL, WITHIN 10 SEC HE CALLED\nAGAIN N SAID I M GIVING IT TO UR WATCHMAN SO I SAID OK N RUSHED DOWN TO MY\nGATE'S ENTRANCE (THE LIFT WAS WORKING) WITHIN A FEW SECS I WAS DOWN, THE\nDELIVERY BOY WAS COMING TOWARDS MY WING N HE SAID 10MIN SE KHADA HU(I WAS\nTHERE IN FEW SECS BUT STILL...) I SAID OK BUT THE LIFT IS WORKING HE SAID ABHI\nCHALU HUA HOGA IN N VERY ANNOYED WAY. I SAID ARE APNE AAP KAISE CHALU HOTA\nHAI. THEN HE SAID TOH KYA MAIN PAGAL N GHADA HU. I SAID BOSS ITS\nRESPONSIBILITY MAIN KYU NEECHE AAKE MERE DELIVERY PICK KARU. HE SAID ABHI DE\nDIYA NA. I SAID HAIN BHAI BADI MANERBANI KI. AND HE WAS MURMURING SOMETHING N\nWENT..  \nREMEMBER AMAZON N OTHER CUSTOMERS 1 STAR FOR GREAT TUPPERWARE BOTTLE, 1 STAR\nFOR FAST SHIPPING, -3 FOR KEEPING SUCH PEOPLE IN UR TEAM, FOR THOSE STUPID\nWORDS HE SAID TO ME N FOR MAKING ME COME TO GET MY PACKAGE WHICH WAS TO BE\nDELIVERED BY U TO MY DOORSTEP\n\n", "good. but some are smelling from inside\n\n", "Very good quality bottle s infact i dropped it many times and not even a crack\non it\n\n", "Very good quality bottles. Make sure you buy from Cloudtails to get original\nbottles.\n\n", "I just received the bottles without cap. There is no cap for even one bottle.\nWorst delivery.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 18 March 2018", "on 22 February 2018", "on 28 December 2017", "on 24 March 2018", "on 31 August 2017", "on 30 June 2015", "on 15 March 2018", "on 21 January 2018", "on 7 February 2018", "on 23 January 2018"], "reviewer": ["Ashwini Anjutagi", "ganesh billa", "Bharathi MN", "Praveen Kumar k", "Mamta sharma", "@^@!0!&amp;#60;", "Amazon Customer", "Thirumurugan", "Amazon Customer", "Guru Prasad S"]},
{"rating": ["2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["received other colours", "Five Stars", "Five Stars", "One Star", "Five Stars", "Five Stars", "Bottles received without “CAP”", "Three Stars", "Four Stars", "Not as per expectation."], "review": ["received orange and yellow instead of red and light green\n\n", "Very good item\n\n", "best product... excellent\n\n", "I received it without caps...\n\n", "The product was good and as shown in the image.\n\n", "Good product...\n\n", "Bottles received without CAP\n\n", "one of the bottle(violet color) having persisting smell of paint even after\nmultiple time washing.\n\n", "Material is good\n\n", "Product quality not as per expectation.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 February 2018", "on 20 March 2018", "on 20 March 2018", "on 10 March 2018", "on 10 February 2018", "on 20 March 2018", "on 10 March 2018", "on 16 January 2018", "on 13 March 2018", "on 26 February 2018"], "reviewer": ["K j.", "BIDHAN CHANDRA ROY", "Karthikeyan", "sarika", "Simran Kaur", "Siya Manoj", "Minesh Patel", "Amazon Customer", "C P KUMARI", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["Superb colourful product", "still shining very good product, so bought more", "Bad premium", "The products were better in real", "Tupperware Bas Naam Kafi hai", "best deal", "Very Good Bottle but overpriced || Buy it in a Deal", "Great product.", "1 bottle ,not upto the mark", "One Star"], "review": ["Excellent colour appropriate to picture  \nQuality at its best  \nTrustworthy product  \nEasy shipment  \nSame as outside products  \nBut in other stores u won't find such classic colours  \nAwesome brand\n\n", "I already have one and using from last 3yrs, still shining very good product,\nso bought more\n\n", "The bottles should be fully prewashed to remove the plastic taste and smell.\nThe product still changes smell and taste of water sheet after weeks.\n\n", "I received them in just 2 days. The products were better in real. Quality was\nalso good\n\n", "Best one everyone knows... iss se behtar koi aur water bottle nahi...\n\n", "its best quality no doubt tupper is best in all brand.. price is little high\nbut you will happy with this product\n\n", "\"####\" Writing the Review After One year of Purchase & Extensive Usage \"####\"  \n  \nBuying Price - 649 Rupees  \n  \nGood quality bottles looks stylish too with not so over powering colours, very\nsturdy, but I did felt its a bit over priced, I think good product to buy in\ndiscount and deal, as its very well built and last quite long time, They say\nits BPA free, which it must be as its Tupperware.Yes when you start using\nfirst time you may feel a bit smell, just wash it with luke warm water, what\nwe did is to repeat this wash cycle for few more days to be totally smell\nfree.\n\n", "Great product... Quality is good got delivered within mentioned date...\nPackaging was also got... But happy i got muli colour\n\n", "I ordered 4 sets of these and all bottles were Tupperware brandished however\n,1 bottle even though of Tupperware was of lower quality plastic and i think\nthat's the reason why you are getting it this cheap ,but all in all good\nproduct in good price\n\n", "bottle caps are not available just we got bottle with out caps\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 31 December 2017", "on 2 March 2018", "on 22 January 2018", "on 1 March 2018", "on 16 March 2018", "on 4 February 2018", "on 8 December 2016", "on 27 January 2018", "on 3 October 2017", "on 11 March 2018"], "reviewer": ["Akshay Kumar.C", "S A", "Tarang1", "Amazon Customer", "Ankur Shrivastava", "prince mall deoria up", "Raj Hanish", "Anusha", "Damini", "Jeevan Paul ch"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Five Stars", "One Star", "good quality, good delivery", "Good product... Got it at much discounted price at GREAT INDIAN SALE of Amazon", "Best in the market!", "Quality Water bottles", "Very good product. I like it because its Leak proof ...", "it's just awesome as mentioned in bottle discription", "Great..", "Three Stars"], "review": ["\n\n", "fake product delivered\n\n", "Original product, good quality, good delivery... Loved them :) :) :)\n\n", "Tupperware products are very good Hardy and water remain safe within this\nwater bottle because Tupperware used Food grade plastic of category 5, you can\nsee at the bottom of the bottle or on the inside of the cap.  \n  \nI got this product very low price during great Indian sale of AMAZON and I\nordered it immediately from Amazon India but after 5 days the product was\ndelivered.  \nThe caps where packed up separately in a plastic packet and 4 bottles were of\ndifferent colours in another plastic, I washed this bottles with warm water\nand then I start using the bottles, one of the bottle I am using for my\noffice.  \nHighly recommended this product.  \nMust use Tupperware water bottles which keep water safe other plastic bottles\nrelease various types of toxic chemicals in the water after using 3 to 5 days\nbut Tupperware bottles do not release this type of toxic and harmful chemicals\nin the water so it is good to drink water in Tupperware bottle.\n\n", "Best product!  \nQuality is excellent  \nMust buy!!\n\n", "These are good quality bottles grade 5 plastic manufactured and can be use for\ndaily water consumption, just select cloudtail seller for genuine product\n\n", "Very good product. I like it because its Leak proof and also because it's\nshatter proof. But the yellow coloured bottle colud have been a little\nbrighter in colour.\n\n", "I haven't single Negative feedback, it's just awesome as mentioned in bottle\ndiscription . Thank you Tupperware & Amazon for such a great deal.\n\n", "The colours are good but I would prefer blue instead of yellow\n\n", "Two Bottles are damaged at the bottom. Got for INR. 673 through flash sale.\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 15 February 2018", "on 30 January 2018", "on 17 December 2017", "on 9 January 2018", "on 25 November 2017", "on 30 August 2017", "on 16 February 2018", "on 15 August 2017", "on 7 October 2017", "on 19 August 2017"], "reviewer": ["Deepthi", "lol", "Kavyashree k", "KB", "Kshitiz", "dhruvchauhan", "vivek praveen", "Prashant jaulkar", "Jeet B.", "NANDHU"]},
{"rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars"], "title": ["Five Stars", "Beware of Duplicate Product", "Excellent bottles but number not mentioned clearly.", "That's fine. Why don't you display", "Good.", "Lite and colorful - Perfect size to keep your hydrated", "Cauvery water people should think constructively that's why I got Eco-Friendly WATER BOTTLES and IFB Washing Machine worth buying Love,", "Best quality bottles", "It's great quality and worth every penny.", "Three Stars"], "review": ["Great product. Exactly as described\n\n", "Tupperware bottles sold by the seller are with very bad quality. One bottle is\ndamaged with dent and other bottles are very filmsy. In the bottom, no marks\nare available showing the plastic quality etc., pictures are attached. I would\nlike to give zero star but unfortunately option is not available. Should be a\nduplicate product with the looks\n\n", "I have reduced 1 star because at the bottom of the bottle number being\nmentioned is blurry but it seems to be 5. Under the cap of it is clearly\nwritten 5 inside the triangle.  \nPacking was amazing and I recieved all the caps along with bottle. You will\nneed to wash it properly after purchase because little bit of foul smell was\ncoming out of it.  \nI found it to be durable because one of them slipped out of my hand and not a\nscratch was found on it.\n\n", "Where is my review? Not displayed? That's fine. Why don't you display?\n\n", "Quality is good. Colours are pleasant. I read reviews before I bought and\nthere seem to be a confusion if these are PET 2 or PET 5. I checked all four\nbottles and it says PET 5. However the bag it came in says PET 2. But this\nmight just be a case of improper packing from the seller. Apart from this the\npacking was good and all bottles came in good shape. As usual Amazon was fast\nin delivery. My only negative is that the bottles are a little too big (fat)\ncompared to your average bottle. This makes them hard to hold in your palm and\nonly two bottles fit in my fridge shelf where there used to fit 3 average\nbottles.\n\n", "Top brand for cooling your thirst. Been using this Product for more than a\nyear and no regrets.  \n  \nPros:  \n\\- Easy to hold and drink water  \n\\- Perfect Quantity to keep you hydrated, every time i go out for shopping or\non a journey, its sufficient to take  \n\\- Possible to wash all corners inside the bottle  \n\\- well designed  \n\\- Color resistant, like said already, had been using for more than a year and\nno regrets  \n\\- Liquid Tight, so no worry about water leaks  \n\\- Fascinating colors  \n\\- Superb Quality  \n\\- And finally, it's Tupperware, remember using it since my school days\n\n", "Eco-Friendly product and on the top of the bottle is written \"Eco\" and the\nbottles cost min: 900 bucks and got for 780 bucks saved 120 bucks Amazon.in is\nworth buying when one is Prime Member then free shipping though Prime is 499/-\nI got free washing machine, free micro wave etc free shipping and the bottles\nare free shipping worth a lot to buy these \"Eco\" Products earlier I got 500ml\nas my cousin asked for 1lt for his native place as he is getting fridge got\nthese bottles and Fridge also for SriKalaHasti they are shipping free all\nwater realted. Cauvery water people should think constructively that's why I\ngot Eco-Friendly WATER BOTTLES and IFB Washing Machine worth buying  \nLove,  \nVj\n\n", "Dear all, pls read below instructions before u purchase any plastic bottles.  \nEacb bottles u will find numbers that indicates there quality. So keep only 3\nnos in ur head for drinking water.  \n1st) No.2 its hdpe quality and best for drinking and its costly too,\nTupperware bottles are of no.2  \n2nd) No.4 its LDPE quality  \n3rd) No.5 its PP quality  \n  \nAvoid rest of nos for ur safe health. Do like my post if u like it.  \nThanks\n\n", "It came with 4 different colors as promised.  \nI see some reviews saying that the quality is not good, but I have a different\nview. I already have two Tupperware 1L bottles that were more than 3 years\nold. When comparing with that bottles, this feels light, more transparent.\n(Which may get the feeling that the quality is not good or sturdy) But I must\nsay that it is able to handle hot water just fine, while washing it. I use\nthis bottle for refrigerator and keep it at my desk. I don't use this for hot\nwater. (Be it Tupperware or any other PET bottles, I don't use that to fetch\nhot/warm water). I have a vacuum steel flask for that purpose. Those who want\nto use for the purpose of office/home use, go for it, it worth every penny.  \n  \nI don't recommend using a Tupperware for travel purpose (car/train/bus),\nbecause it may expose to direct sunlight without your notice and it may\ncontaminate your water, you may never know. Keep it indoors.\n\n", "Good but material is thin when compared to other tupperware bottle\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 25 September 2017", "on 13 October 2016", "on 22 March 2018", "on 29 August 2017", "on 16 September 2017", "on 9 September 2017", "on 16 June 2017", "on 30 December 2017", "on 1 November 2016", "on 15 August 2016"], "reviewer": ["prem prateek", "Amazon Customer", "Amazon Customer", "guru", "AB", "Praveen Prakash", "VijaySrinivas Vittalam", "Mohsin", "Prajith", "Koushik Anand"]}
]