[
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": [], "title": [], "review": [], "verification": [], "date": [], "reviewer": []},
{"rating": ["1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["DON'T BUY, PATHETIC, SORRY, NO SERVICE FROM MICROSOFT", "Solid upgrade from a base XBOX One", "It's been a good buying experience overall except for the fact that I ...", "Can't compare with ps4", "A Good Console with Some Nice Features and a Great Controller, but Limited Storage.", "Honest review for this Console!!", "The console looks nice and is a bit small", "5 stars Xbox; 2 stars Amazon", "Great console for the price. Definitely recommend.", "Best media center for 12.5k"], "review": ["Bought the console. Was working fine for a week. Suddenly it stopped reading\ndiscs. Now to the experience with the pathetic Microsoft service.  \nThe support from Microsoft is just pathetic, I don't get any replies to the\nmails. Had to wait for 45 minutes and listen to the waiting tunes on the call\ncentre number and then got disconnected without having any conversation. Then\non the online chat which is half the time non functional, I somehow got\nthrough to an agent who said he'd scheduled the return pickup. Then I waited\nand waited, nothing came. Again went through the whole process to find out if\nI'm lucky enough to contact the Xbox help centre, After a lot of attempts,\nagain somehow got through to an agent in the online chat. He said that the\nprevious agent missed out on scheduling the return label itself and he created\nthe same for me after making me wait for more than an hour. Then he was also\nnot sure about the process to follow through which I can send back the\nproduct. He said he'll get back to me by eod, for which even after 48 hours\nI'm waiting for. Even in doing the return schedule he committed a mistake, he\nscheduled it as a refund, for which I got it corrected.. Then wrote to\nMicrosoft asking for the process, nothing came so far.  \nHence, I packed the Xbox console as given in the website and approached the\nFedEx people, they refused to take in the parcel as the pickup is not\nscheduled by Microsoft. This is really painful, If this is going to be the\nexperience for a person who buys an Xbox, I'm really really sorry... No wonder\nSony is the one which everyone's recommending. And I feel like being an idiot,\nhaving taken this decision to buy an Xbox.  \nThe return label is created for 7 days, and I believe it expires today. And\ntoday again I waited for half an hour listening to your waiting tunes just to\nget disconnected and the online chat is always showing the status as closed.\n\n", "Had some doubts upgrading to this from my ancient launch day XB1. This really\nis a sleek machine. Brilliant industrial and contemporary design at the same\ntime. The white colour really pops amidst my all black entertainment unit. So\nfar really cool during gameplay  \nAnd feels faster in just about everything. Love the small size and the\nstormtrooper look.\n\n", "It's been a good buying experience overall except for the fact that I am yet\nto receive/hear about the other two games as promised along with the product,\nso the ratings as seen\n\n", "Though I own all the consoles. I must say ps4 still beats the Xbone. Ofcourse\nI have a msi ge73vr 7rf laptop but we are comparing consoles here. Xbox one\nhas dynamic resolution scaling therefore graphics looks better in ps4 in\nsimilar games.  \nMy advice buy Xbox one to enjoy exclusives like gears of war or quantum break,\nbut if u have pc then go for ps4.\n\n", "The Xbox One S is a great console for a great price. It runs smoothly\nsupporting 4K as well as HDR gaming. Though if you already own the original\nXbox One, there is not much of a point to make the upgrade to the S.  \nThe Xbox One S is considerably smaller than the original Xbox One. In fact,\nMicrosoft states that it is 40% smaller than the original release. On top of\nthis, you don’t have to worry about the big external brick of a power supply,\nbecause now it is built in straight to the console. This helps quite a bit\nsince the original power supply was basically as big as the console itself.  \nAs a gamer in advancing years, this is my first Xbox of any description and I\nwould like to give other young at heart gamer's a more balanced perspective\nand help them overcome any techno fears that they may have. My previous\nexperience of modern games machines has been limited to the Wii which I\nenjoyed very much but did have its limitations.  \nPROS  \n\\- Plug and play. Ensure that your WiFi is on, connect the Xbox to the tv\nusing an HDMI lead, connect the power lead and put 2 x AA batteries into the\ncontroller (I can recommend the rechargeable power packs available from\nAmazon). Turn on the Xbox and it will guide you through the set up process.\nYou will need to set up a Microsoft account if you don't already have one.  \n\\- No need for a separate Blu-Ray/DVD player  \n\\- Access to Amazon, Netflix etc  \n\\- Supports 4K Blu-Ray/DVD  \n\\- Quite compact and no external PSU  \n\\- WiFi controller  \n\\- Easy to navigate menus with plenty of content  \n\\- Very little or no noise  \n\\- Ability to connect an external hard drive. Currently a cheaper option than\nbuying the 1TB or 2TB Xboxes.  \n\\- My wife is very happy with the lack of clutter behind the tv now that the\nDVD, Blu_ray player, Fire stick, Wii and all the PSU's and leads have\nvirtually gone.  \n\\- Stands upright for space saving (with appropriate stand, available at a\nvery reasonable price from Amazon)  \nCONS  \n\\- Games on disc need to be downloaded onto the hard drive (20-30 minutes,\ndepending on connection speed as the game invariably needs an update)  \n\\- Some bundled games, in my case Battlefield 1, have to be downloaded online\nas there is no disc just a code. In my case this took nearly eight hours to\nfully load at an average speed of 22 MB/S (BT Infinity)  \n\\- 500GB storage. 5-6 games and this is virtually full. (See PROS above re\nexternal drive)  \n\\- Controller buttons hard to see in low light (Being picky here and I dare\nsay that once you memorize which button is where it won't be a problem but\nback lighting would be good for us not so young as my memory is about as good\nas my eyesight!)  \nOverall I'm very happy with my Xbox. I do hope they fix the OS issues and I\ndid take a star away for that, but at the end of the day I think it's a great\nconsole.\n\n", "I would not say it’s the best console bcz as we all know that project Scorpio\n(Xbox one x) is out there which is the most powerfull console ever.  \nLet me straight away tell you it’s pros and cons :  \nPros:  \n1.Light weighted beautiful hardware packed console which is 40% smaller than\nthe original Xbox one.  \n2\\. No more additional power brick is there!!  \n3\\. We can use it in INDIA directly without using the voltage step down\nconverter.  \n4.specs are a bit less as compare to PS4 slim but games do lags on ps4 slim\nbut over Xbox one s games runs super smooth with HDR and 4K upscaling.  \n5\\. Best blue ray 4K player  \n6.best controller ever built in the market  \n7\\. Xbox has many advantages over PS4  \nAs it deliver better frame rates and graphics even though it is slightly less\npowerful than it  \n8\\. Can use Netflix content in 4K quality directly on this console.  \n9.you do not have to charge the controller every 5 minutes as I’m like in PS4\n. Batteries can work last upto 1week if used regularly.  \n10\\. You can play backward compatible games as well.  \n11\\. I will not provide ratings for looks ,quality or design etc cz the whole\npurpose of providing this review is to make u understand briefly regarding\nthis product.  \nCons:  \n1\\. Still consoles needed batteries  \n2\\. No other cons I’ve faced right now  \n  \nVerdict : if you are buying a console for the first time or switching from\nXbox 360 or PS3 then go for it or else go for project Scorpio or PS4 pro\n\n", "This is a huge upgrade as it now has HDR, 4K Ultra HD Blu-ray, and 4K\nstreaming video. It’s actually good-looking. The console looks nice and is a\nbit small.  \nPros------------  \n  \nSmaller than Xbox One  \n4K game upscaling  \nIt's a cheap UHD Blu-ray player  \nHDR compatible  \nImproved, grippy controller  \nCons-------------  \n  \nNot native 4K in games  \nreview imagereview imagereview image\n\n", "Two months of owning this, and it’s hands down the best entertainment device\nI’ve owned!  \n  \nI’ve always got my consoles from the US as they cost half of what they do here\nbut I bought this here so I could have DRM-free, region-free peace of mind as\nwell as tech support if needed. I’m not too particular about playing the\nlatest game immediately at launch, I’ll play them at some point of time, so\nwith the combined Xbox Live Gold and Xbox Game Pass subscriptions, I’ll never\nhave to buy another game again.  \n  \nNow coming back to the console itself, it can play Blu Ray disks, connect to\nyour TV and control your tv from your Xbox controller or using the Xbox Remote\napp, or even watch Amazon Videos and YouTube. It’s a home entertainment system\nand not just a gaming console. I power the system on using the iOS app when I\ncome home, choose a TV show on Amazon Video and sit back, all without even\nswitching the Xbox Controller on. It’s that easy! Also some people have asked\nme about game downloads in the background. Yes, it downloads games in the\nbackground if Instant Power-on is selected as an option, and plus point is it\nswitches on in 10 seconds if this option remains enabled. If you’re someone\nwho games at night, you’ll like the option of connecting your earphones or\nheadphones to the controller and enjoying your game with the home theater\nsystem turned off. And yes, best coupled with a 5.1 home theatre system and a\n40+ inches Full HD TV.  \n  \nOverall, an excellent buy. Have to mention that the 5 stars is for the\nproduct. For Amazon, I’d rate the buying experience a frustrating 2 stars.\nCustomer Service was pathetic. And I would have liked it if Amazon had not\ndelayed the free game codes, I got them nearly 3 weeks and 2 escalations\nlater.\n\n", "Used it for a couple of weeks. I'm a pc gamer who Purchased this originally as\na backup system for games and Internet. Went in with super low expectations.\nCame out on the other end insanely happy.  \n  \nThings would look crisp on a 1080p tv despite it having only a 1.4 TF gpu (for\nreference a rx 580 is 6 teraflops) this console is great for the price and\nwhat it provides.  \n  \nFor people here trying to decide between XB and PS ecosystems I'll make it\neasy for you  \n  \n1) if playing and experiencing different games is your first priority / and or\nif you already have a PC, go the PlayStation route.  \n  \n2) if you're buying this as a first console or a backup system, don't really\ncare about letting go of 2-3 sony games like horizon, uncharted or spiderman\netc , it's perfect. Comes with the really feature rich Microsoft ecosystem, 4k\nuhd blu-ray playback etc.\n\n", "Perfect Media and entertainment center for the price I have paid for . Ordered\nit from Amazon.com (US)during the holiday season and got it for 12.3k INR . So\nif you are considering to buy one just check with any of your friends or\nrelatives who can get it from US or UAE where we will get it at half price.\nJust try out your luck  \n  \nI am not really into games but was looking for a decent 4k Blu-ray player and\nafter so much research I thought to order Xbox one s because of the price and\nthe kind of options that I am getting with it. Picked up the forza bundle and\nit will download the game which is 57GB .  \n  \nThe console is sleek , very silent and no heating issues at all during\nprocessing.  \n  \nSo am overall happy with my purchase\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 November 2017", "on 9 October 2017", "on 17 October 2017", "on 10 October 2017", "on 10 October 2017", "on 8 October 2017", "on 16 November 2017", "on 1 December 2017", "on 17 February 2018", "on 12 January 2018"], "reviewer": ["Amzzz", "Dr Evil", "Prajish", "SEPHIROTH", "SwordFish", "Shubham", "Shryansh", "Santosh", "Rajitha", "Akbar"]},
{"rating": ["1.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "title": ["One Star", "No Preorder Game Codes provided", "Five Stars", "Four Stars", "Good product for an occasional gamer", "One Star", "good product and value for money", "Making fool. No sale", "Lovely", "Four Stars"], "review": ["Product OK, but promotional offers not given\n\n", "Didnt get the battlefield 1 and Gears of war Game Codes tgat were promised.\n\n", "Worth it.\n\n", "As expected\n\n", "Good product for an occasional gamer!  \nGot it from Australia @259 AUD jbhifi. 13K inr.  \nNearly half the price. One should give a try from overseas if u are looking\nfor high config Console\n\n", "Do not buy it it is not good for anyone to buy it\n\n", "i got this product in 22k and just stunning graphics\n\n", "Making fool. Showing discount on old rates.\n\n", "Lovely product. Really amazing. Found it neat and tidy and I am sure u will\nlove it\n\n", "got it for 12.5k on black friday sale\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 9 January 2018", "on 1 November 2017", "on 25 December 2017", "on 13 November 2017", "on 10 December 2017", "on 3 February 2018", "on 28 January 2018", "on 20 January 2018", "on 6 November 2017", "on 28 November 2017"], "reviewer": ["Amazon Customer", "Amazon Customer", "pardhu", "Sanjay S.", "Amazon Customer", "BHANU", "Satendra", "Tushar Goyal", "Aadvik", "Amazon Customer"]},
{"rating": ["5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars"], "title": ["Perfect balance between Gaming and Media centre", "Awesome | Mindblowing", "Please give me my games", "Best console ever.", "Not better than ps4", "Worth the price...", "When will I receive Forza 6,", "Absolutely loving the console and its features and the games", "One Star", "Good"], "review": ["Perfect balance between Gaming and Media centre for the price. People rating 1\nstar are all from pre-order and have not received the game codes for\nMicrosoft. I have got in touch with Xbox support and got my 2 games ( Gear of\nwars 4 and Battlefield 1) the fun part is Microsoft were generous enough to\nprovide Delux editions. I am extremely happy with the console and the\nperformance. Dont listen to PS4 fans, just do your research online and decide\nfor yourself which console suits your needs. You can switch region to US and\ninstall Amazon Video then switch back to India after installation. 4K. UHD HDR\ncontents on Amazon Video looks fabulous!!!\n\n", "Just go for it console is amazing. Go for Xbox one x only if u have 4k tv or\nif ur 1080p tv size is 48 inches or more otherwise u will not notice much\ndifference in graphics. I have 32 inch 1080p tv so I got Xbox one s since it\nis enough for 1080p tv of less than 48 inches as pixels don't get blurry on\n1080p at 32 inch. At 48 inch or more 1080p starts getting blurry due to large\nsize of display. More the display size higher the resolution it requires to\ndisplay crisp image. You need to update the console after booting it for first\ntime. Update size is 1300mb. I don't have any problem downloading Xbox one\ngames which ranges btw 40-50gb since I have superfast 40mbps broadband\nconnection. I will recommend you guys to have minimum 16mbps connection if you\nwant to buy Xbox one because most of the games need update in order to remove\nbugs if any or for multiplayer.  \n  \nNote: I got 3 free games code in my email after 15 days. U need to order from\ncloudtail seller in order to get those 3 free game codes.You will get 1 year\nwarranty only if u order from cloudtail seller otherwise u won't get any\nwarranty. To check ur Xbox warranty type Xbox one warranty on Google open the\nlink and enter serial number of ur console after signing in with ur Xbox id on\nMicrosoft website. I have 40mbps connection so I have no issue downloading\ndigital games. Game size ranges btw 35-50gb depending upon the game.\n\n", "I did not get 2 extra game when will i get them and how will i het it\n\n", "I purchased Xbox one S before it's India launch as I could not wait for the\ndelayed release, Microsoft India should be ashamed for 14 months delay in\nrelease.  \nComing to the Console, it's slightly more powerful than the previous Xbox one.\nThe 4k Blu-ray drive is amazing. It's the best value for money console in\nmarket now. It has no competition. Xbox UI is the best and the smoothest.\nOnline experience is amazing. Xbox live provides the most social gaming\nexperience, there's no doubt about that.\n\n", "It is a nice console. I prefer it because its interface is really nice.But the\ngames are really much expensive than PS4 . PS4 games are at almost half the\nprice of xbox one games. So I think that I made a mistake in buying this\ninstead PS4\n\n", "I like the product. Its worth the price. I thought of purchasing new games.\nBut Thanks to Amazon. So far i got Beta Codes for 4 latest Games. Each one in\nminimum 40GB :(\n\n", "When will I receive Forza 6,the crew and the other game only forza 3 is given\nstill I didn't receive any code\n\n", "If you have a 4K TV, you should absolutely go for it. At this price,the Xbox\nOne S beats the PS4 hands down. I havent seen any downside to this product\ntill now. Be it in gaming or be it in media usage. And the product design is\nsleek and awesome as well. I got 4 games along with the product which was a\nsignificant plus point. Connectivity is easy as well. The UI of microsoft is\ngood as well. And obviously backward compatibility for Xbox 360 games is a\nhuge pro for this product. If you are ready to spend significantly more than\nthis product then you should go for the Xbox One X and not PS.\n\n", "Not getting two free games battlefield 1 and gears of war 4 as promised.\n\n", "It's the best console but the price in India is way to high.Go to amazon.co.uk\nto buy the same product in 16000\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 12 October 2017", "on 28 January 2018", "on 10 October 2017", "on 11 December 2017", "on 12 February 2018", "on 12 February 2018", "on 5 February 2018", "on 26 February 2018", "on 24 October 2017", "on 21 October 2017"], "reviewer": ["Sachin TP", "Dean Ambrose", "Piyush T.", "Chetan Singh", "Amazon Customer", "techoholic", "Amazon Customer", "Vineeth Ravi Varma", "Amazon Customer", "Agam"]},
{"rating": ["4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "1.0 out of 5 stars"], "title": ["I became microsoft fan after having Xbox one s experience.", "First console... Great buy", "not like: Sir", "Go and buy PlayStation instead...!!!", "received all free games codes", "In the image the games i should have got are ...", "Awesome console as expected", "Best console ever!!!", "Very good But the game takes very much time (almost a ...", "One Star"], "review": ["If you are not a noob or sony excluses fan then trust me its a good choice. I\nwas confuse at start but now I am happy to have it..Controllers are best and\nthey can't be more better. I know we need extra battery but hey they are\nenough to play for long duration.. no need to charge controller in between\ngameplay..They will last you near about 20 hours..I think that nice as you can\ncomplete your mostly games without changing them.  \nI am giving Xbox one s 4 stars.. not 5 because digital games are more\nexpensive than games cd and cd must be inserted in console if you want to\nplay, it doesn't matter if you installed the game..\n\n", "As the company states Xbox one s is one for all.  \nGames run flawless with mind-blowing graphics.  \nThe seller INDIANMART delivered the item on time and the product is absolutely\ngenuine.  \nGo ahead and purchase the console. You'll never complain about anything about\nit.  \nXbox one is great and seller INDIANMART is very helpful.\n\n", "5 stars to the Microsoft Support team that helped me to get the two free\nadditional games  \n3 stars to the seller for quick delivery of the console but unwanted delay in\ndelivery of free games for a months time.  \nCSA's needs to be properly trained and should speak truth.. not like : Sir, we\nare sorry the last CSA you contacted gave you wrong information..\n\n", "Go and buy PlayStation instead...!!!\n\n", "Product is great.. However digital download codes were received for only two\ngames instead of promised three however after speaking to Amazon India\ncustomer support received all three game codes.. Redeemed and all are valid\ncodes.. Forza 6..steep and crew..However i recommend either buying 1tb version\nor buy ext hdd as storage fills quickly.. Only 320 gb is available. .. Must\nhave games are Forza horizon 3..Halo4, gears of war 4, metal gear Phantom\npain. Ori and the blind forest ..rare replay and Assassin's creed origins  \n.. Wicher 3 wild hunt , fall out 4. i hope this helps the beginners\n\n", "In the image the games i should have got are firza horizon 3 ,forza\nmortorsport 6 ,the crew and also one another .... But i only got forza horzion\n3 . When i elm get other games ?????\n\n", "Awesome console as expected.......Havent got the beta codes for the other\ngames like forza horizon 6 and the crew....other than it is worth buying......\n\n", "Its a perfect console for people whoa are looking for cheap and best consoles.\nEarlier I was disappointed by amazon for not sending additional two codes but\nI recieved the yesterday. Also it is the cheapest blu-tay player.\n\n", "Very good  \nBut the game takes very much time (almost a day ) to download so please buy\nCDs.\n\n", "Wasted money\n\n"], "verification": ["Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase", "Verified Purchase"], "date": ["on 10 December 2017", "on 16 February 2018", "on 19 November 2017", "on 22 November 2017", "on 30 January 2018", "on 11 March 2018", "on 23 February 2018", "on 31 October 2017", "on 6 February 2018", "on 20 March 2018"], "reviewer": ["sunil d.", "Valay Chahande", "IM6FEET", "Lokesh Sinha", "Chetan Gondkar", "Amazon Customer", "Vishal Kumar", "Amazon Customer", "Amazon Customer", "Amazon Customer"]}
]