[{"rating": 5, "title": "Great for my requirement.", "review": "For those whose priorities are:\n1. Big screen(for reading, split screen, etc)\n2. Enhanced screen to body ratio(83%)\n3. Better ram management\n4. Elegance\n5. Above average camera performance(front camera is phenomenal!)\n6. Weight of device\n7. Additional features that comes with fingerprint sensor like browsing or swiping images in gallery, app lock, answer calls,etc.\n8. Playing normal settings game(Not advanced)\n9. Full HD+ display\n10. Good viewing angles(because of 407ppi)\n11. Customizable UI( EMUI 5.1)\n\nIf you are the person who can compromise Gyroscope sensor, IR, Fast charging, usb type c port, dual speakers, OIS for video recording,high end games, Gorilla glass protection,4k video recording  then there is no better option in this price segment. \n\nSecond camera i.e of 2MP is provided for portrait effect and not a telephoto lens. If you want telephoto lens then opt for MI A1.\n\n\nLittle bit of heating you may experience but thats normal maybe because of metal body.\nHeadphones provide are not an in-ear type but the old one. \nCharging cable or usb cable is of sufficient length.\nBattery backup is sufficient for a day if you are not a heavy user of high end games or prolonged user of camera and video recording.\nOut of 4GB only 2.4GB RAM was available when the device was first bootup.\nOne hand screen mode is available here for those who find 6 inch phone difficult to handle. Well the narrow bezels makes it more easy to hold. Its like holding a 5.5 or 5.7 inch phone.\n\nWith the advent of Iphone X, MI Mix 2, LG G6 and Google Pixel 2XL, 18:9 aspect ratio or bezel-less display will gonna become mainstream in near future.\nSo, if ergonomic design is your one of the highest priority then go with this device.\n\nNote: If front camera is not your top priority go for Honor 7x. Specifications of Honor 7x is nearly same as Honor 9i except for front facing camera which is of 8 MP and the alignment of rear dual camera. It is priced at Rs.15999 for 4gb and 64gigs of storage variant.\n \nIf you find this description helpful then hit that like button.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Oct, 2017", "reviewer": "Ankit  T"},
{"rating": 5, "title": "Total Value for money pick", "review": "I got it delivered in just one day that was awesome service by flipkart. \n\nNow talking about the device-\n\n1)Rear camera is good in daylight, in low light I found a little noisy and grainy but far better than Mi A1 for low light. \n2)Front camera is brilliant specially in portrait mode. \n3)Battery backup is also very good In normal usage it dropped to just 70 from morning 6 to evening 6.(no gaming or movie watching). With moderate usage battery lasts comfortably till end of day so missing of fast charging is not a big concern if you are not a heavy gamer. \n4)Full HD+ display is awesome and split screen feature will ve more enjoyable on this large screen. \n5)Not felt any major problem while using  with one hand and also there is a one handed mode to make some operations easily accessible . \n6)Audio from loudspeaker is superb quality and good but not too loud from earpiece provided. \n7)No lagging or heating. \n8)Very little bloatware which is easily uninstallable. \n9)EMUI is also very handy and not too far from stock android and personally i like the advanced features provided by EMUI. \n\nYou can go for it if planning between Mi A1, moto g5s plus and 9i.It is a total value for money. \nThumbs up if u found this helpful", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2017", "reviewer": "Ravindra Kumar Gupta"},
{"rating": 5, "title": "Good choice", "review": "Pros-\n1. Good Camera.\n2. Premium look and feel.\n3. Good multitasking performance.\n4. EMUI 5.1 looks really good.\n\nCons-\n1. Battery life could have been better.\n2. No fast charging\n3. No Gorilla glass.\n4. In box ear phones of very poor quality.\n\nOverall 9/10 (According to price)\nGreat value for money with premium built quality and great camera experience.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Oct, 2017", "reviewer": "Shubham Dawra"},
{"rating": 5, "title": "Best in the market!", "review": "Camera super\nFingerprint super speed\nTotally good product", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Vijay"},
{"rating": 5, "title": "Must buy!", "review": "Awesome mobile must buy", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Brilliant", "review": "The Mobile was very good and looks premium.\nI heard some negative review about the sound quality of the mobile..its was very good and audible.\nThe camera was fantastic and clear.\nCall quality is very good\nUI is excellent and very responsive\nFinger print is ultra fast.\nHonor smart assistance working flawlessly.\nMetal finish at the back makes to feel premium when you holding it.\nBattery was very good... 12 hrs of heavy usage battery drops from 81% to 17% and battery optimization is awesome.\nQuick charge was not there but its acceptable..it takes approximately 2.5 hrs to full charge from 15% to 100%.\nOverall the phone was pretty decent and looks slim and fabulous.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Oct, 2017", "reviewer": "Vivek Richard"},
{"rating": 5, "title": "Best in segment", "review": "A nice and premium smartphone but no color options as per now.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2017", "reviewer": "Arjun Paarcha"},
{"rating": 5, "title": "Fabulous!", "review": "Mind blowing mobile vivo v7plus waste", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Super!", "review": "Best smartphone under 20k\nDispaly - 9.5/10\nBuild quality - 10/10\nUi - 9/10\nRam management - 9/10\nCamera - 9.5/10\nBattery life - 8.5/10\nGaming - 7.5/10\nVFM - 9/10", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Oct, 2017", "reviewer": "AJITHKUMAR S"},
{"rating": 1, "title": "Does the job", "review": "Flipkart cheated me i got defective product the camera cannot click clear pictures many dots dots are seen i need return request slip u cheat me flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Brilliant", "review": "Product is absolutely awesome! Just loving the  device and finger sensor cut unlock the best! Comes with even guard and back case. What a delight", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2017", "reviewer": "Vinodh  Rajagopalan "},
{"rating": 5, "title": "Simply awesome", "review": "Awesome 18:9 display smartphone at ₹16,249  price range. Very attractive look with good specifications.  Camera app and picture quality is superb", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Karthik Babu DB"},
{"rating": 5, "title": "Super!", "review": "Awesome Mobile build quality is very good\nBoth Cameras are very good\nDisplay is also good\nFlipkart Delivery is fast\nI like Honor 9i", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2017", "reviewer": "Sadakat Ali"},
{"rating": 5, "title": "Highly recommended", "review": "Fabulous smartphone in this price range\nIts made my day\nPeople who talk about battery is not good i want to say those its awesome battery back\nIn first day i use whole day with mobile data, you tube etc after that battery back up time 22 hrs", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Oct, 2017", "reviewer": "Tanmoy Paul"},
{"rating": 5, "title": "Wonderful", "review": "Well to be frank this piece of awesome device gives scope to iPhone users to think about what a smart android can do beyond the stock features! \nLets talk about the hardware first - Not going into tech specs - \n-The phone looks very premium and superior build quality made of a single metal body. \n-Laced with first in class phone with 4 cameras it's able to achieve bokeh effect on both side cameras.They ensure background blur and wide aperture shots which are very nice. \n-The headphone jack and charging ports are both below which is convenient. \n-The screen aspect ratio and narrow bezels make it look very appealing besides having a sharp &amp; greater than 400ppi clear resolution can be compared with other premium high priced phones below 30k. The fit option on most of the apps enable them to adjust them to the long screen size.. with the launch of new Pixel phone 2 the world will move towards it.\n-The Huwaei sound enhancer helps obtain the 3d sound besides giving us an option to customize the sound output.\n-The battery lasts for a day at ease with a nominal screen usage for a professional. There are provisions to change settings as to what to keep running after the screen is locked.\n- I loved the charging screen animations as well besides the premium animations like icon refresh, icon badge, notification bar display , etc.\n-The Android version 7.0 coupled with the other enhanCments are a grand welcome . Double knocks takes screenshot, Knock swipe can split screen apps, the finger sensors can change pics while on gallery, answer calls, swipe up/down the notification without a need to take your thumb to the respective screen part. Lots of these good features.\nAll in all this phone is built by a market leader that has produced Nexus phones for Google , and a lineup series of Honor, Holly phones with great user satisfaction. While the world is innovative I think the brand has worked really hard with the engineers to get quality innovation packed in a reasonably priced awesome phone. So thanks to everyone at Huwaei !!\nNeed improvements areas-\n-Quick charge or even wireless charge- Ready to pay for it \n- After warranty support by brand is one thing that Huwaei has to work on just like Nokia and Samsung. That will be helpful for people who use a single device for more than a year!\n- No other complaints as such minor glitches will go off air in  a few updates .\nThanks to our readers for tolerating a long review!", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Oct, 2017", "reviewer": "Darpan Kumar Chaurasia"},
{"rating": 5, "title": "Simply awesome", "review": "Superb built quality\nAmazing camera \nNice look\nIt's better camera phone at this price tag\nIt's both camera's  have bokeh effect \nCamera was superb in day light\nSoftware upgrades needed", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Manjunath Ch"},
{"rating": 1, "title": "Must buy!", "review": "Display clarity low", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "kalander  shafi"},
{"rating": 5, "title": "Simply awesome", "review": "Guys belive me what a fabulous smartphone.. \n1.camera great and great both\n2.screen wow\n3.aspect ratio 18:9 u can use easily\n4.audio sweet and loud \n5.looks with graphite black seems awesome \n6.finally great buy at 18k tottaly value for money guys...", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Nov, 2017", "reviewer": "Satya Bhaskar"},
{"rating": 4, "title": "Good choice", "review": "It's been 2 weeks I am using this device. I was a OP3T user. Just bought this as my OP(OnePlus) device got damaged. Now coming to the review, it's a pretty decent device. In some areas even it scores more than my old mobile. Let's see what it offers. The things that impressed me here are \n1. Selfie cam (Definitely it should have been a selfie device, portraits are awesome)\n2. Display (18:9 crispy one)\n3. Built quality (As I came from a flagship killer of last year, I was thinking a lot about it but trust me it's very solid and premium, honestly a head turner)\n4. Rear Camera ( Best in this segment, sorry for some unclear portraits anyway but other than that it's a gem)\n5. Audio via headphone jack (Surely better than OP3T's and good too)\n6. Ergonomics (it's easy to hold and use in a single hand, just using the case given and weight distribution is also fine)\n7. Battery (It's not a battery king but easily get through a single day SOT 4-5 hrs despite being a heavy user and I am loving it as my old device doesn't get me through the next day)\n8. User Interface (Lots of doubt about this before moving from Oxygen OS to EMUI but loving it, now am not even using the app drawer which makes my app pickings very easy)\n9. Call quality (Very Clear through earpiece and loudspeaker too)\n\nNow let me show you the things which are not tasty in this \n\n1. Battery Charging time 2-2.5hrs( Not too bad considering its price but definitely missing dash charge technology, still some YouTube videos are misleading as it's very slow and so on but really not is  true)\n\nVerdict: Decent mobile for 16.25K during Diwali sale using HDFC card, really loving it's camera nd toying with this. If you wanna better camera device then just pick this. Beautiful one. \n\nDon't trust the YouTube blindly as I did in the past to buy mobiles and tech stuff, that's why I wanna write my experience here. Just read the user experience and go for a device. It's my opinion. See you all....", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Oct, 2017", "reviewer": "Raveendharan Sundaram"},
{"rating": 5, "title": "Terrific purchase", "review": "Nice phone for this price range.. Best camera in this range... Front camera on this is just amazing... Emui is really fluid.... 18:9 screen with full hd+ looks really beautiful... Display is easily visible in outerdoor sunlight.. Only misses the gyroscope sensor... Autobrightness sensor works like a charm... Fingerprint sensor is the fastest I have ever seen... Previously I was using redmi note 3.. This phone is a good upgrade.. And lastly the 3400 mah battery should get u through 1 day in full charge.. So if u looking for a steller looking phone with good performance and an amazing camera front and back.. This is the phone for u..", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Oct, 2017", "reviewer": "Aman Kumar"},
{"rating": 5, "title": "Excellent", "review": "nice phone nice service but delivery boy are not good", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Oct, 2017", "reviewer": "DNYANRAJ  LOKHANDE "},
{"rating": 4, "title": "Nice product", "review": "Beautiful &amp; Decent Phone:\n\nWriting this review after 10 days of usage.\n\nDisplay:\nIts one of the best u can get in this price range, 18:9 aspect ratio with Full HD+ display. It is simply awesome &amp; build quality is also good.\nNo issue with display &amp; build quality till now. Color reproduction is also good.\n\nRAM:\nWith 4 GB RAM &amp; 64GB ROM, its does a decent job. Can observe little lag during switching b/w apps, but its negligible &amp; can cope up with that.\nBut no major issues with RAM management till date.  \n\n\nSoftware &amp; Hardware:\nIt runs on Nougat 7 with EMUI 5 out of the box. Will get plenty of features with EMUI &amp; will love it, especially the Knuckle gestures. Not all the apps has been optimized for this phone, but will get used to it. Honor can resolve this with their future update.\nWith Kirin 659 Octa Core is does a decent job. But it fails to perform well while playing heavy games or games with high graphics. This mobile is not for heavy gamers. No heating issues observed.\n\n\nBattery:\nOn a normal usage, it will last for a typical day ( if charged fully in morning, it will end up till evening with around 20 - 30% of charge left ). But for heavy users it will last for upto 12 - 13 hours. And battery drains quite quickly (especially while using camera). Honor could have gone with more power battery for this 5.9 inch display. Battery performance could have been better. Charging time is also more. It takes almost 2:30 to 3 hours to fully charge &amp; no fast charging supported &amp; No USB TYPE C. Its quite disappointing for this price range.\n\n\nCamera:\nFront camera is very good &amp; takes beautiful snaps. Its one of the best selfie cameras one can get in this price range. Portrait mode works well with front cam. It does a decent job even in low light conditions (with some noise). But, overall performance is well &amp; good with front cam. If u are a selfie lover, u can go with this without any doubt. It performs even better than MI A1 &amp; G5 S+.\nBut with Rear camera, its performance is not upto the mark. Its quite disappointing. Even though with 16+2 MP cameras, its performance is quite dull. With good light condition or in day light, it works very well, but in low light condition its performance is degraded. The Portrait mode &amp; bokeh effects do not perform well with Rear cam. The blurring effect is not well optimized (pics come out artificial), as well as Portrait mode. Both cameras over saturates the color &amp; if we zoom the pics, it will loose the details. \n\n\nOne issue that I faced was with FM RADIO. I was unable to hear FM through earphone if the phone was ON, but once the phone was locked was able to hear through earphone. For this we need to change the settings.  Settings --&gt; Google --&gt; Search --&gt; Voice --&gt; 'Ok Google' detection, in this UNCHECK the Say 'Ok Google ' any time option. After this FM issue will be resolved. \n\n\nVERDICT:\n\nIts a beautiful design, great inhand feel, beautiful front cam, an average rear cam, lots of features with EMUI &amp; an average battery back up. \nIf u care more about design &amp; display, a decent phone performance, a selfie lover &amp; a moderate user, u can just go ahead with this Honor 9I.\n\nBut if u want a great performance, with a good battery life,  good rear cam , got an option with MI A1 &amp; MOTO G5 S+. \n\nCONS: \nMinor lags.\nNo Gyroscope sensor.\nSometimes while watching Youtube, it will get exit automatically.\nBattery life is bit low. \n\n\nPROS:\nDesign &amp; Display.\nButter smooth UI &amp; screen.\nGreat Front cam &amp; an decent Rear cam.\nLots of customized features with EMUI \n\n\nOverall, its a well designed &amp; well built phone with great Front cam, loads of features &amp; worth the money. Its recommendable !!\n\nHappyy with my purchase :)  \n\nHope this review might help..", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Nov, 2017", "reviewer": "Yogesh R"},
{"rating": 5, "title": "Must buy!", "review": "Awsm features\nNice cameras\nClearity very good👍", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "mahesh pagare"},
{"rating": 5, "title": "Just wow!", "review": "Phone is best in its class.\nStraight comparison with MOTO G5 S PLUS and XIAOMI MI A1. \nThe portrait mode is good. \nMaybe a little lower because 2mp depth sensor but when it comes to camera, the camera is far better than the other phones.\nBest product in 18000 price and i highly recommend it over Moto and XIAOMI.\nThis is my first huawei phone and I'm impressed. \n\nI've used more than 45 smartphones in last 3 years and in this price segment this is a perfect device.\n\nAlso, the seller is awesome i say. \nI ordered the product yesterday and got today\nMaybe in less than 24 hours. \nI don't know why other people blaming seller. \n\nGo for the device. \n\nThank you all.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Akash Singhal"},
{"rating": 5, "title": "Best in the market!", "review": "Honor 9i best phone in the price and awesome camera quality.....🤗", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2017", "reviewer": "Shikha Gupta"},
{"rating": 5, "title": "Highly recommended", "review": "Nice product but now m not able to find any accessories of this phone flipkart if selling this phone should also sell its accessories too", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Chetan  Pahwa"},
{"rating": 5, "title": "Best in the market!", "review": "Super awesome camera phone within this range. blur effect is so accurate. I don't know why people are posting negative reviews against the camera performance. This is the best camera phone within 20k price segment. Build quality and design is outstanding and reliable. cellular call quality is very good. No heating issues and loudness of speaker is acceptable. This is my 8th smartphone within last 3 years and trust me this one is beast out of all. Don't go for negative reviews of it. Either those guys don't know how to use smart phone or they are just negative publicity stunts. And let me tell u the phone is way better than MI A1 in terms of every aspects. Last and least bettry performance is quite acceptable. Infect it is better than MI A1. I have no issues with this phone till date.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Oct, 2017", "reviewer": "Saurabh Bilgaiyan"},
{"rating": 5, "title": "Fabulous!", "review": "So i read all the reviews here, mostly were positive and some were negative, but i thought i'll give this phone a try!\n\nSo here's my Honest opinion about the phone.\n\nWill make this review simple. Not gonna go into specs, you all already know enough about that.\n\n1. First this is the display! It a HD+ display and looks stunning!! Seriously.. each and everyone who saw the phone actually complimented about the display! One thing though, I think the display should have been more bright at the full level. Also, the phone is really Sleek Slim and light weight! The look and feel is superb!!! Note-  It comes with a screen Guard (NOT TEMPERED GLASS). I advice you to get a tempered glass asap coz this phone doesn't have gorilla glass.\n\n2. It has 4 camera's. 2 front and 2 back. It clicks awesome pictures especially in daylight. It has a flash in front, not exactly a powerful one, but a small &quot;soft flash&quot;. Overall the image quality is very nice. One thing that i noticed is the portrait mode in the front camera looks a little too artificial when you use Bokeh mode.\n\n3. Next is the phone's multitasking. Well it's brand new, it's flawless right now. No lags, nothing. Not even while switching apps. So no cons here. (i'll update if required)\n\n4. The Finger Print Sensor is accurate and Blazing fast! Kudos to that.\n\n5. Speaker - I don't know why some comments are saying the speaker has low volume. It's more than sufficient. It's loud actually. So it's really good in my opinion.\n\n6. Battery &amp; Charging -  Ok, so too much negative review about charging. My opinion - Yes it's a little slow, but my phone went from 55% - 94% in about an hour or so. So i don't think that's really bad. Also, i went to office (around 9am) with 81% battery and with moderate use (4g/wifi always on) watching some videos, regular use of whatsapp and facebook, and at around 3 pm, it was on 55%. So i don't think that's bad either. You guys decide.\n\n7. Knock Gestures - If you've seen some youtube reviews, you might know that this phone has &quot;knock on screen&quot; gestures. For some reason, i can't use that properly, 7 out of 10 times it doesn't work properly. Maybe I'm using it wrong. (i'll update about this)\n\n8. Ram - phone has no lags whatsoever right now. normally, 2.-2.4GB of RAM is free normally.\n\nOverall, if you want to buy a phone that's really a bang for your buck, this is the one!  Go for it!", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2017", "reviewer": "Yajul Srivastav"},
{"rating": 5, "title": "Simply awesome", "review": "Positive =Camera v.Good compare to vivo v7&amp;v5 (boke effects *food mode very nice) \n\nSuperb display look like Samsung S8 \n\nBack body nice &amp; heavy material \n\nGood RAM performance \n\nWorth buying... \n\nNegative =No fast charging option take 3 hours to full.. \n\nNo gorilla glass... \n\n\nBelow 20000rs go for it&deg;&deg;&deg;", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Oct, 2017", "reviewer": "Mohamed Bilal S"},
{"rating": 4, "title": "Good choice", "review": "First of all I should thanks to flipkart for this amazingly quick delivery (within 12 hrs.).\n\nNow coming to the phone itself.. The HONOR 9i !! Being an honor phone user from last 3 years I am happy to say that this time also honor doesn't upset me with it's quad camera beauty !! \n\n1. Both the cameras are shooting beautiful images with very good sharpness levels and punchy colors . the bokeh mode of the front camera is simply unbeatable at this price point. Low light shoots are also pretty good.. \n2. The screen quality is excellent. I have to say Honor has used a very good IPS panel for the device and the metal build of this smart phone is extreme good and also the in-hand feel is really premium. Though in my opinion, using a case will be \n     safe because the phone is a lot slippery.   \n3. RAM management is great due to 4 gb of ram and you will get almost 2.25 gb of ram free for every time, do note that facebook, instagram, whatsapp etc power intensive applications stays in memory constantly and also some back \n    ground processes runs continuously in memory for example Google sync etc.\n4. I have to say that although the processor is well capable to handle almost all the day-to-day tasks without any issue, the GPU is not at all capable for high end and even semi-high end gaming. I am not a big fan of playing Asphalt 8 or \n    modern combat 5 in mobile because I prefer to play those games in my Windows 10 PC but I heartily wished at least PES 18 will run in Honor 9i flawlessly as it runs in my Redmi 4 without any issue, but it disappoints me for the first \n    time. Even PES 18 is also almost unplayable in Honor 9i !! But when I tested NFS No Limits it ran without any lag or frame drops! By the way, Pokemon Go like games will run very efficiently. I don't know if there is any software \n    optimization issues or not but I really wish Honor will look after this matter! Also there is one point to be mentioned here, that there is no HEATING issues I have noticed as of now.\n5. Out of 64 gb storage you will get roughly around 49 gb free space on the first boot. But you can also use a micro SD card for storage expansion, therefore storage will not be an issue for most of the people I guess.\n6. The highly customized EMUI 5.1 with various themes is one of my favorites. But I thing there is also some people who prefer stock android experience. So,  I am leaving it on personal preferences. \n7. Finally the main thing.. The Battery Life. Honestly it can manage to go through a full day having at least 20% charge in it with my semi heavy uses daily but due to the lack of fast charging it takes a looong time to charge the battery \n    completely to be precised 2.5 hrs., which is really irritating I must say!!\n\nSo, in conclusion I should say if you can compromise with high end gaming just go for it. You can hardly notice any difference in performance of Kirin 659 against it's most popular rival Snapdragon 625 and even 626 (except gaming).\nAnd trust me guys, when you hold this phone in hand for the first time it will surely make you &quot;WOW&quot; than holding Mi A1 or Moto G5s Plus, I wish everyone of you should experience that &quot;WOW&quot;... :) \n\nI hope this review will help to choose the correct phone for you.\n\nThank You :) :)", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Dec, 2017", "reviewer": "Subhajit Ghosh"},
{"rating": 5, "title": "Perfect product!", "review": "Honor 9i is the best flag ship mobile considered under 20k\n\nPros: \n1.) Excellent 18:9 Full Screen Display is awesome\n2.) Dual rear and front cameras capture with amazing clarity\n3.) 4 GB RAM 64 GB Internal Memory is perfect\n4.) 2.34 GHZ 659 Huawei Processor is the best for medium to heavy usage\n5.) Build quality is very strong metal God\n6.) Sleek and Slim Design\n7.) Performance is very fast compared to Samsung\n8.) Battery back up is also very good lasts a day around\n9.) Luxury look with amazing features comes with awesome Specifications along with budget friendly\n\nCons: \n1.) Screen size is large\n2.) Not much handy \n3.) It would be better if battery capacity is more\n\nFinal words this mobile stands No: 1  compared in this budget  features comes with top specifications \n\nBetter than Samsung\n\nI suggest you to go for it\n\nM. Jishnu Datta Sai\nProduction Manager\nTelugu Film Industry", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Nice product", "review": "AS EVERYONE KNOWS THE PROS I WILL JUST MENTION THE CONS-\n1)SPEAKER IS NOT THAT LOUD ALTHOUGH CLARITY IS GOOD\n2)SLIGHT HEATING ISSUE NOTICED AFTER USAGE OF 1.5 HOURS\n3)NO FAST CHARGING \n4)NO CORNING GORILLA GLASS \nREST EVERYTHING IS FINE TILL NOW.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Anil Ahuja"},
{"rating": 4, "title": "Worth the money", "review": "Ditching Mi A1 for Honor 9i.\n\nI had bought Mi A1 last month, but didnt like much. \n\nEven though the smartphone was having stock android but still that so called Android One was lagging noticeably and Hanging. Also, the so called Dual Camera is Overhyped. I sold that Android One Mi A1 in less than 1 month of usage.\n \nComing back to Honor 9i, \nI liked everything about Honor 9i except few bloatware, pathetic old school themes and the worst - tortoise charging speed. \n\nOn Geekbench test, \nMi A1 score much better but in real usage Honor 9i beat Mi A1 with ease. Even though the EMUI is heavily customsied UI, but having processor and software coming from the same house beats that so called Android One Phone. \nThats software engineering!!!!\n\n\nPros and Cons of Honor 9i\n\n1. Bigger Screen. \n2. Better Selfie and Rear Camera in this price segment. \n3  Snappy Fingerprint Scanner. \n4. EMUI5.1 runs smooth. \n5. Speaker's sound is clear and audible.\n\nCons - \n-Fingerprint Scanner is located much closer to the camera setup. \n-Battery backup is average. \n-The Worst part, Charging is very slow. From 16% to 75% in 2.5 hours. 1 Stars less for this.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Jatin  Johny"},
{"rating": 5, "title": "Awesome", "review": "Honest Experience(2days)\n\n1.CAMERA- rear camera is good but not excellent(7.5/10);front is superb(9.5/10)\n2.DISPLAY-VIVID,SHARP but not bright(9/10\n3.SOFTWARE-smooth ui\n4.HARDWARE-excellent processor but not for gaming(gpu) obviously high end games(8/10)\n5.Battery-good(8.5/10)\n6.SOUND-medium but clarity good(8.5/10", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Oct, 2017", "reviewer": "aakash sarkar"},
{"rating": 5, "title": "Worth every penny", "review": "Very good phone in this price range.\n\n\n\n I have Galaxy S7 and LG G6 also.\nHere are pros:-\n1. Very good front and back cameras.\n2. Selfie camera is very good superior than S7.and LG G6\n3. Rear camera is good can compete with.MotoG5splus.\n4. Display 18:9 is simply superb with nice viewing angles.\n5. Performance is good \n6. Very good build quality \n7. Finally very fast flipkart service", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2017", "reviewer": "MOHAMMAD UMAR VALI"},
{"rating": 1, "title": "Best in the market!", "review": "Screen flickers some times then need to restart the phone", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Oct, 2017", "reviewer": "Faiz Ahmed Aghadi"},
{"rating": 5, "title": "Super!", "review": "if u are watching for reviews then first forget mi a1...\nif mi a1 is 20 then this phone is 95. bestest of all suprb ui.\nsuperb camera\nawesome functionality.\nvery slim.\nvery very premium.\nat first u r not gonna believe that this 17999 rs phone.\nAbsolutely no heating.\nBest display.\nbest rom emui.\nbest customization of everything.\nperfect for one who comes for camera rom (emui) display build quality ram management. all are perfect..no need to read review. just go for it plz bcoz it is the best.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Oct, 2017", "reviewer": "Aaqib Ahmed Khan"},
{"rating": 5, "title": "Must buy!", "review": "Awesome and nice phone", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 2, "title": "Slightly disappointed", "review": "My phone camera very noise.. I don't know what hapnd, I think I got defective product from flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "Looking for reviews .. don't worry u have jst got the perfect phone .stay happy \nDon't go by reviews go by ur own honor 9i's performance\nHappy honor user", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Value-for-money", "review": "I am writing this review after using it for 10 days and i am quite satisfied with overall performance of the phone.Really impressed by the looks nd features it has in this budget.If you are looking a mobile phone for camera and selfies then this phone could be your first priority but in terms of performance i think it lags few times when u switch in between apps nd games frequently.\nTalking about the battery life ... It can last a day and half on a descent usage becoz i use my phone for calling nd whats app nd other daily stuff but not for hardcore games, so it will stand perfectly on typical day for u.\nOverall its a value for money for me, good phone for daily usage ...awesome camera both selfie nd rear...good Battery life nd no compromises on looks (rose gold edition)", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Nov, 2017", "reviewer": "Mohammad Armaan"},
{"rating": 4, "title": "Good phone", "review": "Display :- 9/10\nRam :- 10/10\nBattery :- 7/10\nSound :-9/10\nCamera:- 10/10 (Best in the price segment)\nFingerprint:- 10/10\nLooks:- 9/10", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Oct, 2017", "reviewer": "Vivek Kumar"},
{"rating": 5, "title": "Fabulous!", "review": "osm", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2017", "reviewer": "VIJAY KUMAR"},
{"rating": 4, "title": "Nice product", "review": "This device is pretty good except the slightly lower performance of the back camera than I expected. The back camera shots are kind of over sharpened and a little bit noisy. In outdoor condition it performed very well, but in lowlight as well as indoors it struggled to give much details without noise. The blurring algorithm is also not perfect. So in the camera department, it needs some optimisation. \nEverthing else is awesome.\nThe battery life seems decent. \nAudio experience on headphones is one of the best with the new huawei histen. \nHoping for an update to make the camera performance the best. :)", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Noel Simon"},
{"rating": 5, "title": "Wonderful", "review": "Best Phone....\nDisplay 10/10\nCamera 9/10\nBattery 8/10\nLook 9.5/10\nValue for money 10/10\nAmazing phone by Honor 9i", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Oct, 2017", "reviewer": "Nitin Gaikwad"},
{"rating": 5, "title": "Awesome", "review": "Awesome . Beast", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "Nagoor Meeran w"},
{"rating": 5, "title": "Super!", "review": "Awesome mobile phone", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Oct, 2017", "reviewer": "SHYAMSUNDAR NAYAK"},
{"rating": 1, "title": "Did not meet expectations", "review": "Mobile hanging and when I watch YouTube entire mobile was hanging and restarting,display fluctuations.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 2, "title": "Battery issue", "review": "The battery is draining heavily and i dont play any huge games. It should carry a decent battery. I have used this device for a week now and i have to charge this twice a day.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Oct, 2017", "reviewer": "Shahid Nazeer"},
{"rating": 5, "title": "Excellent", "review": "I was eagerly waiting for the Graphite Black and the day it was available I ordered one...\nWhy I picked Honor 9i? My wife already using Honor 6X and I was amazed by the huawae's phone quality and the camera performance. I have used Redmi but they lack video quality, they are too dark in low light and talking about other camera phones they lack looks,build and performances . So after researching a lot I chose Honor 9i \n\nPros :\n4 cameras are awesome, the front one is best in this segment.\n18:9 aspect ratio \n5.9 inches screen\nGreat built and design\nCan easily handle multitasking\nGood for Vlogging, Vlogging requires good front camera which this phone is having. \n( Do search Nickk Bisht on YouTube for my VLOG, exploring Rashtrpati Bhawan) \n\nCons :\nNo fast charging, takes much time to get fully charged \nLacks OIS so while walking or running, video is bit shaky ( but can be stabilized in post processing) \nNo gyroscope \n\nIn terms of Video recording Moto G5 S plus is good but I hate moto's look and design. \n\nverall it was a good decision to pick this Honor 9i", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Nov, 2017", "reviewer": "Narendra Bisht"}]