[
{"rating": 4, "title": "Wonderful", "review": "value for money\nit's pixel and the person buying pixel already knows everything about pixel so let me help you with major issue that's bothering everyone \n1 screen is fine for Indian user i think our batch is free from other screen issues except blue tint. \n2 slow charging and camera issues will be fixed in futures updates \n3 clicking noise from earphones and below par speaker is just hoax they are working flawlessly \n\nno need to worry if you buy this phone but be careful as flipkart after sales service is not user friendly if you are having second thought then buy OnePlus5t it's bang on for. money at that price.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "Anurag Gothwal"},
{"rating": 5, "title": "The one true Android.", "review": "This phone is the literal best Android phone out there. Straight from Google, the best of all software features paired with stunning hardware.\nPros:\n- Amazing android experience.\n- Amazing camera.\n- Stabilisation in videos is literally pro level high quality.\n- Great design and build quality.\n- Stereo speakers are loud and very high quality.\n- Great packaging. Was shipped in a hardboard box, with two compartments. One for the phone box, and one for the Sennheieser headset.\n\nCons:\n- Charging is slower compared to OnePlus(had it previously)\n- Out of the box, the display does feel a bit dull. But the first software update will add a higher saturation mode to fix that. So it's a minor setback.\n- The charging cable provided is USB type C at both ends! So you cannot use it as a data cable for laptop/desktop connectivity unless your laptop/desktop has a type C port.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "Ashish Kulkarni (Jagdale)"},
{"rating": 4, "title": "Pretty good", "review": "Used this device for about 6 days.Below is my initial review(Running on Android 8.1 from the first day)\n\nPROS\n1. Battery life- Excellent. SOT is always around 9 hours (5 cycles so far). First time ever, I found it tough to kill the battery.\n2. Fluid performance on every aspect.\n3. Natural mode on display is really natural.\n4. Rear camera ofcourse.\n5. Gestures.\n6. Charging time is around 2hours 10minutes which is good for 3520mah battery.\n7. Stereo speakers (good at less than 60% volume only)\n8. More wallpapers.\n9. Ofcourse latest Android always.\n10. 2 year warranty.\n11. 3 year software support.\n\nCONS\n1. Speaker is getting some noise when more than one notification comes at a time. Speaker Distortions also annoying at higher volumes for some kind of audio.\n2. Touch on edges are not consistent some times.....especially during games.\n3. Front camera is below average on low lighting conditions. Google camera could have included filters.\n4. Phone is little taller which is not comfortable to hold.\n5. A sound(Speaker being used kind of indication) is coming from earpiece during call which can be heard in very silent conditions.\n6. Phone is slippery.\n7. Lack of 3.5mm jack.\n8. Lack of wireless charging considering removal of 3.5mm jack.\n9. Google should have included wireless headset if they are not encouraging 3.5mm jack (Intead of Type C to 3.5mm adapter).\n\nImprovements\n\n1. Speakers issues, Touch issues on edges.\n2. Blue shift is slightly reduced on saturation mode.So there is a scope for improvement.\n\nConsidering good battery standby and SOT, GOOGLE should have opted for dual standby sim atleast for some regions.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Dec, 2017", "reviewer": "Sampath Kumar Shirobhushanam"},
{"rating": 1, "title": "Absolute rubbish!", "review": "This is very sad to say that but I am facing reboot issue in my pixel 2 xl device. But when I place a request for replacement then I got a negative response. I have called Flipkart 3 times still I am not getting any proper response. They are saying to connect with Google service centre. Google team is saying that it is a hardware device. So why can't you people replace the hardware issue under the replacement warranty. As hardware issue comes under damage. I have tried connecting with multiple flipkart service people ( Manish Katare, Avishek Sharma ) and they are saying sir your problem is genuine but we can't help you. That's means if I get a device having screen issue or touch screen issue then also it it doesn't come under physical damage. Which is really unexpetable and very poor service. I have facing this issue from the day I got the product. This really bad service.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jan, 2018", "reviewer": "Pratyush Rath"},
{"rating": 2, "title": "Good Phone but Let Down by Google Tech support in India.", "review": "My Issue:- Phone charger never really worked for my brand new phone . Out of box issue for a phone that still less than a month old. Imagine my disappointment after dumping old faithful iPhone and eagerly Preordering the phone, waiting weeks of delay in shipment, over coming scepticism around 'Blue screen tinge' and other issues only to get a out of box faulty device.\n\nGoogle's Resolution- After multiple calls and followups, i get back a old and dirty charger. Is it unfair for customer to ask the replacement part to be at least cleaned properly and be handed over . B2X guys just reached out into his pocket and took out this charger and gave it to me. No packaging and no box nothing.\nWhat I did not like  \n(a) Complete lack of Customer Centricity - they took 3 weeks to just give me back a dirty charger.That too after multiple (almost daily) calls to google support, escalation to to Managers at google support.\n(b) Delays in communicating to customer- Nobody at google support could really find out what caused a delay of so many weeks in getting me back my charger. What was surprising is that Google was not even able to communicate to me reason for the delay.on 20th I get a email confirming I will get my charger back and it takes another week and multiple calls from my side to get it back\n(c) Over dependence of Google on 3rd party providers:- Google sells Pixel phone though FLipkart and services though B2X and both these companies let me down. First Flipkart delayed my \"Pre ordered\" phone by more than 2 weeks and then B2X shoddy service just kills the enthusiasm of this new phone. My phone calls to Google support made me realise that all Google guy can do was call up his counterpart in B2X and request them to expedite or raise a complaint at their end. None of which works and it leaves the customer feeling helpless.\n\nConclusion- Very good phone but extremely poor service.Google is years away from catching up with Apple in India.Pixel buyers are usually come from a market segment of knowledgeable customers and we have options with us while making a buying decision. A good hardware with poor service is not what helps you win market share. Unless Google invests in opening it's own stores, Own service centers or atl east strong control over service providers then no one will make a repeat purchase. When Google says India is a market which is important to them then please listen to your customers.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Dec, 2017", "reviewer": "Gaurav Bhatnagar "},
{"rating": 5, "title": "Awesome", "review": "Yes, i have switched again from iPhone. And this time i can really say google has done tremendous work for the past few years since i moved from nexus 6p. \nIn terms of software, i think apple has a lot of ground to cover. The machine learning and smooth apps and control over your system and freedom of app choices is something you would definately cheerish after moving from iOS. I felt reserved while using iPhone for twice in my lifetime as initially coming from symbian era iPhone was a dream and Android wasnt evolved that much. Hence, i had moved from iPhone to android and back to iPhone as i wasn't really impressed. This time with pixel 2 xl it feels good, infact i haven't left my ohone alone for last two days. \nYes, its excitement as well as so many small things improved in android and with google assistant it feels awesome. My wife's complaints have made me realise how amazing this device is that I'm using it continuously and can't get over it.\n\nThose who are bored of using iPhone or want something different, look nowhere else. This is the one.\n\nI dont want to mention tech specs here coz you would have already googled it hundred times before its launch in India.\n\nExperience does matter people and you should definately try this one.\n\nCheers!!", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Nov, 2017", "reviewer": "Mukesh Patil"},
{"rating": 1, "title": "Utterly Disappointed", "review": "This one star is Flipkart helpless customer support. I have pre-order the phone in which i was eligible for offer to get Sennheiser headphone worth ₹ 11990 at ₹ 1. I filed a complaint for that. But the customer support team said it will resolve in 24 hours. They took more than 10 days to resolve the issue.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2017", "reviewer": "CA Rakshit Chopra"},
{"rating": 1, "title": "Unsatisfactory", "review": "The product is good.  But be aware of pathetic service from Google and B2X who are their service support center.  You will lose hair before getting  a response from them and even then it will all be open ended and without clarity.  You can only use this product if you find no issues.  Once you find issue, its as good as putting in the dust bin. In my case, its now more than 1 month and I an yet to see the light of the day for the issue which I raised and the device is still with them.  So what's the point in paying INR 82, 000 and not have the  luxury of using this device.  They don't even respond to the mails.  I am now contemplating legal action.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Feb, 2018", "reviewer": "Shashidhar Bhandary"},
{"rating": 5, "title": "Simply awesome", "review": "Have dis device for 3 days now...ill break down it for u guys\nPros:\n1.mosy fluid and snappy android experience.i have over 200 apps installed on 64 gb.not a tiny bit of lag\n2.screen burn is a myth probably paid media doing it but yes there is slight imahe retention of u in the bottom bar are but it fades away.screen is awesome .\n3.those speakers speak for themselves .clear and loud .\n4.updates google fixing and giving updates and all day 1 issues are gone.\n5. Two years btand warranty\nCons.\n1.Minor bugs can be fixed via update.apart from that no issues all is hype created.\n2.RAM management shud be fixed via update.\n\nAnyone fed up of samsungs lag and iphones mumbojumbo...come to dis phone and ull have a great life.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Dec, 2017", "reviewer": "Nipun  Aggarwal"},
{"rating": 5, "title": "Classy product", "review": "I have been using this for the past 6hrs and believe me it's as awesome as advertised. The camera is just pure fun to use. Selfie potraits are very clear and detailed. Unfortunately the blue tint is definitely there but is something that's blown out of proportion. You would see it if you look for it but you forget about once you use the phone. Aprart from this it's so fast and zippy and definitely the way an Android phone should work.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Manish Mathew"},
{"rating": 5, "title": "Perfect product!", "review": "The software,the assistant,the camera,the incredible battery life,the buttery smooth performance\nJust makes this one of the best smartphones of the year(display is also incredible,I think all the display issues were blown way out of proportion,the only thing I noticed in my 10 days of use was the slight blue tint when viewing off center)\nLove the hardware too,the best set of front firing speakers,and nice glossy finish on the panda pixel \nmakes it look killer.\nYup this phone is very special and I am throughly enjoying the Google experience", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2017", "reviewer": "Sachin Singh"},
{"rating": 5, "title": "Amazing Phone!!", "review": "Amazing camera, amazing software experience and 3 years software updates from Google makes it the best smartphone. Although the cost is on the higher side, specially in India.\n\nFlipkart delivery was as expected and on time. But would have been better to get the promotional headphones along with the phone. Specially when they sent out to some people and then left out others.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Mayank Gupta"},
{"rating": 5, "title": "Worth every penny", "review": "If you are a core android user, this phone is worth every penny.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jan, 2018", "reviewer": "Bhanwarjeet Kaur"},
{"rating": 5, "title": "Great product", "review": "Love it! Only Skeptical about the way Flipkart will take care of the warranty part but rest assured it's a great phone probably a bit on the expensive side", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Dec, 2017", "reviewer": "Teja Erra"},
{"rating": 5, "title": "Perfect product!", "review": "Being a proud original Pixel XL owner first, I did not have any doubts with regards to this product either. It's a tremendous piece of hardware which brings the best of software and hardware integration.\n\nWith so many 5 star reviews already on this platform it just tells you how good this phone really is. My choice would be to go for the Black and White model since it's much cooler than the Just Black variant. The Just Black could be for those customers who prefer the corporate look.\n\nOverall, phone is fantastic with zero lag, great camera, battery backup, breezy software, super cool navigation and the backing of Google you can't go much wrong\n\nThe only global concern the company faces is only to do with making the phone available quicker. A pre order on 28th Oct I got this phone on the 30th of November which was a big disappointment. I am sure next time Google will do a lot better in this regard\n\nNevertheless if you are looking for a premium Android experience look no further since you will treating yourself to the very best of what's out there. No second thoughts on this one! Great phone from top to bottom. Cheers!", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Dec, 2017", "reviewer": "Ankur Rai"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Hello guys, that is my review after 7 days of usage of a powerful and a smartest phone on Earth.\nI'm dividing this review on pros and cons\nPROS :-\n1 :- best Android experience\n2 :- great battery life\n3 :- best camera on any smartphone (including i phone 10)\n4 :- unlimited storage on cloud. No one is mentioning it (unlike iPhone 5gb storage) it's a big deal for me.\n5 :- you'll get latest update of Android\n6 :- two years of warranty\n7 :- i got a Sennheiser Bluetooth headphones (worth 12k)\n8 :-you are getting 8k cashbacks as well on hdfc card\n9:- stereo 🔊 speakers are mind blowing\n10 :- i didn't notice any kind of screen burn on me device, yes POLED panel become little blue when you tilt the device to certain axis, but who the hell use device like this\n11:- over the air update fixes the screen dullness issue , now screen is more vibrant and colorful\n\nCONS :-\n\n1 :- Edges are little bit irresponsive when you touch it so it's better to swipe the edges. For example you need to open the WhatsApp setting by touching that 3 dots then it's better to swipe over it toward left.\n2 :- it's bit expensive , I'm use to of Nexus device which are great and value for money as well.\n3 :-that powder coating on the back looks great less finger print magnet but i think it'll start vanishing after some time (not sure about that)\n\nFinal verdict :-\nif you are an apple fan and you want to switch to Android you wouldn't find better option then this. It's a great device with great hardware and greater software experience.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Nov, 2017", "reviewer": "Manish  Sindhi"},
{"rating": 5, "title": "Best smartphone of 2017!", "review": "Excellent Phone! \n\nThis probably is the best smartphone of 2017 closely followed by Note 8, iPhone X and Oneplus 5T\nJust a quick comparison of the main specs which everyone requires in practical day to day use between these 4 :\n\n1. Camera:-\n\nPixel 2 / Xl :10/10\nNote 8 : 9.5/10\niPhone X : 9/10\nOneplus5T : 8/10\n\n2. Battery life:-\n\nPixel 2 / Xl : 9/10\nNote 8 : 9/10\niPhone X : 8/10\nOneplus5T : 9/10\n\n3. Display:-\n\nPixel 2 / Xl : 9/10\nNote 8 :  10/10\niPhone X : 9/10\nOneplus5T : 9/10\n\n4. Software (user experience):-\n\nPixel 2 / Xl :10/10\nNote 8 :  8/10\niPhone X : 9.5/10\nOneplus5T : 9/10\n\n5.  Speakers:-\n\nPixel 2 / Xl :10/10\nNote 8 : 7/10\niPhone X : 9/10\nOneplus5T : 8/10\n\n6. Price:-\n\n\nPixel 2 / Xl : 7/10\nNote 8 : 8/10\niPhone X : 6/10\nOneplus5T : 10/10\n\n\nI know there are different advantages of the Note 8, iPhone X and Oneplus 5T. But in my opinion Pixel 2/ XL has the best android experience I've ever had. The fluidity and smoothness of the phone is ridiculously awesome. ALong with that it has the best camera in any phone right now and the battery life is exceptional for a high end flagship phone. I get around 6 hrs SOT(screen on time). To put a cherry on top, the front firing stereo speakers are a delight and sound really good.\n\nLastly, DO NOT go by the reviews of Pixel XL. The reviews talk about display issues such as screen burn-in and faded colours. Trust me on this, there are NO ISSUES. The only disadvantage I would say is the price of this device. But Flipkart was generous enough to give me massive discounts, so no complaints there. I got 64GB version of Pixel 2 XL for 48k. This included 12.5k cashback, 12.5k for my old Moto Z Play and Sennheiser CX 7.0 Bt headphones (worth 12k)", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Dec, 2017", "reviewer": "Rishikesh Kunte"},
{"rating": 5, "title": "Best camera, best battery in any phone out there", "review": "Absolutely an amazing piece of technology yet again by google. Haven't faced any burn in issues although the blue tint is there but only if you tilt the phone and no one uses their phone by tilting it. Also, if you pre ordered like i did - i got it in an amazing wooden box by GOOGLE - it had a 12k worth bluetooth sennheiser headphones and my phone with a welcome note.\n\nPros:\nCamera\nBattery \nSoftware - Google obviously\nFingerprint sensor\nGoogle Assistant\nBeautiful piece of equipment\n\nCons:\nNo cons as of now\nisheep haters hating on this masterpiece", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "Shivin Kaul"},
{"rating": 4, "title": "Cashback is fake", "review": "EDIT: Flipkart service is worst. I bought his on preorder offer with Rs8000 cashback. It is supposed to be credited in 90 days but didn't get cashback yet (ordered on 11th Nov) . Flipkart is saying cashback posted and HDFC is saying cashback not posted. Neither of them are giving any evidence to counter the other party. Cashback on FlipKart sounds very much like fake\n\nPerhaps everyone would agree that Google pixel provides the best stock android experience with excellent camera. Though Oneplus 5T and Nokia 8 may provide good stock android experience, there are some unique advantages with Pixel but comes only with twice the price. It is is up to the individuals to decide. \n\nPros\n1. Google Pixel is the android's equivalent to iphone in terms on smooth experience. This phone is buttery smooth. I used Nexus 6P (with Oreo) before which itself was quite good but this one is awesome. Never noticed even hint of lag\n2. One of the best cameras in smart phone. Portrait mode on front camera is very good. Don't worry about lack of dual camera setup. Google is doing great job in software without a dual camera setup.\n3. Brand image of Google would look better than something like OnePlus.\n4. AI is going to be the future and Google is comfortably ahead of competitors . Google assistant is no gimmick and understand Indian accent very well.  Google lens  is an innovative idea. Remember all the new AI features are not going to be available first on other android devices.\n5. Unlimited storage for pictures/videos taken from Pixel. Instead of giving room for microSD card, Google provides much better option of saving in cloud. Cloud is better way to keep pictures and videos than keeping it in any physical storage devices.\n6. Pixel is going to get all the updates first (at least two months earlier than other phones)\n7. Build quality provides premium feel (it should be at this price point). \n8. Awesome battery life with fast charging\n9. Two years of warranty is simply outstanding.\n\nCons\n1. Price! Price! Price! If you only look for functional aspect of smartphone oneplus 5T and Nokia 8 would do pretty much of it with half the price. At least they could price lesser in Indian market to compensate the higher taxes. Oneplus is doing that. This would push more customers to buy in India even if they have opportunity to buy in other countries. \n2.  Bezeless looks is not good as other phones (Samsung glaxy s8, LG V30 etc) in this price range. Thicker side bezels and curved display edges are ugly. However, curved edges and overall look of the phone still gives premium look. Blue tint is blown out of proportion. At least on my unit it is just slight bluish look when viewed from a position nobody wants to look at the phone. \n3.  No earphone, No data cable to connect standard USB port on the computer,  Very short USB-C cable to the power brick. At this price point, it is completely unreasonable. \n4. On preorder, there was an offer to buy bluetooth earphone for Rs.1. I wonder why they didn't come up with such offer for Google earbuds (same price range). This is the offfer convinced me to buy in India though.\n\nOverall in conclusion, if you look for premium stock android phone with best camera go for it. If you are looking only the functional aspects do explore other options like Oneplus 5T or Nokia 8 (maybe even upcoming Nokia 9) before buying this.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Nov, 2017", "reviewer": "Mohan"},
{"rating": 5, "title": "Worth every penny", "review": "Well First of all I will admit that I am a big Apple iPhone lover . After all these years I swapped my iPhone 7 as secondary device and pixel 2 xl as my primary device . To be honest iPhone x was just too much costly for me and I didn't find iPhone 8 plus as big upgrade . First thing is the screen , yes there is blue tint and you will notice it too much for first few hours then it will settle in your mind . About colour saturation , I don't need any but there is option for it .Will not talk about specs but phone is super quick . Then comes the real deal : The Camera , My goodness this is something fabulous . Everything is just on point . Sometimes I was comparing it to my DSLR. Now I get this phone in exchange of Moto g4 plus and 8000 cash back for RS 55800 and with 12000 worth of earphone's which I didn't receive yet and yes two years of warranty .I don't think there could be much better package than this . \nI am just getting used to this 6 inch screen and want to use it without cover which adds bulk but I m afraid for camera lense. \nAnd yes after all this I still had my eyes on iPhone x . That would be the combination of best of two operating systems .", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Nov, 2017", "reviewer": "Jatin Kaushik"},
{"rating": 4, "title": "Wonderful", "review": "Best phone i have ever used with great features and worth every penny..sadly wanted a white one but was not available at that time..\ncons\nheadphone jack should be there..earphones must be included for that pricy phone..charging is bit slow than one plus.\npros\nbest camera, such a beautiful phone not a slippery one also the updates will be there for good amount of time..photos backup is free..love the software and tuning is perfect by google..doesnt have any stupid notch which i dont like..front speakers are awesome..battery backup is pretty good.and you know a ddvice from google how good they have build it..yeah blue tint is there but if you are looking right at phone u wont be noticing it..light weight with 2 years of warranty..how much you can ask..good job by google and i am in love this device", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Hated it!", "review": "The phone is very good. Camera is fantastic and runs buttery smooth without any lag. But thats it. Everything good about the phone is ruined by the support provided by Google in India. It is very bad. It takes more than 20 days for the device replacement. They have outsourced their support activity to B2x which blames Call Centre for their inefficiency. \n\nAlthough you can neglect this review and buy this phone. But I only wish you get a perfect device so that you don't have to contact Google Support.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Mar, 2018", "reviewer": "Tariq Ali"},
{"rating": 5, "title": "Great product", "review": "Switched from 5t and this phone is just class to use, things just fly and smart knows and suggests stuff before you think about it.\n\nHave blue tint but I never notice and camera on this thing even in low light is years ahead.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Feb, 2018", "reviewer": "Surender Singh"},
{"rating": 5, "title": "Love!!", "review": "This is the best mobile phone money can buy! Lovely experience. Android ❤️", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Jan, 2018", "reviewer": "Deepankar Kotnala"},
{"rating": 5, "title": "Great product", "review": "This phone is worthy of being the best Android phone available in the market.\nBeen using this phone for almost three weeks now, and the phone shows no signs of lag.\nIf you are looking for the best Android software experience (at a premium price of course) then blindly buy this phone, you won't regret your decision.\n\nNow about the things I like about this phone:\n1. Speaker: The speaker is loud enough than most phones out there (Reminds me of the speaker quality of iPhone 7 plus).\n2. Battery life: At first I thought that the battery life would be average, but it is well above average. It easily lasts me about a day and a half.(I am not a gamer, else in that case the battery life would differ a bit)\n3. Screen quality: It is not as bad as shown by others in all the YouTube videos out there, you need to experience it in person first before making an upfront decision. Use the phone at any mobile store first before making any purchase. You won't be disappointed.\n4. Proper RAM management: I have used phones from most tier 1 brands and the RAM management on this phone is exceptional. Transitions and animations are smooth enough. Apps open and close pretty fast. 4GB RAM is more than enough for most apps.\n5. Google Integration: Software optimisation by Google is top notch. Google assistant is available by simply  squeezing the bottom sides of the phone. Also Google lens is integrated in the camera app, it means that Google search can be launched directly from the image capture taken.\n6. Camera: Best camera out there with solid AI which recognises the subject and blurs the background in portrait mode. The portrait mode is available on both front and rear camera and is amazing. In India by default you won't get portrait mode on front camera, but simply googlng around you will get that functionality too.\n\nI seriously didint find any negative points about this phone. And with the offers going on this could be a good buy before the new year arrives..", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Dec, 2017", "reviewer": "Kshitij Tandel"},
{"rating": 3, "title": "Decent product", "review": "Less stars for seller and his services. Delayed delivery by 7 days, and new offers added few hours after ordering the phone.\n\nPhose is excellent full points for that to google", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2017", "reviewer": "Rahul Pal"},
{"rating": 5, "title": "Brilliant", "review": "Absolutely brilliant phone. \nLet's move a few things out of the way first. \n- The blue tint only bothered tech reviewers. For a daily consumer, the screen is spot on.\n-    Yet to notice any screen burn. So, it ain't a deal breaker yet.\n\nThe best parts\n-  Everything an Android should have, is there. The best in class camera. Amazing phone design. Brilliant fingerprint sensor location. Plus other things Google mentioned at the launch.\n- A days battery life makes this phone, so much reliable.\n- Notification LED... After so long.\n- 2 year manufacturer warranty\n\nI am telling you, from my personal experience, when people come and ask you \"is it pixel 2\", there's a sense of satisfaction. You will love this phone even more.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Dec, 2017", "reviewer": "Anurag Singh"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Not a review exactly, but my questions to all the confusions I had was cleared with my 10 days with this product. Almost all the reviews say \"Almost perfect phone\" because of the display controversies. If that was the only issue for them,  then i can say this is \"the perfect phone\" so far because the display issues are overhyped. \nNow answers to the overhyped issues, let me say I myself can't stand any known flaws in my phone, it would keep bugging me, \n1. Dull colors - As everyone might already know there is a patch that gave color options which gives a saturated option that pops out colors.  But I feel the Natural and Boosted colors are very good. They are not washed out, we are just used to over saturated colors. Only when you compare this phone with saturated color phone you feel that.\n2. Blue Tint - I keep tilting my phone trying to find the too much blue tint people have been complaining about. Have been trying to reproduce.  Either its not there or it's not as noticeable as the reviews claimed.\n3. Blotchiness and Black smear  - I did notice the black smudge once when i was viewing a picture with black background and trying to move it up and down rapidly. But i had to reduce the brightness level less than usual (i prefer 40 to 50% brightness) to notice it. Black smear is a common thing with oled panels. This display is not having the issue more than any other phone. Blotchiness, i couldn't find notice it. These two issues are something that will be noticed in testing scenario not in day to day use.\n\nEdit:Burn In Issue: Its almost 20 days since i have started using the phone, i am not able to reproduce this issue. \n\nBattery: Some blog claimed fast charging is not as fast. My phone gets to 20 to 80 in just 30 mins. It lasts for more than a day with heavy usage (games and videos). \n\nSo my thoughts, i am absolutely loving the phone. :) :)", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Nov, 2017", "reviewer": "Pon M"},
{"rating": 5, "title": "Terrific", "review": "Google at its best!", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Mouli Srikkanth"},
{"rating": 5, "title": "Awesome", "review": "Another great device after first pixel. Improves on every aspect. Seriously not for fashion statement. People don't recognise it and accessories are limited (won't get the attention in crowd like an iPhone does). Spend only if you are looking for some serious software and camera. As comfortable to hold as other 18:9 devices. The more than usual screen to body ratio is due to speakers but it ain't no tradeoff. Extremely mature device. Blue shift is more like a character than a flaw. Hadn't bothered since beginning. Maybe Indian units don't have it that much. Battery lasts as long as iPhone 8 plus which for me is a personal battery benchmark. Rear camera is great as usual but where it embarrasses the iPhone is the front camera especially the portrait. Since it uses primary sensor for portraits there's no los in quality (leaving aside some zooming in), compared to dual lens setups where secondary sensors compromise on quality.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jan, 2018", "reviewer": "Devesh Sharma"},
{"rating": 5, "title": "Excellent", "review": "Awesome phone\nNo one better than this. \nBest camera and great speed. \nI have compare pictures and video quality with my friend, Is is better than Iphone x, Iphone 7 plus, 1 plus 5t, Samsung note 8 and galaxt 8plus. they are camera nothing of pixel 2.\nbest 4k video. 🤳\nI think ram is enough. never hang.\n50% charging in less 30 min.\nlatest Android patch ugrade. \nbest work google assistant, unlock my device only my voice, I tested with 15-20 person.\nbattery is max 1 day☹️, may be my phote uses ismore. \nAr, Vr and 3d video is very well, but I check it on chief vr, later I will try to with google VR.🤑\nno head phone jack☹️\nwater and dust proof👍\nsnapdragon 835👍\noreo 8.1.1👍", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Feb, 2018", "reviewer": "Yagnesh Patel"},
{"rating": 5, "title": "Excellent phone", "review": "Display: I read a lot about display issues - and frankly I was a little put off, and thought multiple times I will cancel the pre-order. Once I got the phone and powered on and went through the setup process and android upgrade etc.  the first thing I noticed was pale colors. Then I quickly went into advanced display settings, and selected \"Saturated\" - bingo - the colors are bright. I could not find much issue. If I tilt a little, the colors fade - but frankly if you have saturated colors turned on, not much issues. Also, the display brightness is always 50% or lesser normally, so slight reduction of maximum nits value has no impact in normal uses I guess. On the whole I am very happy with how my display is working. Its quite sharp. Will update after some time if I see any other issues.\n\nCamera: Outstanding - no need to go through anything much I guess. Checkout DxO mark site  - I agree completely with that. HDR+ is fast and low light performance is good. One thing I noticed though is very good audio recording and playback quality during video recording/playback from camera.\n\nPerformance & Battery: very smooth. Have been using for a week. no lags noticed anywhere. I configured office mails ( Outlook ), gmail, skype, whats app, location is always on - and use it through out the day for office and personal emails and communication. Also I use the Google news reader configured and frequently use the Google now. I listen to music for some time on bluetooth in my car during driving to office/home. My nexus 6p previously used to give up around 4:30 - 5 pm every day - but this almost goes to the next day morning - lasts through the night for me. I don`t do much gaming/youtube though normally - so can`t comment on those use cases.\n\nBluetooth / Wifi: So far no issues. I will add more after using more.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Nov, 2017", "reviewer": "Raghava Mohan Madhwapathi "},
{"rating": 5, "title": "BUY IT!! FEEL IT!!", "review": "Starting from unboxing to using it for 5 days. Received it a wooden box with two drawers, one for Pixel 2 XL and one for Sennheiser earphones. The presentation made by them really made me feel special. \n\nPros:\n- Lookwise there is no other phone better than it (super SEXY!!)\n- Easy to hold.\n- Fingerprint sensor is really nice and on perfect place.\n- Camera quality is exceptionally good. High video stability. Took a pic in low light without flash, was too much visible and clear. Digital flash in front camera and protrait mode in front camera also. \n- Unlimited storage on google photos.\n- Used phone continuously for 12-14 hrs, playing game, watching video, using GPS, listening to songs. Good battery backup.\n- Switching between apps very easy, doesn't hang.\n- Sennheiser headphones are way too awesome. Very comfortable. Good noise cancellation. 10 on 10 for it.\n- Android Oreo.\n\nCons\n- No headphone jack. (solution the provided by giving headphones. Ps: Not big problem)\n- Touch doesn't work sometimes on edges and in between also. (Hope another software update will fix it. Ps: Big problem)\n- Blue tint is there. (but it actually looks cool :D ps: Not a very big problem)\n- Doesn't charges fastly. It takes around 100 min to charge phone from 0 to 100%. (Not big problem)\n\nOverall I will rate it 4.7 out 5. Probably the best android experience ever. Best android phone available in market if they fix the screen problems. As they are providing 12k worth earphones, so the overall offer is worth for money. If you are having it, you are having the best piece available in market.\nIf you want to feel special, buy it, feel it.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Nov, 2017", "reviewer": "Shubham Singhal"},
{"rating": 1, "title": "Worst Experience buying from flipkart", "review": "I have had the worst experience of buying a mobile online. I was not informed the phone was delayed till the day it shipped. I call the customer care multiple times  yet no help. Also Google advertises that they are selling this phone through flipkart exclusively but flipkart claims they are a \"marketplace\" and they have nothing to with the delays caused by the \"seller\". Overall worst experience ever. \n\nBut the phone is an absolute joy though!\n\nI had to give 1 star because of flipkart. Worst service from customer care.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Dec, 2017", "reviewer": "Abhilash Chukkapalli"},
{"rating": 4, "title": "Good choice", "review": "Great phone... Wonderful camera. On time delivery. \n\nAs for some others, I didn't get any fancy 3 kg pack with headphones... Probably Flipkart didn't want to make everyone feel special. Now have to wait another 15 days till 1st December to order the promotional headsets... Not sure why those couldn't be sent to everyone by default.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Nov, 2017", "reviewer": "Mangesh Chore"},
{"rating": 5, "title": "Worth every penny", "review": "Exellent phone. Though bit costlier than 1plus 5t. Worth every penny.camara is awesome. if u r true Android fan u would love it.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "kashyap"},
{"rating": 5, "title": "Great product", "review": "Awesome product. All the issues are actually hyped.  Maybe pertinent post launch but not after latest Oreo update. Google seems to have addressed all of them quite well. Ofcourse best flagship phone.\nBattery life - 8.5/10\nDisplay - 8/10\nCamera (Clarity, focus, bokeh) - 10/10 - best so far in an android phone. And that too no extra lens (dual lens). Portrait mode is quite intelligent\nPerformance - 9/10\nFingerprint sensor very fast.\n\nSpeakers 8.5/10 (Warning: No headphone jack. But now getting used to it. Not a big show stopper for me atleast)\n\nN the best part : It'll only get better in future with direct Google updates for stock android.\n\nFinally, not to mention unlimited Google storage for 3 yrs!\n\nOnly one con that over the screen edges it seems to loose it sensitivity and you can feel that immediately. I think even that shall be fixed in future update.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Jan, 2018", "reviewer": "Lalit Kadam"},
{"rating": 5, "title": "Terrific purchase", "review": "Totally in love with this phone. Bought it from Flipkart and have been using it for over 1 month. Used to use one plus 3 and OnePlus 5 . There is no comparison with pixel xl 2 with that or as a matter of fact with any other phones. It's super fast, looks great and take amazing pictures. Use Photoshop express to modify the pics - the photos are amazing. There is a lot of negativity about the screen. But I think it has been exaggerated. It's the best phone. Got for it. I went got the black and white version and it looks super cool", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Worth every penny", "review": "The best Android can offer you.\nAmazing camera, snappy performance.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2017", "reviewer": "Arjun Pradeep"},
{"rating": 5, "title": "Star of 2017", "review": "First of all, Thanks Google for the amazing packing. Nailed it. Coming to the phone, its a beast. Fast, punchy and smart. \nPros: 1. Fastest and latest Android\n2. Best camera\n3. Feels premium\n4. Fast charging\n5. Battery backup is superb\n6. Size is perfect and matches 2017 standards\n7. Screen is crisp and super responsive\n8. Stereo speakers are awesome\n\nCons: None as such. Blue shift is over hyped.\n\nWaiting for the AR stickers for camera.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Naveen"},
{"rating": 5, "title": "Simply awesome", "review": "Finally got the Black and White phone, it is an amazing phone. Love the color and finish and worthy upgrade from Nexus 6P .\n\nFollowing are my observations post 12 hours of usage will update the post after an month\n1. Display: I loved the display and brightness of the screen. Colors looked natural and I have selected the saturated mode where we get punchy colors, I will leave it to individual interest on the saturation level.\n2. Processor: No doubt phone has the latest Snapdragon 835 octa core which is an beast in terms of performance, phone blazes past in handling multitasking and heavy duty applications\n3. RAM: Google has optimized the phone to run with 4 GB of RAM, zero lags when launching applications and switching between them.\n4. Camera: Second gen Pixels have the best camera ever, what an amazing clarity and pictures retain great amount of details, phone performs good in low light too.\n5. Battery: Equipped with 3450 mAH of battery and with 12 hours of usage I can see there was an drop 6%. however I haven't used power hungry app till now.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Dec, 2017", "reviewer": "Karthikeyan  T K"},
{"rating": 5, "title": "Welcome to the future!", "review": "Google had nailed it. Best smart phone ever.\n\nUpdate after ten days off heavy use.\n\nTo summarise all my experience, I'll put this in bulleted text.\n1. Great software experience you'll get ever in a smart phone including iPhone's(please watch geekyranjit review of Pixel 2 XL for this comment). Specially iOS 11 it's so buggy.\n2. Great battery backup in any smart phone again. Yes. Any smart phone including midrange phone. Midrange phone don't have high-end quad HD display to push more pixels. But still this phone manages to get more than 6 hours of battery backup no matter whatever you do.\n3. Great front firing stereo speakers. They may not so much louder like iPhone X. But the hearing range and sound clarity it's great. I can say this much that you'll hear it one floor up or down, off you're listening music. It's so clear and wide reach.\n4. It didn't get heated up during extended browsing in Chrome, because of that plastic coated material on back and also because of better heat sink management. My OnePlus 3 get constantly heated up while browsing in Chrome.\n5. Google has said, they'll be providing atleast 3 years of software update. But I think it may go upto 4 years as this one support the project Treble. That's why Google said atleast 3 years. That means it may be more.\n6. Camera experience is terrific. No need to explain it.\n7. You have nailed it. The power button placement is little on top side which is not comfortable.\n8. My Pixel 2 XL doesn't have any blue colour shift on tilting. If you say, I can post a picture of it. Rather I'll say, it's colour management is something which I'm liking it lately as though I can switch to saturated mode, but I'm staying with boosted mode as it looks better and natural to me.\n\nLet me try honestly to clarify certain things, as I'VE already used this device for last ten days. It's light weight as the back don't have any glass or sides don't made up of stainless steel like iPhone X. About missing 3.5 mm headphones Jack, I think because of placement of stereo speakers on both the side they might not be getting placement to put that on top or bottom.\n\nI hope if any one find this post useful and buys this phone, her or she'll be very satisfied with her purchase decision. But price is something which may play a little hindrance. But once you cross that hurdle, of will be a very satisfying investment.\n\nThe boss is here. I'm posting this after only 7 hours of usage. The battery is insane. Over 6 hours already. I don't find any fault with the display and using the default boosted color mode though it's system update to November security patch.\n\nThese are only initial impression. Still to check the camera. I'll come back in couple of days for more in depth.\n\nUpdate after three days\n\n1. Consistently getting seven hours of battery. Standby time is excellent.\n2. Stereo speakers does sounds very best. Got the Sennheiser Bluetooth earbuds and they sound great like AudioTechnica M 50x. Not missing my wired hardiness at all. These are so convenient.\n3. Camera quality is insane. Just point and shoot. You'll get best of the image. Yet to take any video though.\n4. Smoothness is just top notch. Coming from OnePlus 3, if I can feel so much better smoothness then think about others.\n5. Launching Google Assistant is so much fun and at the same time so intuitive. This squeeze feature the made into this phone is not gimmick at all. You'll surprised to see how often you use it.\n6. No problem at all. No blue tint nothing. It's saturation and black lavel are amazing. Not comparing with Note 8. I'm not using it's saturated mode though it's available.\n7. In hand feel is just right. Very well balanced and grippy.\n\nInitially thought about the price a lot. But just took some calculated risk for the sake Google's credibility and I'm not disappointed. Just wondering how much Google has improved in design and hardware department. I'm an old Nexus 4, Nexus 5 and Nexus 7 user. So really appreciate their effort in providing a nearly flawless and fluid Android device.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "Nilachandan Mohanty"},
{"rating": 1, "title": "Did not meet expectations", "review": "I have been using Google phones since Galaxy Nexus time. But this time, I was totally disappointed. My Pixel 2 XL, 128GB, a black phone used to take 6 hours to charge. I complained about it on Flipkart and they told me to contact Google directly. I sent a few requests but no one ever replied until I complained about the problem on Twitter. They promised me to send a service engineer from Baroda on 1st December after 3 days of complaining. No one turned up on 1st December so I called them again so they sent someone on 2nd December to check my phone. Since he didn't have any solution to my problem, they took my phone and told me that they will revert soon. It was 14th December morning that I called them up again to ask what happened and they replied that they will revert to me on it on 18th December 2017. Today they send me a text message saying that service engineer collected my phone today. I am terribly disappointed with Google this time.\n\nRegarding phone... Apart from Camera and some live wallpapers, there is nothing special than Pixel XL. So, even though it's a decent product, I would not recommend it.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2017", "reviewer": "Dr Vimal Hemani"},
{"rating": 5, "title": "Best in the market!", "review": "Awesome phone. Buy immediately. Epic camera!", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Mar, 2018", "reviewer": "Siddhant Soni"},
{"rating": 1, "title": "Hated it!", "review": "Its a third day of pixel xl 2 and the earpiece on call stopped working. I have to talk on loudspeaker !! Bizzare.. shocked. What am i suppose to do now", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Mar, 2018", "reviewer": "Anita  Singhal"},
{"rating": 2, "title": "Expected a better product", "review": "No issues with the phone what so ever , and even FLIPKART delivery was good .\n\nThe reason for 2 stars is after buying the phone the price for reduced for RS . 5000 after 3 days , when saying the sale is between a period of time , Flipkart has to ensure the price is not changed during the offer period .", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Mar, 2018", "reviewer": "Monesh Prabhuraj"},
{"rating": 5, "title": "Wonderful", "review": "This is by far the best phone that I have ever used. Everything about this phone is designed with end-user in mind . Most of the people who are considering a pixel 2 xl can very well afford a note or an iphone and both of these are amazing . So why go with this new enthusiast brand ? Because this is the most well rounded and balanced Android or hell the best phone out their . This phone marries the stability and polish of ios and customability of Android. This phone does not have the horrible software of a galaxy and the lackluster design-feel of an iphone . \n\nSure there is a little bit of blue tint but you will forget about it within a few days of use. The blue tint is not that bad. The cameras are amazing, software is groundbreaking, google assistant is smart af , battery life is best in class, quad-hd display is super crisp the build quality is amazing and oh boy that panda paint job is a sure head-turner .", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "Kanishk Singh"},
{"rating": 4, "title": "Best Daily driver", "review": "One of the best out there. Ordered Pixel 2 last month in a sale and didn't get the Phone for 6 days. \nCancelled the order and this time got it in 1 day flat. I guess they had made amends.\n\nThe display being OLED is fantastic with colors popping out. Blue tint is not a worry for me. Build quality is fantastic. I was skeptical about the panda but boy was it awesome.Comfortable to hold and one hand usage is good.\n\nI have upgraded from Mi5 and Pixel really is way better. Call quality was better in Mi5. One disadvantage is you cannot select multiple messages from one user to delete in Pixel which I can do it in Mi5. Camera in Mi5 with OIS was great and Pixel as it turns out, focuses super fast and snappy. Enough is said about Pixel camera already. We know how good it is.\n\nNote 8 is another best option you can go for if you are not into latest Oreo. Identifying song in the background is dope.\nThe live wallpapers with moving objects are super cool. I keep staring at them every time I start the home screen. Addictive.\nCurved glass in the front and back and it's google take on how smartphone has to be made. \nI dont like super thin galaxy s8. Design of galaxy may be superior but, width seems to be very less.\nThe screen i,e length and breadth ratio should be optimum and Pixel is ideal I think.\nDisadvantage is no pen which only note8 boasts of. But, that bulky feel and uncomfortable size of Note8 is also a turn off.\nOverall for me, this is how a smartphone should look and perform.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jan, 2018", "reviewer": "Kishore  Reddy"},
{"rating": 5, "title": "Terrific", "review": "The Best Smartphone Camera in the world! Highly optimised and smooth experience!", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Dec, 2017", "reviewer": "Romit Chakraborty"},
{"rating": 5, "title": "Highly recommended", "review": "Using this since Nov 17th and it has been a great experience. Everything about this phone is perfect. The blue shift? No, you won't even notice it, it's a great display.\n\nBattery is great and it delivers a screen on time of 5 hours with Bluetooth (watch and earphones connected all the time) and Location turned on ( high accuracy) all the time.\n\nCamera's the best of all! Satisfied much with this phone. Worth buying!", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Dec, 2017", "reviewer": "Sriram Subramani"},
{"rating": 5, "title": "Just wow!", "review": "Totally worth the money. the camera is so out of the world, just superb quality pics.\nComing to the screen, the blue hue never was an issue. In fact it never happen to have bothered to me from the day 1.\nso who ever is taking a step back just cause of the screen, i would recommend to just go and buy this phone.\n\nThe only thing which i miss pretty bad is the 3.5mm headphone jack.(do not want to switch to Bluetooth headphones)", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Dec, 2017", "reviewer": "yala hasan"},
{"rating": 5, "title": "Simply awesome", "review": "The best phone from Google. Camera is absolutely Amazing. If you love andriod just go for it.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Dec, 2017", "reviewer": "Shubham Kabra"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Pixel 2XL is just an awesome phone..... I have been using the phone for one week now... No screen issues.... Expect for the blue tint... But it's not seen after using the phone regularly.... Camera is jus freaking awesome.... If you love to click pics... Jus buy this phone... It won't disappoint you....", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Best Android Smartphone of 2017...No screen issues noted...", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Dec, 2017", "reviewer": "Siva Krishna Puramsetti"},
{"rating": 5, "title": "Classy product", "review": "Absolutely stunning phone..check all d boxes..display issue is blown out of proportion.absolutely no issues..in love with the device", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Dec, 2017", "reviewer": "Anand Arangath"},
{"rating": 5, "title": "Wonderful", "review": "First thing I love the colour and the design of the phone. The camera of the phone in portrait mode gives excellent results and you will be so amazed for sure. It's too early for me to tell all the good things about pixel 2 XL but I'll keep you posted once I have experienced it enough. This time I am disappointed with Flipkarts service because I had pre ordered it on 31st of October and I received it after a month on 1st December. Preorder is something you receive a new handset prior to anybody else. In this particular case I had to wait a lot. I could have easily bought this phone from the nearest retail outlet if not pre order. Last thing the Hype regarding display issues please ignore all of them this phone, it's fantastic the screen looks awesome. Yes there is a blue shift, no denying on that factors but it is only when you tilt the phone and so far I haven't tilted even once while using it and I believe nobody tilts the phone and use it.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Dec, 2017", "reviewer": "ShivRohit Vanagondi"},
{"rating": 4, "title": "Excellent Purchase", "review": "I am writing review after 3 days of usage of Pixel 2 XL Black 64 GB.\n\nIts software is beyond comparison.....Its breezy all the way.\n\nBattery is excellent.\n\nCamera is a top notch.\n\nIn saturated mode display look nice.\n\nBlue tint do not bother from normal angle.\n\nThe only con is its data cable which is type C at both the ends and for that i have to buy type A to type C data cable to connect it to laptop.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Nov, 2017", "reviewer": "J. Shankar"},
{"rating": 4, "title": "Very Good", "review": "Good product with nice display, of course  there is blue tilt issue, but still its has good screen. Very fast and smooth to operate and camera is best part of it.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "MANISH MISHRA"},
{"rating": 1, "title": "Bad quality", "review": "Im facing a lot of difficulty and inconvenience with support team in india fir ky pixel 2 xl phone.. the speaker was faulty from the beginning and they replaced that device with a new one which had the same issue when inraised an issue they just took my phone and gave me the same faulty phone after 7days.. wrost experience with pixel phone. Will never suggest anyone to buy it and suffer", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Dec, 2017", "reviewer": "Sai Sahu"},
{"rating": 5, "title": "Worth every penny", "review": "At first google pixel 2xl was never in my list..m  a big lg lover so was planning fr lg v30 coz of it's bezeless design plus a very gud camera n wide angle lens too..Than i saw google pixel 2xl review at first i felt that the design was more or less the same as the prev yr design but google the xl variant looked better if not the best having the futuristic design...n than i watched the comparison videos of it wid iphone x n lg v30. Than i found out that pixel 2xl have got the best camera among all n than decided for this smartphone beast.\nI got this phone on 11th thanks to flipkart for fast delivery.\nThis phone has got the best camera..the selfie camera is really so awesome n the selfie portraits are just wow.\nThe battery life is too gud it's just unbelievable as even with a gud usage m able to last fr 24hrs.....this is best among all the others available...guys just go fr it", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Awesome", "review": "A very good phone that is useful, fast and brilliant. Google assistant is great, better than Siri in my experience. The camera is as good as is being claimed. The images on screen are close to reality rather than being over saturated. The fingerprint sensor is lightening fast, and the face recognition is great too. It is a very good buy. I recommend this phone, especially for the updates...you get them first. And also for the pure Android experience.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2017", "reviewer": "Rishabh Shukla"},
{"rating": 5, "title": "Worth every penny", "review": "Smartest smart phone I've ever used with the best Android and AI experience. Amazing design much thinner and lighter than expected with a nice grainy texture in the back. Front facing stereo speakers and HDR support makes the screen look awesome(All the market hype on the screen flaws are unnoticeable). Fingerprint reader is too fast. Water and dust resistant. The Camera -  hands down no contest there !! \n\nJust missing headphone jack :)\n\nAmazing delivery from Flipkart. Got a huge 3kg Google pixel box with the phone and Sennheiser bluetooth headphones. \n\nThumbs up.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Vijay  M"},
{"rating": 2, "title": "Slightly disappointed", "review": "Was very excited about the phone, ordered it as soon as it got on pre-order. Got an amazing phone, with a few bugs here and there, but the biggest let down was the screen burn in that occurred within 4 days of use. As much as I love the Google Flagships, I'm sort of disappointed with this, wanted to return the phone, but there's no return policy with Flipkart which is another let down.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Nov, 2017", "reviewer": "Ranbeer Sidhu"},
{"rating": 4, "title": "Wonderful", "review": "A fantastic phone.... Using it for 3 months now no signs of slowing down.. get the latest Android.. a fantastic camera.. unlimited Google photos storage (it's far more useful than u think), a very good battery life.. easily get through  a day of power use...  and a whole bunch of other fun stuff..\n\nPlease note: The screen is a tad below the mark... U will find blue shift when u tilt the screen.. it doesn't bother me much... But I can imagine it being a deal breaker for some.. but if you are going for the Google software experience... Nothing else beats it.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Worst experience ever!", "review": "Product is excellent...Flipkart services is not...", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Jan, 2018", "reviewer": "Prajoth Prasad"},
{"rating": 4, "title": "Very Good", "review": "Been using it for around 2 weeks. So here is the review\nPROS:\n1)Software - You will fall in love with the super smooth, lag free software. You might overlook all other cons just because of this feature. Its just awesome (understating it).\n\n2)Camera - The best rear and front camera hands down as compared to any other phone in the market. The portrait mode on both front and rear cameras is better than all the dual cameras gimmicks that other companies give. Kudos to Google for their software.\n\n3)Speakers - The dual front facing speakers are really good. Playing games, listening music, watching movies is a treat.\n\n4)Battery - I easily get 1.5-2 days of battery life on a single charge. 6-7 hours of screen on time. What else you can ask for. \n\n5)Google Assistant - You have to use it to know how intelligent it has got.\n\n6)Design - My personal opinion but i just love my the black - white Pixel 2 XL. It is quirky yet classy and beautiful. \n\n7)Miscellaneous - Google lens,fingerprint scanner, latest and fastest Android updates for 3 years.\n\nCONS:\n1)Screen - a) Blue tint is quite visible while looking sideways. But nobody uses the phone looking sideways so the issue is blown out of proportion.\n                b) Their is smearing / stretching of black color objects on rapidly scrolling of screen or scrolling during low screen brightness or when the night mode is on. \n\n2)Charging - Although only twice (might be some bug) but it took 5-6 hours to fully charge the phone. \n\n3)Customer Support - Really a deal breaker. Does not reply to queries or call back even after repeatedly asking for the same. \n\nAll in all its the best smartphone out in the market. PERIOD!!!. The overpriced Iphones, bloatware full Samsung, Chinese One Plus are no comparison to this beauty. Plus the amazing discounts offered on Flipkart, its a steal (overhyping but true to some extent).", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Dec, 2017", "reviewer": "Himanshu Verma"},
{"rating": 3, "title": "Decent product", "review": "Product is really gud but not satisfied with the Flipkart delivery as I received my product after 15 days of expected date which is really very frustrated.", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Nov, 2017", "reviewer": "Paras Kapoor"},
{"rating": 5, "title": "Thanks Google for making me feel so special.", "review": "The packaging was mind blowing.\n\nPhone no doubt is aweeeesssssooooommeeeeee.\n\nThanks google for the privileged case.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Kapil Kishore"},
{"rating": 4, "title": "Just okay", "review": "Positives:\nBest-in-class camera\nAll-day battery life\nIP67 certified\nLoud and clear front-facing speakers\nEasy-to-use and practical Android experience\nFluid, quick performance\nGoogle is finally good at designing smartphones\n64 GB of base storage\nActive Edge is very useful\n\nNegatives:\nPixel 2 XL's display feels like a step down from the Pixel XL\nNo headphone jack\nNo USB Type-C headphones in the box\nHigh price tag\nWhile useful, Active Edge should have more features", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Rahul Bangar"},
{"rating": 1, "title": "Utterly Disappointed", "review": "1. Excessive heating on charging\n2. Battery drains very fast without usage\n3. Defective sennheiser bluetooth headphone\n4. Non responsive customer care of both flipkart and google", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Nov, 2017", "reviewer": "Resham Singh"},
{"rating": 1, "title": "Worst experience ever!", "review": "Worst phone ever i purchased in my life. Phone has battery issues. It took 7-8 hours to charge with supplied fast charger. I contacted google and they tell me some tricks like reboot, factory data reset and calibrate the battery. I tried all but nothing happens. Not expeted this from 60000 rs phone. Learn a lesson from this. If someone want to buy costly phones than buy only apple or samsung. Sold this phone after 1.5 month at rs.30000 at huge loss. Now i m using galaxy note 8 and happy with it.\nSo guys please don't buy this phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Feb, 2018", "reviewer": "Sumit Rai"},
{"rating": 1, "title": "Useless product", "review": "Stopped charging", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Renu Seth"},
{"rating": 4, "title": "Pretty good", "review": "Nice", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jan, 2018", "reviewer": "Jagan Mohan Rao Aileni"},
{"rating": 5, "title": "Terrific", "review": "Smartest smart phone", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Prasanna Kumar"},
{"rating": 5, "title": "Perfect product!", "review": "After going through lot of confusion between S9+ and Pixel 2XL, finally decided to buy Pixel2 XL because of the native Android experience. \n\nPros:\n1.Pixel2 XL gives a buttery smooth android experience, (zero lag, fast switching between apps, super fast browsing)\n2.It's camera is quite amazing. In all ligting conditions it manages to produce sharp and clean images I am taking lot more photos these days after using pixel. The portrait mode works good.\n3.Even after playing real racing/dead trigger2 it doesn't heat much, so the thermal management in Pixel2 XL is quite good.\n4.Pixel2 XL has great battery life.\n5.Finger print sensor is super fast, I am really surprised with the accuracy and the speed of this sensor.\n6.Pixel2 XL has stronger signal reception capability. In my previous phone(one plus) I hardly use to get 4G  signals.\n7.Stereo speakers are awesome. The clarity, loudness, positions of the speakers is just perfect.\n8.As everyone knows unlimited storage and 3 years software updates.\n\n\nCons:\n1.Display is not as great as Samsung's super amoled type but it's not bad though I am happy with it except the blue shift which I am used after a day of usage.\n2.Headset jack removal is annoying, the type-c to 3.5mm Adaptor they provided does not work. Need to spend extra money to get a good quality wireless headset. Also the Type-C headsets are not yet available in India from too many manufacturers if u wish to buy one.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Flipkart needs to up its game", "review": "This is for Flipkart and the offer zone. The Google mobiles available on offer have an extremely old manufacture date specially for pixel 2xl of which the old models had screen defect. \nSecondly the service on Flipkart is horrible, terrible service. Even smaller sites have better service than Flipkart.. They don't care if you get a defective piece. You don't get any replacement for the same. Every website gives that surety. I got this phone from Flipkart because of their 10 day replacement policy, that's a lie. No replacement on phones.\nThe piece I got is manufactured in November. It has an extreme blue tint. The entire display is so grainy, pics look pixelated on this display. It seems like a matte screen guard is appled on it. It has a dead pixel as well. Ideally this phone should be replaced as it's defective. Any website would do that for me. But Flipkart is the last place I am ever going to purchase anything from. It has the most terrible service.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Mar, 2018", "reviewer": "Kiran M"},
{"rating": 5, "title": "Worth every penny", "review": "Ordered at midnight and got the phone within 24 hours. The phone is excellent in all respect. Thanks flipcart for fastest delivery.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Fabulous!", "review": "Amazing phone with awesome picture clarity", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2018", "reviewer": "Anjali ."},
{"rating": 1, "title": "Worthless", "review": "I bought jus few days back, I m facing bottom Speaker n Microphone Issue, I m a big fan of Google, paid a huge amount for this, but now it has become an unbelievable issue for me, I can't even call also to anyone.\n\nI requested for Google support hope they will resolve this  issue.\n\nI m really very upset on this ....", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Feb, 2018", "reviewer": "Deepa S Saligrama"},
{"rating": 5, "title": "Terrific", "review": "Supreme in hand feel.\nEasy to use.\nCould had been a dual-sim phone\nCamera is awesome\nOverall it's really good", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Feb, 2018", "reviewer": "Sutarna Saha"},
{"rating": 3, "title": "Does the job", "review": "Sound is not clear..", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Feb, 2018", "reviewer": "Veena Narang"},
{"rating": 5, "title": "Simply awesome", "review": "This is one awesome phone", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Feb, 2018", "reviewer": "Nalini"},
{"rating": 5, "title": "Wonderful", "review": "Great experience.. it's been 7 days... Nexus 6 to pixel 2 xl..... Loved so far", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Feb, 2018", "reviewer": "G GANESH KUMAR"},
{"rating": 4, "title": "Good", "review": "The product is good, software is smart and latest. It has the blue screen whenever I tilt the device that's the only issue I found, Camera is the best. I had difficulty with the delivery guy. while exchanging the old phone. Delivery guy is such a headache I ended going to local Ekart hub just to show my old phone is working fine. Just because of the delivery issues I am giving fewer stars. otherwise it is 5/5.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Feb, 2018", "reviewer": "Mani Praskash Reddy"},
{"rating": 5, "title": "Terrific purchase", "review": "Excellent offers by flipkart for a wonderful product from google....\n\nOn time delivery by flipkart personal as promised..\nPacked neatly and product is awesome n Im enjoying using it.\n\nVery satisfied", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Jan, 2018", "reviewer": "Karpaga  Vinayagam "},
{"rating": 5, "title": "The Best choice with offers", "review": "Do not give weight-age to the online review of Pixel 2XL display ( blue tint or other )..Nice phone by Google..software part is the  best)...(But definitely iphone X is still Number one- No comparison till date)...I purchase the phone with 3 offers...(HDFC 10%,Republic 15% & other)...So in that cost(with offers) it fits in mobile's best category....But with original /actual cost without offer - Better buy iphone X....\nGo for purchase of 2XL with offer only  i.e 48000-50000....\nAs far as delivery is concern -Flipkart needs to improve a lot on its material packing policy.(though mobile was  packed /wrapped with safety but it was freely moving in the packing box)..Other online seller have better packing for mobile...", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Worthless", "review": "description for flipkart not for product.\ndelivery guy showed up without even any pre confirmation no call nothing.\ni have ordered one more phone same with that he came up without even any prior notification. \n\nphone is excellent camera is superb, cool sleek sexy look, wide screen , very light, super fast, speaker is ok ok, didnt get any earphones with it, so costly phone cant even provide earphones strange..", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jan, 2018", "reviewer": "Gaurav kaushik"},
{"rating": 5, "title": "Great product", "review": "It's the best Android phone. Superb speakers, good display and the most smooth Android experience. Have upgraded from the Nexus 6P and the difference is so evident as it's buttery smooth. The camera, the best on any smart phone. Hands down.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jan, 2018", "reviewer": "Rhishav Phukan"},
{"rating": 5, "title": "Worth every penny", "review": "Great phone and equally great service by Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jan, 2018", "reviewer": "Navjot Singh"},
{"rating": 5, "title": "Classy Product!", "review": "Have been using it for a month now and loving every bit of it. Amazing battery life, superb camera, lightening quick processor, quick charging and seamless google experience. Also, the issue of blue tint seems to have blown out of proportion. It hardly is noticeable if a user in not aware about it and if visible it is from certain angles which are hardly used. So the so called Blue Tint is not a problem at all. Really don't have any cons to report except for the absence of 3.5 mm head phone or aux jack. I have a Bluetooth head phone, but my car's audio system don't support Bluetooth so face certain issues there. Except this everything is amazing.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jan, 2018", "reviewer": "Rachit Pathak"},
{"rating": 5, "title": "Must buy!", "review": "Excellent phone for a true Android experience", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Dec, 2017", "reviewer": "Rajiv Yashroy"},
{"rating": 5, "title": "Great product", "review": "Excellent phone", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Dec, 2017", "reviewer": "Debal Basu"},
{"rating": 5, "title": "Best in the market!", "review": "Best smart phone... Best camera 📸", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Dec, 2017", "reviewer": "Gyaneshwar Biradar "},
{"rating": 4, "title": "Good quality product", "review": "I am using it from to week.It's great phone , who are tech savvy , not impressed by  showbiz of iPhone . This is great machine . With great battery. Awesome camera clarity. Zero lag. And Google as usual the cream of best.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Dec, 2017", "reviewer": "Sandip Ulape"},
{"rating": 4, "title": "Good choice", "review": "Best of Android but the problem is that we don't get a proper temper glass and casses.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Dec, 2017", "reviewer": "Nilavan Udayam"},
{"rating": 5, "title": "Fabulous!", "review": "Beautiful buy. What a phone. Wow wow wow.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Dec, 2017", "reviewer": "Sahil Grover"},
{"rating": 4, "title": "Very Good", "review": "This product is making rattling noises on high volume.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Brilliant", "review": "CAMERA 📲📸 ON POINT FRONT OR REAR ABSOLUTELY EPIC.\n\nDISPLAY 📱 AFTER THE UPDATE ITS SATURATED AND  HAVING NO ISSUES.\n\nFRONT FIRING SPEAKERS🔊 ARE GOOD\n\nBATTERY 🔋LIFE IS KIND OF GOOD NOT AMAZING \n\nHEADPHONE 🎧ADAPTER AUDIO QUALITY IS AVERAGE,  NOT BAD\n\nFAST 💥🔋CHARGING AS GOOD AS OTHERS PHONES  DO", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Dec, 2017", "reviewer": "Rajpal Singh"},
{"rating": 5, "title": "Terrific", "review": "one of the best phone from google", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Dec, 2017", "reviewer": "Pranav Patil"},
{"rating": 5, "title": "Simply awesome", "review": "The best camera on a phone ever! Pixel 2 XL is the current Google flagship and offers best of the Google's AI and software refinements along with a well engineered hardware.\nPros:\n1. Camera : Takes perfect shot in auto mode and the potrait mode on both sides is coming great  Makes me feel less nervous about traveling without my DSLR.\n2. Performance : Very smooth and quick. Faster than OnePlus 5 and iPhone X for day to day use. RAM optimization is more important than raw amount of it.\n3. Speakers : Loud and clear sound with some depth to it. These are kind of speakers you will find on a tablet than a phone.\n4. Design : The powder coated back is grippy and allows it to be used without a case. The phone is a bit thick but the bigger battery and negligible camera bump are the pros \n5. Battery life: 1.5 days battery life, again due to software optimizations and bigger battery.\n6. Water resistant: Peace of mind while using at pool parties or at sea side\nCons:\n1. Display: The wannabe bezeless look isn't at par with the Note 8 or iPhone X but you have to fit those speakers somewhere. The saturation issue is fixed by the first update that I got out of the box \n2. No 3.5mm jack: Not a major issue for me as I use Bluetooth earphones but the phone is chunky enough to have space for one.\n\nBottom line: Best of Android and arguably the best phone.\nIt was a no brainier for me as I got it for 45.7k after exchanging my OnePlus 3. Thanks Flipkart for the sweat deal :)", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2017", "reviewer": "Amitojdeep Singh Brar"}
]