[
{"rating": 4, "title": "Nice product", "review": "Nice and beautiful phone\nPro\n1. Rear camera - its beautiful especially live mode \n2. Software is clutter free..smooth\n3. UI is simple and takes 2-3 days to adjust ...but once adjusted  u love it.\n4. Built quality, speaker volume, 4g/3g calling and internet usage all  are the best\n5. Doesn't​ support fast charging, but charges 100% in less than one hr\n6. Eventhough the screen is small, doesn't feel so, while watching videos u love the quality.\n7. Compactness and one hand usage is really amazing.\n\nCons\n1. Selfi cam..better in daylight, ok in low-light. But never best.\n2. Freedom in settings is missing...specially Android users will experience.\n  Other than this not much.\n\nVerdict.. very good phone for especially girls and conventional phone users...but for the techno geeks and frequently changeover believers it does not suit...the freedom njoyed by  android users is really missing....\nGo for minimum 32 gb...if u can get below 23k otherwise wait for 128 gb(which i feel unnecessary for this phone)", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jul, 2017", "reviewer": "Venkata Ramana Babu Nadimpalli"},
{"rating": 5, "title": "Terrific", "review": "Best mobile phone ever seen", "verification": {}, "date": "19 May, 2017", "reviewer": "yogesh  hase "},
{"rating": 5, "title": "Cool device..handy..mighty performance", "review": "I checkwd the warranty on apple site.. it was fine.. however people who like small phones should only go for this.. not good for media consumption..display quality is ok.\nBattery is a bit poor but ok..\nSound quality is cool.. premium body.. the main advantage of this phone is that it IS BEAST in performance..as good as a gophone 8 .. back camera is good as it is same that of 6s..\n\nOverall it is a cool device..apple is definately better than any androids.in my op", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Genuine product", "review": "Update after 20 days of usage: phone become faster after update to iOS 11 good features, not hanged till now, genuine product.      First update after purchase: I am impressed with the quality and price of I phone SE. It is beautiful beast with the performance. Also , excellent work done by flipkart. Got rose gold model in Rs 15179 after exchange with Lenovo K4 note. I become bored with large screens that's why I took this phone with one hand operation. And it is genuine brand new I phone SE. You can actually believe flip kart in providing value for money product. Despite all negative reviews I ordered the phone and got this beast. This is my fourth mobile from flip kart and all three previous mobile did well. Thanks you flip kart. Guys, buy only if you want small screen.", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Oct, 2017", "reviewer": "Hemant Banga"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Recieved the product well in time. Hatsoff to the FlipKart for on time delivery. Now about the phone, iPhone SE is a good choice for those who like to have a decent small phone having nice features and reliability.\nEarlier this phone was quite costly but now it is moderately priced. I got it in RS. 15200/- after getting 3 offers if Flipkart and HDFC bank card. \nAt this price phone is amazing. It's hardware is almost equal to iPhine 6s. \nProduct delivered to me was original and intact. Packing done by the FlipKart has degraded by time. But I received my phone without any damages.\nDetails on box shows that phone was imported in India in August 2107. \nMost admired features of the phone are its size and it's performance. Size is so small and performance is insanely big. I am now in a great comfort of carrying phone with me. It never bulge out from my pocket. It's performs in running applications and in general operating is decent. I always want this type of phone and now my search ends. Really it's nice to get rid of bulky phones. \nCamera is decent in all type of lighting conditions but front facing camera is not upto mark in comparison to the time where people's are selfy concious. Of taking selfies it will disappoint you. But for normal pics it is good. \nBrowsing and surfing the internet is good but reading text may strain your eyes as size of display is too small. But browsing speed and compatibility to web technologies is amazing, all the sites open smoothly.\nE-mail client is too good and you never regret of using it.\nMessaging and Calling quality is good and you hear the caller's voice clearly even in a crowded site. \nIt is is VoLTE phone you can use it with Jio Network for calling as well as data.\nBattery life is much better in comparison to other iPhones. If you are using the phone as phone not an entertaining device then it will let you enjoy full plus day. But use of multimedia may cause battery drain faster and need charging by dusk time. Battery is really better in comparison to other iPhone models.\nIt's way of notifications is way better and it is good for busy executives and more suitable to senior citizens.\nIt's operations are most easy and elderly people will be happy to use them.\nInbuilt Apple Pay and support to Apple watch, NFC is a plus feature, however ApplePay is not usable in India at this time (October 2017) may be useful in future.\nTouch ID i.e. finger print scanner is really disappointing. To unlock phone you have to scan and press the home button with your finger unlike iPhone 7 where you need to only touch the scanner.\nIt doesn't have 3-D touch. But in general it is not a required feature by now and not supported by most of the applications.\nAll other features are same of iPhone 6s and iPhone 7.\nMaps and GPS is accurate and fast. It also support Google maps.\nMy opinion about this phone is I like it and it is an excellent phone for professionals like Doctors, engineers, respected teachers and professors, advocates.\nCollege going and school students, others  who use their phone to watch movies and play games extensively please keep away of this phone as it is not meant for you.\n\nIt may be best choice for elderly persons.\nI will share my experiences after using it for 2-3 months.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Oct, 2017", "reviewer": "SANDEEP KUMAR"},
{"rating": 5, "title": "Excellent buy at a very reasonable price", "review": "Excellent phone. Worth the price tag considering it's 32 gb variant. \nPros:\n1. Handy to use\n2. Super smooth \n3. Excellent camera. \n4. Superb battery backup.\n5. Rich quality headphones bundled with the package \n6. Very fast charging.\n7. Crystal clear call voice quality \n8. Network reception great.\n\nCons:\nNil..", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Jun, 2017", "reviewer": "Guruprasad  Wagh"},
{"rating": 5, "title": "The best your money can buy from Apple", "review": "I have been using iPhone SE for quite a lot of time and I can tell you guys that go for it. it's the value for money Apple product and it has iOS 11 update and also it runs smoothly in anything and it takes much sharper clear images with 12 megapixel camera with 4K video Recording out of the box and  2 GB of RAM is well enough for it to handle any kind of apps and graphics intensive games. If you're trying to buy a smaller display super phone I would recommend to buy iPhone SE and don't go for the iPhone 6s if you want the biggest screen and the same features go for the 6S it comes with a bigger screen but it comes with a lot of cost too and as the display of iPhone SE smaller the processing is much much more better in any kind of daily usage. and it has  better battery and the battery longevity is much better if you charge it around like 10 PM at night and then you wake up at 8 AM in the morning you will see that 99% charge left. Reason is because better iOS optimisation and better standby time of iOS side recommend all of you to go for this phone instead of going any big phones and after using the few days you will just get better at the keyboard typing it won't bother at all. For those of you who are reading my review thanks for reading it and the whole review is written through iOS keyboard voice recognition The bit of an example ;)\ngood luck :)", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Sep, 2017", "reviewer": "Snehasish Banik"},
{"rating": 5, "title": "Fabulous!", "review": "Good filling use power full I phone se", "verification": {"CERTIFIED_BUYER": true}, "date": "12 May, 2017", "reviewer": "Deepak Rai"},
{"rating": 1, "title": "Highly recommended", "review": "Please don't buy iPhone specially from flipkart. My iPhone SE rose gold is not getting detected in itunes and not vale to charge. They are not agree for the replacement.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 May, 2017", "reviewer": "Nivi Vyas"},
{"rating": 5, "title": "Awesome Product", "review": "Awesome product. Initially had some issues with music quality & earphone. Now it has been solved after update.Getting amazed day by day by the quality of the product & its operating system.BTW: this is my first iPhone.\n\nFlipkart should provide after sale support. They are asking to contact apple directly.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Oct, 2017", "reviewer": "Biplab Manna"},
{"rating": 4, "title": "Worth the money", "review": "Good product from apple.i satisfied but the packaging could be better.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Not satisfied with service and product.", "review": "Speaker volume is too low that u can't hear the other side voice.\nI complain and they refused to return the phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 May, 2017", "reviewer": "Radhe shyam Yadav"},
{"rating": 5, "title": "Excellent best of best in 22k", "review": "This is the best you get in 22k\nFirst of all i would like to thanks flipkart for such a great deal \nSecond thing is the great phone wait it's iPhone that's what apple and people says about it the quality and everything is top notch it works great no chances of lag in this apple \nA9 processer with 2gb ram multitasking is also great and camera is way better than any phones in this category for 20-30k \nSo I strongly recommend you that you should get this one if big screen isn't your priority", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Jul, 2017", "reviewer": "Sahil Kumar"},
{"rating": 5, "title": "impressive", "review": "awesome phone bought on 22 sept 2017 in flipkart for 16500 (sbi card cash back actual disc.price 18 k) rose gold colour is ultimate  works flawlessly without lags . good video viewing pleasure even its 4inch,it feels smaller if u used 5 inch phones , battery backup is awesome it lasts 2 days if only used for calls with moderate usage i get 1-1.5 days my friend has 6s i compared every thing its equal ant to 6s (except display size &resolution ) rear cam is awesome it will beat samsung j7 prime upto     30k phones, with ios 11 it works super fast , i had dropped phone 2 times one time without cover but nothing happened to phone ,i really impressed with phone & its colour(rose gold) ,writing review after 10 days ,if u need handy &power full phone go for it", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Oct, 2017", "reviewer": "shivaraj totiger"},
{"rating": 5, "title": "Terrific", "review": "Awesome, delivered before time, and original product, very fast phone ... Love it", "verification": {"CERTIFIED_BUYER": true}, "date": "22 May, 2017", "reviewer": "Manabi  Nayak"},
{"rating": 4, "title": "Good one!", "review": "Authentic product. Delivered as communicated.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "abhilash  panicker"},
{"rating": 5, "title": "Super!", "review": "You cant get more than this. I got it for 16499 on BBD. Awesome phone. Very light & powerful. Thank you flipkart for delivering me in 18 hrs.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Awesome", "review": "Phone is Awsome as expected and got it with a great deal i.e. Flipkart big billion days \"16.5k\" best price ever.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Sep, 2017", "reviewer": "Lalit matta"},
{"rating": 5, "title": "Brilliant", "review": "Best best and best", "verification": {"CERTIFIED_BUYER": true}, "date": "18 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "Genuine Product Recieved..Thank You Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "17 May, 2017", "reviewer": "Deepak Aggarwal"},
{"rating": 5, "title": "Nice product", "review": "Nice product simple to use what a cemara front 1.2mp equal to 10mp rear 12mp equals to 25mp superb performance", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jul, 2017", "reviewer": "Pradeep Ningaraj"},
{"rating": 1, "title": "need help for TO COMPLAIN IN CONSUMER COURT", "review": "I have purchased Iphone SE on May 19th 2017. It start problem after 50 days of purchase. 1) When I gone to service center then they did IOS problem need to restore. 2). After restoration with 5 days same problem again went same service center they sent it to banglore apple care and they said changed display of Iphone. Now 3rd time one week back i got one more problem i visited same service center they said icloud data problem so needs to be restore, i agreed and restored my iphone se. as per service center instructions i used and configured new mail id. Today Sep 15th, 2017 display is gone( Now it’s completely dead). I am going to service center what they will say.....\n\nNOW I HAVE DECIDED TO COMPLAIN IN CONSUMER COURT with any any one helps to me. I REQUEST OTHER FRIENDS DO NOT BUY IPHONE......", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Sep, 2017", "reviewer": "chakrapani Aalaa"},
{"rating": 4, "title": "Really Nice", "review": "Very fast", "verification": {"CERTIFIED_BUYER": true}, "date": "17 May, 2017", "reviewer": "Patel Yashdip"},
{"rating": 5, "title": "Good product and great delivery", "review": "Great product for the price... people who are longing for an entry into iPhone family, this one is the right product for them.\nFlipkart delivery is amazing. I needed the phone before 17th but I booked on 14th and delivered on 16th. 5 stars for that too", "verification": {"CERTIFIED_BUYER": true}, "date": "17 May, 2017", "reviewer": "Jilu Keerampanal"},
{"rating": 3, "title": "Not User Friendly", "review": "If someone used high-end android phones, this phone will greatly disappoint him. Its only advantage is its small size. May be its very durable and high quality, but so far as ease of using features(other than making and receiving calls) and customising the phone screen , this phone is just miserable. I am very very unhappy with the product. Another problem in India is that a dual sim phone is always preferable because of weakness of signals in certain areas of some mobile service providers.\n\nI had to purchase this because I didnt get any 4G android phone of reputed brands with a 4 to 4.5 inch screen that makes a phone easy to use and keep in pant pockets. But I think it cant be called a smartphone at all. It reminds me the high end Nokia phones like N95 and N96.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Jun, 2017", "reviewer": "PARTHA PRATIM BANERJEE"},
{"rating": 5, "title": "Beast in a compact size for just 16000", "review": "My First mobile from Apple.\nFirst of all thanks to Flipkart for faster delivery.\nNow comes to phone I got this mobile for 16000 in Diwali sale including all offers.This is a great deal. If u want a mobile with amazing performance and perfect camera just go for it.Here is the pros and cons.\nPros:\n1. Amazing battery life(not updated to ios11.because it has many bugs).\n2. Perfect rear camera.it is great in capturing perfect shots.\n3. Compact design.(I love it because it is easy for one hand operation).\n4.Same processors as in iPhone 6s.\n5.clutter free UI.\nCons:\n1. Not suitable for those who watches movies in mobiles(because  of compact display.Just my opinion).\n2. Front camera not great.But for this price it is great.\nAnything else..........\nNothing.Just go for it guys...........\nIf u found this useful just hit 'like'....", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Oct, 2017", "reviewer": "magarajothi jothi"},
{"rating": 4, "title": "A much anticipated purchase.", "review": "Excellent value for money. Got this at big billion day. \nDelivery/ packaging all 5/5. \n\nDevice itself is great. Loved it for one hand usability. Screen is 4 inches. Which is great for day to day usage. \n\nRetina display is great. \n\nApple's 12 mp camera is awesome for shooting live photos/ slow mo videos. \n\nNo slow or lag in operating system. \n\nTouch id unlocking is fast/ accurate and reliable. \n\nApple earpods headphone are great and strudy. \n\n32 gb internal storage is adequate. \n\nRose gold colour is beauty.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Sep, 2017", "reviewer": "Karan Sharma"},
{"rating": 5, "title": "Highly recommended", "review": "Compaq IPHONE Beast\n\nI Bought this Mobile in Big Billion Sale for 16.5K. my initial impression about this mobile was confused.\n\nAs i have updated it from Iphone 5c to Iphone SE\n\nI have received it with good packing thanks to EKART delivery\n\nAfter Unboxing i felt this is the best Iphone till date in looks(if you're fan of small screen size mobiles) i bought a Rose Gold one it looks premium like other high Budget Iphones.\n\nPros:\n1. Primary Camera 12 MP\n2. Body\n3. Display\n4. Performance\n5. Battery Lasts better than Iphone 6s\n\nCons:\n1. Secondary Camera 1.2MP\n2. IOS 11 (So Many Bugs please dont update)\n\nVerdict: I would recommend this mobile if your budget is under 20k and if you're fan of Compaq Design.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Oct, 2017", "reviewer": "Natraj Gantakolla"},
{"rating": 5, "title": "Worlds best Best phone under 20k", "review": "The best phone in the world for under 20k! Got it for 16.5k with SBI credit card offer.\nGo get it now", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Awesome device at double awesome price.", "review": "Great device at great price. Got this device for just 15300/-. Thanks Flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Oct, 2017", "reviewer": "Chaitanya Pottam"},
{"rating": 4, "title": "Value-for-money", "review": "Nice phone", "verification": {"CERTIFIED_BUYER": true}, "date": "13 May, 2017", "reviewer": "kousik Rajendran"},
{"rating": 5, "title": "Loved this SE 32Gb variant(Rose Gold)", "review": "Nice phone....for those who want a small handy phone it is perfect for them..it will perfectly fit in your palm..no chance of hang in this pretty 2Gb ram..And assm shempered design..battery quite last for 1day or near about 21hours after using it for heavy use..good battery life after having only 1.6k mah of power in it...and high end of graphics with equally powerful processor..loved it..And the logo or the brand power has some assm attention..That too I admit..", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Jun, 2017", "reviewer": "Samir Kumar  Tudu"},
{"rating": 5, "title": "Must go with this iphone se", "review": "Perfect iphone, worried about product by some bad reviews but after checking product its 100% genuine iphone SE with all accessories perfect, delivery on time.... go for it", "verification": {"CERTIFIED_BUYER": true}, "date": "21 May, 2017", "reviewer": "Kartik Lekhi"},
{"rating": 5, "title": "It's beast never lag", "review": "I m used this device from 2month\nSo i write this review because some says its negative \nThis device is only one device which not had lags problems in ios 11\nIn this device 10.3 had great battery backup but in that version i see some lags \nBut if you update to 11.1 you know whats apple device is omg omg\nIn 11.1 this device smooooth as butter\nBut i must say battery in 11.1 is worst it gives only few hours of battyif u use heavy\nBut i still tell you to upgrade to latest because its smoothest than any device because even 7plus had problems lags in 11\nBut even developers experts say se performance is best in 11\nSo just buy an mi powerbank just charge when its low\nThats it problem solved \nYou probably know different between android vs ios in 11.1 \nCamera was 5/5 excellent i ever seem under 25k\nBut ios is better i now know exclent ram management i never see a app loads soo long \nOmg ios is top class\nTo whom bought this mobile and had few lags first upgrade to latest version then see power of se\nBut forgot that battery issue it will solve in few updates may be", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "excellent", "review": "great phone to used for women ..\nthe thing i love the most is the shipping it fast n nice ....\ngood job \nand thnk you", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Jan, 2018", "reviewer": "Dauru"},
{"rating": 5, "title": "Great product", "review": "Value of money", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jan, 2018", "reviewer": "Rizwan Khan"},
{"rating": 5, "title": "Best in the market!", "review": "Very nice service by flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Must buy!", "review": "I have never seen like this phone ever.good phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jan, 2018", "reviewer": "Rahul Warpa"},
{"rating": 5, "title": "Best Phone Ever to Buy in This Range", "review": "Its the best phone I can ever buy \nBest camera \nBest speed\nNever hangs \nBest for gaming", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Dec, 2017", "reviewer": "Shantanu Meshram"},
{"rating": 1, "title": "In just 4 month lots of problm started", "review": "Continuous network issue in iphone very pathetic", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Delightful", "review": "Thanks a lot flipkart \n☺☺ but battery is not sufficient.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Oct, 2017", "reviewer": "Sohit Ydv"},
{"rating": 5, "title": "Fabulous!", "review": "As name says Flipkart assured,i was lucky to get for 16k.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Oct, 2017", "reviewer": "Avinash Shekhar"},
{"rating": 4, "title": "Dhakad phone", "review": "Product was good\nAwesome look\nQuality camera \nMassive battery \nFeels premium", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Sep, 2017", "reviewer": "Saurabh Raj"},
{"rating": 4, "title": "Just wow!", "review": "Awesome experience. It's Apple after all, so don't expect anything else, even though it's taking some getting used to with a small screen immediately after Samsung A7 :)\nDelivery also super fast (received it a day before the promised date)\nGenuine product, without any tampering.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2017", "reviewer": "Varsha Roy"},
{"rating": 5, "title": "Worth a buy", "review": "Body of iPhone 5s\nStuffed in with quality of 6s\n12MP cam says it all !! Why iPhone is worth a buy \n32GB ROM with an affordable price is another plus point\nWorth a buy \nLovely piece \nThat's what Steve jobs always wanted it's about design", "verification": {"CERTIFIED_BUYER": true}, "date": "20 May, 2017", "reviewer": "Bhavya  Goradia"},
{"rating": 5, "title": "Good things come in Small Packages!", "review": "I bought this phone for my Mom. She's very happy with it. I have a iPhone 6+ myself and will not go for a SE myself but would definitely recommend the SE for people who want more portability and practicality than have a huge screen.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 May, 2017", "reviewer": "Robin Richard"},
{"rating": 2, "title": "Could be way better", "review": "i PHONE SE battery pickup is very bad....", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Aug, 2017", "reviewer": "pankaj bagdi"},
{"rating": 5, "title": "Terrific purchase", "review": "Very nice phone ... i purchased rose gold ... and trust me it's the best colour... very nice battery life.. and gaming performance", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Jun, 2017", "reviewer": "Pratik Burande"},
{"rating": 5, "title": "I phone Se", "review": "Package was properly intact iPhone se is awesome 100% genuine", "verification": {"CERTIFIED_BUYER": true}, "date": "17 May, 2017", "reviewer": "Deepak Dalal"},
{"rating": 5, "title": "Just wow!", "review": "my 1st ever I phone after using this only just to say it's awesome..... simply looks better", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific", "review": "It is 1 month I am using this SE it is superb\nHigh Performance well overday Battery back up Siri is Excellent (After all Apple is Apple)", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Jan, 2018", "reviewer": "Manojkumar Sahoo"},
{"rating": 5, "title": "Best in the market!", "review": "Very nice product. I buy 3 months ago no any problem yet.\nMy charger stops working after 2 months of usage the service centre returns instantly.\nI'm happy with shopping at flipcart..", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Aug, 2017", "reviewer": "Rohit  Gargade "},
{"rating": 4, "title": "Pretty good", "review": "Product is gud....nice delivery....but is there is anyone who stuck in login itunes in this mob ?", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jun, 2017", "reviewer": "Atul K"},
{"rating": 4, "title": "Awsome", "review": "v good phone", "verification": {"CERTIFIED_BUYER": true}, "date": "16 May, 2017", "reviewer": "Nithin B A"},
{"rating": 5, "title": "Excellent", "review": "Great product", "verification": {"CERTIFIED_BUYER": true}, "date": "12 May, 2017", "reviewer": "Mujahidul Islam"},
{"rating": 1, "title": "Hated it!", "review": "I didnt get my iphone it just had an empty box", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Nov, 2017", "reviewer": "nikhil thimas"},
{"rating": 5, "title": "Must buy!", "review": "It's very good phone. Only those who like  small screenphone, can go for this. I got this phone for Rs20500 during offer sale. I think rose gold unit is the best one to choose.Got the product within 2 days though the expected delivery day within 4-6 days.\nOne  query is that the product I got with plain Apple logo.whereas here the photos shows the Apple logo with dual colors. Need to check this. @flipkart, please clarify this", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Jun, 2017", "reviewer": "Mohan Shettigar"},
{"rating": 5, "title": "Super!", "review": "Amazing product, always have loved iphones, was skeptical about the 4inch screen size but it is not an issue. If you would do the math, the 4.7inch is only 1.17times the size of an 4inch. Plus, the performance is a big boost to the phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jun, 2017", "reviewer": "Harshil Shah"},
{"rating": 5, "title": "Great product", "review": "flipkart provide all your need in easy way  ...it is helpful for all people and fast deliavery also provide by flipkart ..i loved it ...i got new mobile without any defect instead of other shooping apl they provide deafective mobile phones but flipkart give me without defective mobiles ....pleazz shop with flipkart it really good and outstanding app...thank you flipkart to provide me my replacement phones in time....", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jun, 2017", "reviewer": "Deepak anjana"},
{"rating": 5, "title": "Must buy!", "review": "My first iPhone and I don't regret picking the rose gold.. Way better than every colour out there.. Performance wise, you cannot go wrong with the A9 chip for such a small phone..! If u don't want those phablets, your making a right choice.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jun, 2017", "reviewer": "Tanety Padma Kumari"},
{"rating": 5, "title": "Go for it!", "review": "Totally worth in terms of brand value and specs under 20k", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Uttam Garg"},
{"rating": 5, "title": "Classy product", "review": "Good Phone i love this 4inch Bazuka......", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Mar, 2018", "reviewer": "Mohsin Ansari"},
{"rating": 4, "title": "Good choice", "review": "Great product\nAnd as always fast delivery by Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Mar, 2018", "reviewer": "Aswin V.S"},
{"rating": 1, "title": "Don't waste your money", "review": "I have purchased two days before, I have received item but has defect in sound quality. I can not hear the voice of dialer. \n\nI am struggling to return the product and get the new working phone with Flipkart, lets see how smooth Flipkart handles it. Currently Flipkart requested me to wait till 17th March 2018 which is not worth if you spend 19K on product and paid with all money.\n\nI am not able to submit the return from mobile phone as well.\n\n-Ganesh", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Mar, 2018", "reviewer": "Ganesh Kudale"},
{"rating": 5, "title": "Wonderful", "review": "Good product", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2018", "reviewer": "Manoj Varma"},
{"rating": 4, "title": "Good choice", "review": "Costly as per current demand of phone is considered.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Feb, 2018", "reviewer": "Faysal  Syeed "},
{"rating": 5, "title": "Awesome", "review": "Nice phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Jan, 2018", "reviewer": "SRINIVASARAO JAVVADI"},
{"rating": 5, "title": "iPhone...", "review": "All features are awesome except front camera in low light..but its great in this price.thanks Flipkart for fast delivery & lowest prices.", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Jan, 2018", "reviewer": "Dr.Nikhil  Kanani"},
{"rating": 5, "title": "Classy product", "review": "Awesome", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jan, 2018", "reviewer": "VARUN S"},
{"rating": 5, "title": "Iphone se", "review": "Good product", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jan, 2018", "reviewer": "santanu mali"},
{"rating": 5, "title": "Terrific purchase", "review": "Awesome phone ......with quick delivery from flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jan, 2018", "reviewer": "Sathya Narayanan"},
{"rating": 5, "title": "Fabulous!", "review": "Good one", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jan, 2018", "reviewer": "Shraddha more"},
{"rating": 5, "title": "Best in the market!", "review": "My first iPhone excellent quality", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jan, 2018", "reviewer": "Amar mahajan"},
{"rating": 5, "title": "Iphone SE The Beast", "review": "My first apple mobile \nAwesome mobile from apple \nBeast in performance \nSmooth ios \nExcellent camera\nSelfie camera is good \nBattery back up is awesome better than 6S\nA9 chip And 2GB Ram the same chip used in  iphone 6S\nSame specifications of apple iphone 6S except selfie cam and screen size \nThanks to flipcart and the seller SuperCom Net for their genuine product and super fast delivery  its a beast go for it guys without a second thought \nThanks flipcart", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Praveen S"},
{"rating": 3, "title": "Worth it", "review": "I love my appleSE,colour feature but only problem is battery heat up very frequently....thank you Flipkart for on time delivery", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Ritz  Verma"},
{"rating": 5, "title": "A attitude really", "review": "Great 4 inch phone, great camera and in your hand iPhone its a attitude.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Jan, 2018", "reviewer": "Ritik Baranwal"},
{"rating": 4, "title": "Really Nice", "review": "Observed heating while playing games..else this is very good phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific purchase", "review": "best phone i was afraid of 1.2 MP camera but it is like 8MP in android best phone to use 4g", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Jan, 2018", "reviewer": "Rahul Kumar"},
{"rating": 3, "title": "Decent product", "review": "Good", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jan, 2018", "reviewer": "Devendra Singh Thakur"},
{"rating": 4, "title": "Worth the buy if you are not into customisation.", "review": "This is basically an iPhone 6s packed in a smaller body (minus the latest fingerprint sensor and OIS for back camera, 5MP front camera and 3D touch).\n\n1- Performance is, needless to say, very good, since hardware-software integration is seamless as always.\n\n2-The primary camera gives colossal performance in daylight and good to average performance in low light. Front camera is a 1.2 MP (idk why Apple didn't upgrade it) but clicks good photos in daylight, although in low light the picture tends to get a bit grainy.\n\n3-Software is great (runs on ios 10.3.3 out of the box, can be upgraded later) and with the hardware specs similar to 6s, should still get sufficient updates.\nFingerprint sensor is a tad bit slow, but you'll get used to it (unless you are super fussy).\n\n4-With the A9 processor and the amount of RAM provided, this hardly shows any lag even in the execution of heavy games which require a lot pf 'brainwork'.\n32GB (you get around 27GB usable) is fine if you generally upload everything on social media. For people who tend to keep memories for longer, 64GB should be a better option. And for avid 4K shooters, wait for the 128GB. The option to use iCloud's 5GB is good too. \n\n5-Battery backup is not exceptional, but is good, and you'll never really find your phone out of juice with light to moderate use.\n\n6-Looks good and that aluminium body feels premium.\n\n7-As for the screen, those who are saying it is for small screen users only, my personal opinion, after using everything ranging from Samsung Champ to iphone X, is that that a mobile device should not exceed a screen size of more than 5 inches. Any bigger, it violates the term 'mobile' and more or less feels like a phablet.\nSo screen size, according to me, is perfect. You could go for iphone 6 if you need a bigger screen within a similar bracket. But then you'll be losing on a lot of upgrades.\n\n\nBasically, it is a great phone, and can satisfy the fussiest of users (who don't bicker over screen size).\n\nEDIT: After using for about a month, no major issue. But do go for a software upgrade.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Jan, 2018", "reviewer": "Mohit Senapati"},
{"rating": 3, "title": "Just okay", "review": "Godd", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Dec, 2017", "reviewer": "Gautam Gupta"},
{"rating": 5, "title": "Superb phone", "review": "Superb phone. Apple quality is classic. Go for it if you are a small phone lover. Processing, speed, RAM, battery life, rear camera quality, live photo all are similar to iPhone 6S. Only difference is 3D touch and front camera of 1.2MP. Otherwise this phone is superb.", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Dec, 2017", "reviewer": "Ankur Sharma"},
{"rating": 5, "title": "Worth every penny", "review": "Good product with greate offer.", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Dec, 2017", "reviewer": "Sampath kumar"},
{"rating": 5, "title": "Nice Birthday gift", "review": "iPhone SE\n\na good product from a reputable organisation, its beyond to say the pros and cons but still 32gb now feels like too little space with such space eating away by some simple and needed application.\nI purchased it for calling and music as a birthday gift for my wife and it proved be of every worth.", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Dec, 2017", "reviewer": "Arnab Chakravarti"},
{"rating": 4, "title": "Iphone SE - Awesome", "review": "Got the iphone SE one day before it was supposed to be delivered.\n\nNothing to say other than one word to describe its review - Iphone \n\nThe name is enough. Awesome performance on SE.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Dec, 2017", "reviewer": "Prasanna Ram"},
{"rating": 5, "title": "Terrific", "review": "Nice ....", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Dec, 2017", "reviewer": "raju"},
{"rating": 5, "title": "Excellent", "review": "Very High configuration compared to 6 and 6s", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Dec, 2017", "reviewer": "Srinivasan Mudaliar"},
{"rating": 2, "title": "Not good", "review": "Product is good and delivery experience is worst. Payed for in a day delivery but got it after 3 days.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific", "review": "Excellent", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Very Good", "review": "Good but battery level not upto mark", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2017", "reviewer": "Manasa Byri"},
{"rating": 5, "title": "Perfect product!", "review": "Excellent", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2017", "reviewer": "Gopalakrishnan G"},
{"rating": 5, "title": "Terrific purchase", "review": "Excellent phone.  Flipkart, Delivered as said. Good.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2017", "reviewer": "Krishna Chaitanya "},
{"rating": 5, "title": "Excellent", "review": "This delivery guy named Samrat is Awesome... Very o service really", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2017", "reviewer": "Somnath Chakraborty"},
{"rating": 5, "title": "Fabulous!", "review": "nice product...its a little beast phone,i got it only for 16000 in Flipkart sale and i am very much satisfied by it as a primary phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2017", "reviewer": "Akshay Goyal"},
{"rating": 4, "title": "Delightful", "review": "Nice", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Perfect product!", "review": "Best at the price of 15 k", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2017", "reviewer": "AMIT SHARMA"},
{"rating": 5, "title": "Excellent", "review": "Exelent", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2017", "reviewer": "Shivam"},
{"rating": 4, "title": "Value-for-money", "review": "I am happy", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2017", "reviewer": "Chakri B"},
{"rating": 5, "title": "Awesome", "review": "Awesome product better than iPhone 6 mobile", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2017", "reviewer": "Sivaji Tatipudi"},
{"rating": 5, "title": "Terrific", "review": "Best product", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2017", "reviewer": "Flipkart Customer"}
]