[
{"rating": 4, "title": "Best Laptop for Everyday as well as High end Application.", "review": "Now it is 1 and half year from Purchase.\nPros-\nDisplay- Retina Display 2560x1600 is stunning. Even after full zooming, Image or text never becomes blur.\n\nBattery- With WIFI is on, I actually took readings and I got 9 hours 45 min of battery. Which is outstanding.\n\nTrackpad-Force Touch feels really great. Due to gestures, It becomes very easy to use trackpad.\n\nPorts- It has 1 MagSafe 2 Charging port,2 USB ports, 2 Thunderbolt ports 1 SD card ,1 3.5mm headphone and 1 HDMI. USB 3 ports are very fast. Transfer speed is good. Thunderbolt to VGA adaptor is also great. Just Due to retina display, you have to adjust resolution of projector as projectors do not support 2560x1600 resolution. MagSafe 2 charging is incredible. As it is magnetic You don't have to worry about disconnecting wire. Even though if somebody pulls wire accidentally, just wire will get disconnected and it will prevent mac from falling. Also Charging indicator on charging wire shows you battery is fully charged or not. With HDMI you can easily use your TV as display for MacBook. \n\nCamera-720p facetime camera is not too bad. Photos comes really good. for FaceTime calling, video quality is also good\n\nKeyboard- Even though it is not butterfly mechanism, typing is very good on this MacBook. For day to day typing, this keyboard is enough.\n\nConnectivity- With bluetooth, you can send as well as receive any type of file from any device. For USB also any Pen drive can be attached to mac. So You can share files from MAC to windows as well as Linux based computers.\n\nMusic- You can actually download mp3 from internet and play it on Mac. There is no any restriction like iPhone or iPad. Sound Quality is awesome.\n\nCons-\nNot useful for Gamers.\nDue to SSD is 128 GB not useful for Boot  Camp.\nMagsafe 2 port becomes dirty very soon. So charger pin does not fit well.You have to clean port regularly.\nSometimes apps stops working.\nSometimes it lags.\nBut overall good. If you really want to buy Mac then this 2015 model is really great option.", "verification": {}, "date": "21 Dec, 2016", "reviewer": "Akshay Sant"},
{"rating": 5, "title": "Excellent Product and Timely delivery", "review": "I am using it for last week and no issues to complaint. Highly recommend flip kart. 5* for delivery exactly as promised and a niche product at the most competitive price. \n\nAbout Macbook: The cost is really worth it. No match for the design, performance, speed and convenience.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Jan, 2017", "reviewer": "Aditya  Das"},
{"rating": 5, "title": "High-end laptop,the best Macbook ever !!", "review": "The MRP for 2016 Jan changed to 106900/-, although NO difference in Hardware SAME Product !! \n\nI absolutely love my MacBook Pro 13.3\" laptop. Writing genuine review on my overall experience. \n************************************************************************ \n\nI've used my early 2015 13\" Retina MBP pretty intensively every day. I also got 7.5% extra  - http://goo.gl/OyC5Ui via flipkart .I'm evaluating it relative to my 11\" recent-year fully loaded MB Air and the most recent non-retina MB Pro, which I used for a year at work. \nHere are my impressions of the 2015 rMBP so far, relative to these other Macbooks: \n\n* Display \nThis is the main reason I bought the rMBP and I'm absolutely thrilled with it. It blows away every other Macbook's display except of course the 15\" retina MB Pro. \n\n* Weight \nThe 13\" rMBP weighs 3.5 pounds. Whether that feels like a burden or a breeze will depend on what you're comparing it to. \n\n* Force track pad \nThe \"force\" part -- pressing the track pad harder to activate different features -- is not supported in most applications now, but more and more applications will support it in the coming year. Until that happens, it works great as a regular trackpad - better than the (already excellent) trackpad on previous MB Pros and Airs. I like using the new trackpad pretty well. But it's not a killer feature, and in the future when more apps take advantage of it it will probably be like having a third mouse button--handy, but hardly essential. \n\n* Speed & Performance \nThe 2015 rMBP has a newer generation of processor and graphics. Everything feels very fast, including bootup times, app startup, running apps, etc. That said, the 2014 model feels very fast, too, and I don't think most people will notice any speed improvements with the 2015 model over the 2014 model in normal everyday usage. \nApple claims the 2015 model's flash SSD is twice as fast as the SSD in the 2014 model. Independent testing from professional review sites have verified this. However, in normal usage, I don't notice much difference - the SSD in last year's model is pretty dang fast. \n\n* Battery life \nApple claims 10 hours to a charge, compared with 9 hours on last year's model. Independent tests by professional reviewers largely support Apple's claim: Laptopmag.com reports 12 hours 4 minutes; PCMag.com gets 11 hours 10 minutes; CNET gets a whopping 15 hours 42 minutes. \n\n \n* Summary: should you buy one? \nBuy a retina MB Pro instead of an Air if you want a MUCH better display, more connectivity, a more powerful system, and don't mind an extra 1/2 pound relative to the 13\" MB Air (or full pound relative to the 11\" Air). \n\nIf you choose the 13\" retina MBP, I'd encourage you to shop around for good deals on last year's model. It has the same excellent screen, keyboard, design, and same exact weight and dimensions. The 2014 model doesn't have the new force trackpad, but I think most people can easily live without this. The new 2015 model is slightly faster, but I think most people won't notice the differences in every day usage--I wouldn't. If you can save $300 by getting last year's model, that seems like a no-brainer to me. I didn't do it because I'm a teacher, and with my education discount at the Apple online store I got a 2015 model for about the same price as the best deal I could find on last year's model.", "verification": {}, "date": "26 Jan, 2016", "reviewer": "Geeta Singh"},
{"rating": 5, "title": "Faster delivery with exciting exchange offer", "review": "Really exciting with exchange offer and delivery service is truly surprising. They prepare us for a date, but deliver the product much earlier depending on the possibility. This truly unleashes the excitement to such levels that it is hard to contain. That too, when the product delivered is a macbook pro, to a first time mac-user, it is totally a speechless state with all smile on our face...!!\n\nTruly love the service of Flipkart.....!!!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "30 May, 2017", "reviewer": "praveen siramreddy"},
{"rating": 5, "title": "My First And The Most Amazing Macbook", "review": "This is my First MacBook I am using so I won't be comparing it with other MacBooks .\nWith my first Experience I am telling you It is a great laptop to use. You Shouldn't Compare it with other \"laptops\" People usually think that MacBooks are overpriced but its not true .You get what you pay for.It works so Smoothly that you won't mind which processor is it Having.The Clock Speed is 2.7 GHZ and Upto 3.1GHZ which is Great Piece . And above all this do i need to say anything about the Retina Display, Everyone Knows about it, and if you don't then Google about it . \nIf you have also been a loyal windows user ,like me then believe the price you pay is worth .\nI purchased it from Chroma(Tata)  and Not from flipkart for  about 90K .If you are planning to Buy it for Gaming then go for Alienwares ,This is Not for you .Macs are made for performance accordingly with their pricing.Go for this one If you have budget \nAround 60k to 80K.", "verification": {}, "date": "1 May, 2015", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "AMAZING APPLE", "review": "HONEST REVIEW OF THIS AMAZING LAPTOP AFTER 10 DAYS.\nTHE BUILD QUALITY IS SUPER AWESOME.\nTHE CRYSTAL CLEAR SCREEN IS PRETTY AMAZING.\nTHE OPERATING SYSTEM RUNS BLAZING FAST.\n8 GB OF RAM HAS DOES NOT ALLOW LAPTOP TO LAG.\nTHE INTERNAL MEMORY HAS AMPLE SPACE FOR DATA STORAGE.\n2 STARS JUST BECAUSE MY FRIEND USED COUPON FOR DISCOUNT. GO TO\now.ly/UDlk309Qjve", "verification": {}, "date": "13 Mar, 2017", "reviewer": "Alisha Khanna"},
{"rating": 4, "title": "Really Nice", "review": "Product is good but some dents are there on backside idk should I worry about it or not coz it's works well. Now talking about Flipkart's ​delivery it's just bad it takes 10+ days to deliver.overall nice purchase in big10 sale.\n\nPS : Flipkart do something to your shipping partner E-kart.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jun, 2017", "reviewer": "sanket pitale"},
{"rating": 5, "title": "Terrific purchase", "review": "Best part is the weight of the laptop and retina display to put it in a one-liner. Good for personal or professional use If you do not consider camera,heavy duty graphics for gaming. Flipkat delivery -asusual the best in class.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jun, 2017", "reviewer": "Santhosh Prem"},
{"rating": 5, "title": "Comes With El Capitan Not Yosemite As Advertised", "review": "Was delivered in a day. Ordered it from WSretail - was packed neatly. The price on box was over 1 L, they are offering it under 95K which is a good bargain. This is perhaps the best budgeted macbook.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Jun, 2016", "reviewer": "Pushkar K"},
{"rating": 5, "title": "Just wow!", "review": "Coming from a Windows setup this laptop was a learning curve.... but it gives you another level of performance.... be it sound quality, display media experience trackpad experience build quality os experience..... i believe everyone should experience macbook atleast once... kudos to flipkart for ontime delivery and hassel less exchange of my old laptop", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Jun, 2017", "reviewer": "Barun Patra"},
{"rating": 5, "title": "Perfect product!", "review": "Well, I was a little skeptical before making the purchase through Flipkart. But I'm pretty pleased with how it turned out.\nYou can find a lot of reviews for the MacBook pro on the internet and chances are you are here to make the purchase only after going through them and realizing it is indeed an amazing laptop to have.\nComing back to Flipkart, my package was delivered within two days of ordering it with standard delivery. The package arrived in perfect condition and unboxing it was delight. I might consider shopping more from Flipkart after this purchase. Hoping for a similar experience ahead too.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 May, 2017", "reviewer": "Sudhanshu Tandon"},
{"rating": 4, "title": "compare", "review": "come on man flipkart is an indian brand and same product i hot at 82k atleast show some competition", "verification": {}, "date": "23 Sep, 2016", "reviewer": "sarang sethi"},
{"rating": 5, "title": "Better than the Newer ones", "review": "This is my 4th Mac. First had that 500gb hard disk model. Then had 2 Air's and now Pro. It's fantastic. 100 times better than the latest model. Anyone who wants to go for the newer ones should really skip and get this one instead. Thanks.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jan, 2017", "reviewer": "Deepak Bhakoo"},
{"rating": 5, "title": "Awesome purchase", "review": "Delivery took longer but it was mentioned properly on page. Delivery status updated regularly with precision. \nProduct is authentic, genuine and sealed pack. \nI am not happy with external packaging. \nI will update this review after some time.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Jan, 2017", "reviewer": "Rahul Susar"},
{"rating": 1, "title": "Worst experience ever!", "review": "3rd class", "verification": {}, "date": "7 Dec, 2016", "reviewer": "kanan  jain"},
{"rating": 5, "title": "Awesome product!", "review": "Best laptop in terms of functionality and price", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Nov, 2017", "reviewer": "Mohammad  Ismat "},
{"rating": 5, "title": "Great laptop.", "review": "Great laptop. Just trying to get a hang of using apple. Little difficult to shift from windows to macos. But speed and boot awesome.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Nov, 2017", "reviewer": "varun"},
{"rating": 5, "title": "Great product", "review": "Nice product", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Sep, 2017", "reviewer": "Bhaskar Gangabattina"},
{"rating": 5, "title": "Must buy!", "review": "amazing experience. best laptop ever", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Aug, 2017", "reviewer": "Sreekrishna Menon"},
{"rating": 5, "title": "Wonderful", "review": "This model is better than macbook pro 2016 and 2017. \n- As 2016 one is having only 2 USB-C ports.\n- 2017 one is having is only 4 USB-C ports.\n- this model (2015 one ) is having highest base clock speed for its family (ie. 2.7 GHz in core i5 family)", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Aug, 2017", "reviewer": "Piyush Kumar"},
{"rating": 5, "title": "Ultimate", "review": "Super laptop", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Amazing product", "review": "100% genuine product as expected. Best delivery as always....", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Jun, 2017", "reviewer": "asrar haque"},
{"rating": 5, "title": "All new MACBOOK PRO thanks Alot Flipkart!!!", "review": "Order placed in 30 May 2017 and Reached to my door on 1 June 2017\nExtremely satisfy by the Flipkart services And also the seller.\nSeal packed, good packaging, very excellent offer by Flipkart worth exchanging my old laptop with this beautiful piece.\nThat's my First Mac, so at starting i experience a little awkward coz of windows background but later on I'm love with the OS and features, retina display is damn good.\nCONS: till date No problem & i know in future this machine will never let me down.\nHIGHLY SUGGESTED to people who thinking to buy this product\nDon't hesitate go for it with Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jun, 2017", "reviewer": "Maddy  Patil"},
{"rating": 5, "title": "Great", "review": "Great Retailnet Seller", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jun, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Good experience", "review": "Great as Expected", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Jun, 2017", "reviewer": "Kunal Jain"},
{"rating": 5, "title": "Must buy!", "review": "awesome product and very fast delivey by flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Jun, 2017", "reviewer": "Vikas sharma"},
{"rating": 5, "title": "Great product", "review": "Awsome in good price", "verification": {"CERTIFIED_BUYER": true}, "date": "26 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "mac pro", "review": "good product", "verification": {"CERTIFIED_BUYER": true}, "date": "11 May, 2017", "reviewer": "vijaya kumar subramanian"},
{"rating": 5, "title": "Wonderful", "review": "Awesome machine", "verification": {}, "date": "8 Feb, 2017", "reviewer": "Sai kiran Chalam"},
{"rating": 1, "title": "Horrible seller", "review": "The seller delayed the shipment. When the product reached me, it was not sealed pack and it was already used by someone else.", "verification": {}, "date": "6 Nov, 2016", "reviewer": "Ashish Pali"},
{"rating": 1, "title": "Absolute rubbish!", "review": "Extremely disappointed in the way apple India has treated this purchase of ours. Flipkart delivered well or not, m not so sure. Everything was fine but within a DAY! the screen had block spots. Black lines. Not a scratch and not a crack. Went to apple and they asked for 50000 to replace. This has been by far my worst experience both with flipkart and apple India. \n\nPurchased this expensive product only to find that no one cares how it gets to you. Flipkart definitely doesn't and apple service care is pathetic in India anyway. \n\nCheck your purchase extrenely well when you receive it. \n\nThanks", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Apr, 2017", "reviewer": "Sukul Kundan"},
{"rating": 5, "title": "Just Awesome . Go for it !", "review": "Thank you Flipkart!", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Jun, 2017", "reviewer": "Smruti Ranjan Panda"},
{"rating": 4, "title": "Satisfied", "review": "In time delivery. Product is of course a great one. Packing done was excellent.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jan, 2017", "reviewer": "Deepak Kumar"},
{"rating": 1, "title": "Disappointed", "review": "I bought this product from Flipkart, but the date of purchase of my Macbook PRO was 4 months earlier than Buying date.\nApple care representative mentioned me this when i visited Apple Care Service centre & because of that i lost 6 months of my warranty.\n\nWill never buy costly products from Flipkart again", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Jan, 2016", "reviewer": "Ankit  Sinha"},
{"rating": 1, "title": "Worst experience with Flipkart", "review": "Had worst experience ,ordered this Mac book on 7th Aug it got cancelled by flipkart , same happened on 8th and again on 10th Aug . Called customer care they are saying it's on hold and pending for approval ,their damm approval ,if they are unable to approve price above Rs 50,000/- then why they sell it .Unable to approve working 3 working days . I am never ever ever gonna use flipkart .", "verification": {}, "date": "10 Aug, 2016", "reviewer": "Ankur Vaish"}
]