[
{"rating": 3, "title": "Does the job", "review": "As always.. iPhone is iPhone..\n\nUsing about 1year and more..\n\nIt is 4g- only internet can be used, no volte ( cannot able to call)\nModerate battery life\nGood camera quality both front and rear\n\nNothing to tell something new.. it's a iPhone so u obviously have very limited apps, no storage capacity only 8gb will be available in 16gb model but that 8gb also will get disappeared no one knows how and why.. once it got broken Ur mobile u have to sell some of Ur property and u can resolve it with Apple Service..\n\nSo if u r buying a iPhone 5s then it's clear Ur budget will be around 15k and u will sell something and make it up to 20k and buy a iPhone 5s..\nIf Ur budget will be around 25k then u prefer a 30k iPhone 6 16gb.. and this budget plan will goes on, no more changes.. if u can offer 80k then u will buy a 1lakh iPhone 7s plus or something buy making some loan or selling Ur property or who knows u may sell Ur kidney as well.. \nOnce it fall down badly or get into some problem, don't worry Apple Service support is there.. simply go to a Apple Service centre they will exchange Ur old broken mobile with completely new one.. a brand new one.. in exchange u only have to give Ur another kidney or liver or heart or brain as well, if u have some million worth property it can be a good offer, if u don't have any of these don't worry, just sell Ur friend's kidney who uses Ur iPhone for gaming. Problem solved.. now u can start it again... A normal iPhone users life..", "verification": {"CERTIFIED_BUYER": true}, "date": "15 May, 2017", "reviewer": "Madhurandhagan B"},
{"rating": 5, "title": "Best in the market!", "review": "the phone  was totally awesome.... thanks for the wonderful deal... got it at 12K after all the exchange and cashback.  \neven got gift card because the seller decreased the price it was a awesome experience. ..\n\nreceived the phone in 1 day with brand  u...\ni suggest this seller....", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Oct, 2016", "reviewer": "Srikanth M"},
{"rating": 5, "title": "Super!", "review": "My first iphone ... no need to say about the design, performance... of an \"Apple\" product.\nA complete value for money product.\n\nSuperb delivery by ekart ... received the product with 1.5 days of placing order.\n\nAs it was my first online smartphone purchase  and price quoted was concerned so as to how much old stock product will i receive as the phone was launched 3 years ago. No issues as to same ... received August 2016 batch product with ios 9.0.3. Updated to ios 10.1 within an hour of receipt of delivery. \n\nHighly recommended.\n\nThank you Flipkart and eKart.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Oct, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Did not meet expectations", "review": "Weak battery performance", "verification": {}, "date": "19 Feb, 2017", "reviewer": "anwar basha"},
{"rating": 3, "title": "Good Phone with worst battery life", "review": "Phone is awesome but I think it has worst battery life. In a morning when I get out with Battery full and click some photos (30-40) and shoot some videos (9-10 of about 6 mins), my battery is completely drained. I have carry power bank with greater mAh always with me if I am on holidays. Can't recommend this phone to anyone.", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Jan, 2017", "reviewer": "Ketan Magdum"},
{"rating": 4, "title": "Superb Speed", "review": "Hi Guys,\nUsing Flipkar Since 6 Year but never ordered anything for more than 1000 as had a mentality that we should not buy online bla bla\n\nNow First of All.\nEKart Courier - Awesome Speed - Ordered on a Friday Afternoon Received on Monday Morning with Excellent Packaging\n\nPhone\nWill not comment on its working as its just 12 hrs am using it. But the piece nothing can get better than this one. Its smooth fast cool awesome sound clarity i think i will be out of words.\n\nWill surely comment on the performance after a week or so.\n\nThanks Flipkart for making life easier\nThanks WS Retail for genuine object\nThanks EKart for lightening Speed\n\nWill rate 4 for now and may increase if no problems in a week\n\nThanks", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2015", "reviewer": "Jigar Veera"},
{"rating": 5, "title": "Iphone 5S review", "review": "Well the iPhone 5S is here ! its the best iPhone today ! but is it up to the mark ? Well Yes ! \n\nShort Review :-\n\nBuild quality !\nThe iPhone 5S comes with the same look and feel as the last years iPhone . The screen is the same Although there is a fingerprint scanner in the front now ! also knows as touch ID !\n\nCamera:- The camera has been bumped Amazingly ! Although 8mp like the last year ! the iPhone 5s now has a larger sensor and aperture tat it captures stunning pictures ! And the dual coloured led flash makes Photos look even More dramatic !\n\nSpeed:- Amazingly Powerfull ! Many people look at the specs and decide which phone is fast but tat is utterly wrong! The iPhone 5s Beats the galaxy S4 and the xperia Z1 in terms of processing andf graphic speed ! Test dreived by benchmarking apps like *Geekbench3**Antutu*3D max*\n\nVerdict ! \nYhe iPhone is definitely amazing with its 64 bit A7 processor Along with the M7 co-processor ! The better camera And the touch ID\nWell how does so much come from a phone tats just 112 gms and so damn Sleek ? Well tats Apple :)", "verification": {}, "date": "1 Nov, 2013", "reviewer": "Sheldon Sequeira"},
{"rating": 4, "title": "Good choice", "review": "Bought my 5s 4 months back from flipkart.its running fine.handset n accessories were well packed.flipkart didn't disappoint me.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Nov, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Awesome iphone 5s", "review": "iPhone 5s\n!!!!!!!!!!!!!!!!!\nAwesome battery backup \nAwesome camera front and back \nAwesome speed\nNd last 1 is every 1 say dnt buy mobiles phone online because it was fake\nNow i am telling u their was no fake !!!! \nmust  buy because Flipkart is trusted online shopping site !!!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jul, 2016", "reviewer": "Aditya  Chopra"},
{"rating": 5, "title": "Great Deal!!", "review": "Rs.20499 with 10% cash back, super awesome deal!!! landed cost around 18750 cannot be matched by anyone. phone looks good. checked for product registration and full 365 days warranty available unlike few who  have complained that they received used product. Manufacturing date is also of November 15. But was not update to latest version of IOS.  Got it upgraded to IOS 9.2 immediately on startup. \n\nDelivered well before time. packing was OK,I would say. I think flipkart was relying more on the product's internal packing itself.\n\nWas available in local market for Rs.27500 and they were trying to  convince that the online versions are not real. Got a bill with taxes paid, so I think there will not be any issue with the warranty either. Migrating from android to IOS has its own learning curve. Hope the experience is good ,  Have tried IOS after a lot of deliberation", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Dec, 2015", "reviewer": "Reena Sinha"},
{"rating": 5, "title": "The Best device with an Outstanding OS !!!", "review": "I Ordered this phone on big billion sale for Rs.18499 by Monday midnight and the price was dropped to Rs. 17,799 by morning.\n\nBut the seller has gifted the difference 700rs to my wallet , so i have placed an another order in it.\n\nThank you Flipkart and Supercom.net seller.\n\nNow coming to the phone.\n\nI was using android for over 7 years and Trust me guys after using iOS, i understand that we should not compare android with iPhone.\n\niPhone is an iPhone - Cant compare it with others. (Please use it to feel)\n\nCamera - It was amazing, with the 8mp you can get the DSLR charities.\n\niOS - Very smooth and user friendly, and the best secure based OS. (You don't need to worry about your data even if you lost the phone, everything will be synced with icloud and no one can access it without the pass code)\n\nBattery backup  is good, we can manage it for a day use. (Social networking, Games, Calls and chats)\n\nYou'll addicted to iOS when you start using it.\n\nAnd now it comes with a deal price in Flipkart, so go for it without hesitation.\n\nApple iPhone 5s - Classy looks with the Best OS.\n\nPersonally i feel why i missed this for this long!!!  \n\nCheers,\nJonam", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Oct, 2016", "reviewer": "Manoj Kumar"},
{"rating": 5, "title": "Highly recommended", "review": "Nice Phone in nice range @ 16050/-\n\nGot in time.\nWas properly packed.\nGot it at only Rs. 16050/- in a deal.\n\nHandy as it is of 4 inch screen.\nNO LAG as expected from iPhone.\nAwesome touch response.\nDisplay is really nice.\n\nCAMERA quality is so nice though the rear camera is 8MP. Image originality is just perfect. The image quality is as u see in bare eyes and no 8MP camera of any android can provide that.\nGood optical image stabilization.\nNice slow motion camera.\nSpecially the FRONT CAMERA is only 1.2 MP but I can assure everyone that its better than 5 MP of android and windows.\n\nThe battery is nice for me as I use it moderately. Easily last for 1day. No android phone's battery will last for 1day after using internet connection, WiFi, games and other usage when the battery capacity is only 1500mah.\n\nIts a nice experience to switch from android from iOS.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Nov, 2016", "reviewer": "Meheboob Alam"},
{"rating": 5, "title": "Purchased iphone 5s fantastic performance.", "review": "I got this phone on 13 Nov 2015 and till now it is better to give a review. I got this at 26200/-. I brought this iphone 5s(space grey) as i got the manufactured october 2015 version and inbuilt ios 9.0 which is fluidic and superb performance.\nGaming is superb and battery lasts a day long for average users. \nCamera is 8 MP is the best part in iphone 5s. stunning photos and front camera is as equivalent to 5MP compared with other phones.\nI upgraded to ios 9.1 and its still working fast and fluidic. \nTouch ID feature is unique and can give you a different way of security and privacy.\nMusic in headphones are clearly fantastic. Overall fantastic performance and should buy this definitely. the price is also down now. \nMust go for it guys.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2015", "reviewer": "KALYAN GORAI"},
{"rating": 4, "title": "Once Bitten, Twice Shy!!", "review": "Hi Flipkart.\n\nI had a while/silver iPhone 5S before this which I sold last month and got this space grey one and intend to keep the same till iPhone 6 is back in all awe & glory. I always liked how uniform the screen looked when the phone is switched off and lying beside me when I'm busy with some actual work, far from any distraction due to contrasting white and black. \n\nThe one piece I received had two issues and it prompted me to return-\n\n1) Two tiny black spots were visible against a white background in apps like \"notes\"; possibly some dust particles had found their way into the screen\n2) The phone's aluminium frame was bent, starting from the (-) volume button and upwards. It literally threw me off and I was damn pissed. It is also bizarre how it left the assembly line and the final check!!\n\nAnyway, the Flipkart guys were very helpful, I got a call back the same day and they did arrange the replacement. In two days I got a new one free of defects. I hope Apple does improve its in-process quality control.\n\nI was this close in snapping buying electronics from Flipkart; but their through professionalism in addressing the issue and making good of the problem surely speaks of their character. Tell you what, I will stick to them.\n\nThanks guys.\n\nAbout the phone, you know it, I know it; it's the best out there...\n\nCheers,\nJagannath.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Feb, 2014", "reviewer": "Jagannath Moharana"},
{"rating": 2, "title": "Met some expectations", "review": "Thanks for the genuen review. I was suppose to buy the iPhone 5s from flipkart today but after reading the review. I will definatly not but the iPhone 5s now.\nThanks a lot for saving my money", "verification": {}, "date": "31 Aug, 2016", "reviewer": "Chandrashekhar Taksande"},
{"rating": 1, "title": "Hated it!", "review": "The world is just mad at apple products without any knowledge of technology. I wish there was an option for zero star.\n1. Does not pair with any phone over Bluetooth.\n2. Call quality is like a dirt grade mobile. When we put on the speaker, it just gives lot of noise similar to white noise in radio.\n3. In areas where I used to get proper range and talk  well with my Moto Turbo, I don't even get range with this product.\n4. Hardly noticed any difference when updated from iOS9 to iOS10.\n\nThis is just a piece of polished 'BRICK'\n\nBlackberry and Motorola were way better.\nOne thing is for sure, anyone who has an apple product definitely has money, but no guarantee of technical knowledge.\n\nApple should stop making phones and get into the business of jewellery. That atleast makes sense for non-technical expensive 'BRICKS'.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Oct, 2016", "reviewer": "Kapil Ingle"},
{"rating": 1, "title": "iphone 5s", "review": "apple iphone 5s 16 gb - this phone in all colors should now sell at rs.30,000 below online.many sites now offering at this price.fliycart too should reduce price.", "verification": {}, "date": "23 Sep, 2014", "reviewer": "rajshri sanjay"},
{"rating": 1, "title": "Worst production for paying huge amount", "review": "The rating should be worst not bad.\n\nReally a worst product to received from Flipkart. Delivering product in a day or two days doesn't make sense. Please give the good product which the customer is looking for. Really going on trusting flipkart is worst i feel. We are paying you such a huge amount and we are getting such a cheap quality goods from flipkart.\n\nThis is the second time i'm buying Iphone from flipkart, both the times i have received defective product. It has a brand name which you are spoiling by saling defective product. Please take the product back and my advise is not sale these kind of product any customer and waste everyone's time.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Bad quality", "review": "i am not able to receive any call.\ntried everything,like restart,reset,restore factory settings etc.,but nothing happened.\nsim card is working fine in other phones. so no network or sim issue", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jun, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Compact phone with required features", "review": "Pros:\nExcellent hardware\nRugged build\nRear Camera is good even at dynamic shots \n\nCons:\nAverage battery backup\nSmall screen size", "verification": {"CERTIFIED_BUYER": true}, "date": "13 May, 2017", "reviewer": "thiyagarajan krishnamoorthy"},
{"rating": 5, "title": "Satisfied", "review": "before ordering this phone I was little nervous because my earlier experience was not good with buying mobile phones online ..  But fortunately this one is not like that 😊😊 I,m enjoying  my iPhone.. Finally  a proud owner 😇\nThank you  Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Jun, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Iphone 5s one of best", "review": "Bought it in 2014 still working as smooth as new", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Jul, 2017", "reviewer": "DR OBAISH ALI"},
{"rating": 5, "title": "No words", "review": "Got this yesterday...original one...import date April 2017...no issues ...fast as light...buy apple than other ones", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jun, 2017", "reviewer": "Nithin Bejjarapu"},
{"rating": 5, "title": "Super!", "review": "Awesome phone still worth money in 2017 :)", "verification": {"CERTIFIED_BUYER": true}, "date": "30 May, 2017", "reviewer": "Ritwik  Jha"},
{"rating": 5, "title": "Highly recommended", "review": "I have lost my phone bill can i get again the bill", "verification": {"CERTIFIED_BUYER": true}, "date": "22 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Do'nt go for this April fool offer from Flipkart", "review": "Reliance Digital offering the same with 15,599 with exchange offer. And they always sell latest manufactured product. Flipkart is just making fool", "verification": {}, "date": "28 Mar, 2017", "reviewer": "Prabir Rath"},
{"rating": 5, "title": "Just wow!", "review": "fabulous", "verification": {}, "date": "28 Feb, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Just wow!", "review": "Good phone but only a single problem of water  damage because there is no solution for water damage", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Sep, 2016", "reviewer": "Tushar Yadav"},
{"rating": 5, "title": "Awesome Phone", "review": "On Time And Good Packing.. (WS Retail)\nOriginal Piece With 1 Year Apple Warranty. \n\n\nChecked The Serial Number On Apple Website And No Problem With 1 Year Warranty From The Date I Activated Phone..", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Mar, 2016", "reviewer": "Vishwajit Vadgaonkar"},
{"rating": 4, "title": "Really Nice", "review": "I give it a 4 star because of it low memory of 12.5gb.\n\nYou come here for reading reviews!.. LOL\n\nCom'on man it's an Apple Device.. \nIts a very good device with a perfect size. Feels great in the hand also felt great from the core of the pocket money.\n\nHowever for a Android user planning for a change this a great device. 'Lags'- don't ever think of it for normal use like chatting, listening to music, shopping, and calling obviously. Battery lasts for a day long with a decent use.\n\nI liked it very much. I would have bought iPhone 6s because it's an upgraded version but you know my kidney is not for a sale.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Dec, 2016", "reviewer": "Sayan Karmakar"},
{"rating": 2, "title": "Really Nice", "review": "Worried after reading all the comments here.. But tried my luck and ordered one..  The phone is absolutely fine, genuine, and original. Got it for 19,480/-\n\nEdit:-\nIts been a year now and I have to say I had some Kind of software problem from the beginning. The apple service guys told its just a minor software problem then.  Now(2017) , It automatically restarts and switches off.  And as of now(Jan'7 2018)the phone switches off and restarts with an interval of abt 2 days. Don't know why!!", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Dec, 2016", "reviewer": "Sashi  Kiran"},
{"rating": 5, "title": "Peace of mind", "review": "Nice phone. The best part of iPhone is that it never hangs. I had a bitter experience with Samsung. Then onwards I am loyal to iPhone. According to me this is the most beautiful phone in the world. iPhone is always a smart buy. Limitations are certainly there but it gives you peace of mind in respect of performance. Even premium devices of android hangs after one update. So go for it. Flipkart is the best in respect of delivery and return.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 May, 2017", "reviewer": "subhankar nag"},
{"rating": 5, "title": "Awesome", "review": "Flipkart - Was deslivered much earlier than expected !!!\n\niPhone 5S - Safe packing. Sealed and genuine ! Works flawlessly. Can always rely on Apple for build quality !!!", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jun, 2017", "reviewer": "Mohammed Aadil"},
{"rating": 5, "title": "IPhone 5S for 14K", "review": "Great Phone, brought for 20K from LOT mobiles with 6K HDFC cash back as valentines day offer.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Feb, 2017", "reviewer": "Madhusudhan Kakarla"},
{"rating": 1, "title": "Unnecessary super priced", "review": "Waste of money.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Sep, 2016", "reviewer": "Raj Kumar"},
{"rating": 5, "title": "Yet another on time delivery by WSRetail", "review": "Awesome and genuine phone... \nYou may have difficulties if you use it for bigger screen phone and switch to iPhone 5s", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Mar, 2016", "reviewer": "Albin Baby"},
{"rating": 5, "title": "Must buy!", "review": "The product was shipped in less than 36 hours. \nIt was Brand New iphone 5s totally in  sealed condition. Package was very well packed.Delivery was spot on. And delivery boy (ekart wish master - Mukesh) behaviour was extremely joyful and pleasant. Wish him a very good future. Thank you Flipkart and  ekart.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Dec, 2016", "reviewer": "RAJESH JANGRA"},
{"rating": 5, "title": "Original and genuine product", "review": "Three cheers to flipkart and WS Retail for clearing the doubt in my mind which was publicised by everyone that the iphone bought from the site is not genuine etc. My iphone is fully genuine with all original accesories and full warranty", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Nov, 2015", "reviewer": "Abhinav jindal"},
{"rating": 5, "title": "A superb phone!!!", "review": "Bought this phone on big billion sale day. A super fast delivery by flipkart and a great seller Supercom.net who gave me 700 rs giftcard. \n\nNow coming to the phone!!!\n\nPros:\nA super phone with awesome design, fits perfectly in hand and a lag free device. Battery backup is good, lasts for a day with moderate use. One great thing about battery backup is your OS won't eat up your battery if not in use, it manages everything perfectly. It fully charges in 1-1.30 hrs from 0-5% battery. All your data is fully secured, perfectly smooth finger print scanner. A great and flawless rear and front camera which gives me clear images. Speakers are good and gives a great experience when headphones are plugged in.\n\nCons: \nPhone heats up if you operate during charging\n\n\n Writing this review after using it for 10 days.\n\nOver all I would say a Perfect Phone!!!\n\nThanks!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Oct, 2016", "reviewer": "Jatish  Nair"},
{"rating": 5, "title": "For Apple Haters", "review": "For all new Apple users and Apple haters every Apple user knows that Apple's battery sucks up a lot faster than any phones. But everyone must accept the fact that it also charges up a hell lot faster than any other phone.\nIt's performance is the best in 1GB RAM range and its compatible of defeating any phone with 2GB RAM under 30k. \nPeople who think that why should they buy a phone with a Secondary Camera of 8MP but guys it's not the megapixel that matters in a phone camera. The thing that matters is apperture and Iphone 5S gives a 8MP camera with f/2.2 apperture and a 13MP camera under 25k gives f/2.0 apperture so its the best in its range. And everybody knows that apple has the best slow motion captures in comaprison to any phone.\nAnd many people think that a 4-Inch phone is not so cool and eye catching in 2016. Though it's somewhat correct but people have to accept that it's very easy to reach every corner of tge screen with one hand which js not lossible in a 5.5-Inch smartphone.\nIn short the phone is the BEST and the BEAST in its range and it's still one of the best smartphones in 2016 also .", "verification": {}, "date": "2 Apr, 2016", "reviewer": "Kaustav  Koer"},
{"rating": 1, "title": "Flipkart I wont return again", "review": "There is a price drop of 2500 Rupees just after 2 days of my purchase this is absolute mockery for the customer, I will never ever return to flipkart for my next purchase. \nI would like to give ZERO Star for flipkart and the seller but no option for it so I would go with a generous 1 star \n\nThe phone is apple wonderful as usual.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2015", "reviewer": "Akshay Acharya"},
{"rating": 1, "title": "cheaters", "review": "i m checking the rate of 16gb black ifone 5s .. flipkart is changing rate btw 39,999 and 45000 evryday ..   really big cheaters !!", "verification": {}, "date": "31 Aug, 2014", "reviewer": "faizan bakshi"},
{"rating": 4, "title": "Worth the money", "review": "I Have Iphone 5s... Nd This is gd gd gd phone", "verification": {}, "date": "22 Mar, 2017", "reviewer": "Flipkart Customer"},
{"rating": 2, "title": "Iphone No longer worth the money", "review": "Apple was once known to be an innovating company in terms of design and tech in their products.That name is now all but gone now a days.\nIphone 5S is yet another eg of the company who can no longer really innovate.What does this have for it to be priced at Rs.53K that too for the 16GB verson (32 GB is 62K).Lets take each feature and component of the phone and do a comparison with the competition.\n\nCamera \nThis is one of the most used part of a smart phone.Apple itself has prided in its cameras and advertised it well but the fact remains Iphone camera has NEVER been the best in Market and this is espeacialy visible in this current gen.Smartphone cameras of other phones esp Nokia Lumia 1020 are MILES ahead of iPHONE 5s camera in almost every aspect.This includes Optical Image Stabilization,Losseless Zoom,Over sampeling,focusing after photo has been taken,RAW digital negatives are some of the features iPhone 5S doesn't have and Lumia 1020 has and these features amount to a lot in normal everyday use.iphone camera's night or low light performance is poor when compared with the 41MP monster sitting on Lumia 1020. \nMicrophones\nSorry Apple Nokia beat you again in this area. Search online for HAAC Microphones by Nokia and you will what an amazing piece of technology and  innovation its.\n\nNavigation Software,Map application.\nThe default map application in IOS 7 is the Apple's Own Apple Maps.If you don’t know this remains the worst Map software among its competition which includes Google Maps(default in Android),Here(Nokia)Maps(default in all Nokia smartphones,Jolla and Kindle Android also used by 4 out of 5 cars with GPS) bing Maps ( default in non lumia Win Phones).Apple Maps has been notorious for its innacurate data which has lead people to drive straight to Airport runways.You will however get Google Maps and Here Maps in App store but Apple maps will remain as your default map app.\n\nDesign\nNothing much has change from Iphone 5 and 4S.Its allmost  same itself.\n\nScreen\nApple screen is one of the best in Market but it remains a bit small.I am not a Fan of big screen but the screen can be bumped to 4.3 which is sweet spot.\n\nProcessor.\nProcessor is Apple's proprietery A7 which gives fast performance thanks to good OS optimisation.This  is a plus when compared with Android but not so much when comparing Win Phone whose low end phones like  Lumia 520 is comparable with Galaxy S3.Being 64 bit doesn't serve any purpose as no apps are now made for 64 bit.By the time they make you will be throwing away this phone after long use.\n\nOverall\nBuying this makes little practical sense esp at this price. There are amazing products from other manufacturers which offer better phones at cheaper price. Phones like Lumia 1020,HTC One,LG G2 each of which has innovating features and DOUBLE the memory.Only truly ignorant people buys Iphones by their choice.This fact is high lighted by the high market share iPhone  enjoys in US and we know the level of ignorance  Americans have (not all Americans I mean).", "verification": {}, "date": "13 Dec, 2013", "reviewer": "Aaron Abraham N"},
{"rating": 2, "title": "iPhone is not working properly", "review": "After a month of use the iphone 5s has started hanging... too many times. The touch is also not responding properly. :(", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2014", "reviewer": "PRIYANKA PARVANDA"},
{"rating": 1, "title": "Hated it!", "review": "No battery backup\nNetwork connection problem\nIt gives only less than 3 hour battery backup  while using internet.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Jun, 2017", "reviewer": "Somnath Shinde"},
{"rating": 3, "title": "Heats up too much", "review": "Too much heating upon opening any game or during charging, even while playing YouTube.\nAnd worst part is can't do anything about it rather just bear with it and hope it would keep on working without blowing up someday. I just hope it's not a refurbished one, though looks awesome and as expected. Keeping fingers crossed.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jun, 2017", "reviewer": "Anshul Shrivastava"},
{"rating": 4, "title": "Nice product", "review": "Best phone but plzz decrease price bcz holi is coming some special deals plzz", "verification": {}, "date": "7 Mar, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Superbbbbb", "review": "Rating with the same iPhone ,Awesomeee", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Jan, 2017", "reviewer": "Shiru S"},
{"rating": 5, "title": "excellent", "review": "Apple iphone is an excellent phone compared to other phones in the market excellent software and built quality.\nFlipkart service was also good, i got the phone the next day of the order", "verification": {"CERTIFIED_BUYER": true}, "date": "9 May, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Fantastic Smartphone Just Buy it", "review": "Thanks to Flipkart and WS Retail.\nI replaced my 2 year old nexus 5 (32GB) phone with this iphone5S in replacement offer from flipkart. So I received this iPhone from WS Retail in Original Apple iPhone Packaging.All accessories are Brand new including iPhone Device. I crossed checked warranty of this product by entering the serial number of device and confirmed online that phone is having 1 year validity. I called to Apple iPhone customer executive and given the serial and IMEI number of device to certify authenticity of product, and got to know from Apple that received product is genuine brand new iPhone.\nI been using this iphone for last 20 days with no issues. Charger I got along with this iPhone is good,it charges the iphone to 100% in 1 hour. And I use phone moderately whole day to play music, watch videos, messaging,calling and other stuff. So battery backup comes for about 10 -11 hour. So I believe its fair and nice battery backup. Earphones of this iPhone 5s are Awesome , I am sure for every music lover it gives TOP NOTCH BEATS as in like you are inside Sound composing studio..!!. I do have have On-Ear Bose headphones and I been using Bose headphones for 2 years from now, I wanted to know you that iPhone5S  headphones are equally Superb like Bose. I know you cannot compare Bose headphone with iPHONE earphone, but I experienced beats to some extent.. like BOSE..! headphone. iPhone5S is complete product, I am completely satisfied.iPhone 5S screen is small, But Im not big fan of large screen. I believe smart phone should like perfectly handheld Smartphone So iPhone 5S serve its purpose with 5 star.. Video I shooted with this device is really good with crisp and clear 1080P HD motion picture. This smartphone has 8MP lens, Still Pics are nice with good details.As I use DSLR, I am not fan of smartphone camera since all smartphones except iPhone6S have small sensor motor which cannot capture details. Finally as you know Use and Feel of Iphones are always great. IPhone5S has Siri(Voice recognition) feature which lets you read your E-mail ,play music , navigate places and many stuffs with handsfree, and this phone takes your thumb impression to unlock ,all these features makes phone  a smartphone..!! My last word.. to all buyers that, Buying iPhone from Flipkart online, I made NO MISTAKE..!! and I'm truely Satisfied. Even if you go to Apple store and buy,you get same product by spending 3K or 4K more..!! .  I got 5K discount for exchanging my old Nexus 5(which I used for 2 years extensively) and bought iPhone 5S for 18,900/- only.", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Jan, 2016", "reviewer": "Sandeep Hiredesai"},
{"rating": 5, "title": "Great Product, Trusted Online Dealings", "review": "I was really looking forward to own an iPhone for last 2-3 years & Flipkart helped me to make that dream to a reality in the form of an iPhone 5S Spac-e Grey 16 GB  (Model A-1530). \n\nThis is really a stunning piece of creation & I was amazed by the kind of discounts offered by Flipkart & WS Retail for such a flagship product from Apple. \n\nThe product was safely delivered as \"manufacturer box packed iPhone\" double packed inside Flipkart's own box along with Credit Card swiping facility while taking the delivery at my doorstep (COD). \n\nAs indicated by their website, the product was 100% new & genuine &  Apple India's domestic service warranty (1Year) has started as soon as I activated my phone. Since apple products need activation using a SIM, you can make out the status by checking the activation status of its IMEI with Apple website, immediately after Flipkart prepares the invoice. \n\nThe new iCloud storage of 5GB (free with iPhone) helped me to seamlessly transfer all my contacts from my old Android phone to the new iPhone. \n\nMy overall experience for the shopping experience with Flipkart, their back end partner WS Retail & the logistics partner Ekart Logistics are Simply Superb... Please keep it up guys...", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Feb, 2014", "reviewer": "Babu T Kurian"},
{"rating": 1, "title": "Worst customer service", "review": "Flipkart team sent me 2 iPhone and charged me 4 too also, when I told to return one of them,,, no reply from team,,, worst service", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Jan, 2018", "reviewer": "Parveen  Kumar"},
{"rating": 5, "title": "Best in the market!", "review": "Brlant device I like it", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Jan, 2018", "reviewer": "VEERU DAYMA"},
{"rating": 5, "title": "Excellent", "review": "Value For Money Product and Superb Service by Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jan, 2018", "reviewer": "Amitesh Ojha"},
{"rating": 5, "title": "Terrific", "review": "Good", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jan, 2018", "reviewer": "AKSHAY DESHBHRATAR"},
{"rating": 5, "title": "Awesome", "review": "Nice one", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Just wow!", "review": "Very good", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Good", "review": "expectation is not fullfill battery level is is not good", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Apple phone", "review": "Really great. Service from flipkart is too good", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2017", "reviewer": "C Murugu Sellan"},
{"rating": 1, "title": "Useless product", "review": "Just one word: WASTE!", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2017", "reviewer": "Bhavya Dhanda"},
{"rating": 1, "title": "Worst phone", "review": "Battery issues", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Hitting problem", "review": "My iPhone hitting problem", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Nov, 2017", "reviewer": "SANJIB  RUIDAS"},
{"rating": 2, "title": "Dont buy", "review": "Dont buy... I bet you will regret... there are many other good phones buy them dont buy this phone.... and if u are a Apple freak then buy iphone se... dont buy this", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Nov, 2017", "reviewer": "Abhishek  Pankhraj "},
{"rating": 5, "title": "still strong after two long years.", "review": "its a good phone for this price range \neven after two years its still fast \nbut after the ios 11 update the phone lags a bit though\nbut truly satisfied with this phone", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Oct, 2017", "reviewer": "tsewang tamchos"},
{"rating": 4, "title": "Worth the money", "review": "Very nice BT delivery too late", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Apple Lover", "review": "It is a very Good Phone in All apple series", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Oct, 2017", "reviewer": "Indu Shekhar shar"},
{"rating": 1, "title": "Review after 5 month usage", "review": "Worst phone i ever had, gets switched off any time and starts heating after that battery drains. Battery dosn't lasts for a single day. Sometimes homebutton stops working, and when i lock the phone it makes a wierd noise. Simply dont buy . Battery drains any time and when i connect to adapter it shows 50% charge, in 5 months visited service centre 4 times. DONT BUY THIS PHONE.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Sep, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Worth every penny", "review": "Still one of the best product out there.\nAnd the most beautiful iphone till date!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Sep, 2017", "reviewer": "Bhushan Gaikwad"},
{"rating": 1, "title": "Waste of money!", "review": "over heating", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Sep, 2017", "reviewer": "Manivannan M"},
{"rating": 3, "title": "Nice", "review": "Poor bettry", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Sep, 2017", "reviewer": "Naveen  Hinduja "},
{"rating": 4, "title": "Worth the money", "review": "Totally satisfied", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Sep, 2017", "reviewer": "DIPESH SINGH"},
{"rating": 4, "title": "Four Stars", "review": "Nice phone", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Jul, 2017", "reviewer": "suraj kitkat"},
{"rating": 4, "title": "Wonderful", "review": "Nice one", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jul, 2017", "reviewer": "Sanjeeva Kumar  Velamuri "},
{"rating": 1, "title": "Bad product", "review": "The phone is getting strucked not good as first  replace it", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jul, 2017", "reviewer": "Vinaykumar Karadi"},
{"rating": 2, "title": "IPHONE 5S", "review": "I do not like this product it s heating", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jul, 2017", "reviewer": "MEGHA MENDHIRTTA"},
{"rating": 4, "title": "Go for it", "review": "After 9 months of usage, satisfied with the product.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Jul, 2017", "reviewer": "Kishore K"},
{"rating": 5, "title": "Excellent", "review": "Good", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jun, 2017", "reviewer": "Chintu Kumar"},
{"rating": 1, "title": "Absolute rubbish!", "review": "In last 6 month, I went to Apple care 4 times, and they have changed my phone 3 times. But still facing the problem of auto switch off. In short\" saara Maaza kharab ho Gaya Apple Lene ka\".", "verification": {"CERTIFIED_BUYER": true}, "date": "24 May, 2017", "reviewer": "Pramod  Kumar"},
{"rating": 1, "title": "Terrible product", "review": "Speaker is not working while talking", "verification": {"CERTIFIED_BUYER": true}, "date": "23 May, 2017", "reviewer": "vijju ammu"},
{"rating": 5, "title": "Just for showing off you can buy itt!", "review": "In 16000 its good enough to handel normal tasks ( like calling, showoff :p ,texting), battery life is poor on 3g/4g. \nIts just waste of money now!\nLook for another cell phone in its price range for a better choice!", "verification": {"CERTIFIED_BUYER": true}, "date": "16 May, 2017", "reviewer": "Shubham Sharma"},
{"rating": 5, "title": "Best in the market!", "review": "Happy :)", "verification": {"CERTIFIED_BUYER": true}, "date": "16 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 2, "title": "Slightly disappointed", "review": "Nice but too small", "verification": {"CERTIFIED_BUYER": true}, "date": "15 May, 2017", "reviewer": "sujju reddy"},
{"rating": 4, "title": "Value-for-money", "review": "Best product lowest price", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2017", "reviewer": "Rohit Kamboj"},
{"rating": 5, "title": "Great phone", "review": "iPhone at its best. Can't compare with anyone", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2017", "reviewer": "Abhijeet  Mali"},
{"rating": 5, "title": "Great Deal", "review": "Awesome smartphone of Apple", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2017", "reviewer": "Anuj Hissaria"},
{"rating": 4, "title": "Must buy", "review": "Apple iPhone 5s is very good and easily accessible product and unique design for apple of the world  bests mobile devices company!!!!!!!buy the new iPhone enjoy life!!!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Apr, 2017", "reviewer": "Mujahed Sayyed"},
{"rating": 5, "title": "Best phone at this price", "review": "Best back camera at this price for low light pictures. Smooth flowing operating system. Zero lag. Great metallic design. Fingerprint sensor works reliably everytime.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Apr, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Worth every penny", "review": "Nice one must buy ordered my phone without money now begging on road along with my phone", "verification": {}, "date": "6 Apr, 2017", "reviewer": "srinath sri"},
{"rating": 4, "title": "Nice product", "review": "Very good", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Mar, 2017", "reviewer": "Niladri  Chakma"},
{"rating": 5, "title": "Classy product", "review": "Great product & awesome...", "verification": {}, "date": "24 Mar, 2017", "reviewer": "Munsheer"},
{"rating": 5, "title": "Wonderful", "review": "Simply good product fast performance \nI have been using it for a week I phone 5s and its giving good toch Response and good gaming performance but \nSmall display covers up by fingers while gaming\nBut doesn't heat and good quality product \nAnd the sound quality is very nice and ear birds us also give good quality sound .sound doesn't \nBubbling and doesn't make your ears pain\nAnd the finger print scanner is also good response fully utilizable phone both camera are good and it's ratina display gives you better \nScreen experience then other devices. Now it can connect with other device easily perfect phone.", "verification": {}, "date": "13 Mar, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Don't waste your money", "review": "Diffective product received.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Mar, 2017", "reviewer": "akshay  srivastava"},
{"rating": 3, "title": "Just okay", "review": "Poor Battery backup", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2017", "reviewer": "Jayaprakash M"},
{"rating": 5, "title": "Terrific purchase", "review": "Good", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2017", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Decent product", "review": "Good", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Recommend to All", "review": "Best Quality", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Feb, 2017", "reviewer": "Saurabh  Jojare"},
{"rating": 4, "title": "Gud phone", "review": "Hey it about a year i am using this I have bought this phone from flipkart.still it works like a charm unlike andriod phone which have a life of year.\n\nThanks flipkart!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Feb, 2017", "reviewer": "Deepak Gusain"},
{"rating": 5, "title": "Awesome", "review": "Nice Product.  Happy To Buy.\n\nStill Working Fine.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Feb, 2017", "reviewer": "Subhash Panchangam"},
{"rating": 5, "title": "Super!", "review": "Apple is always reliable.", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Jan, 2017", "reviewer": "Flipkart Customer"}
]