[
{"rating": 1, "title": "Hated it!", "review": "I ordered a silver iphone X but received a space gray product. Didn't expect this to happen while buying such an expensive product.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2017", "reviewer": "Sanjeev Malhotra"},
{"rating": 5, "title": "Perfect product!", "review": "Excellent delivery .... on time sharp 6:00 PM .... thank you flipkart...\n\nthe phone is everything that apple promised.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Harish Balan"},
{"rating": 3, "title": "Cash back not given.!", "review": "The offer said 10000 cash back for citi credit and debit cards and I used a debit card for full payment and never got the cash back. Please guide me here with the procedure.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Nov, 2017", "reviewer": "Anirudh N"},
{"rating": 1, "title": "No Invoice hardcopy or softcopy", "review": "Product delivered with no hardcopy or softcopy of invoice...no invoice even in app or desktop version...customer care says wait till 11th..as a result I can't insure my phone worth 1 lakh rupees...for all I know it's a stolen product or a counterfeit...thanks Flipkart...ur the worst...", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2017", "reviewer": "Nitin Kumar"},
{"rating": 1, "title": "Faulty IphoneX delivered, Flipkart refused to help", "review": "First time in my life I ordered something so expensive from online ecommerce site and as per my fear, they delivered a faulty iPhone x. There are blurred lines appearing in portrait mode in back camera.\n\nWhen I contacted Flipkart support they refused for any help and suggested to go to Apple care. So this is pity that after spending 102000/- my iPhone is laying in service centre.\n\nThe Flipkart support is useless and I am not going to make such big purchases for such sites again.\n\nFeeling cheated for my purchase.\n\nRegards\nSachin", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Nov, 2017", "reviewer": "Sachin Tewari"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Amazing build quality, except the fact that it is missing the fast charger.. all good", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "CHIRAG CHOUDHARY"},
{"rating": 5, "title": "All Screen. All Good.", "review": "Delivered right on time by Flipkart at 6PM India iPhone X launch time. \nRegarding the device, it will blow your mind. Apple proved once again what a masterpiece can be.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Swapnil Das"},
{"rating": 5, "title": "Best iPhone ever. Killer one...", "review": "I am using iPhone since almost last 7 years and this is no doubt the best phone of all. \nJust loved it\nCamera is amazing\nAs always its iPhone so works like charm. \n\nThanks Flipkart for special delivery n on time.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Nov, 2017", "reviewer": "Nishikant Mhatre"},
{"rating": 5, "title": "Apple x", "review": "Awesome", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Dec, 2017", "reviewer": "Sagar Hongekar"},
{"rating": 1, "title": "Pathetic Deliver by Flipkart", "review": "Delivery from Flipkart was pathetic. I ordered on Friday night. They had to deliver on Monday and the seller didnt even ship it until Monday. Then it was in Flipkart Bangalore hub for 22 hours before it was shipped to Delhi. It took another 24 hours for it to reach Delhi and then it was out for delivery on Thursday. I was not in town, so it was re-scheduled for Monday. In between Thursday and Monday I received numerous calls and emails from Flipkart asking me to cancel the order or get it delivered to someone else at the address. I told those fools that I had taken the exchange offer and dont they want the old phone? Finally, the day came and the delivery guy called up at least 5 times before reaching the delivery address as he was new to the area. He checked the phone details IMEI number etc and took the phone. He called me back at 9pm saying that he cannot check the IMEI and asked me to Whatsapp the screenshot I had shown him during the visit. Terrible! Really Terrible!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "The complete phone.", "review": "Most complete phone there is. \nLooks Good ? Of course.\nBest screen ? Yes, its Amoled but with Apple specified specs.\nCamera ? Very awesome.\nPortrait mode ? Yes, front and back.\nGood battery life ? Yes, 8 hrs of usage time.\n3D Touch ? Yes and very useful.  \nBest feedback system there is in any smartphone ? Hell yes. No body does it better than Apple when it comes to vibration feedback in smartphones.\nFace ID ? More convenient than Touch ID. \nFace ID fast ? Yes and it work almost all the times.\nPhone feels snappy ? Hell yes.\nBest processor ? Hell yes.\nStereo speaker ? Yes\nWireless charging ? Yes\nFast charging ? Yes\nRam ? 3GB but its good enough for iOS because of a lot of system optimisation that Apple does. \n120 Hz Touch input, you have to use the phone to get it. \nNo home button ? You will never need it once to get used to the new gestures.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Awesome device", "review": "First let me share my experience with Flipkart..I got the device yesterday morning.. delivered right on time as mentioned by Flipkart on the day of prebooking . I must say Flipkart has improved a lot. I was hardcore fan of amazon now I have a better option!! I got device as well as nice little surprise in the box from Flipkart. Thanks you Flipkart for amazing service.👍👌\n\nNow about the device..well it’s much faster then I expected and Face ID works like a charm even in pitch dark. Few apps are still not optimised but the native apps are great. It’s a complete visual treat. Size is in between iphone 7 and 7 plus. Speakers are   much better too. One more thing I would like to mention that if you have your older device with you then switch on your Wi-fi and Bluetooth on older device then turn on iPhone X and see the magic of seamless transfer of all your data!! This is the best iphone you can buy in 2017. Cheers !!", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Nov, 2017", "reviewer": "jitendra singh"},
{"rating": 5, "title": "Excellent service by Flipkart!", "review": "Excellent service by Flipkart! The phone is amazing. Few apps need to be optimized for the iPhone X, rest all main apps are working perfectly. The product is worth the price!", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Rahul Chakraborty"},
{"rating": 1, "title": "Not worth buying", "review": "If you want to show off then itsOkay otherwise Apple X or somebody says Apple 10 not worth it all... So my Friends I bought this apple x about a week ago exactly on 16th January 18.... dont Scrap your Hard earned money.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Feb, 2018", "reviewer": "Rajbir Singh"},
{"rating": 5, "title": "Awesum Phone !! Must Buy", "review": "I will highly recommend this phone if you have bucks!!\n1.Good camera\n2.Speaker sound is mind blowing\n3.Compact size\n4.Face ID is really  good\n\nSuggestions: Buy Spigen back cover and Spigen Screen guard for your beauty", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jan, 2018", "reviewer": "Shobhit Sarin"},
{"rating": 3, "title": "iPhone X", "review": "Till placing the order was all good but post that you guys (Flipkart) changed the delivery date that too of one week ...after requesting so many times they delivered on 13th but ideally it was supposed to be on 9th as it was very special day of my life. Sorry to say but am just not happy with your service.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2017", "reviewer": "Mrinalini Singh"},
{"rating": 1, "title": "People should wait for review and then buy..", "review": "I started having problems in 2 days ,phone keeps hanging,network is not coming properly,snapchat keeps hanging..Speaker voice is not clear.Its been just few days and i have to visit service centre.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "Deep Vidyarthi"},
{"rating": 5, "title": "Excellent Phone", "review": "I highly recommend this phone if you have the buck!!\nHowever some issues seen by me which could get addressed with software updates.\n1. Face ID does not work properly in direct sunlight. And few times acted wonky. So not perfect like Touch ID.\n2. RAM management is little bad compared to earlier iPhones on iOS 11.1. \n3. True Tone makes the display more warm / yellow for this phone. Looks better without it. \n4. Dont quite like the control center gesture position.\n5. Provided charger is not a fast charger. This is a bummer by Apple \n6. Glass on front and back could be risky if not handled properly. \n7. Very Costly for a piece of tech whose value deteriorates over time. \n\nWhats nice:\n1. Good and big screen. \n2. Speaker Sound is loud enough for a mobile\n3. Wireless capability (only its too slow to charge)\n4. Fast charging via MacBook Pro charger\n5. India unlocked unit is based on a Qualcomm chipset which makes it a universal phone\n6. Good looks and nice to hold. Not too large like iPhone Plus models. \n 7. Good cameras", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Nov, 2017", "reviewer": "Christie  Watsa"},
{"rating": 5, "title": "Best in the market!", "review": "It was awesome", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Not worth 1 lac price tag", "review": "Phone is everything as expected from Apple but little bit of heating after some usage.Rest all great...but FLIPCART delivery sucks...charged me for 1 day delivery but it took 2 days for the phone to reach me.In just 20 days of use..the phone has scratches on steel frame in just 20 days of usage.very poor quality.Definitely not worth a 1 lac Rs price tag", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Nov, 2017", "reviewer": "Dinesh Panwar"},
{"rating": 1, "title": "Waste of money!", "review": "This is really disappointing..just 2 weeks of purchase and newly iPhone X earpiece speaker is not working...did not expect this from worldwide best brand.Instead of giving instead replacement for the device I had to wait for the response from icentre on this.Waste of money definitely.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Dec, 2017", "reviewer": "Anjali Priya"},
{"rating": 5, "title": "Worth it!", "review": "I used the iPhone 7 before this. With so many conflicting reviews I was unsure how the Device would be. I also knew that Apple would not bring an anniversary product to the market without extensive testing to eliminate major problems.Thank god I ordered it! Face ID changes everything. Unlocking the phone is only one minuscule part of its job. Lovely phone enjoying every minute of it. Never missed the home button for a second. The gestures and screen are pure butter. Feels like the future for sure! Apple at its intuitive best!", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Great service by Flipkart, high hopes from Apple X", "review": "So far so good. Have been using Android before this hence I found a few hiccups with the way Apple functions. It's a good phone and the face ID works well most of the time. \"Most of the time\" The no home bottom has changed the way this phone functions as compared to the past Apple phones. Kudos to Shreyas who delivered the phone to me right post the launch at around 6.40 pm. Commendable service by Flipkart. Thanks you.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Saurabh Chhabra"},
{"rating": 5, "title": "Best Phone! Period.", "review": "First of all I have to thank Flipkart for providing an amazing experience in delivering this beauty! Such precision timing, Im just very impressed. Since the day I had ordered it I had so many negative things in my mind, coz I couldnt believe I was the lucky one to order the phone, then all the rumours which made think of I would get the genuine product. Believe me, when the phone got delivered, I was so nervous. Opened the package and I was blown away with what I had seen. Such sophisticated product I have never experienced in my entire life! To top it all Flipkart had sent a gift and a message which was a thank you note.\nI know this seems like a dragging story, but Im just so happy to get this product via Flipkart!! Wont regret this decision. Thank you so much for handing over the future of smartphones to me so efficiently! I feel lucky to receive it on the launch day!", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Best iPhone ever", "review": "Quick delivery \nExcellent product", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2017", "reviewer": "Bhargav Kotadia"},
{"rating": 5, "title": "The best that apple has to offer.", "review": "An awesome phone for apple lovers. Face id is on point and very fast. The third party apps are yet to be optimised for this screen, however devs should begin optimising soon. \nRest everything is awesome as expected from apple. The screen is ridiculously good. Speakers are one of the best that i have heard. Overall an awesome phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "best thing i have ever purchased in my life .\nsuch a masterpiece to use , it makes me feel like i was waiting for this whole my life .", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Nov, 2017", "reviewer": "ashish gupta"},
{"rating": 1, "title": "Very poor", "review": "Cannot expect a phone worth this price to restart for no reason.\nFriends- show us your new phone \nMe - flaunting\nPhone - leme go off to sleep\nI mean this\nIs unacceptable, not something that is expected out of apple", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Dec, 2017", "reviewer": "Ankit Shinh"},
{"rating": 5, "title": "Stunning !", "review": "Simply stunning!!! \n\nLoving my new Iphone X :)", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Nov, 2017", "reviewer": "Himanshu"},
{"rating": 5, "title": "Worth every penny", "review": "Fast and awesome delivery! Thanks for all the extra goodies and the letter!", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Nov, 2017", "reviewer": "Abhilash Tiwari"},
{"rating": 5, "title": "Best iPhone yet", "review": "Awesome!", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Nov, 2017", "reviewer": "Yash Sumaya"},
{"rating": 5, "title": "Excellent", "review": "Excellent", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Nov, 2017", "reviewer": "Sandeep Asati"},
{"rating": 5, "title": "Love the new Apple IPhone -X", "review": "No doubt a gen-x phone and yes it does have an earphones.. Love the user interface definitely worth the money", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Nov, 2017", "reviewer": "Neeraj Singh"},
{"rating": 1, "title": "Don't waste your money", "review": "Price is to high", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Worth it", "review": "Awesome phone. I have been using iPhone since 2012, and upgraded every year. But iPhone X is the best upgrade.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Jan, 2018", "reviewer": "Pawan"},
{"rating": 5, "title": "Just wow!", "review": "It's awesome....", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Classy product", "review": "Youtube reviews can tell any thing, Best phone ever. Everything just works out of box in Apple Echo System. Perfect integration between devices. Photos best in class especially portrait shots\nThough one small issue. when network connectivity is slow while taking video @4k-60fps and normal shots phone is getting bit heat up", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Feb, 2018", "reviewer": "Monin Manu"},
{"rating": 5, "title": "Big deal", "review": "Big Deal . I got 5000 less Price from market for my I phone x .", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jan, 2018", "reviewer": "SOUMEN KUMAR  DEY"},
{"rating": 5, "title": "iPhone X", "review": "Flipkart is no 1 super service I am very happy .super iPhone x", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Jan, 2018", "reviewer": "Altaf Husain"},
{"rating": 5, "title": "Worth every penny", "review": "Supurb Product but Fast charger not enclosed", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Dec, 2017", "reviewer": "Rajia Choudhury"},
{"rating": 4, "title": "Good not excellent product as well seller/flipkart", "review": "I want to write about product and seller as well\nFirst about product : Product is good not excellent as it is exaggerated by apple Face ID is ok ok not as better as finger print ID (Touch ID ) it could be better if finger print unlocking also provided.Incase of performance its excellent. Disappointed with Siri ( it is unable recognise Indian accent as google asst does ),maps and Face ID \n\nNow about seller : the date of delivery mentioned by seller/Flipkart is completely wrong the product hadnt been packed even the date of delivery (or just one day before the given date of delivery ) its been packed after raising complaint regarding the delay to the Flipkart. Then they(seller/Flipkart) changed date of delivery (postponed) and finally the product is received lately. However product is genuine.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Dec, 2017", "reviewer": "RAJANIKANTH PINGALI"},
{"rating": 5, "title": "Latest iteration of the Apple juggernaut", "review": "If you are an Apple fan boy/girl, then this is your holy grail! (As long as you don't mind the price, that is)", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Super awesome!", "review": "As expected, super nice product. Face ID is beyond awesome, the phone looks vey different & better from the previous versions.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Iphone X is perfect! Flipkarts Delivery sucks", "review": "Phone is definitely awesome. \n\nFaceID is definitely much better than touch ID. It gets faster and faster as it learns more from every unlock. \n\nDisplay is definitely the best I have used on an iPhone. \n\nNotifications personal to a users eyes is also an amazing feature. \n\nBattery life has definitely improved as it can survive a whole day with a heavy user like me. \n\nAnimojis are fun and the envy of my friends..haha \n\nIn total, I m definitely impressed with this device. \n\nI was able to preorder the 256 GB space grey. My decision to go with Space Grey was definitely right. Looks classy. \n\nThe only disappointment was with Flipkarts  Delivery. \n\nEven after the preorder on 27th, Flipkart failed to deliver my phone on launch day because my shipment was travelling from one warehouse to another the whole day. This was frustrating.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Nov, 2017", "reviewer": "Aviral Gupta"},
{"rating": 2, "title": "Bad quality", "review": "Price is too high..  Only apple brand costs u 95k..  Not worth it", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Dec, 2017", "reviewer": "Shailaja Dash"},
{"rating": 5, "title": "Perfect product!", "review": "Best apple phone till now, very compact in size, easy to use in one hand, face id works every time till now, rear camera quality is excellent, front camera quality is good not the best, lack of 3.5mm headphone jack but sound output is very good though..", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jan, 2018", "reviewer": "Aritra Das"},
{"rating": 5, "title": "Finally a refreshed iPhone experience in years!!", "review": "The phone reached me as promised on the launch day by flipkart. So full marks to flipkart for speedy delivery. \n\nAs far as the phone is concerned, I would say its a great phone. I have been an iPhone user since the time of iPhone 4 and have bought every iPhone since then. This time Apple has bought something new as compared to the iPhones in the past. \nThe iterations of iPhones were becoming boring and no revolutionary feature was being added by the company, iPhone X definitely changes it. So its  not a boring iPhone like the other ones.\n\nStarting with my experience:\n\nThe display is the main highlight here. Its sharp and gorgeous to look at. You will definitely be happy with it. The chin on top is unnoticeable after few minutes of using the phone.\n\nThe battery life is insane. Heavy users can expect a full day battery and for light users, it can last upto 2 days! Its  Definitely better than iPhone 8 plus for that matter.\n\nFaceId also works really well and I dont miss the TouchId. \n\nPerformance is brisk without any lag as expected. No issues there\n\nCamera performance is also great, especially the new studio light effects and front camera portrait mode feature! I would say you wont Be disappointed from the camera of this phone. Although its similar to the camera of iPhone 8 plus upto a large extent. \n\nFinally to conclude in brief, overall iPhone X is a great phone. The only issue is: Price of the phone is on a higher side which could have been much less in my opinion(compared to the pricing in other countries). Otherwise its the phone to buy, instead of the iPhone 8 or 8 plus if you want to upgrade from older iPhones or if you just dont want a boring old iPhone platform. I think it is worth it over the iPhone 8 plus at least.\nI hope this short review helps you in deciding your purchase of this device. Cheers!!\nP.S: Go for the silver colour. I think it pops more. Grey looks more generic and unrecognisable as a iPhone X.. xD", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Nov, 2017", "reviewer": "Parth Kumar"},
{"rating": 5, "title": "Fantastic phone and great service from Flipkart.", "review": "Excellent delivery service, within few hours of launch. Great phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Jayanth Ramachandran"},
{"rating": 5, "title": "Excellent phone", "review": "Theres no doubt that the iPhone X is an amazing device and thats the reason for everyone wanting to get one. The experience could have been better because I have read reviews of rest of the lucky ones who got the phone delivered on 03 itself whereas mine was delivered on 04 after a number of calls to find the status. The reputation of the seller was very doubtful as per the reviews however I took a risk and Im glad that the experience was not so bad.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Poor packing", "review": "Bamb Cheez by apple but poor packing by flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2017", "reviewer": "The Khan"},
{"rating": 5, "title": "Perfect product!", "review": "💯% genuine", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Dec, 2017", "reviewer": "Ashish Kumar"},
{"rating": 5, "title": "Amazed by the phone.", "review": "Awesome phone. Amazing delivery experience.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Rishi Anand"},
{"rating": 5, "title": "Early Impressions of World's Most Awaited Device - iPhone X", "review": "Okay, so here it is... iPhone X (it's 10 - TEN and not 'Ex' or 'X'). Before I jump to iPhone X, let me quickly comment on Flipkart's service. They delivered before the date committed (6th Nov was scheduled date whereas product received on 5th Nov itself). While delivery was scheduled for 6th Nov, fans/early adopters do expect launch day delivery and thus it would be appreciated if Flipkart can plan the same accordingly to reach all the pre-order on launch day or a day later than 2 days+. Also, the customer care team is trained to give you rhetorical answers and that can be improved.\n\nAlright, coming back to business, iPhone X is definitely a few years ahead of the competition. The Face ID is so damn good, accurate and reliable. Works like magic. The front notch doesn't bother me and new gestures become familiar in just a few hrs as the base of iOS remains same. The camera is so damn good, that people would want you to click their pictures to be used for display pics on social media. The Design is amazing and feels premium. The glass and steel just combine edge to edge to give you a singular unibody design. Super Retina Display is so damn amazing, the contrast ratio is far far far better than previous iPhone and the black is so deep that it gives you color perfection while looking at it. Am still getting used to the True Tone display, however, you do have a facility to turn the same off. The Processor is so fast, you don't even have to wait for apps to load anymore. Even last year's iPhone (7 series) feels slower in front of A11 Bionic Processor. \n\nAm keeping this really short. If you want it, can afford it, just go for it, cause you don't know if there is a better tomorrow. If you have any other queries or questions and need specific answers, do drop me a note on my twitter @purav_mehta", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Nov, 2017", "reviewer": "Purav Mehta"},
{"rating": 5, "title": "Must buy!", "review": "Undoubtedly best iPhone ever", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Nov, 2017", "reviewer": "Amit"},
{"rating": 5, "title": "iPhone X perfect gift for your loved ones", "review": "Feels nice to hold iPhone X. Yeah it does all that is said by Apple and I have not yet faced any issues as of now :) The phone delivery by Flipkart was swift and quick, shout out to them. And thanks for the surprise gift from Flipkart. Lol", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Really Nice", "review": "Amazing phone but delivery was kind of late I was expecting in the first week..I am an android guy from last 5 years this is my first phone so I am comparing same segment android phones :\nCamera 4.5/5\nBattery 3.5/5\nLook 5/5\nstrength 5/5\nDamage risk - high\nSpeaker 3.5/5\nEarphones 4/5\nProcessor 5/5\nCostly - Super expensive", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2017", "reviewer": "Gaurav kaushik"},
{"rating": 5, "title": "Brilliant", "review": "Yes i agree that its a bit too over priced (Not to forget that even Samsung Note 8 is comparable at price with iphone X) . But oh my god, this is an impeccable beast with sublime performance and premium finish. You wont regret paying the huge amount. Because its an absolute stunner <3 And special thanks to flipkart for delivering the product on the release date itself - Go for it if you have the budget. Trust me, you wont regret <3", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Nov, 2017", "reviewer": "Akhil Prasad"},
{"rating": 4, "title": "Value-for-money", "review": "Product is great offer is also great but dilivree every slow..", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Jan, 2018", "reviewer": "Rahul Gupta"},
{"rating": 5, "title": "Excellent phone, as expected.", "review": "Everything as advertised and listed. Though, delivery could have been faster. Delhi to Delhi delivery took more than two days!", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2017", "reviewer": "Ravi Sharma"},
{"rating": 5, "title": "iPhone X is the most beautiful beast", "review": "iPhone X is the most powerful device inspite of beautiful look. Animogi is amazing, no other phones is having these feature. The new way of unlocking the lock feature is Face Id. Its very good.\nEnjoying using iPhone X.\nKudos to Apple innovation.", "verification": {"CERTIFIED_BUYER": true}, "date": "22 Nov, 2017", "reviewer": "AMIT K"},
{"rating": 5, "title": "Wonderful", "review": "The best phone ever. Great interactions. Great battery life. I am loving the face ID.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Ajinkya Karale"},
{"rating": 5, "title": "Classy product", "review": "On time delivery and very good mobile.....i phone x is best....", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "KHIMANI MOHAMMED AEZAZ"},
{"rating": 5, "title": "Super!", "review": "The Revolutionary product from Apple.The best display and love the face Id which is super fast .", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Nov, 2017", "reviewer": "Sita Rama Reddy T"},
{"rating": 5, "title": "Shipping speed disappointed me a lot", "review": "Product is good but Shipping speed is very slow", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Dec, 2017", "reviewer": "siripurapu sunitha"},
{"rating": 5, "title": "A Technological Marvel", "review": "This phone is a delight. FaceID is just so good that you almost forget that it is there as a primary layer of security. Build quality is immaculate. The phone has a good heft to it and feels substantial and premium to touch. This radical new iPhone is a must buy for those who want to experience everything Apple.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2017", "reviewer": "Soumyadeep Dutta"},
{"rating": 5, "title": "Terrific purchase", "review": "Awsome phone thanku so much flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Nov, 2017", "reviewer": "Saalim Smarty"},
{"rating": 5, "title": "iPhone X", "review": "Awesome product by Apple and superb delivery by Flipkart.I just loved it.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Nov, 2017", "reviewer": "Chavalla Sai"},
{"rating": 4, "title": "Good", "review": "Product is good delivery is vary bad", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Mar, 2018", "reviewer": "Ashok Kumar"},
{"rating": 5, "title": "SUPERDEAL DEAL REAL FLAGSHIP PHONE", "review": "I am in love with this phone. Smooth as silk no hanging or lagging. Got ₹6000 discount, ₹10000 cashback, ₹10000 old phone buyback. What else do you need. Face ID is flawless even when lightswitched off. Camera is best in class. Wireless charging very useful at work place. Absolute perfect size. Compact yet a large screen to view. Brightest screen.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Mar, 2018", "reviewer": "COLONEL AMARPREET SINGH"},
{"rating": 5, "title": "iPhone X is simply awesome", "review": "Simply awesome!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Dec, 2017", "reviewer": "Sean"},
{"rating": 5, "title": "Simply awesome", "review": "Good but late delivery", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Dec, 2017", "reviewer": "dhanesh khanna"},
{"rating": 5, "title": "Wonderful", "review": "Best iphone....\nCompact size not too big \nBest battery life on a iPhone \nScreen is oled \nCamera's are great with potrait lighting feature which is unique n awesome", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Dec, 2017", "reviewer": "syed shoeb"},
{"rating": 5, "title": "Simply awesome", "review": "I am in love with my new Iphone X, thank you flipkart for the extra fast delivery. Just loved it.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Perfect product!", "review": "Excellent phone", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Dec, 2017", "reviewer": "kapil  Kushwah"},
{"rating": 5, "title": "Perfect product!", "review": "No home button, all gestures making it so easy to use. OLED edge to edge Display is killer.\nLoving animojis.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Dec, 2017", "reviewer": "Swapnil Godambe"},
{"rating": 5, "title": "Wonderful", "review": "Timely Delivery. Good packaging.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2017", "reviewer": "Shikhar Bhatnagar"},
{"rating": 5, "title": "Best phone:)", "review": "Too delicate..Too beautiful:)", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2017", "reviewer": "Abhishek B R"},
{"rating": 5, "title": "Great Service by Flipkart", "review": "Feeling happy with new IPHONE X.\nThis is first time had purchased high value product through Flipkart. Product is genuine and delivery happened within the given time frame.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2017", "reviewer": "Suryakant Sawant"},
{"rating": 5, "title": "Brilliant", "review": "Flipkart delivery was quick..but my iPhone x is heating and restarting every single minute what to do????", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2017", "reviewer": "Nagprasad Gowda"},
{"rating": 5, "title": "The best ever", "review": "The best iphone/phone till date. Great performance and the best picture clarity..Portrait mode is the main attraction. It is not at all an over priced phone. Flipkart delivry was delayed :(", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Dec, 2017", "reviewer": "Vishnu vee"},
{"rating": 5, "title": "5stars to flipkart", "review": "Superb phone really exceptional flipkart service n delivery 5stars to apple n flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "happy", "review": "happy", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Nov, 2017", "reviewer": "sanjay kapoor"},
{"rating": 5, "title": "Very Good", "review": "awesome phone , best feature , very handy .I got delivery on next  day .", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Best phone", "review": "phone is kind of ultimate innovation by apple...thanks flipkart for timely delivery", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Nov, 2017", "reviewer": "pulkit gupta"},
{"rating": 5, "title": "Awesome!!!!!", "review": "Perfect on-time delivery from Flipkart! Product received in excellent condition, and exchange handled nicely as well! All in all, 5 out of 5 for excellent service!!!!!\n\nJust a heads-up, I bought this phone and got it delivered at a different address than mine, and Flipkart used the shipping address as Billing address on invoice. Make sure you mention your name even if the address is someone else's, so that the Bill is in your name.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "Inder Kumar"},
{"rating": 5, "title": "Awesome Phone", "review": "Im in love all over again. Its an excellent phone with great design. No comparison at all.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "Abhi Joshi"},
{"rating": 5, "title": "Super!", "review": "Expensive but OlED is realy great", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Amol"},
{"rating": 5, "title": "Perfect product!", "review": "Delivered on time with right product.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Terrific purchase", "review": "Delivered right on time", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Nov, 2017", "reviewer": "Dipanjan Das"},
{"rating": 5, "title": "Brilliant", "review": "Nice product got it on the day of the launch for pre ordering. Nice phone but very expensive.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Nov, 2017", "reviewer": "Godwin Arthur"},
{"rating": 5, "title": "Best phone! Best service! Best buying experience!", "review": "Best iPhone yet. Loving the experience. \nFlipkart delivered on its promise. \nGot delivery on the 4th as guaranteed. Youve found a new fan in me! Will recommend one and all to always shop on Flipkart!\nThank you.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Nov, 2017", "reviewer": "Naman Khettry"},
{"rating": 5, "title": "Day 1sh", "review": "Day 1sh Just Amazing", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Nov, 2017", "reviewer": "Emidio Gomes"},
{"rating": 5, "title": "Iphone X is a great phone", "review": "This phone is mind boggling with great features and excellent camera ,, love this phone :) :) design is soooo swaggy with awesome display..", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Nov, 2017", "reviewer": "abhinav talwar"},
{"rating": 5, "title": "awesome mobile I even seen", "review": "Great product by apple", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Nov, 2017", "reviewer": "Praveen Katragadda"},
{"rating": 4, "title": "Smartphone of the Year 2017", "review": "I always embraced the notch\nI was big fan of the design\nYoull be blown away by the sound of speaker\nPhotos sharpness and edges can be improved over software updates\nSlow mo video and 4K at 60fps is jaw dropping.\n*Pro tip - If you have the budget go for it you wont regret ;)", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Dec, 2017", "reviewer": "Utkarsh"},
{"rating": 1, "title": "Poor service of seller", "review": "Phone was awesome..but pathetic service of seller...seller takes 7 days to dispatch the order and 10th day i got my parcel.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Dec, 2017", "reviewer": "Harshdeep Khanna"},
{"rating": 2, "title": "Could be way better", "review": "Fairly prdinary product. Not worth the money. It's twice the thickness compared to any of it's competitor's/predecessor's. \n\nIt's the same screen and tech as what a lot of other phones bring in at half the price point. \n\nOn the upside the UI is well organized and designed. Typically apple. Underpowered overpriced product which was designed well in parts and marketted well as a package.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "A Supreme buy.", "review": "A nice product from Apple. Fully satisfied with it and it is satisfying the price tag. Bravo.", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Jan, 2018", "reviewer": "Sriram Pattanayak"},
{"rating": 5, "title": "Terrific purchase", "review": "This is the best Smartphone on the planet   I have Been using iPhone since 6 years but this is the beast \n\nFirst impression is awesome when it comes to display and speakers.\n\nConsumer satisfaction defined by Flipkart.\n\n\n################THIS IS IPHONE X GIVEN BY FLIPKART############", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "MANOJ NAVADA"},
{"rating": 5, "title": "iPhone x", "review": "Awesome packing by Flipkart and phone look pretty gud", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Nov, 2017", "reviewer": "Kushboo  Jain u"}
]