[
{"rating": 5, "title": "Best in the market!", "review": "Rating tym...\nCamera=8/10\nSound(dolby atmos)=10/10(crystal clear)\nProcessor=8/10\nBody=10/10(metal)\nSensor(fingerprint)=10/10 less than 1 sec(quick)\nDisplay(full hd)=10/10(all colours)\nBattery=10/10(fabulous)\nColour=#golden(1st)\n              #dark grey(2nd)\n              #silver(3rd)\nI hope this review is helpful for u...\nPlzz like", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2016", "reviewer": "KRISHIL  SHAH"},
{"rating": 5, "title": "Terrific", "review": "Awsome phone loaded with good features im quite impressed with this phone first of all i would like to thank flipkart for its fast dilvery .\n* phone looks good with its colour \n\n*camera quality was also good in low light it take average pics but in day light its performance was superb\n\n*its new ui system was an new experience and its feels good \n\n*gaming experience was an ultimate in this phone\n\n*phone has almost 1.3 to 1.4 gb of ram will free which is an another good thing\n\n*its battery performance was also an amazing thing \n\n*Dolby atoms sound system was great thing in this phone \n\n*it consists 2 Nano sim slot and an memory card slot we can use either a 2 sim slot or 1 sim and memory card \n\n*there r some minor issues that it wont have an inbuilt apps like gallery and music app \n\n*no heating issues while using\n\n*  it is better than redmi 3s prime in many ways in camera, in built vibe UI SYSTEM,hd display,sound system and more over Lenovo have more service centers than mi \nSo overall Lenovo k6 is really an kickass phone \nIf u like this review  plz hit the like button\n\n#suhas.r", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2016", "reviewer": "Suhas Teju"},
{"rating": 5, "title": "Terrific purchase", "review": "Firstly thanks to Lenovo for a beautiful phone under 10k\nI'm writing this review after using this phone for a week\n\nThe good things on this phone are,\n\nGood Display with 1080p resolution\nDolby Atmos works superb \n3GB of ram does pretty well and 1.3GB ram is free \nMetal body is good and very similar to Redmi3s\nCamera is excellent with pro mode\nDual app feature works fine\nNo lag while playing games\nIt has good Battery life last for one and half day even with more usage\nFingerprint sensor is faster\n\nBad things are,\n\nPlacement of speakers\nSlow charging\n\nI didn't find anything else worse than the above\n\n\n\n\nOverall it's been a great phone under 10k better than Redmi 3s\nAnyone wants to buy a phone under 12k this is the best one\nIf like my review smash the like button.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Jan, 2017", "reviewer": "Praneeth Vasthi"},
{"rating": 4, "title": "Wonderful", "review": "The product is quite good.\nCamera- 9.5/10\nScreen-10/10\nSound-10/10\nBuild-9/10\nLook-8/10\nPerformance- 9/10\nBattery-9/10\nAfter sales service-7/10\nOverall the performance is well\nLooks perfect\nValue for-9/10\nI must say that it is better  than Redmi 3s prime\nIn some specifications.\nFlipkart delivery was nice.\nThis phone has a light UI so the phone not hang as the heavy MIUI's.\nI declare that my review is not biased and  I am not intentionally hurt anybody. If Anybody feels offensive pls hit the dislike button. If Anybody likes then hit the like button.\nThanks.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Mar, 2017", "reviewer": "Ratna Bhattacharjee"},
{"rating": 5, "title": "Great product", "review": "Best product comparing with Le ECO 1s, Le2, Redmi 3S, Note 3, 3S Prime and other 10k approx. Devices.\n\nReviewing after 4 days of usage......\nIf u r looking for budget oriented smart phone go for K6 power.\n\nPros:\n4000mAh battery\nQualcomm Snapdragon 430 (bit smaller compared to note 3) but works fine\nAndroid Marshmallow 6.0.1\n13 MP rear facing with Sony sensor camera\n8MP front facing camera\nDolby Atmos enabled\nVR and compass sensors\nFingerprint Sensor\n\nCons\nQuick charging not available\nDual SIM slot ( either 2 SIMS or 1 SIM and sd  card)\n\nTested battery by charging once after receiving the product from Flipkart (on time delivery). \nBattery is too good you can use 25+ hours by charging 3 hours. It gets 5 out of 5\n\nMarshmallow is good and Lenovo is bit slow in launching Android updates. Mostly it takes 3 to 6 months for Noughat.\n\nTested camera - whatever the features provided are enough.... There are some features which are necessary are not provided.\nBut camera performance gets 4 out of 5\n\nSound quality with Atmos is flawless and even tested with earphones. Great quality.\n\nDisplay 1080p HD screen with 5 inch screen.\n\nVR works fine and compass also works fine.\n\nFingerprint Sensor is little bit more responsive compared to Lenovo K5 Note.\n\nThe thing I was unhappy with the phone is quick charging. I tested with quick chargers but did not work.\n\nAs most of the devices have same format of  either inserting both SIM Cards or Inserting a SIM Card and SD Card.\n\nIt supports VOLTe . Tested with Jio works good.\n\nThanks to Flipkart for faster delivery and on time delivery. Nice packing.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jan, 2017", "reviewer": "Sailendra Damaraju"},
{"rating": 5, "title": "Super!", "review": "Lenovo K6 Power ******\n\nFirst I want to say it is the best mobile under 10000k also rather than Redmi 3s Prime...\n\n*Display- FHD that is very good thing also its display clarity and also you can see 3d  video by long pressing power botton and choose VR\n\n*Sound- I can't say about its Dolby Digital Audio because all you know about Dolby sound quality\n\n*RAM & ROM- 3GB & 32 GB a very good thing  it left almost 24 GB internel memory for your personal use\n\n*Android Version & Interface- Android 6.0.1 Marshmallow and Lenovo Pure Vive UI is the best combination among all the budget mobile under 10000k which make this mobile very very fast and very very powerfull\n\n*Camera- Rear 13MP &  front 8MP which is very good but I think rear flash is bit low. After all these camera capture a very good picture\n\n*Fingerprint- Fingerprint unlock is the very important part in this mobile which take your print of your finger very very fast less than a second\n\n*Hybride Sim Slot- You can able to use a sim and a micro sd card or use two sim card  at a time and both sim are nano sim card type\n\n*Network- Oviously 4G VoLTE faciality and double sim 4G VoLTE also\n\n\n*******At last I want to say again that the **Lenovo K6 Power** is the best mobile rather than Redmi 3s Prime. Do you thik  to buy Redmi 3s Prime then I suggest that don't buy Redmi you can buy K6 Power that is a very best choise of yourself.....", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Jan, 2017", "reviewer": "Akash Mondal"},
{"rating": 2, "title": "Mic problem", "review": "voice cant be heard by other side clearly", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Jan, 2017", "reviewer": "RAJNI  SUNDARSINGH"},
{"rating": 4, "title": "A straight and honest review and detailed comp with 3s prime", "review": "without waiting time i'll tell u what t's worth then decision is up to u...\nassuming u already read the description and features lets go to performance \n3 gb ram out of 1.2 is free for flawless usage... didn't had any hanging or rebooting issue with this one, i'm a heavy user,as my data is on 24/7 and my all social and the apps are always running in background  i  still get a whole day of non stop processing i.e, battery backup is good but not as grate as xiomi redmi 3s prime it's bcz of the screen resolution k6 power wields 1080ppi screen where as 3s prime has  720ppi. and over that 3s prime has 100MAh extra battery.. so i have used both alternately i have both of em so i'm honest here... 3s prime is about half a day more lasting than k6  power.\nboth the phones have same hardware and on board features so there is no difference in performance... let me rank them,\n1. Gaming, both have same Adreno 505.. i played nova , modern combat,asphalt 8 and asphalt nitro, and i was freaking impressed there was not a single frame drop, not even a slightest hanging flawless and superb experience in both of them but i noticed some warm up in 3s prime while playing but not in k6 power . so for gaming i'll give 9/10 \n\n2. Battery , k6 power has 4000MAh of lithium polymer battery where as 3s prime has 4100 MAh it isn't much of a difference but  still xiomi has a lead \n\n3. Sound,, k6 power has 2 Dolby atoms rear facing speakers and 3s prime has mi louders simple.. 3s prime dosen't stand's a chance of comparison \ni use Dolby atoms in k6 power with sony head phone they realy change the experience of listing music.. without headphones the sound ok k6 power is impressive and loud with rich base and surround sound i'll give 10/10 for sound in k6 power.\n\n4. Display .. k6 power is holding a full 1080 hd  ips display where as 3s has 720pp HD.. watching movie or hd vedios on k6 power gives rich experience i'll give 8.5/10 for the display because of it's high resolution display it consumes more power..\n\n5.storage..both have 32 gb interna out of witch in k6 power's android consumes 8.01 gb and available for user is 24gb wher as in 3s prime gives 25 gb free for user  so i'll give 8/10 for storage\n\n6.design.. both of them has uni body full metal body .. but especially for me i think k6 power has a better build quality science i have seen some tear and wear on 3s prime some paint loss and some fading but k6 is holding good, i have accidentally dropped it  once or twice too but had no issue.\nk6 power is a tad thicker and bulkier than 3s prime but weights same in hand and usage but i like the hold of k6 power, but it has some round edges which makes the phone slippery as a soap so u have to be careful with that bcz none have the glass protection so investing on screen protecter will be a good precaution..i'll give 9/10 for looks and build quality  \n\n7. ''CHARGING'' now guy's do read this one carefully bcz there is a twist that will make u re think again before purchasing..\nwhile charging both the phone take around 2.30 to 3 hours to full charge from 0-100 as both of the comes with 5.2v 2 amps charger but-but-but \nwhile charging lenovo k6 power heats up like a hot plate u can defiantly cook an omelet for free of cost LOL the highest temp while charging was recorded 48.7 d's this is a major problem with this phone,. and u should know heating is the biggest enemy of battery bcz of heating battery looses it's backup power and eventually it will reduce it's performance too so consider this as a good advice and use a 1.2 amp charger it'll take some time to charge but will ensure your product's long and healthy life i tested and use a moto 1.2 amp charger it work's grate and doest not heat's the devie while charging and backup is also good .. but it does not heats up while heavy usage it becomes warm just a little like arround 38 d's that's common... but with xiomi it dosen't heat's much while charging but sure does when heavy used. \n \nNO doubt k6 power is the best supper phone for 8999, but it has it's own problem like over heating while charging despite of that u get 1080ppi of full hd screen and doubly atoms, build quality and looks of k6 power is better than 3s prime  \n\nso now u know every thing about k6 and it's rival 3s prime .... now decision is yours to make... so  now which one will u chose.\n\ni'll personally suggest u to go for k6 power bcs it has more features and better build quality than it's rivals  it's worth every single rupee.\n hit like if u find it use full and vise-versa... thank you for reading", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Apr, 2017", "reviewer": "Abhishek Madhusudhan"},
{"rating": 1, "title": "Did not meet expectations", "review": "Same mic problem in both mobile.\nI have returned the product due to mic problem(Call receiver not gating clear voice, voice is so slow that it is not recognized) in first mine set.\nBut but ... when I have received new mobile in reacement then same problem got started after 12 days in second mobile also.\nIn starting both mobile was working smoothly but after few days mic problem started.\nMobile features are very good,\nLooking is very beautiful, performance is good, battery life is also good.\nBut I am disappointed with mic problem.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 May, 2017", "reviewer": "sharif khan"},
{"rating": 3, "title": "Just okay", "review": "Pros: Camera's quite pro, the features are good. Super sleek design, with good battery backup, Processing is good, touch is perfect. \n\nCons: The fingerprint is not accurate as per the standards, doesn't require your own fingerprint sometimes, and hardware failure for fingerprint every alternate day with message: Fingerprint hardware missing.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2016", "reviewer": "Tanay Bhatt"},
{"rating": 1, "title": "Microphone is very Bad.", "review": "*Drawback*\nMic not working fine\nAfter reset camera quality getting low\nRAM consumption is very high \nI am very disturb with mic literally and no support from Lenovo service centre.\nPictures getting blurr after zoom .pixels breaking ....", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Dec, 2016", "reviewer": "Dev"},
{"rating": 5, "title": "Brilliant", "review": "It's very comfortable phone 10/10\nCamera is very good 10/10\nBattery awesome 10/10\nTouch sensitive is really good 10/10\nBut Delhivery Courier Service is very bad and if u r COD customer u r getting delivery within 3 to 4 day's \nBut if u r already paid u r delivery is minimum 10 day's", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Dec, 2016", "reviewer": "Hari Kumar Thadoju"},
{"rating": 4, "title": "BEST PHONE TO BUY UNDER RS 10000/-", "review": "FULL REVIEW :-\n\nPROS:-\n1) FULL HD DISPLAY\n2) COMPACT SCREEN SIZE\n3) INTERNAL MEMORY\n4) HIGH PERFORMANCE RAM\n5) GOOD BATTERY LIFE\n6) BOOM BOOM DOLBY SPEAKERS (DUAL)\n\nCONS:-\n1) LOW BRIGHTNESS LEVEL WHEN UNDER DIRECT SUNLIGHT\n2) HYBRID SLOT ( INSERT 1 SIM & 1 MEMORY CARD OR BOTH SIM CARDS )\n3) HEADPHONES QUALITY NOT AT ALL GOOD\n4) NON-REMOVABLE BATTERY & NON-REMOVABLE BACK PANEL \n5) NO GALLERY ICON IN MOBILE ( PLEASE DOWNLOAD 3RD PARTY APPS FROM PLAYSTORE )\n6) MOBILE CHARGER IS VERY BIG ( DIFFICULT TO CARRY )\n\nTHANK YOU,\nSHANTANU HUMBARWADI", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2016", "reviewer": "Shantanu Humbarwadi"},
{"rating": 5, "title": "Terrific", "review": "Nice mobile,\nGood touch response \n430processor work nicely\nVoice is clear and sharp and loud to,\nYou tube stream is fast ,comparing to other mobile", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Dec, 2016", "reviewer": "Sachin  Patki"},
{"rating": 1, "title": "Absolute rubbish!", "review": "Guys be carefully there is problem in mic . Because of this mic issue... On call we need to struggle lot . . Thanks", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Jan, 2017", "reviewer": "Anand Mathapati"},
{"rating": 5, "title": "Classy product", "review": "Cool phone.....cool specs.....cool feel......don't think.....go for it....or u will regret it later.............\nI m writing this after use..\n\nPROS:\nOsum storage\nOsum fast\nCool interface\nBest fingerprint sensor\nCameras....... wow factor\nDolby speaker .... Amazing high quality sound..\nBattery backup ........ :-) Very good\nNo lags while playing high end games..\nIt has notification light ..... White color.\n\nCONS:\nHeating issue .... But thats negligible.\nThe charger design.... Doesn't suit to me\nEarphones.....could be better..\nBoth are Nano SIM....and one with option for either SD card or SIM.\n\nSo that's it........and under 10k it's probably the best phone till date....I guess....hope this helps.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "Shubham Singh"},
{"rating": 5, "title": "Worth every penny", "review": "# DETAILED REVIEW AFTER 1 WEEK #\nPros:-\n1.Good general performance and processing speed.No lags so far.\n2.Multitasking is fluid and has no Ram management issues like Redmi note 3.\n3.Full HD display.\n4.Gaming is smooth in light and medium graphics.\n5.Speaker sound is excellent and very loud.Best in budget segment for sure.\n6.Super front cam (8MP)\n7.Build quality feels solid with metal body.\n8.No issues with network reception and VOLTE is working well with Reliance Jio.\n9.Good battery life.Lasts one full day with heavy usage.\n \nCons: \n1.No in-built screen protection.\n2.Back camera is average.Low light image quality is bad.\n3.Hybrid sim tray.\n\nMy Verdict:\nThe best phone you can buy below Rs.10000 for sure at present.Personally i prefer this over other options.Hope this review was helpful!", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2016", "reviewer": "Nikhil Raj"},
{"rating": 5, "title": "Simply awesome", "review": "Best phone.  camera is good and battry backup very good ..one of the best is finger print apps lock. And sound is superb.and delivery in one day .i realy like it..", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Dec, 2016", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "Its a great phone.Go for it \nPROS :-\n1. Its build and design. Metallic body looks stunning. And very well built the whole phone.\n2.  Battery Life. Its just superb.  Take 3 hrs to get full charge and it lasts for 2 days with average usage and more than 1 day with extreme usage.\n3. Rear camera. Very good in sunlight but in low light conditions, its average.\n4. Stock Android UI. No lags and RAM is enough available for multitasking. 1.5Gb RAM available for you all the time after installing the apps.\n5. VoLTE. Jio sim works fine with great speed.\n\nCONS:-\n1.Front camera.  Photo quality is good but the camera is not wide angled. Not too many person can come in one selfie.Redmi 3s has wide angle front camera.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Dec, 2016", "reviewer": "Sumit Punia"},
{"rating": 5, "title": "fabulous phone", "review": "its a very nice phone in this price. highly recommended.\nthanks flipkart for quick delivery \ni got it in just 24 hour of my order.\nand thanks flipkart for delivery in lucknow.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2016", "reviewer": "Prem Shukla"},
{"rating": 5, "title": "Simply awesome, but its a Hybrid Slot Phone...", "review": "Excellent phone...\nFirst look device is compact and classy.\n\nUpdate- I have been using it for 4 days and general performance is very good.\n\nUI is good,Now its looks like a stock android. Lenovo removed unnecessary apps and general perfomance is good and you can also uninstall remaining useless apps also, which is a good thing.\n\nFingerprint sensor is super fast, performance is smooth.\n\nStorage - Out of 32 GB, 24 GB is free at the time of first boot. Ram is free around 1.6 GB for first time out of 3 GB.\n\nHybrid Slot- You can use 2 Sim only or 1 Sim+ 1 micro sd, not 2 Sim+ micro sd at a time. So if you want all three slots working at the same time, Don't purchase it. \n\nCamera is good or above average, on par with Redmi 3s prime, low light photography is average at its best. If you want mainly a camera phone, you may be disappointed.\nBuy Honor 8 or something like that but you have to spend a lot of money for a good camera phone.\n\nBattery life is very good with full HD display.\n\nDisplay- Display is good colors are sharp and near accurate but Brightness is somewhat average but that is not problem for me because I prefer Battery life.   \n\nJio 4G- I have been using it along with aitel, and network reception is good.\n           Speed of net largely depends upon the area you live and network coverage,     and Now a days Jio network speed is drastically decreased as the number of people is increased, but call quality is good for me.\n    \nGaming perfomance is good but ram fills up quickly, lenovo must notice this problem and give a update to its users.\nSo Gaming on redmi 3s prime > lenovo k6 power because of its HD display as compared to Full HD display of this, I am talking about higher frame rates (smoothness).\n\n\nand at last I gave a overall rating- 4.5/5.\n\nIf you don't want to buy Xiaomi Redmi 3s prime, then surely buy this. \nFlipkart services is good, but I don't get the offer on Moto Pulse 2 headphones so flipkart don't do false ads.\nAnd please hit the like button.\nI hope this review may be helpful for many buyers who want to buy this on next sale.\nThanks for reading.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "Abhishek Maurya"},
{"rating": 1, "title": "Microphone is faulty", "review": "I have not a good experience as this product has a microphone issue. I can hear but other person cant hear me. today i noticed.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jan, 2017", "reviewer": "Satyadev Yadav"},
{"rating": 5, "title": "YAARO GREAT PHONE HAI _ Red Mi 3S prime Se kahi achchha hai", "review": "Awsome phone loaded with good features im quite impressed with this phone first of all i would like to thank flipkart for its fast dilvery .\n phone looks good with its colour \n\ncamera quality was also good in low light it take average pics but in day light its performance was superb\n\ngreat Full HD dic on 441ppi \n\nits new ui system was an new experience and its feels good \n\ngaming experience was an ultimate in this phone\n\nits battery performance was also an amazing thing \n\nDolby atoms sound system was great thing in this phone \n\nit consists 2 Nano sim slot and even it supports memory card with 2 nano sim simultaneously so its an another feature\n\nthere r some minor issues that it wont have an inbuilt apps like gallery and music app \n\nno heating issues while using\n\nit is defnetly better than redmi 3s prime in many ways in camera, in built vibe UI SYSTEM,hd display,sound system and more over Lenovo have more service centers than mi so by all this Lenovo k6 power has more advantage than redmi 3s \nSo overall Lenovo k6 is really an kickass phone \n\nRed Mi 3S prime Se kahi achchha hai isse jarur lijiye", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "Hitesh Nagriya"},
{"rating": 5, "title": "Terrific", "review": "Compact and Stylish Mobile but the delivery man was Disgusting.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "Mohd  Danish"},
{"rating": 5, "title": "Brilliant", "review": "Fabulous........simply superb", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Dec, 2016", "reviewer": "Radhakrishnan"},
{"rating": 5, "title": "Awesome", "review": "I got defected product. Fringerprint scanner stopped working and camera was not good. Flipkart replaced it within 3 days. Now phone is working properly.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "Tamal GHOSH"},
{"rating": 2, "title": "Moderate", "review": "Review after 17 days of use .\nPros -\n1) battery backup - excellent.. full day in 4G .End of the day u ll have 30% left with u.\n2) front camera excellent better than rear camera.\n3) Sound wise very loud but not as good as Lenovo k3 note. K3 produce less sound than power but make u feel good.\n4) cahrge time decent. Not fast charging but ok.\n5) screen is bright even under sun which is very important.\n6) Finger print sensor is also price.\n7) Ram, processor is fast. U LL have 1 GB ram saved after downloading apps.\n\nCons-\n1) hybrid sim slot.\n2) Rear camera\n3) Screen flickering issue .\nCalled up Flipkart they helped but again it creates problem. \n\nOver all nice phone", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jun, 2017", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Simply awesome", "review": "Cool    good product by Lenovo        \nBattery good   \nBefore buying you can watch videos on YouTube  which help you to know features and comparison with other phones.\n\n\n\nDefault apps run slowly", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Mar, 2017", "reviewer": "Ajay Phulwade"},
{"rating": 4, "title": "needs time for evaluation", "review": "feels little heavy , looks good , not sure about performance yet .cheers", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Dec, 2016", "reviewer": "karthik raja"},
{"rating": 5, "title": "Must buy!", "review": "Excellent phone nice look good design and battery also good", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2016", "reviewer": "Bala Nagendra Dhaniyala"},
{"rating": 1, "title": "Lenevo K6 DO Not Buy", "review": "Even after the replacement i still have mic issues with the new phone. The other end  person is not able to listen anything.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Apr, 2017", "reviewer": "Mudassir Fareed Fatihi"},
{"rating": 1, "title": "Very poor", "review": "phone is getting over heating.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Feb, 2017", "reviewer": "sripad sai"},
{"rating": 2, "title": "The product could have been much better!", "review": "This is the first time I am writing a critical review. I usually only like to appreciate things.\nHowever, 2 unexpected inconvenient situations faced.\n\n1. This phone was ordered from the flash sale. Even though I managed to get one and get it delivered on time, I found that there were some hardware issues. Even the product description wasn't explicit about 2nd SIM slot being only usable for SIM or Memory Card. \"Hybrid\" slot that was mentioned in the description could also mean that the slot is designed in such a way that both Nano SIM as well as Memory card can be used together. Anyhow, giving them the benefit of doubt, I went ahead only to find out that the fingerprint scanner has some hardware issue. Sometimes it detected the fingerprint other times it doesn't. Even the Jeeves technician checked it.\n\n2. When I asked Flipkart for refund as I thought K4 note is much better than K6 Power and my wife has been using it for last 1+ years, Flipkart said we can only replace and not refund. I had a similar experience with Amazon but I must explicitly mention that Amazon did not argue or debate about it. I asked for refund and they processed it. It just shows that Amazon is actually so customer friendly than Flipkart. I'm not sure if I will purchase anything further from Flipkart anymore.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "Prashant Kankokar"},
{"rating": 1, "title": "LENOVO K6 Power....NOT GOOD PHONE", "review": "I PURCHASED THIS PHONE THROUGH FLIPKART BUT HAS PROBLEMS....\n1. GETS HEAT UP....EVEN WHEN IT IS IDEAL\n2. BATTERY DRAIN AUTOMATICALLY\nWHAT IS THE USED OF 4000MAH BATTERY WHEN IT IS OF NO USE....ONE HAS TO CARRY CHARGER ALWAYS..", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Apr, 2017", "reviewer": "Pradeep Bansal"},
{"rating": 2, "title": "heating problem", "review": "gets hanged many times and devices gets heated during charging", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Dec, 2016", "reviewer": "Nagsingh Devda"},
{"rating": 5, "title": "Reviewed Everything Except Gaming", "review": "(Feel sorry for the people who got defective products. It is possible for one or two pieces from a large scale manufacturing batch to be defective. Fortunately, I didn't receive any defective piece. So, the review is only about the phone without any hard feelings. I don't have time to play games. So, no comments on games. Do not waste time expecting to read about gaming).\n\nUser Interface/Experience: Mostly stock experience of Android. No non-sense UI. It's neat, uncluttered, organised and easy to use. EXCELLENT - 10/10.\nDisplay: Stunning resolution. Excellent for reading text. The rendering of font is brilliant. Screen is sharper. EXCELLENT - 10/10\nVideos: Very good resolution. I just felt while the colours are rendering there is a bit saturation. 9.5/10. VERY GOOD - 9.5/10\nAudio: I use Sennheiser CX 300 II in ear phones which is one of the world's best ear phones. The stock ear phones are useless and I never use stock ear phones in my life. So, my experience may be definitely better. I also suggest to buy a good ear phone always.  Dolby quality is for real and certainly a differentiating factor. It enhances the \"feel\" of the audio especially at max volume. Bass is excellent on the phone. Singers voice when I hear melodies sound slightly sharper. But the same sounds normal without Dolby. Overall, I still rate Dolby effect on the phone is for \"real\" and very impressive. OUTSTANDING - 10/10. \nTouch Experience, Hardware, Speed etc: Very effective, quick, very negligible lag noticed when too many apps opened, no hangs noticed. EXCELLENT 9.75/10.\nCamera: It's difficult to understand without posting actual images. So, I just rate directly. EXCELLENT 9.5/10. \nGaming: No comments.\nWeight,Size: Handy, sufficiently gripping. EXCELLENT 10/10\nFinger Print scanner: Very fast and efficient. EXCELLENT 10/10\nBuild Quality: Sturdy. EXCELLENT 9.75/10\n\nFinale: I especially fell in love with 'outstanding' Audio quality and if you listen to songs often, think no further. I rate this phone slightly better than Redmi 3s Prime for it's audio and video quality. \n\nOverall Recommendation: BUY.\n\nDon't forget to like/dislike the review. It may help others.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2016", "reviewer": "Sreekanth"},
{"rating": 5, "title": "Brilliant", "review": "First of all, it is a great product within 10k. I am really loving it. I am writing this review after a week use, here are my opinion on its different components :-\n\nDisplay - Probably the best thing about the product. It is simply amazing. Even redmi cannot compete with it in terms of display. Its resolution 1920×1080 really outclasses any other products in this price range. 5/5 for display.\n\nBattery - 4.5/5 , While it might not be the best but it is pretty good. I myself play heavy games all day and i am a heavy user, for me it lasts a whole day, maybe 1 1/2 day. Even if you play heavy games for 8 hours a day, you will still find yourself charging the phone maximum once per day. So battery is pretty good.\n\nCharging - I would rate it 4/5. I have noticed that it takes an average 3 hours to charge from 5% to 100%. One thing i liked very much is it doesnt heat up much during charging unlike mi phones which becomes almost a gas stove while charging.\n\nProcessor speed - 5/5 , great job on it. No lags expirienced. I have even played games like fifa 14, fifa 16, gta san andreas on full graphic settings and there was not a single lag. Love the gaming expirience.\n\nRam - Again as above the games were played smoothly. Also you will find about 1.5 GB ram free even after loading your phone with lots of apps which pretty good. 5/5 for it.\n\nStorage - Again another great thing of this model. A storage of 32 GB from which you get 24 GB free is pretty big enough in my opinion at least keeping the price in mind. 4.5/5 for it.\n\nCamera - I found it way better than redmi 4 or redmi 3s prime camera. Its rear camera is way better. Even a 5 year old can tell the difference just by seeing it. Coming to the front camera, 8MP is just too good for some cool selfies. I am impressed with the quality. 5/5 for it.\n\nSpeakers - Mind blowing 5/5. Dolby atoms speakers totally rock. You might not get the difference just like that but compare it with another phone like redmi 4 or redmi 3s prime and you will see the difference. Totally love it.\n\nThats it for now. If you are looking for a good display and camera, just go for it, totally worth it for this price.\n\nIf you agree with me, please leave a like.\nDon't agree? Feel free to dislike. \nThanks and have a good day!", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jul, 2017", "reviewer": "Sanjoy  Sen"},
{"rating": 1, "title": "Waste of money!", "review": "My mobile is having a display screen shaking issue when scrolling the screen up and down.", "verification": {"CERTIFIED_BUYER": true}, "date": "19 Dec, 2016", "reviewer": "Ibrahim basha"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Wow this is the best budget phone under 10k..Camera is awesome,battery is great,multitasking is smooth without any lag,gaming is ultrasmooth.Those posting negative feedback must be with defective piece.No issues,Go for it guyzz..!!!!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Dec, 2016", "reviewer": "Faraz Hussain"},
{"rating": 3, "title": "Good Phone at this price range...", "review": "I got the phone on the first flash sale on 6th dec, Phone delivery was delayed by a day. After using the phone for 3 days below is my review :\n\nPros:\nRAM Performance\nQuick Finger Print Sensor response\nFeatures\nNear Stock Android experience\nGood Quality Selfie Camera\nSound Quality\nSpeaker Quality\n\nCons:\nHeating up while charging.\nHeating up while talking on the call for long time.\nAverage Display quality, Inspite of being a Full HD screen the pictures look grainy.\nFinger print sensor is awkwardly positioned at the back.\n\nRegards,\nVenu Avanapu", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Dec, 2016", "reviewer": "Venu Avanapu"},
{"rating": 4, "title": "Excellent", "review": "Some advantages and disadvantages pints:\n1. U can only use either two sim or one sim+ memory...not two sim and memory card at a time.\n2.metalic finished means not metal at all...only looks like metal but looks good quality .\n3.built-in app lock application... Excellent for security concern.\n4. Have volte and multiple purpose finger print scanner, Dolby Atmos.\n5. Other things are very good...go for it blindly.\n6. Better than Redmi 3s prime.\nAfter 1 yr...Big issue is microphone problem.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2016", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Good choice", "review": "Great battery life. Great display. Multitasking is smooth. Decent camera. Fingerprint reader is quick and accurate 9 out of 10 times. Call quality is pretty good. Pretty great device for media consumption given the full hd display which is crisp and punchy along with Dolby Atmos enabled stereo speakers.\nGaming also pretty impressive high quality graphic games are playable and very responsive. Doesn't heat up much.\nOverall a great package for ₹8,999 .\n\nHave been Using the phone for a week now.... All above mentioned pros still there. The phone hung up a couple of times. Also noticed a few hiccups here and there.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Apr, 2017", "reviewer": "charu"},
{"rating": 4, "title": "Excellent power backup", "review": "As per model name it provides excellent power backup even with internet turned on...Performance is good..However, I am not satisfied with it's camera quality. Otherwise good product.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Dec, 2016", "reviewer": "Hitesh  Lade"},
{"rating": 1, "title": "Horrible", "review": "I had bought dis phone on 23rd december. Very bad touch ..you need to touch thrice to make a selection gallery option is not there so u need to go to file manager every time. Earphone is ordinary..and it lag too many times since the date of purchase. I personally suggest every1 who is going to buy this go for red mi 3s price cheaper and better phone from this ..I had made a blunder mistake by trusting lenovo.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Jan, 2017", "reviewer": "shobhit agrawal"},
{"rating": 4, "title": "Value-for-money", "review": "Perfect to gift parents", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2016", "reviewer": "Deepak Veshala"},
{"rating": 2, "title": "Could be way better", "review": "I bought this phone of 9999/- but on the next day Flipkart was selling the same product of 8999/-.\nThis is wrong.\nBenefits should be given to all customers....", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Apr, 2017", "reviewer": "Lokendra singh Singh"},
{"rating": 1, "title": "Hated it!", "review": "Device is getting hang frequently", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jan, 2017", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Not good", "review": "Sometimes it's hang when heavy task...", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Dec, 2016", "reviewer": "Ajit Kumar "},
{"rating": 4, "title": "Very Good", "review": "Good phone", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2016", "reviewer": "KESHAV KUMAR"},
{"rating": 5, "title": "Deserves 5 star, Premium phone at this price !!", "review": "Simply excellent at this price range\nTop features - Display very sharp and bright, fingerprint scanner very fast, Dolby sound makes it amazing... \nLove this phone...", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2016", "reviewer": "Gurjeet Singh"},
{"rating": 4, "title": "Detailed Honest Review After 6 Day USe", "review": "I have been using this mobile for last six days , its definitely a best budget Phone Under 10K We Can't Get More than this in this range \n\nDisplay \nFull HD Display : Display is one the best feature of this phone , Cristal clear display when used indoor , but it is not good that much good outdoor but still a very descent display . \n\nRam :\nTheir is no lag , fast responsive We can use several apps at a time , even after opening many apps there is still 1GB free RAM available . Its the best \n\nMemory :\n32 GB Inbuilt but System OS Occupies 8 GB Only 24 GB is available for User , the pnly bad thing about this is It;s a Hybrid Slot so Either we can use Two at a time or one sime one memory card .\n\nCamera :\nCamera Quality is the best you can take UHD pics the 13Mp Back Camera outdoor images are far far better than indoor , front with 8Mp is definitely best You Can get \n\nBattery :\nBiggest advantage of this phone is 4000Mah Battery which last more than 1 day for moderate user , even for a heavy user it will give better result\nthere is some time slight heating issue which is because of  metal back cover . overall best battery \n\nSound :\nAudio quality of the mobile is at it's best , loudspeaker produces best audio , if you have good earphones you will definitely enjoy the sound , a theater like sound \n\nThat's it all from me \n\nIf your budget is around 10000 then go and  grab it , because it's steal deal there is also Redmi 3S prime available for 9000 but if you look at service of  both lenovo and Xiomi lenovo has the upper hand \n\n\nPros :\nBattery\n3GB ram\nFull HD Display\nAtoms Dolby\n\n\nCons :\nHybrid slot \nNO Glass Protection (no gorilla,)\nphone is slightly heavy there are chances screen breakage that if you mobile fell down to the ground \nEarphones : basic quality earphones not good for listening for music", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2016", "reviewer": "SANTOSH K"},
{"rating": 1, "title": "Waste of money!", "review": "* VERY VERY DISAPPOINTED *\n\n\nOn 8th Dec, I got 2 Kenobi k6 power mobiles...\nwhich was my year ending blunder...\nVery very disappointed...\non the both mobiles..\nStill I'm under trials...\nLater I g for return..\n\nDEMERITS of the device...listed a few here.\n\n1. No voice cal clarity....very poor n low volume\n2. On Video call, it displays 40% video n 60% dial pad\n3. Speedy battery draining\n4. On and off lagging\n5. Automatically switching off and sticking\n6.At times vanishes contact list\n7. No gallery n music inbuilt apps\n8. No quality in voice recordings\n9.No option for two Sims with one memory card\n10. No video clarity while video calling....etc a few..\n\nPlz don't go for this at any cost...", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2016", "reviewer": "NARESH GOUD GANDHASIRI"},
{"rating": 5, "title": "Worth for Money and Excellent Gift to Parents", "review": "Actually I am lucky enough to get the product in flash sale, After so many analysis ordered this product.\nI bought this smartphone for my mom as New year gift, And its her first smartphone.\nPros:\n*Camera selfie is coming too good- picture perfect , no need of special apps to hide the dots in your face.\n* Back camera is also good\n* Battery extends for 1.5 days if you are moderately using WIFI orelse one complete day with WIFI also\n*Charging happens very fast\n* Rest all features are as good as 15-20k mobile\nCons:\n* Gallery app is not present\nExperience from my Mom side\n* Actually since its the first smartphone she is using as her own, she is very much excited when she is learning how to send whatsapp messages, Audio messages, taking selfie.\n* Every mor she is sending some Good message with Good morning.\n* She is Tamilian, She knows English but not fluent, she is vigourously learning english to send messages without grammar(though i can install tamil version but still she loves this).\n* Its like when we were kids, how we would feel very happy during completion of Alphabets, the same excitement i could see in her face on each and every new thing she is learning in smartphone.\n*  Even the old generation also feels excited and happy- when they are up to the trend of youth.\n* She started using paytm wallet pay in shopping. she is 51 came from a lower middle class.\n\n* Kindly give the same experience to all your parents so that they will not feel odd in the current world. Like it and give this experience to your Parents, Grand Parents", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Jan, 2017", "reviewer": "Sundar Raj"},
{"rating": 5, "title": "Awesome", "review": "I Love This Phone Got it for 8999rs\nUsing It Since 3 Months\nHere Is The Pros And Cons\n\nPros\n1. I Got Nougat Update (lol Everyone Get)\n2. Battery backup is decent \n    8-9 hours screen on time with 4g\n    And 2 days for normal usage\n3. Dolby is amazing Sound is great loud and clear\n4. Front and rear camera both is awesome\n5. Fingerprint works so fast \n6.Support Vr\n7. Phone never hangs \n    Even after so many apps\n8. Amazing looks and 32gb Rom and 4gb ram\n9. I DON'T GET any mic problem\n10. display is clear and awesome full hd\nCons\n1. the earphone Provided Are worst\n      (But I use my Headphone)\n2. Hybrid SIM slot (1 SIM+ micro SD) or 2Sim\n(Not a problem for me)\nAnd No Other Con\n\nGo for this if your budget is under 10000 this can beat redmi 4 and redmi note 4 phone easily.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Jun, 2017", "reviewer": "Ashok Modi"},
{"rating": 5, "title": "Brilliant", "review": "Awesome phone  9/10 .\nRear Camera is good 8/10.\n Selfie camera wonderful10/10.\nSound quality up to the mark 10/10.\nProcessor are good 8/10.\nBattery 10/10.\nFingerprint scanner 10/10 (less than 1 sec).\nBuild quality 9/10\nOverall best class phone in this budget .\nValue for money phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Jan, 2017", "reviewer": "Alok Singh"},
{"rating": 1, "title": "Product great just on first look", "review": "3gb ram is just a number.\nPerformance is quite bad.\n\nJust 1 day of use\n\nGets heated up while charging\nHad to hard restart thrice due to sever hang.\n\nNot happy with d product.\n\nBuy something else guys", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Dec, 2016", "reviewer": "vishnu vijayakumar"},
{"rating": 1, "title": "Voice quality not good and the touch is also not working", "review": "The voice quality is not at all good. Not even audible during voice call. The touch sometime doesn't work.\n\nI think I got a faulty product. \n\nCan anyone let me know how to raise a replacement request.", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Dec, 2016", "reviewer": "Piyush"},
{"rating": 1, "title": "Terrible product", "review": "Phone is heat while playing game, using internet, Facebook, etc...", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jan, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Worst experience ever!", "review": "Bad mobile phone. Its mic not working properly.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Dec, 2016", "reviewer": "Poonam Aggarwal"},
{"rating": 1, "title": "Phone is good but Flipkart service is Bad.. Really Bad..", "review": "I am using this phone since 4 days. I faced out going call issues. When call someone or someone call me, that person cant hear my voice. Even touch screen is also not working well.\nI have requested for return and technician came yesterday and he also agreed this issue. But still there is no any update from flipkart. Please get my issue resolved ASAP as currently I am stucked with this issue.\n\n@Flipkart Team, Please improve your customer services. Check Amazon services. They are too far from you.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2016", "reviewer": "Timir Shah"},
{"rating": 1, "title": "Don't waste your money", "review": "I had bought dis phone on its 1st sale. Very bad touch ..you need to touch thrice to make a selection gallery option is not there so u need to go to file manager every time. Earphone is ordinary..and it lag too many times since it's only been 3 day old phone.i personally suggest every1 who is going to buy this go for red mi 3s price cheaper and better phone from this ..I had made a blunder mistake by trusting lenovo.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Dec, 2016", "reviewer": "shobhit agrawal"},
{"rating": 1, "title": "Useless product", "review": "Worst product from flipkart...When delivered 1st time there was heating issue when replaced the product then voice problm comes n got no help from service centrr", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Apr, 2017", "reviewer": "Amit  Chauhan"},
{"rating": 5, "title": "Metro Speed Delievery....", "review": "About phone.. is simply superb .....\ni Just love you and recommend to all my friends and family..\n\nSuper Lenovo.. \n\nand Thanks to Flipkart...", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Dec, 2016", "reviewer": "RAHUL YALLA"},
{"rating": 1, "title": "very poor product", "review": "CAMERA QUALITY IS ABSOLUTE POOR ,INSTEAD OF 13 MP IT SEEMS 5 MP AND AFTER ZOOMING -PICTURE QUALITY GETS BLURRED .\nAT ALL ,ITS VERY DISAPPOINTING TO PURCHASE SUCH PRODUCT FROM FLIPKART .", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2016", "reviewer": "Flipkart Customer"},
{"rating": 2, "title": "Could be way better", "review": "Mobile is good,but some problem in mike .No clear sound going.\nIf Flipkart exchange my mobile\nThen I am very happy.", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Dec, 2016", "reviewer": "Tripurari Kumar"},
{"rating": 1, "title": "Worst Phone", "review": "Phone is over hanging. Sometimes touch not working. Initially Sim slot not open I am contact service centre they told the key is not working.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2016", "reviewer": "Mohammed Younus"},
{"rating": 1, "title": "Don't waste your money", "review": "Unhappy With the Product\nIt is having mic problem Your voice will Not  heated to the person whom you are speaking\nAlso after purchasing online the Service Agent declined to make Service As The Product doesn't have registered IMeI  No", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Apr, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Brilliant", "review": "I started to use this phone today and it goes me awesome feel. Battery backup is awesome and I do not feel any heating issue so far and even when phone is on charging \n\nInstalled almost 70 new apps and they installed automatically as part of migration.   They all installed smoothly and have no lag so far whatsoever", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2016", "reviewer": "Ashwani Bhat"},
{"rating": 1, "title": "Very Good", "review": "Worst fone ever. \nMain problems\n--Mic problem \n--- Phone is very heated up while calls.. \n\nMore Cons:\n1.Rear Camera Could Be Better,But is Ok For The Price\n2.Earphones Are Below Average, They Should Have Given A Cover Instead Of Earphone.\n3.Gallery Not Available,You Need To Use Third Party Apps\n\nFinal Verdict: dont buy save money\nFlipkart took a really long time,wish to get better experience from flipkart in future..", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jan, 2017", "reviewer": "RItwik Das"},
{"rating": 1, "title": "flipkart bahut bekar mal bekta hai jaise patri par se kharid", "review": "CAMERA QUALITY IS ABSOLUTE POOR ,INSTEAD OF 13 MP IT SEEMS 5 MP AND AFTER ZOOMING -PICTURE QUALITY GETS BLURRED .\nAT ALL ,ITS VERY DISAPPOINTING TO PURCHASE SUCH PRODUCT FROM FLIPKART .", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Dec, 2016", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Terrible product", "review": "Product is really bad... Mobile getting heat while charging... Thinking to throw it as scared of blast of device.. in case of exchange options please let us know..", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Mar, 2017", "reviewer": "Kiran Kumar"},
{"rating": 2, "title": "Moderate", "review": "Not good performance\nCamera result very poor\nWhile downloading something no application or browser access to internet\nDuring volte video call 60% display covered with dial pad, only 40% video screen shown\nBettry drain fast", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Dec, 2016", "reviewer": "Hitesh Parmar"},
{"rating": 1, "title": "Screen is Shaking", "review": "Whenever i scroll up/down/left/right  or zoom in/out something screen is shaking while holding finger on the screen.Very bad experience its kind of irritating", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Dec, 2016", "reviewer": "Lalit Mourya"},
{"rating": 3, "title": "Terrific purchase", "review": "I'm using ths phn since jan 30 2017 \nCons -\nhuge heating while playing games .\nHeating while charging phn .\nCamera clarity in low light below average, especially front facing camera.\nLittle hanging while playing games ,and using 3rd party apps .\nLed flash is not good,but ok \nLenovo theme center is really really disappointing me :-(\n\nPros -\nGood display Full HD \nViewing angle is good \nSound clarity is awsome no words to say tht.  \nCamera in good light conditions is superb .\nProcessor speed is good \nFingerprint sensor is good nd accurate.\nBattery backup is really good .\nStorge is good available around 25 GB. \nRAM management is good .\n\nOverall this phone is good considering the price of 10 k \nBut this phone is not good for playing games (also small games like Subway surfers,bubble shooter etc.)\nCam is not best ,if u want a btr camera phn in this price asus zenfone max is rly gud option .\n  If u want a good battery backup phone, good display,good sound ,and good  performance go for it", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Jan, 2017", "reviewer": "Jithin Mathew"},
{"rating": 5, "title": "Terrific", "review": "Nice", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Dec, 2016", "reviewer": "Umesh Yadav"},
{"rating": 5, "title": "Contains all necessary elements of a decent smartphone", "review": "I received my phone 3 days earlier than expected  which i think is great service from part of flipkart service providers.\nThe phone looks great and contains everything necessary for a budget smartphone with such a decent price tag.\nIt is working smoothly and the fingerprint sensor is pretty impressive.\nIt didn't get heated up even after excessive usage of various apps and games on the smartphone which i feel makes this phone more attractive.\nThe primary camera is decent and secondary camera is not up to mark but overall it is also quite fine.\nThe highlight of this phone is the \"Dolby Atmos\" speakers which are a top notch and display is also pretty good.\nStorage capacity is sufficient for daily stuff and 3GB RAM makes it worth considering.\nOverall it contains all necessary stuff which one looks for for an under Rs10K phone.\nGo for it without any doubt.\n(The following comment was made after using the phone for a day)", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "NITIN KUMAR BOTHRA"},
{"rating": 5, "title": "Excellent", "review": "Very Very Fabulous Product.\nI am impressed to see this phne in this lower price.\nIt had delivered to me on TODAY.\n**VERY HIGH PERFORMANCE\n** NO HANGING PROBLEM\n**NO MIC ISSUE.\n** BETTER THAN REDMI 3S PRIME.\nSO guy if u like my review and iF it helpFull For you Then Hit the Like butten\nSo anyone has any problem in buying this Product this review  helps them.\n👍👍👌👌", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Apr, 2017", "reviewer": "Sanju Sharma"},
{"rating": 5, "title": "Brilliant", "review": "I have been using this phone since 9 December and i can give you the full detailed review now.\nPros:\n1. Extraordinary battery life.\n2. Gaming experience is exceptionally high and any game is handled at it's high settings very easily without any lag.\n3. The general performance is great, thanks to the 3GB ram.\n4. The rear camera is too good for this price range. It even gives you the manual mode which is great. It has a noise cancellation mic with it on the back.\n5. The front is also as good and clicks great selfies.\n6. The phones never heats up even after 4 hours of continuous gaming and watching videos on 4G network and then switching to WiFi for the next online multiplayer gaming of 3 hours.\n7. The screen is very beautiful and is truly full HD.\n8. The sound is extremely loud thanks to the dual speakers and Dolby Atmos.\n9. The screen despite not having any official word of Gorilla glass is tough as i had recently installed a tempered glass and before that the phone had fallen many times out of my hand.\n10. The fingerprint sensor is also fast and gives haptic feedback on touching it. It can also be used to let the sceen from going into sleep mode by touching and finger gently onto it when phone is unlocked.\n11. The flashlight i quite bright when used as a torch.\n12. The phone works well with 4G network and has VOLTE by default and gives a great battery even with 4G always on.\n13. There is a LED notification light on the front which is single colour i.e. white.\n14. The audio of earpiece is clear and the person on the receiving end also gets a clear voice.\n15. The GPS Bluetooth and built-in compass are quite fast and battery friendly.\n16. The network strength is also very good on the handset.\nCons:\n1. The phone does not have backlit capacitive buttons. But you get used to it after 4-5 days of usage.\n2. When using speaker while calling the microphone does not work as well as expected. The sound is also low on loudspeaker while calling.(compared to my last phone moto g2)\n3. This is not bight enough to be visible on a fully bight sunny day outdoors amd you have to find some angles for the screen to be visible.\n4. The phones is too slippery as it has full metal body. Kindly order a good quality cover with the phone as well.\n5. The phone is little heavy than your usual 5 inch screen phones due to the 4000 MAH battery but it is acceptable.\n\nIf you have any questions feel free to ask.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Jan, 2017", "reviewer": "Sidharth Gupta"},
{"rating": 5, "title": "good", "review": "product is good. \ndespite of having 4000mAh battery, phone charges in about 2hrs. \nphone boots up quickly.\n*no dual band wifi(only 2.4GHz band)\n*no multicolor led notification\n*data cable jams in usb port and its hard to remove.\n*a bit heavy(weight distribution is not good).", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jan, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Wonderful", "review": "Awesome ......in this price this phone is best", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "Mijanur Karim"},
{"rating": 5, "title": "Great product", "review": "Value for money", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "Rahul Jain"},
{"rating": 1, "title": "Absolute rubbish!", "review": "Redmi 3s prime.      vs         lenovo k6 power\n***                                                   *", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Feb, 2017", "reviewer": "Deepak  Kushwaha"},
{"rating": 5, "title": "Must buy!", "review": "Awesome", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2016", "reviewer": "Hussain Basha Shaik"},
{"rating": 1, "title": "Worst quality lenovo ..... supported by flipkart", "review": "SIM slots are worst quality, may damage without any usage. \n\nVolte calling half screen issue, can not be resolved, lenovo guys surrendered \nStarts heating on little usage \nBlue screen without any reason \nCamera Shutter Sound ON/OFF not available \nNot recommended \nGo for Mi Note4\n\nThe only mobile I regret to purchase in my life till now.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2017", "reviewer": "Vikesh Singh Bhadouria"},
{"rating": 4, "title": "Good quality product", "review": "Lenovo is doing very well in smartphone.Phone looks very good in hand,light weight, design is also good. Lenovo launcher looks impressive this time.fingerprint sensor is also fast and accurate. Camera is also good.So overall its good phone in this price range.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "Saurin Patel"},
{"rating": 4, "title": "Overpriced", "review": "I think supplied accessory Handsfree Earphone is not compatible with the mobile k6, it is not working..even not fit.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2016", "reviewer": "Rakesh Karnani"},
{"rating": 5, "title": "Just wow!", "review": "Pro's:\n1.good display\n2.good battery backup\n3.sound quality is super because it is Dolby Atmos.\n4.camera quality is good in day light and average in dark.\nCon's:\n1.the backside of the phone is sliperry", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Aug, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Best in the market!", "review": "Please I will request not to believe in one star ...this phone Lenovo k6 power is just awesome ...it's camera touch everything is just perfectly working", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Jan, 2017", "reviewer": "Sujata  Sinha"},
{"rating": 5, "title": "Classy product", "review": "Best phone if u think much u ill loose best phone at best pric... Battery life,,finger print sensor, audio and selfie camera is usp of this device also storage  is sufficient ram is more den enough \nBuy It!!\nSilver color is best amoung all colors", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2016", "reviewer": "Amit Nagori"},
{"rating": 5, "title": "Worth every penny", "review": "nice", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Dec, 2016", "reviewer": "indra dutt Dixith"},
{"rating": 4, "title": "Good quality product", "review": "Nice budget product..\nNo issues detected yet.\nOutstanding battery( runs 2-3 days in single charge for heavy usage, including 2 hrs video watching)\nMuch more than expectation camera for a price of 10k INR.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Feb, 2017", "reviewer": "Vishal Thakur"},
{"rating": 5, "title": "Simply awesome", "review": "I am a big fan of Lenovo and flipkart .\nThis is the best smartphone in this price (Rs9999). You could never find any other phone in this price .\nThe points that this phone made me crazy are \n\n1> unbelievable battery backup last up to 3day in my hand (4000mah + ultimate power server)\n\n2> Super sound quality with Dolby atom (360°)\n\n3> Mind blowing design( full metal body) , uniform distribution of the parts like camera , fingerprint lock etc\n\n4> Display is crystal clear with 441 ppi + 178° viewing angle) \n\n5> very fast performance with snapdragon 430 , 14 Ghz, 3gb ram + 32 gb rom (expendable upto 128gb) , support OTG with reverse charge \n\n6>Camera is also cool with sony lens (13Mp with the pro mode) front is also good(8mp)\n\n7> Fast fingerprint sensor + Dual app\n.. Ohh I have written  long like an essay . sorry! \nIf I have enough money then i will surely buy the k6 note also!!!! Oh god help me! \nAfter showing to my cousin he also wants this ! So i will buy it again on 18 Dec ! Yahhooooooo", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Dec, 2016", "reviewer": "Nayan Jyoti Haloi"},
{"rating": 4, "title": "Delightful", "review": "SO LETS START WITH\n PROS \n1.LIGHT WEIGHT\n2.REAR CAMERA IS VERY GOOD\n3.FINGER PRINT SCANNER IS JUST AWESOME\n4.OS IS VERY GOOD\n5. PHONE DOESNT LAGS OR SLOWS DOWN\n\nCONS \n1. FRONT CAMERA IS WORST AS YOU COMPARE WITH 8 MEGAPIXEL ITS EQUVALIENT TO 5 OR BELOW IT\n2.ITS NOT 3 GB U GET TO USE IT IS AROUND 1248 MB TO USE SO PLZ DNT BECOME A FOOL OF GETTING FREE RAM OF 3GB OR EXPECTINNG OF GETTING 2GB OR ELSE\n3.SCREEN IS 5 INCH FULL HD\n4. LAST FLASHLIGHT IA SLIGHTLY YELLOW IN COLOUR THAT BRINGS DOWN PITCURE QUALITY", "verification": {"CERTIFIED_BUYER": true}, "date": "4 Jan, 2017", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Good quality product", "review": "Nice product.. Battery life amazing...Speaker sound good.. Not great but a decent camera..One handed use..Overall a better budget phone.. \n\nCons: no fast charging.. average cam performance .", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jun, 2017", "reviewer": "Selva kumar"},
{"rating": 5, "title": "Fabulous!", "review": "Good phone excellent front camera,good back camera,good battery,good storage 32 GB + 3 GB ram,excellent sound quality ,no problem with micro phone I checked,good looking phone,\nOnly con is that smaller size compared to other phones but I am ok with the size", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Apr, 2017", "reviewer": "Ashish varghese"},
{"rating": 5, "title": "Excellent", "review": "Good product.nice battery and camera.", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Jan, 2017", "reviewer": "Pritam Dutta"},
{"rating": 3, "title": "good bt not best.., some hagging problem, camera is nice.", "review": "ok, bt  try mi prime", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Dec, 2016", "reviewer": "jitendra singh"},
{"rating": 5, "title": "Today at 5.30 Pm The phone is Dead", "review": "Best phone in this price range. After the November update a new feature of face unlock is available.\nIt's great to have such a feature in budget phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Dec, 2016", "reviewer": "Rajesh Sah"},
{"rating": 5, "title": "Terrific purchase", "review": "Best phone under 10K,", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Dec, 2016", "reviewer": "Mir Ilyas"},
{"rating": 1, "title": "Super Phone", "review": "Worst phone I have seen, mic stopped working in few days. The basic needs of phone it lacks, don't know why Flipkart is selling these product which ruins Flipkart image..", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Dec, 2016", "reviewer": "Nitesh ranjan"}
]