[
{"rating": 4, "title": "Worth 40K Every Bit", "review": "Excellent service from Flipkart in terms of delivery within 24 hrs of purchase and Installation from Jeeves within 24 hrs from Delivery.\n\nTV looks stunning. It is ultra slim and the display is great. You will enjoy 4k and HD content very well on this TV at the same time you will hate to watch SD content from the DTH services. So better opt for HD channels if you buy this TV.\n\nSound output on TV speakers is not all that great. Tried all different settings but could not find the optimal sound experience. However it is not so bad either. I can live with it. I mostly watch movies by connecting my JBL Everest BT headphones, so that helps me. There is no lag on Bluetooth.\n\nPatchwall is a mixed experience. I feel it is more of a gimmick. There are only 4 apps pre-installed, SonyLiv, Voot kids, Hungama and Alt Balaji. There is also you tube with has been sideloaded already. I have sideloaded opera browser which works excellent. The STB integration using IR blaster does not work well all the time with Videocon D2h. I greatly miss Prime video TV app. Hope MItv gets it soon as an update.\n\nMi Bluetooth remote is also good with minimal buttons. However within some apps it becomes difficult to manage with those fewer buttons. You will feel the need for more. I found a fix for this. The best feature I found is the MI Remote Android app. Install the app in your android smartphone and it works over WiFi network. You can use the MI Remote app to control your TV. Best part is you rotate your phone and the TV content will be mirrored on your phone screen. You can then use your smartphone as a touchscreen device for your TV. Use it to know it. Excellent feature.\n\nOverall I am satisfied with the buy. Thanks Mi for the excellent product and Flipkart for the great service!\n\nCheers!\nAR", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2018", "reviewer": "Aqib Rahman"},
{"rating": 5, "title": "Brilliant", "review": "PROS:\n\n- PRICE \n- 4k HDR 10 BIT \n- android TV\n- Fluid ,lag free interface\n- 60 Hz refresh rate \n- Super slim\n- Simplistic design, no stickers on TV\n- 3 HDMI + 2 USB\n- 1 + 1 year on panel warranty \n\nCONS:\n\n- SOFTWARE - Patchwall is really bad at this point of time (there no YouTube ,Amazon prime and Netflix )\n  APP SUPPORT -  All the app's need to be sideloaded which is very inconvenient\n- No internet browser pre installed \n- No Google play services installed , so none of the modern Google apps work on this TV \n-Use apps which doesn't use play services like silk browser or any others \n- Apps which i tested on the TV and are working\n       - MX media player \n       - Opera browser\n       - Es file explorer \n       - YouTube (Android TV version) works but search option        doesn't work , use your phone as remote \n\n- SOUND - good only when you install it on table top but on wall mount it's not up to the mark \n\nFEW MENTIONS: \n\n- PANEL - Black levels could have been better, Contrast is also not up to the mark but can be adjusted for better image quality , Viewing angle is not that great as advertised (178°) there is a colour shift but can be noticed only when more than (100°) so not that much of a problem , Bezel is thin on the outside the glass , but when ON you can notice the Bezel is present to some extent inside the glass \n\n- REMOTE -  very basic, but the TV support both mouse and keyboard so it's fine , support for other remotes is not know at this point of time\n\n- UPSCALING - Only full hd and 4k content looks good on the TV ,others look bad because of badly optimised upscaler and the size of the TV\n\n- AAA BATTERIES for the remote are NOT INCLUDED in the package, which is very strange so make sure you have 2 ready \n\nGAMING - Most of the games via console looks great , but there are some fast pace action game which at times show ghosting \nWhile gaming make sure that display profile is in Game mode as it has dynamic contrast option, 4k HDR games actually works better than normal 1080p games\n\n- Mi TV remote app is good , it has more functionality than the standard remote it self , inorder to make it work Both TV and phone should be on same WiFi connection    \n\n- PORTS postion is very bad, it very difficult to reach and plug in the Cables, these is very less clearance near ports so it might damage the cables if care is not taken while plugging them to the Tv, it is almost IMPOSSIBLE to plug in a cable after it is wall mounted - So plug the cables before wall mounting the TV and if possible keep usb Hub for later use\n\nOverall it's a great purchase for the best price , don't except too good quality especially if you are owning good TV before but for people upgrading from normal TV it will surely make a difference", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2018", "reviewer": "KRV09"},
{"rating": 5, "title": "Just wow!", "review": "Best TV out there in market.\nBest delivery and service by flipkart.\nMI best consumer satisfying brand.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2018", "reviewer": "Vishnu RS"},
{"rating": 3, "title": "Pretty good", "review": "Premium quality TV with respect to price. You should not compare this TV with the likes of LG or SONY \nPros: \n\n1.) Very Good screen. Patch UI is neat but needs work.\n2.) 4k Content looks great with some tweak in settings.\n3.) Gaming with this screen is awesom. U will enjoy it if u have PS4, PS4 pro or Xbox.\n4.) IR blaster works as it was advertised.\n\nCons:\n\n1.) Although youtube runs perfectly after the OS update, but you cannot watch 4k content on youtube. Max you can watch upto 1080p .(Mi customer care confirmed it)\n2.) After wall-mount its insanely hard to access any of the ports \n3.) Very Bad speakers. U have to have a soundbar or any external sound system to run with TV. (MUST)\n3.) Searching or browsing your DTH content with MI Remote is very difficult. (You will tend to use ur DTH remote as well.)\n4.) There is a considerable lag between tv picture and sound when used Bluetooth speaker. (Tested with JBL flip 3 (Bluetooth V4.0.1))", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Mar, 2018", "reviewer": "Tanoy Kumar Maity"},
{"rating": 5, "title": "Just wow!", "review": "Worth the money !", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Mar, 2018", "reviewer": "Ashutosh Patil"},
{"rating": 5, "title": "Wonderful", "review": "Excellent delivery service from flipkart. Awesome product from mi. Good installation service by Jeeves.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2018", "reviewer": "Karunakar Reddy Reddy"},
{"rating": 5, "title": "Terrific purchase", "review": "Super", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Feb, 2018", "reviewer": "Sraban Nandy"},
{"rating": 5, "title": "Classy product", "review": "Fantabulous, \nGreat picture quality.\nIf you connect this tv to your laptop through HDMI just wow.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Lohith Reddy"},
{"rating": 5, "title": "Reviewing after a month to highlight a few key points....", "review": "This is my review after using the TV for a month. Don't want to elaborate much about basic stuff already reviewed by others. Will highlight a couple of key points not said by others.\n\nGot this TV on the very first sale and the installation happened the very next day, But I  took my time to compare this with my Samsung Full HD 3D TV which I'm using since the past 5 years.\n\nThis is an EDGE-LIT LED TV and the backlight is not distributed evenly and you can surely make this out when the room is completely dark. Coming to the clarity as said by others is very good with good color reproduction, But it lags in contrast and dimming as with other high end televisions. The screen is not able to adjust the backlight at different points as with the micro dimming feature in SAMSUNG.\n\nAnd the next thing is the sound clarity which is good but lacks in Treble and Bass. The speakers are designed only to watch the normal cable television channels and not for Dolby audio.\n\nConnecting external speakers to it is difficult as the regular 3.5mm Audio out port is missing.  You can connect an external speaker by two options. One is with Bluetooth, But you'll face an audio lag. The second option is to use a HDMI audio extractor which can be connected to the HDMI ARC(Audio return channel) port at the back. This is not available with MI and has to be sourced from third party.\n\nComing to the conclusion. If this is you're first big television, Then you'll find the picture clarity amazing. But if you've already used other brands like SAMSUNG, SONY or LG, Then you'll find the picture clarity much better in these with Full HD than the 4K clarity in MI. The normal FHD to 4K upscaling is not good and blurs the picture. You can get a crisp picture only with 4K HDR. As said by others this is only a budget TV and you'll definitely feel it's worth for the money spent.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Mar, 2018", "reviewer": "Santosh N"},
{"rating": 5, "title": "Honest Review", "review": "Excellent Product, Timely Delivery, Prompt Installation.\n\nI would like to say that this Mi LED Smart TV is best in class in the price as well as the features given.\nThis is really a honest price of 40k ( 32k TV Price + 8k GST ). This price will really disrupt the TV market in India i believe.\nI was lucky to book the TV in this first sale, and to my surprise within 24 hours the delivery and also installation happens.\n\nExcellent Product : Not only the competitive price range, but also Mi hasn't disappointed the smart TV features and also Patchwall OS..\nTimely Delivery : After i booked yesterday 2pm, i received the product by 7am today from Ekart.. Kudos to delivery team.\nPrompt Installation : It was mentioned that Jeevas team will assign for installation for next day.. When i requested their customer care team, they immediately arrange 3 executives who came at 11am and they are very careful in installation taking some time without hesitation and also took time in explaning the demo and other details.\n\nI will write a detailed review after using for next one week. \n\nThanks to Mi, Flipkart, EKart & Jeevas..", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2018", "reviewer": "Mohanram M"},
{"rating": 3, "title": "MI TV 4 High on Expectations Low on Practicality", "review": "Practical problems with MI TV 4:\n\nBought MI TV 4 on first day of sale. It got delivered and installed in a day...phew that was fast. This excitement lasts only till the TV is lit up and \"patchwall\" welcome screen came on. After this point I hate to call it a smart tv. Reason: It only has Sonly Liv, Hungama Play and Voot pre-installed on it. Largely the content (note: latest) that I intend to watch on Hungama Play was available on rental of Rs.70 to Rs.120 (range) for 3 days; rental model in 2018 Seriously!! Sony Liv has least interesting content among the 3 and content is open to access for first 6 months (free subscription). Popular video platforms are not pre-installed.\n\nWhen wall mounted, side loading via pen drive or to that matter connecting any cord to the Gigantic TV is not at all possible. There is hardly any space and visibility between wall and TV panel to attach the cords. Given the thinness of the panel, it looks very delicate to demount it from the wall.\n\nXiaomi India, if you are reading this, request you to shout out to your fans regarding your plans to get more content for MI TV 4. I have been using and advocating about your mobiles for past 3 to 4 years. As a fan, my benchmark for this TV was higher in terms of practicality.\n\nWho can possibly buy this TV?\nThose who know side loading the apps on TV and this can help maximize the experience.\nPeople with loads of 4K / HD content. Given the size of display, regular content does not look good and this set is just not made for regular content.\nThose who intend to use TV as table top. That way you have complete and safe access to ports for connecting content sources.\nThose who live in a owned house or those who do not often shift from a rented accommodation. Jeeves currently does not offer reinstallation service according to installation engineer.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "Mylavarapu  Nikhil"},
{"rating": 5, "title": "Perfect product!", "review": "Can't take my eyes off the TV. I am big MI fan and I just love this TV. I have been waiting for this since it had launched in China. Enjoying every bit of it. Felt worth the money spent. \n\nCan't ask for more. Waiting for their wireless home theater to launch soon. \n\nMI rocks as usual !!!\n\nFlipkart delivered and instaltion by Jeevs were super fast.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2018", "reviewer": "Frederick  Richard"},
{"rating": 5, "title": "Terrific purchase", "review": "Amazing tv for this price range 4k hdr picture quality is very good and flipkart fast delivery with in 24 hours", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Mar, 2018", "reviewer": "R Giri Tharan"},
{"rating": 4, "title": "Impressive and affordable", "review": "Pretty decent TV especially for the price. Streaming 4K HDR content from Apple TV and PS4 Pro looks good but not the best. Black levels are not that great but again, its good for the price. \nCEC is a little glitchy (the tv shuts down alright when I turn off the Apple TV but restarts again for some reason). \nThe biggest problem I have is the position of the ports. Its almost impossible to plug something in after the tv is wall mounted. Best to get a swivel mount if youre gonna be changing cords often. \nNo other complaints, looks great, sounds okay, and definitely more than worth the price.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Mar, 2018", "reviewer": "aakash kumar"},
{"rating": 5, "title": "Must buy!", "review": "Super and excellent...", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "Ram Sudheer"},
{"rating": 5, "title": "Good product..Thanks", "review": "Best delivery and service by flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Mar, 2018", "reviewer": "Vipul Patel"},
{"rating": 3, "title": "Decent product", "review": "The price is reasonable at this quality... its not great but okay.\n4K HDR quality is not comparable with Sony.\nSound quality is worst... Dolby.. dts are just logos to advertize but in real... it plays like a 'dabba' radio\nDONT BUY IT !! \nThis is the real China quality product.\n40k you will get full hd tv from other brands has better quality than this !!\nI WISH TO RETURN IF THERE IS POLICY...BUT UNFORTINATELY NO SUCH OPTION!!", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Mar, 2018", "reviewer": "Janga Reddy Maddula"},
{"rating": 5, "title": "Nice product", "review": "TV performance is extremely good but some channel not working like hungama, limited episode in voot, etc. But TV look and feel is great", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2018", "reviewer": "Sumit  Verma "},
{"rating": 3, "title": "Does the job", "review": "Nice tv i like it but very much disappointed with the sound quality while screen mirroring from device wireless display sound quality is very bad. Mi should look after it .", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Mar, 2018", "reviewer": "Mohsin Vohra"},
{"rating": 4, "title": "Good Product But Need Improvement In OS", "review": "PROS\nGood 4K HDR movie performance\nGreat console gaming performance\n10-bit panel\nSlim design\nCONS\nViewing angles & black levels could have been better\nSound from the built in speakers could have been better\nPatchWall OS feels unfinished(Ex: YouTube)\nBuilt-in services don't provide content in 4K\n\nUse Aptoide app instead of google play we can directly download and install apps in TV(using mouse)\nUC browser is best in this TV...", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "vinay kumar"},
{"rating": 1, "title": "Utterly Disappointed", "review": "Worst product. Display of the TV went black within 15 days. Do not buy.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Mar, 2018", "reviewer": "rajesh kumar"},
{"rating": 3, "title": "Good", "review": "Not so great. Its just OK.\nYou get for what you pay. \nIts a value for money TV that's all.\nAfter exploring all the features here is my review\n\n1. The display. Elegant and vibrant ....9/10\n2. ‎Thr patchwall UI. The MI should have gone for default UI provided by google. Many bugs are there in patchwall UI(PUI). updates may correct it. But Now the PUI is not mature.\nThis UI will definitely irritates you   .........5/10\n3. ‎App customization/installation as per user requirement not possible/available. This actually is most desirable feature in any android TV.  ........0/10\n4. ‎Sound output ...The sound is clear but not loud. You definitely will think about home theater system after buying this TV.......6/10\n5. ‎MI remote. Nothing great in it.. .....7/10\n6. ‎The mechanical design of the TV is Bad. You want to access all ports ,then forget about wall mount or vice versa. Table mounting is always dangerous with the sleek design. Its not a portable one so why that much sleek is required?...............6/10\n7. ‎IR blaster provided free of cost but not effective. IR blaster ...we can use single MI remote to control TV as well as Set top box. But the problem with this is, it is not generating channel numbers correctly/ properly for my dish TV HD set top box. I don't know with others ..........4/10\n8. ‎not possible to use amazon prime, Netflix, YouTube......\n9. ‎Refresh rate........ Is only 60Hz. Difficult for action movies/sports channels..\n10. ‎Dont think about games in it.\n11. ‎Net Connectivity is good.\n\nWill update some more....soon", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Mar, 2018", "reviewer": "Babu Lal B"},
{"rating": 5, "title": "Wonderful", "review": "Thank you Flipkart and yejees", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2018", "reviewer": "Zakir A.K"},
{"rating": 5, "title": "Great product", "review": "Idk why the owners here are complaining about the picture quality, after fiddling around a little and setting adaptive backlight off , setting display profile to picture and switching on dolby surround sound in sound settings I'm fairly satisfied. I don't use cable so can't comment on that but streaming from any service at 1080p or even 720p the clarity is mind blowing for the price. I've used TVs from Vu to Sony X950 series and this is closer to the sony in terms of picture quality.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Mar, 2018", "reviewer": "BISHAL GOSWAMI"},
{"rating": 5, "title": "Highly recommended", "review": "Nice product , value for money, very slim ,flipkart very good delivery very fat secure good job flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Best in the market!", "review": "Every thing is very Nice but only some problem with miracast..", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Wonderful", "review": "Picture Quality: Perfect (10/10)\n\nSound: Not perfect, but its great. (8/10)\n\nRefresh Rate: 60Hz ie 60fps (10/10)\n\nWifi and Bluetooth conn: Works as advertised\n\nApps: 4-5 Apps, but you can download apk from net and can install it via pendrive, OR just install chrome apk through pendrive and connect mouse, download directly apk from chrome to tv and install. (10/10)\n\nPorts: If you put tv on table (10/10), on wall mount (2/10) as it will be very difficult to insert anything.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Mar, 2018", "reviewer": "Navjot Singh"},
{"rating": 5, "title": "Brilliant", "review": "Awesome product with lots of functionality in one like inbuilt WiFi, setup box, has own os ram n memory. And no doubt abt 4k.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Govinda kumar  Sah"},
{"rating": 5, "title": "Fabulous!", "review": "There is no words to explain the quality. \nFor  Everything 5/5.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Mar, 2018", "reviewer": "MUJAHEER HUSSAIN"},
{"rating": 5, "title": "Fabulous!", "review": "THE TV IS AWESOME BUT I CANNOT USE GOOGLE CROME IN THIS TV I DONT KNOW WHY I HAVE INSTALLED THE APP BUT IT DOES NOT WORK Any APP CAN U SUGGEST ME", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2018", "reviewer": "Aman Gupta"},
{"rating": 5, "title": "Perfect product!", "review": "Thank you Flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Amit Singh"},
{"rating": 5, "title": "Excellent", "review": "Amazing tv.. intially I don't have belief in xiaomi products. But I bought mi a1.. my opinion changed.. now mi tv 4... Amazing tv..  I bet if this product is launched in offline.. everyone will buy it only because it's of that quality. If tv is in showrooms Sony and Samsung will be biggest looser... Value for money.. for 40k they gave 1lakh product experience .. I recommend it.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Worst experience ever!", "review": "Patchwall is crashed every time.......\nNeed everytime master reset\nNEED URGENT UPDATE IN patchwall\n\nFor design 5 star\nFor looks 5 star\nFor patchwall -1 star\nFor build quality 5 star\nFor UI 5 star\n\nFor Tatasky patchwall not working correctly and it search the channel but not redirect to that channel....", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Mar, 2018", "reviewer": "Manjunath M"},
{"rating": 5, "title": "Excellent", "review": "Excellent Product.Only the concern  was sound system  as not as expected.please look into this", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Mar, 2018", "reviewer": "Sravan Boddu"},
{"rating": 5, "title": "Wonderful", "review": "Master piece best 4k tv at best price.. worth every penny awesome team work by Mi, Flipkart & Jeeves", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Mar, 2018", "reviewer": "Srinivasan R"},
{"rating": 5, "title": "Excellent", "review": "Best TV from MI I love MI..", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Fabulous!", "review": "The TV was delivered so quickly and the service ingenier came on that day .The TV is looking super compared to other TV's in the market it is so thin of 4.5mm lee's than my redmu 4x the TV comes with a very good packageing and it has a mi Bluetooth remote it has only eleven buttons and the remote is so tiny that it will fit into our hands and it come with a powercoard .  User experience is very smooth there is no lag the gives true 4k experience by playing a 4k input source to the TV .the patchwall os super easy to use the TV has three HDMI slots ,one Pendrive slot ,the sound output of the TV is crispy and nice .if you need to control your dish with the mi TV remote then you will get a IR blaster receiver Frome the service ingenier but you need internet to be connected to use the feature .the apps are priinstalled by the TV like miracast by this feature you can cast your redmi phone interference with the the TV the WiFi connectivity is fast and speed the overall the Mi LED smart TV is super and gives best experience in your home for less budget TV .I thank xiomi for bringing this TV to India and also I thank Flipkart for super fast delivery and I thank the service ingenier Jeeves consumer service for providing two years extra warranty for the TV of cost rupees 3499.I suggest that this TV for the buyer's who want to buy a new 4k TV for less budget getting around 55inches THANk YOU", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "Dhanush Nv"},
{"rating": 5, "title": "Terrific purchase", "review": "Awesome TV with best patchwall OS.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Really Nice", "review": "The delivery and installation were very quick - Great delivery & installation experience.\n\nThe TV display & audio quality is very good at this price point.\n\nSome of the (software) issues I faced so far:\n- The IR blaster didn't work with my latest Airtel Internet TV set top box (perhaps my STB doesn't support IR, I couldn't find clear documentation). It works via HDMI CEC to control channels on STB (prev/next only as there are no numbers on MI TV remote), but then I can't use the Sensy remote application in CEC mode. So I gave up on integrated remote for my STB. This seems like an issue that could be fixed in software - My Airtel Internet TV STB has Bluetooth remote. So if MI TV remote can intelligently pair between the TV & STB, this can be made to work.\n\n- The AI recommendations are not filtered for children (no option in settings), take care when viewing with family. Initial recommendations were really vulgar content before it even built a user profile. There was no login option, so it basically started with wrong default adult profile, so I was really surprised & furious. This needs a definite software fix with option for parental controls. MI needs to understand that Phones are personal devices, and TVs in the living room are shared devices.\n\n- 3-4 seconds Beep noise when switching to a HD channel (audio decoder taking time to switch, but they didn't mute the output in the meantime)\n\n- Unpredictable delay in audio decoder. I have SPDIF optical output connected from my STB to my Home theatre (my default viewing setup). I use both TV audio (better vocals) + Home theater (Better subwoofer) simultaneously. My Airtel STB has option to control the delay between the two decoders so that user can synchronise them correctly. I could configure it once, but the delay keeps varying on MI TV between different channels / even with the same channel. This causes too much echo. I can't keep adjusting the delay between the two decoders frequently.\n\nThe software needs some time to mature. For the current low price, this TV is a very good buy.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2018", "reviewer": "Kiran Ravinuthala"},
{"rating": 4, "title": "Value for Money...Good Picture quality but bad sound quality", "review": "Pros:\n1.Cheapest 55 inch ultra HD TV\n2.Better looks on wall mount, like premium segment tv\n3.USB plays almost all types of media file\n4.Jeeves installation service is top notch\n\nCons:\n1.Below average sound output,(Invest in Bluetooth sound bar)\n2.My existing LG Full HD tv display is better than ultraHD mi 4 tv while playing from videocon d2h HD settop box.\n3.TV switch on time is about 10-15 secs,which feels irritating", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Mar, 2018", "reviewer": "Rizwan Fadnaik"},
{"rating": 4, "title": "Decent product", "review": "Tv is outstanding... No doubt abt it. Picture quality is too gud, big screen you wl enjoy the movie to the fullest, os is vry handy. Premium luk. Whn u wall mount t u wldnt feel tat tv exist thr its tat thin... \n\nCONZ....\n-Wall mounting is bad... It jst stuk with the wall u wl nt gt easy access to hdmi port r usb ports...(hope mi wl come up with  btr wall mounts)\n- sound quality is normal, nt as expectd mre ovr we dnt gt 3.5 mm audio jac so tat u need to invest on buyn cable fr tat.", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2018", "reviewer": "Dinesh"},
{"rating": 3, "title": "Decent product", "review": "Expected too much with the Display. Average quality display. Sound is ok. Definitely doesn't feel like a 4k TV. Realised this is all you can get for 40k. The TV is huge and ultra thin. That's the only consolation. Do not have high hopes if you decide on buying it. It will just look big on your wall. If your a fan of quality display, definitely a NO. My LG 4K tv has a display that is at least 10 times better.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "John David"},
{"rating": 4, "title": "Brilliant", "review": "Full paisa wasul\n\nPros.\n1.Big and clear screen with great colour\n2.4K HDR\n3.Ultra slim body 4.9mm\n4.great packaging i have ever seen in a TV Box\n5.very easy to use and very easy to understand it's user interface\n\nCons.\n1.very very difficult to reach to the plug at back side in wall mount\n2.after watching TV for 1 an hour it's getting heat at lower end\n3.Lake of 3.5mm jack\n4.Lake of RC OUTPUT Port\n5.Bluetooth connectivity disturbance\n6.Useless antenna port and S/PDIF port", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "sirajul shaikh"},
{"rating": 2, "title": "Not good", "review": "Problem with sound...some times it stop automatically", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Just wow!", "review": "'Words can not represent what eyes are seeing\" this is for my  MI TV 4.\n\nBest quality, best design, best look,  best display, best color reproduction, best remote control, very good sound sufficient for big room or hall, and finally best best best price. This MI TV 4 is worth to buy even if the price is 80K.\n\nI feel so lucky having this on the 1 flash sale and being part of those who have got this beautiful MI TV 4 in India. I am completly satisfied with the purchace of MI TV 4.\n\nI played GTA 5 with 4K resolution on my dear MI TV 4  and the experience was amazing. I will write the detail review after few weeks of use.\n\nThank you MI for such a exalanty beautiful MI TV 4.\n\nNow we are waiting for sound bar and home theater system from MI, and happily wait for your another masterpiece.\n\nOnce again thanks MI team and Flipkart for best TV the MI TV 4.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "Ghanshyam Parmar"},
{"rating": 4, "title": "Worth for the price range", "review": "Flipkart\nProduct delivered in 18 hrs from ordering. \nJeeves\nInstalled within 5 hrs from delivery of the Mi Tv 4.\n\nVivid Colour reproduction, Patchwall UI looks Impressive\n\nWill post updated review after using MI TV for a while.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Feb, 2018", "reviewer": "Balamurugan"},
{"rating": 3, "title": "Does the job", "review": "I have 43 inch Sony android TV, comparing to this MI TV Sony is far far far better.\nWhat's good: \nSetup box synch with TV and showing the green progress bar.\nAble to operate from anywhere because remote runs with Bluetooth.\nScreen size in this cost range.\nColor accuracy is good.\n\nWhat's bad:\nVideos are not playing smooth, you can clearly observ at 1080p videos.\nNo upscaling for a 4K HDR TV.\nSound clarity is ok, not as good as Sony.\n\nI have tested playing content using WiFi, playing videos in 720p and 1080p from YouTube and other services in TV.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Mar, 2018", "reviewer": "SAI  CHEEDELLA"},
{"rating": 4, "title": "Worth the money", "review": "Overall it's a good TV with the price. The only thing inbuilt  speakers are  not much I expected.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Value-for-money", "review": "Hi Guys, This is my review for Mi TV 4.\n\nHope You are looking the exact problem for Mi TV. So please read this before buy.\n\nUtter Flop Sound - You cant even watch a BlueRay movie with awesome sound. I think this is their plan to make a worse sound for selling their Home teatre. \n\nYouTube Won't play 4K:- This is another Problem. I am using 50 Mbps Broadband plan and Youtube Won't show 4K or even 2K option. Maximum support quality in Youtube is only 1080p which is worst for a 55 inch TV.\n\nSome 4K won't Play:- Some 4K videos showing lagging while playing. \n\nNo Play Store:- I tried all possible version of Play store and none of them is working.So you need to manually install the supported apps on this TV.\n\nNo Head Phone Jack:- I don't know whether it is necessary or not, but there is no Jack for plugging head phone.\n\nDifficult to access Ports if Wall mounted:- It will be very very difficult to access USB, HDMI or any ports if you have done Wall mount.\n\n\nBut This is still the best 4K TV for this price range. 4K quality is extremely good. Many are expecting 4k quality for their DTH or Cable channels Lol. If you wanna test the 4K performance, download any 4K video and run it on your TV.\n\nI hope all kind of software issues will be solved in coming patchwall update.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Must buy!", "review": "Very amazing tv and I liked the installation provided free of cost as well and the engineer who visited to install was very good", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Classy product", "review": "good work by flipkart  mi tv came very safe and fast thank you for your good work", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Feb, 2018", "reviewer": "prashan Customer"},
{"rating": 5, "title": "Fabulous!", "review": "Just awesome. Best product .", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Feb, 2018", "reviewer": "Sougata "},
{"rating": 5, "title": "Fabulous!", "review": "Excellent service from Flipkart in terms of delivery and installation within 24 hours of Purchase.\n\nTV looks stunning. It is ultra slim and the display is great. You will enjoy 4k and HD content very well on this TV at the same time you will hate to watch SD content from the DTH services. So better opt for HD channels if you buy this TV.\n\nSound output on TV speakers is not all that great. Tried all different settings but could not find the optimal sound experience. However it is not so bad either. I can live with it. I mostly watch movies by connecting home theatre system or else on my MOTO PULSE ESCAPE HEADPHONES via Bluetooth.\nThere is no lag on Bluetooth.\n\nPatchwall is a mixed experience. I feel it is more of a gimmick. There are only 4 apps pre-installed, SonyLiv, Voot kids, Hungama and Alt Balaji. There is also you tube with has been sideloaded already.The STB integration using IR blaster does work well all the time with Tatasky. I greatly miss Prime video TV app. Hope MI TV gets it soon as an update.\n\nMi Bluetooth remote is also good with minimal buttons. However within some apps it becomes difficult to manage with those fewer buttons. You will feel the need for more. I found a fix for this. The best feature I found is the MI Remote Android app. Install the app in your android smartphone and it works over WiFi network. You can use the MI Remote app to control your TV. Best part is you rotate your phone and the TV content will be mirrored on your phone screen. You can then use your smartphone as a touchscreen device for your TV. Use it to know it. Excellent feature.\n\nOverall I am satisfied with the buy. Thanks Mi for the excellent product and Flipkart for the great service!\n\nDo like my review if found helpful.\n\nThanks.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Mar, 2018", "reviewer": "RAJESH  SHAH "},
{"rating": 5, "title": "Highly recommended", "review": "Awesome Product at awesome price.Installation is tricky as theTV is extremely fragile but flipkart had experts to do the same.fantastic experience on day 1. Very user friendly remote and seamless interface.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 2, "title": "Not good", "review": "TV is unable to detect the set top box signal. So the much talked about feature of navigating the set top box channels via TV guide is now useless.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Mar, 2018", "reviewer": "Chidvilasa Raghava"},
{"rating": 3, "title": "Good", "review": "Mi IR dongle is not working. Even customer support is unable to get it resolved.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Mar, 2018", "reviewer": "Pradeep Kumar"},
{"rating": 4, "title": "Value-for-money", "review": "Value for money TV with a few software hiccups!\n\nFirst off kudos to Flipkart and Jeeves for timely installation and demo in Bangalore.\nComing to the television...I have used it for a week now and here are my impressions:\n1) Sleek design.The panel quality itself is good.More than what you can ask for in this price range.\n2)Connectivity options are adequate and miracast is there which is good.\n3) TV and set top box integration leaves a lot to be desired. I found myself going back to the set top box remote more than once.\n4) if you have Amazon or Netflix membership you have to wait for an update of which the timing is obscure.The only way is to cast your laptop screen or use a HDMI cable.\n5)Content is good from Sony liv and Hungama play but regional language videos is not upto the mark.\n\nConclusion: Go for it without second thoughts. Mi TV won't disappoint you. With its sleek design and amazing value for money albeit with some improvements to Patchwall it is here to stay for a long time.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Mar, 2018", "reviewer": "Anand  Kumar "},
{"rating": 4, "title": "Good quality product", "review": "Simply amazing, great package at this price, 4 starts because it don't have play store.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Mar, 2018", "reviewer": "Sumeet  Gadge "},
{"rating": 5, "title": "Super!", "review": "This is a brilliant piece of art. Bezeless borders is redefined by this TV. Sound is decent, but a dedicated sound bar or home audio system should be considered. Installation and delivery was a breeze. Thanks Flipkart & Jeeves and of course Mi for this brilliant piece of tech.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Mar, 2018", "reviewer": "Angelo Mathews"},
{"rating": 5, "title": "Classy product", "review": "wowwwww Nice tv super display 4k videos are awesome and Dolby digital surround sound extraordinary .\nThank you flipkart and thanks Mi", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "kumaran baskar"},
{"rating": 5, "title": "State-Of-The-Art Technology!", "review": "Xiaomi Mi LED Smart TV 4 is quite impressive. Considering the price point, fluid performance, and features on offer, it delivers value for money. With more content partners on-board, it will be more compelling. Also, there are barely any smart TVs with such high quality display and premium design at this price in the market.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Mar, 2018", "reviewer": "Abhishek Mundra"},
{"rating": 5, "title": "Fabulous!", "review": "The best tv for the best price dont hesitate to buy", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2018", "reviewer": "padma vathi"},
{"rating": 5, "title": "Does the job", "review": "Great product...just launched in India...its a masterpiece..Got a small issue but got solved in a single day with excellent service...The technician who attempted the installation is fantastic...superb service from Flipkart.Don't have anymore words to say...Its a revolution...Thanks to Nagraj (Technician) for visiting and helping us again...Right from the starting, the open box delivery was great..The very same day, got the TV Installed on a wallmount in just 10mins...Thanks to Flipkart and Mi for the great product and outstanding service...", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Good one MI, but lets see the life of the TV ;)", "review": "I dont find a difference in sound like most people say...its great for me... mounted as table top.... picture quality is equal to Sony.... just make sure ur channels are HD .... very light weight OS with minimal apps...any extra apps like YouTube you can download... ultimate design....apart from this nothing bad.... Thanks to Jeeves for quick installation on the day of delivery itself....Also, there are some minor glitches in the OS.... but MI is working on it !!!\nWe need to wait 5 years to really know whether MI can stand in Market.....", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Mar, 2018", "reviewer": "Jai Vignesh  R"},
{"rating": 4, "title": "So close!", "review": "So I managed to order this from flipkart when the second flash sale took place. The TV was delivered the next day and on request was installed the same day by the fantastic team over at Jeeves. Have listed the pros and cons of the TV below;\n\nPROS\nStunning design. And so thin! \n\nPicture quality is very good. It's not as crisp as the displays on the higher end tv's, but compared to my Dad's 55 inch Sony LED from three years ago, it's exactly the same! Which is saying something at this price point! \n\nThe remote of the TV looks exactly like the Fire Stick and it works wonderfully. This sort of a remote and user interface makes so much sense. The patchwall UI is designed in the same tile manner that the Amazon's fire stick is. It's a refreshingly new way to interact with your TV. \n\nCONS \nI don't have quite a problem with the inbuilt speakers as people do but yes the trebble seems boosted and the mids feel compressed. Volume isn't the problem. Quality is. \n\nLack of modern audio ports is by BIGGEST issue with this TV. No headphone jack, no optical out! It makes absolutely no sense! They have given the option to connect via Bluetooth but that usually results in an audio lag causing AV to go out sync. I really wish they had another option rather than a Coaxial connector. Home theater is lying unconnected because an optical to Coaxial converter is so hard to find. This is actually my only grouse with this TV. \n\nAll in all if you're looking for a good BIG display and have a third party entertainment streaming device (apple tv, fire stick, chrome cast etc) don't think twice! If you figure the audio bit out or know where to get a damn convertor, drop me a message!", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Mar, 2018", "reviewer": "Maahir Zaveri"},
{"rating": 5, "title": "Very poor", "review": "My tv display was fault manufacturing problem flipkart refunded my amount.....never buy thus type of cheap product..bad picture quality", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Mar, 2018", "reviewer": "Kadiyala  Ganeswararao "},
{"rating": 5, "title": "Great experience", "review": "Best product in 40k ,value for money but user  manual not received.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "Arun Kumar"},
{"rating": 3, "title": "Decent product", "review": "Decent panel, for the price. I feel Patchwall could be tad overbearing if you your requirement is divided equally between online and on-air content. One thing is for sure is that the sound quality is rubbish. Not bad, but rubbish. In two minds of returning the tv just becoz of that. The large screen experience is totally marred by that.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Feb, 2018", "reviewer": "Akshay Chheda"},
{"rating": 5, "title": "Best TV better than Sony in Interface and Clarity", "review": "Excellent TV. Better than any brand. Very slim. Even slimmer than any phone. Excellent job by Flipkart. One day delivery, next day installation. Other Brands going to reduce their prices.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Pradeep Kumar"},
{"rating": 5, "title": "Super!", "review": "Excellent performance", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Perfect product!", "review": "Alhamdulillah TV is awesome 100% trust on mi & Flipkart", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Mar, 2018", "reviewer": "SYED  HASHMI"},
{"rating": 4, "title": "Very Good", "review": "I expected a lot from Xiaomi but not. Everything is good except the panel and we can see a slight bend on the top of the panel. Less contrast ratio, bad backlight not intelligent as other brands. The ir wire not in the box.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Mar, 2018", "reviewer": "GRITTOMON THOMAS"},
{"rating": 3, "title": "Overall a good buy for this screen and price but not best", "review": "MI has done a great thing bringing this to India. I am sure many like me will buy and enjoy it \nAlthough there are few good and bad things that come with this TV which I noticed\n\nPros:\n\nExcellent design and super slim\n\nBest price \n\n4k quality playing with the Hard drive connected is good .. ( You will see few frames drop now and then for sure )\n\nIt has decent colours not greatest not bad would say 7/10 \n\nUI scrolling is smooth with a simple remote provided along\n\nOverall a great buy for those who don't want to spend a very high price for a TV\n\n\nCons:\n\nStreaming 4k with youtube app is not allowed just yes so you will have to settle with 1080p max for now \n\nNetflix and other streaming apps I was not able to install and play which is kinda bummer\n\nMaybe with an update, they will add more streaming apps to the list \n\nInterface hosts everything you have it connected and in kinda no order, Which is cluttery and patchy... It's confusing a lot at least for now\n\nPicture quality for 720 and less looks ok and not a great to watch looks blurry and not very clear \n\nIt doesn't really upscale anything I suppose... which is kinda ok as we are not paying anything premium again \n\nI hate the fact that MI keeps most of their product as a flash sale.. maybe just to create more hype \n\nI am still testing and will update the review if noticed anything new \n\nNote: Above things are first 3 days impressions \n\nHS", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Mar, 2018", "reviewer": "Hiten Soni"},
{"rating": 3, "title": "Decent TV. Worth the money. But ..", "review": "1. You'll miss play store and the apps (games, hotstar, prime video etc)\n2. Tv has issues rendering 4k vp9 format (doesn't render at all)\n3. Laggy built-in youtube app (while running 1080p videos)\n4. No voice support (in the remote)\n5. After wall mount the interfaces are in lil unreachable areas\n\n1. Panel is good and bright\n2. Built in apps and OS is very responsive without any hitches\n3. Clean and good finishing", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Mar, 2018", "reviewer": "Raghuveer Pai M"},
{"rating": 5, "title": "Worth every penny", "review": "See, Each people will have their own expectations. Please dont compare the TV with other High priced models. for 40k with 55\" TV in India, come on people worth buy it. spend some extra money and get additional speaker. we do have HD channels. what we can expect more than this. over all it is a good to go buy.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Mar, 2018", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Good quality product", "review": "Bad- 1.Average sound\n2.Viewing angles poor\n3.Amazon prime, hotstar, and 99.9% apps won't work.\n\nGood- overall value for money for 40k", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Mar, 2018", "reviewer": "sandeep ky"},
{"rating": 4, "title": "Really Nice", "review": "Flipkart service and delivery is a 5 star. Ordered the tv at 12pm and the next day 12 pm I am watching interstellar on this wonderful TV.\n\nThe best points of the TV are already know to the world sleek and awesome design, good picture quality.\n\nThe sound quality is bad. Was not able to hear the dialogues clearly even at half the sound. Might have buy a sound bar for better sound output. Hopefully Mi lauches the Mi Bar soon. The panel heats up a bit on the sides( could be normal).\n\nRest the TV is awesome at this price range.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "Vaibhav Reddy"},
{"rating": 5, "title": "Brilliant", "review": "Superb TV in this price range I use for 2 days more review give in 7 days thanks Flipkart for delivering the product at a time and nicely and also Jeeves for supporting my tv installation no any problem superb TV in this price...", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "PARTH SHAH"},
{"rating": 5, "title": "Good quality product", "review": "Ok nice TV. But I suggest not available in mute button future.", "verification": {"CERTIFIED_BUYER": true}, "date": "23 Feb, 2018", "reviewer": "Praveen M"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Amazing TV for this price point!\nOnly one concern that I have faced is the speakers!\nMaybe it's a problem with my unit I don't know, but I don't care and I can't complain for the price I paid!\nUse home theater for best sound output!", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Mar, 2018", "reviewer": "Vinit Wani"},
{"rating": 5, "title": "Worth every penny", "review": "Amazing TV with such a price point", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Mar, 2018", "reviewer": "Karan Sharma"},
{"rating": 5, "title": "Terrific", "review": "Mi tv 4 is beast in all factors,but i am not satisfied with its sound output.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 Mar, 2018", "reviewer": "Pranav Sarvaiya"},
{"rating": 5, "title": "Perfect product!", "review": "Super product\nNice's prices", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Mar, 2018", "reviewer": "Gaddam Narayana swamy"},
{"rating": 5, "title": "Awesome", "review": "Good services, flipkart jeeves, mi all thanks......at small town like himmatnagar 383001... satisfied till now.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Mar, 2018", "reviewer": "CHIRAG PATEL"},
{"rating": 4, "title": "Worth the money", "review": "40K worthy....But, can't be compared to Premium brand quality", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "Rajesh Gadiparthi"},
{"rating": 5, "title": "Does the job", "review": "Good TV and worthable super must buy", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2018", "reviewer": "Virupakshi Hosamani "},
{"rating": 5, "title": "Brilliant", "review": "Good. Value for money. Nice service", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Absolute rubbish!", "review": "Remote not working or syncing with Airtel 4k Box. If you have Airtel 4k Box you must use both remote with is really disappointing. And a annoying beep noise while switching channel in Airtel DTH.", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Mar, 2018", "reviewer": "Sai S"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Absolutely loving it!! Decent product and very prompt delivery and installation by Flipkart. Apart from the sound during casting through mobile. Rest all good.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Must buy!", "review": "Excellent Product as i expected", "verification": {"CERTIFIED_BUYER": true}, "date": "27 Feb, 2018", "reviewer": "ansari mohammed sulthan"},
{"rating": 5, "title": "Great product", "review": "Good product", "verification": {"CERTIFIED_BUYER": true}, "date": "26 Feb, 2018", "reviewer": "PRAKASH S"},
{"rating": 5, "title": "Great product", "review": "Great service provided by Mr. Saurabh just within 1 day from the time of order", "verification": {"CERTIFIED_BUYER": true}, "date": "24 Feb, 2018", "reviewer": "Varun Saini"},
{"rating": 3, "title": "Good", "review": "Good looking TV, but display and sound are below average. Remote also feels very cheqp. Expected more from MI. Software also is in half baked state. I'm regretting selling my KU6000 at cheaper price.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "Prabhjot Singh"},
{"rating": 4, "title": "Worth the money", "review": "Hi All, \n\nFirst thing first.. TV is looking good and quality is also looking good..\n\nDisplay:. Downloaded LG 4K demo video and quality is very good.. may be at points I felt like little colour fade out.. can't say untill checked in another 60\" Panasonic TV we have..\n\nSound: Definitely very bad TV speakers.Bass is weak.. and simply to say.. it's like you are watching some piracy video.\n\nInterface: So far  it's ok.. but play store is must in future updates.\n\nFor 39.99k it's worth it.. \n\nWill comment on gaming and other aspects in future.\n\nMi TV cable is missing in packing ...\n\nPlaying all video formats if you wanna watch from usb drivers, not like VU and others.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 4, "title": "Wonderful", "review": "TV is good the only problem is that the sound stops automatically when playing content through hdmi(dth) after switching it off and on we get the sound back.dont know is this the problem of set top box or TV. Seeking help!", "verification": {"CERTIFIED_BUYER": true}, "date": "12 Mar, 2018", "reviewer": "aditya singh"},
{"rating": 5, "title": "I usually don't reviews on products this is the best TV@ 40K", "review": "I usually don't reviews on products this is the best TV @ 40k just go for it  !!", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Mar, 2018", "reviewer": "Majeed Ali"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Great Product..\nHow mch I loved it, I can't explain", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Best in the market!", "review": "SUPER TV", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "S.Tamizh Anban"},
{"rating": 4, "title": "Really Nice", "review": "Picture quality awesome.  Sound is a mis match. The position of the plugins such as hdmi cables is not convenient on wallmounts. Taking the size of the tv , it is preferable to fix it on wall. Otherwise so far so issues.4k and hdr are more  value for money.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Mar, 2018", "reviewer": "Vasanth Kumar  M"},
{"rating": 5, "title": "Worth every penny", "review": "Close your eyes and buy this product... It offers much more than what you pay for it..", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Feb, 2018", "reviewer": "Shrikanth  P"}
]