[
{"rating": 5, "title": "Excellent", "review": "The World's Best & Stylish Smartphone From SAMSUNG.\nHats Off To The Entire SAMSUNG Design Team For Making This Beautiful Smartphone.\nThe Design Of Galaxy S8 Is Stylish & Cool.\nThe Rear Camera Quality Is Outstanding, In fact It's Best Ever Smartphone Camera Till Now!\nFront Camera Of Galaxy S8 Is Lovely, It's A Wonderful Selfie Camera For All The Selfie  Lovers.\nDisplay Quality Is Fantastic, I Must Say It's  The Best Ever Display Used On A Smartphone.\nBattery  Is Strong Enough To Last 18~20 Hours.\n\nFlipkart Service  Is Super Speedy, The Packaging Was Amazing!!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2017", "reviewer": "Sachin Tater"},
{"rating": 5, "title": "Best phone till date", "review": "The World's Best & Stylish Smartphone From SAMSUNG.\nHats Off To The Entire SAMSUNG Design Team For Making This Beautiful Smartphone.\nThe Design Of Galaxy S8 Is Stylish & Cool.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 May, 2017", "reviewer": "Abhiram  Varma"},
{"rating": 5, "title": "Truly Love at first sight!", "review": "If there is something called as \"Love at first sight\" this has to be it! The feeling of holding this awesome piece of creativity is a joy in itself! And not to forget the blazing fast delivery by Flipkart!\n\nAbsloutely loving this one!", "verification": {"CERTIFIED_BUYER": true}, "date": "2 May, 2017", "reviewer": "Vaibhav Sathnoorkar"},
{"rating": 5, "title": "Terrific purchase", "review": "Being an iphone user I love this phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jun, 2017", "reviewer": "Krishna Tamanampudi"},
{"rating": 5, "title": "Samsung S8 is the Tardis of the smartphone world!", "review": "Review from a guy who used almost 60 mobiles in last 10 years. :D\n\nFirst Impression :\n     The first thing u ll notice is the GORGEOUS display. \n     Infinity display with curved edges makes it look stunning.\n     No words to express the beauty of this smartphone.\n\nBuild Quality :\n     Over a decade, Iphone was leading smartphone industry because of the build quality.\n     Its time to change the era.\n     This Samsung S8 build quality is as good as iphone or even better.\n     Sexy Design and Solid Build Quality.\n\nDisplay :\n     Infinity Super Amoled Display is the best display ever in a smartphone. No competition here.\n     Quad HD+ display is crisp and vivid.\n     Battery life using Quad HD is almost same as using Full HD.\n     Some games like Clash Royale are getting BLACK BARS on top and bottom because of the new resolution 18:9. Hope games will be developed to support 18:9 resolution soon.\n     Videos has to be played with DEFAULT PLAYER to view in full resolution. Video players like MX player are not yet supported for 18:9 resolution which are cropping the video to display in full screen. No problem with default video player though. \n\nCamera :\n     Best camera in smartphone as of now. Only competition here is Google Pixel XL.\n     Back Camera is almost same as S7 edge. \n     Front camera has been upgraded to 8MP from 5MP in S7 edge.\n     Tons of options like slow motion, Blur effect are there.\n\nPerformance :\n     This is another area where Iphone was shining for the last decade.\n      Now Samsung has optimized the phone to match the performance as same as Iphone 7. Finally Android is competing IOS in performance thanks to Samsung developers for such optimization.\n      Exynos processor is much better than Snapdragon in performance. Good that Samsung launched Exynos version in India.\n\nBattery :\n     No phone under 4000 mah can match this phones battery performance.\n     I have used almost all the Snapdragon devices, the thing which are same in all the devices are heating. This Exynos is not at all heating which leads to better battery backup.\n     Easily getting 5-6 hrs SOT using 4g data and Quad HD display.\n\nSecurity :\n     We have seen Youtube reviewers saying the FingerPrint sensor position is awkward and not reachable. Trust me in S8 there is no problem at all in reaching Finger print sensor. Though there is issue with S8+ since the phone is huge.\n     We will be used to this finger print position in a week. So problem here.\n     Also Iris scanner works flawlessly, super fast unlocking. I am surprised  to see how Iris scanner works in complete dark area. \n\nWater Proof :\n     Used under water camera in wonder la. Fabulous. \n\nAudio :\n     AKG earphone is awesome. Its crisp and clear. But its not BASS lovers. Bass is low. But the clarity is ultimate. We are getting it for free what else we can expect here.\n     Audio quality in Exynos processor is a bit better than Snapdragon.      \n     Equalizer software does the job well.\n\nPersonal feel :\n     I'm getting happy and energized seeing this beauty. \n     I would suggest to get S8 than S8+. Perfect size to hold and finger print sensor can be easily used.\n\nConclusion :\nIf u can afford 58k blindly go for it. No 2nd thought.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 May, 2017", "reviewer": "Kalai De Bluffer"},
{"rating": 4, "title": "Detailed Review after 2 MONTHS of use | Battery Stats.", "review": "NOTE:\n@ It takes 1 hour 20 Minutes to charge from 0 to 100 % due to Fast Charging ( Check the complete Battery stats below )\n@ Do take the Buy back Guarantee pack, its worth spending to be assured. \n\nI am using this phone since last 2 months and following are the observations,\n\n●● If you want to get quick overview of the device, then read below else scroll down for Detailed Review ●●\n# Awesome Build quality ( best on any smartphone I have ever used )\n# Great Infinity Display with Crystal Clear output ( ~84% screen to body ratio )\n# Decent Camera quality.\n# Great Battery Backup.\n# Flawless in Multitasking ( No Lags detected at all )\n# Massive Internal memory.\n# Tons of sensor like Iris scanner, fingerprint, accelerometer, gyro, proximity, compass, barometer, heart rate, etc\n\nDETAILED REVIEW -->\n===============\n\nBUILD QUALITY :--\n---------------------\n# Build Quality is Great and it looks very Rigid.\n# Light Weight about 155g considering the size of phone.\n# Glass Finish looks very Premium.\n# Has Corning Gorilla Glass 5.\n# Fingerprint sensor is Lightening Fast.\n\nPROCESSOR & MEMORY :--\n------------------------------------\n# Have Exynos 8895 (octa core) 2.3GHz Processor with Mali-G71 MP20 Graphics Unit.\n# It is Faster than most of its counterparts.\n# This Processor perfectly balance the Battery life & Performance.\n# 4GB Ram is great and handles Heavy Multitasking seamlessly.\n# Has 64GB in-built memory, expandable upto 256GB\n# Supports Android 7.1 (Nougat) out of the box.\n\nDISPLAY :--\n------------\n# Screen is 5.8 inches Super AMOLED display with Corning Gorilla Glass 5.\n# Has Awesome Viewing Angles.\n# Brightness is also well balanced with the Pixel density.\n# Has good screen to Body ratio ( ~84% ).\n# Has Superb Pixel Density ~570 ppi which gives crystal Clear display output.\n\nBATTERY PERFORMANCE :--\n------------------------------------\n# Charges from 0 to 100% in just 1hour 20 minutes with stock charger.\n# This is so far 2nd Quickest Charging Time available in any smartphone.\n\nUsage Mode ---> Battery Performance(Avg.)\n===========================================\n@ Mobile Data(3g/4g) Used Continously ---> 6-7 Hrs.\n@ Normal Calling Only + Standby ---> 25 Hrs.\n@ Normal Calling + Music Playback( Continuous ) ---> 14-15 Hrs.\n@ Internet Usage on WiFi Only( No Calling ) ---> 11 Hrs.\n@ Gaming ( Wifi) ---> 7-8 Hrs.\n@ Gaming ( without WiFi ) ---> 7-9 Hrs.\n@ Video Playback ---> 12-14 Hrs.\n\nCAMERA QUALITY :--\n-------------------------\n# Rear --\n* Has 12 MP and f/1.7 Aperture.\n* This gives crystal Clear Micro Images.\n* Colour production is good.\n* Simultaneous 4K video and 9MP image recording.\n* Overall image quality is great.\n\nFront Camera -----\n* Its 8 MP with f/1.7 aperture.\n* Has Decent quality and face recognition is quite good.\n* Its above average camera for selfies.\n\nCONNECTIVITY :--\n--------------------\n# Supports Dual 4G Sim.\n# Supports VoLTE (4G).\n# Supports NFC.\n# Has Bluetooth 5.0\n\nOTHER FEATURES :--\n--------------------------\n# Finger Print Sensor is Lightening Fast.\n# Phone Handles Heavy games like NOVA 3,Asphalt 8, etc Smoothly, even at High graphics settings.\n# with Heavy multitasking NO LAGS Detected yet.\n# Has Lots of sensor like Iris scanner, fingerprint, accelerometer, gyro, proximity, compass, barometer, heart rate, etc\n\nCONS :-\n--------\n1) Cameras are above average, I was expecting even better Quality output.\n2) Ram Consumption by System apps. is above moderate.\n3) Phone is very Slippery and prone to complete Damage if falls.\n4) Position of Finger print sensor.\n5) Ton of bloatware.\n\nVERDICT :--\n------------\nAccording to my usage if you are a Normal User ,then there's NO NEED to upgrade to this phone if you already have Edge 7.\nFor this Price, it has Everything. Performance, Quality, Durability and aesthetic. Have few downfalls, but the quality and performance overshadows them. I also got chance to use S8+ and Note 8, so I felt S8 is best among all for Normal user and has better Value for Money ratio.\nLuxury has a Price and this tag is justified, you can certainly go for it.\n\nThank You for reading this Review.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 Nov, 2017", "reviewer": "Sameer Patil"},
{"rating": 5, "title": "Samsung S8", "review": "What an Excellent Pakaging by @Flipkart. \nI Preordered the device and got today. Got dairy as a gift and Welcoming To the Samsung family of infinity display with Nice audio greeting .\n\nJust Got the Beast Today. Loving the infinity display. The screen looks Gorgeous .\n\nPros :\n1) Infinity display \n2) Smooth interface\n3) Bixby\n4) Excellent Camera\n5) Blazing fast Performance \n\nCons:\n1) Heating Sometimes \n2) Some bugs\n\nFinal Review 9/10", "verification": {"CERTIFIED_BUYER": true}, "date": "2 May, 2017", "reviewer": "Balarama Raju"},
{"rating": 5, "title": "Super!", "review": "The best phone in the market. I can proudly say it is even better than iphone 7 and iphone 8 and even iphone x but maybe the to the iphone users the logo matters more than performance and looks.", "verification": {"CERTIFIED_BUYER": true}, "date": "13 May, 2017", "reviewer": "Avradeep  Sarkar"},
{"rating": 4, "title": "Pretty good", "review": "Fabulous look.and great delivery by flipkart.got my phone yesterday.\nSome heating problem and battery drains fast.\nTempered glass not work well.\nRest is good..i m liking the phone so much till now.", "verification": {"CERTIFIED_BUYER": true}, "date": "9 May, 2017", "reviewer": "Pratyush Priyadarshi"},
{"rating": 5, "title": "Quality Issue", "review": "Display was defected. It had a green dot on display. Not expected from samsung's quality assurance. Causing delay in replacement. \nCausing loss of wireless charger offer.\n*Compensation Required*", "verification": {"CERTIFIED_BUYER": true}, "date": "5 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 3, "title": "Good phone, marketing cheats", "review": "The S8 is excellent. However, the wireless charger was supposed to be registered for using the Samsung Pay app. when i did that NOTHING! Then contacted samsung who said i should download the Mygalaxy app and register, still NOTHING!!! Is this flipkart fibbing or Samsung?", "verification": {"CERTIFIED_BUYER": true}, "date": "8 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Terrible product", "review": "mobile is awesome..but there is nothing about no cost emi,they cheated us,by charging around 5000 extra.mnz no 2995&;18 but 3192×;18 mnz around 5000 extra", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Oct, 2017", "reviewer": "abdul rabbani"},
{"rating": 1, "title": "Did not meet expectations", "review": "Product is awesome. But dnt buy it from flipkart. They will cheat you some how.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 May, 2017", "reviewer": "Ranjit Jha"},
{"rating": 5, "title": "Great product", "review": "A product worth of being flagship. Excellent battery, camera and built quality.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 May, 2017", "reviewer": "Mayuresh Singh"},
{"rating": 5, "title": "Brilliant", "review": "Shaandar majedar jabardasttt... look of this phone is more then enough to justify its price. rest everything is complimentary.\n\njust got it 2nd may, awesome phone no issues.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 May, 2017", "reviewer": "Ajeet Rohilla"},
{"rating": 5, "title": "Absolute rubbish!", "review": "No doubts about the phone it is the best till date of all Samsung galaxy phones. The sexiest phone I ever seen. And finally got the free coupon for wireless charger. \n\nNB: battery is not up to the mark.", "verification": {"CERTIFIED_BUYER": true}, "date": "8 May, 2017", "reviewer": "Arindam Das"},
{"rating": 5, "title": "Great product", "review": "Heating more than usual.  And battery back up is worst", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Jun, 2017", "reviewer": "Karthi Keyan"},
{"rating": 5, "title": "Terrific purchase", "review": "No doubt that this flagship from Samsung is flawless. Infinity display is amazing.\nPerformance wise also the phone is superb.\nThe only drawback is the making wrong statements to customer as far as wireless charger is concerned. There are no wireless charger link in promotion panel of Samsung pay.\n\nCorrection - its 25th may and i got my wireless charger delivered today. Samsung u rock.. The phone is superb and so is the wireless charger", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Must buy!", "review": "Its most beautiful smartphone of this planet.\nReally you will fall in love after taking this masterpiece in your hand.\nIts amazing...its fabulous....its flawless...\nI mean its the master of the universe...\nAfter using couple of hours...it will change your way of using the smartphone....really above all...", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Jun, 2017", "reviewer": "Aman Singh"},
{"rating": 5, "title": "Speedy Delivery", "review": "Received my Samsung Galaxy S8 Midnight Black variant yesterday, 2 days before the official launch in India. The product is original and as always you can trust on Flipkart for speedy and original product delivery.\n\nUsed to phone for about 24 hours and I am quite satisfied with the display and software. Though still it is kind of difficult to use the Fingerprint sensor on the back, wish it was on the front.\n\nP.S- Shifted from iPhone 6s", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2017", "reviewer": "Sahil Kataria"},
{"rating": 5, "title": "Galaxy S8", "review": "The best looking Phone I ever held. Smaller than my S7 Edge with larger screen. the display is Amazinggg... Battery is withstanding torture for the whole day.(No games at all though only mails,FB,4G throughout,Music Streaming for 2 hours).", "verification": {"CERTIFIED_BUYER": true}, "date": "5 May, 2017", "reviewer": "Abhishek Chakraborty"},
{"rating": 5, "title": "Wonderful", "review": "This phone is awesome to use. Display is great and the smaller s8 is easier to use with one hand feels small and light. Made my iphone 7 plus look old. I am switching from iOS. Flipkart delivery service is super fast. Trust me you won't regret buying this phone.", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Apr, 2017", "reviewer": "Asutosh Gupta"},
{"rating": 5, "title": "Gorgeous Phone", "review": "Excellent product and fast delivery by flipkart. My phone is delivered on the same date shown on flipkart expected delivery date.\nPhone comes in nicely packed box and if you closely see back side of phone you can see written \"made in India\".\nAs far as free wireless charger offer you need to do following step to redeem it (it does not come with phone, only wired charger comes with phone):\n1. Register your mobile on my galaxy app while registering make sure that working sim card inserted in phone.\n2. Wait for 3-4 days for free wireless offer to show up.\n3. After 3-4 days open my galaxy and browse through various deals in my galaxy app surely you will see free wireless charger.\n4. Click on free wireless charger deal and generate coupon. Write down or copy that coupon code it is valid till 31st august 2017 only\n5. Go to samsung India shop and add Wireless Charger Stand (Convertible) to your cart\n6. Proceed to checkout and enter coupon code from step 4\n7. Your payable price will become 0 with 100% discount i.e. discount of 4,499.\n8. Enter phone number and shipping details\n9. You will get otp on your phone to confirm the order.\n10. wait 10-15 days for your product to deliver.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Jul, 2017", "reviewer": "Shubham Rathi"},
{"rating": 4, "title": "Worth the money", "review": "Mobile is excellent in all respects. Only draw back is the battery. It's draining out very fast as compared to my 4 yrs old htc ki one under same usage. Moreover , I feel the phone is heating up", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2017", "reviewer": "prasun khaitan"},
{"rating": 5, "title": "Best in the market!", "review": "☆☆☆☆☆(5/5)---> Galaxy S8 is a world's best & gorgeous smartphone. Its infinity display, curved edges & wider screen size makes it look stunning. Its time to change the era by Samsung Galaxy S8.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jun, 2017", "reviewer": "Sudip Kumar Karan"},
{"rating": 5, "title": "Awesome", "review": "Delivery from flipkart was jjst awesome as got the phone day before promised delivery that too on said time. Packaging was too good from flipkart, ensuring that no harm should be done in transit.  S8 is a best phone anyone can find in market right now. Beautiful and pwerful. Extremely sarisfied with the flipkart service and samsung.", "verification": {"CERTIFIED_BUYER": true}, "date": "5 May, 2017", "reviewer": "Ankit  Sharma"},
{"rating": 4, "title": "Good choice", "review": "Great phone, one of the best in class camera. Pretty good battery life. TouchWiz has improved immensely and has a really nice feel to it.\nThe major qualm I have is the Bixby button. It's just physical bloatware, which is worse than the bloatware inside.  If Samsung would have allowed us to remap the button to our choice, then that will be a game changer. Better than the new Pixel 2 or U11's squeeze function.\nBixby is still very new so it'll probably get better over time with software updates but until then it's nowhere near compared to Google Assistant or Apple's Siri. \nThe Camera is fantastic, great low light ability as well. The selective focus mode is decent but not excellent and has some way to go. Other modes such as pro or food are nice addition. \nThe speakers are good and loud although they sound a little tinny on high volume. And then there's the headphone jack. One of the major reason why I purchased the phone. Out of the box, it comes with AKG tuned earphones which are decent but if you love your sound, you're better off with  earphones from Sennheiser or Sony.\nDecent battery life with some really quick fast charging. With average to above average use and it still lasted me the whole day.\nFingerprint reader is not the fastest of the bunch but still not bad. Iris and face scanning are almost gimmicks but still work really well. \nAll in all a great flagship phone for people who prefer to use the phone in a single hand and who don't need a stylus.\nAlso it comes with the headphone jack!", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Oct, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Superb", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jul, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "Awesome phone", "verification": {"CERTIFIED_BUYER": true}, "date": "19 May, 2017", "reviewer": "Biren Subba"},
{"rating": 4, "title": "Awesome and beautiful gadget", "review": "Pro:\n1. Amazing device with beautiful build\n2. Fast Iris scanner\n3. Working smooth\n4. Samsung pay \n5. Good display\ncons:\n1. Heating problem sometime", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2017", "reviewer": "Gaurav Bhandari"},
{"rating": 1, "title": "poor", "review": "Really upset with flipkart, would not recommend anyone to purchase anything specially mobile. Bought s8 after so much of saving and the product delivered was damaged, i understand it was sealed samsung box mobile however flipkart shouldn't have such kind of suppliers who have no product quality check because we as a flipkart customer get effected Nways i personally recommend not to purchase anything from flipkart or any online portal", "verification": {"CERTIFIED_BUYER": true}, "date": "25 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Perfect product!", "review": "There's no need of introduction for this marvellous phone. I really owe Flipkart for giving me a No Cost EMI. And the Extra goodies provided along with the item won my heart.... Thank you FLIPKART.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Jul, 2017", "reviewer": "RATAN SAMUEL"},
{"rating": 5, "title": "Brilliant", "review": "Samsung is best", "verification": {"CERTIFIED_BUYER": true}, "date": "15 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Unsatisfactory", "review": "DON'T MAKE MISTAKE TO BUY THIS PRODUCT. \n\nFake product delivered. Had requested for return of this product within timelines. Even after being given assurance by customer care that the issue would be resolved within 3days the issue still remains unresolved. Very poor customer service. Clearly a difference between 'Kathani' and 'Karni'(Saying and Doing), don't go by what they claim on their app at the time of selling, else there's lot of mental agony you should be prepared for.\n\nAdditional edited comment: Moreover, today even after 2 weeks of having requested for resolution against issue raised, the problem remains unresolved. Pathetic support.\n\nUpdate: It's been a month since I last lodged my complaint. Have repeatedly requested them to resolve the issue but Flipkart customer care doesn't care to respond. Very poor service. Doesn't deserve to be called a brand.", "verification": {"CERTIFIED_BUYER": true}, "date": "26 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Best in the market!", "review": "Flipkart exceptional service in terms of delivery, got my phone 2 days before it was expected, and samsung yet again has not disappointed with the S8, it really is the best available phone in the market, #S8#Bestphoneever", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2017", "reviewer": "Sarvagya Jain"},
{"rating": 5, "title": "best phone with the best display and camera", "review": "No complaints about the phone. Its the best looking phone in the market right now. Phone looks better in real than in the pics.\nFree wireless charger: I did everything as samsung suggested but not able to see the wireless charger promotion under samsung pay as they say. After contacting samsung customer care few times, i was able to get the coupon for free wireless charger", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2017", "reviewer": "Shaji S"},
{"rating": 4, "title": "Really Nice", "review": "Excellent product.  Delivery was also on time. Fingerprint reader is not at good location and sometimes it fails. What about free wireless charger .", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2017", "reviewer": "Aman Mathur"},
{"rating": 5, "title": "Brilliant", "review": "Amazing experience with the phone. Got my phone delivered yesterday and its amazing. Sleek n thin design with Infinity display is pure awesome. Love this phone, it works so smooth. Total value for money.\nOverall amazing service by flipkart delivered before market launch. Amazing service !!!", "verification": {"CERTIFIED_BUYER": true}, "date": "1 May, 2017", "reviewer": "Lalit  Abrol"},
{"rating": 1, "title": "Worst experience ever!", "review": "Received a replacement from Samsung for my first defective s8. Even the replaced phone is defective. Customer support of flipkart is pushing to the service center where no support is offered. Pathetic", "verification": {"CERTIFIED_BUYER": true}, "date": "25 May, 2017", "reviewer": "Mukesh Jangid"},
{"rating": 3, "title": "Very Good", "review": "Great product. The offers are challenging. Be careful to follow the complicated offer conditions diligently. One small deviation and samsung will deny fulfilling their offer saying condition not met!", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Jun, 2017", "reviewer": "C%20G%20 Muthana"},
{"rating": 5, "title": "Terrific", "review": "This phone is already from future , infinity display makes it stand out from the rest . Crazy quick dual pixel autofocus makes it point and shoot master...ignore dxomark rating ,this camera is the best smartphone camera you can find right now , the pro mode is absolutely fantastic and lets you take dslr level low light shots with almost no grains ....there is a little problem with the aluminium frame heating up but thats  natural. The earphones tuned by AKG are brilliant. Wireless charging is not that fast but wired charging is very fast and last for a day with 15-20% left at the end of the day . IP68 water and dust resistance makes it even more durable and you can easily take your fone for a dive.  \nWraping everything up , the S8 is the best smartphone right now in the market.", "verification": {"CERTIFIED_BUYER": true}, "date": "10 Jul, 2017", "reviewer": "Omkar Dandawate"},
{"rating": 5, "title": "Best in the market!", "review": "Just 5 stars...c'mon the phone needs more.Its been more than a month now since I am using this as my primary phone.One of the best phones you can get your hands on.Awesome camera.Proceesor speed is one of the best.Samsung has literally creamed of the bloatware and their own version of android,this time for the better.Really gives the stock andoid feel with the samsung flair.The most important and the best, the display.Its way generations ahead.Hope this would revolutionize the world of phones.The only con is the battery backup.It comes up a complete 1 day with more than 1 hr gaming and complete 4g data on.But I dont mind it coz the charger charges it double quick.\n\nThat's my personal and honest opinion after having and still using Moto Z Play and iPhone 6.", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2017", "reviewer": "Asit Baran Behera"},
{"rating": 5, "title": "Awesome", "review": "Superb phone ..the look and the feel is fabulous..only little issue with the battery ..heavy usage can drain your battery in about 8 hours..BUT REST ALL LOOKS OK ..and it doesn't BLAST", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2017", "reviewer": "Jigar Parikh"},
{"rating": 5, "title": "Best in the market!", "review": "Best mobile i have seen till now in market. Love to hold this device. Battery is good too. Today got a code for free wireless charger after a little follow up with samsung and my galaxy team", "verification": {"CERTIFIED_BUYER": true}, "date": "11 May, 2017", "reviewer": "Nitin Sharma"},
{"rating": 5, "title": "Classy product", "review": "Superb phone slim and perfect fit in an hand very smooth till today I suppose to use iPhone 7 but now I started using s8 really good I got it delivered on 2may2017.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 May, 2017", "reviewer": "Shruti Mishra"},
{"rating": 5, "title": "Highly recommended", "review": "phone is good but i dout it is having gorilla glass just small fall damaged my screen and its very sleepery in hand.some time it hangs batrrey drain so fast..", "verification": {"CERTIFIED_BUYER": true}, "date": "5 Dec, 2017", "reviewer": "Manjunath Sutar"},
{"rating": 5, "title": "Must buy!", "review": "The best smartphone till date. Beautiful display makes other phones display mediocre fast processor excellent UI decent UI\nCons- back side is glass and prone to cracks so be careful and buy a good cover", "verification": {"CERTIFIED_BUYER": true}, "date": "29 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Worth every penny", "review": "Detailed review not required as you must have definitely done a lot of research before you settle down for this premium phone. In one sentence, this is a black stallion, you would love it.", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Nov, 2017", "reviewer": "Pranesh Kuppu Rao"},
{"rating": 5, "title": "Simply awesome", "review": "I gifted my hubby this legendary phone and hes very happy..... The design the features are just awesome.... Overwhelmed", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Oct, 2017", "reviewer": "Nikita Roy"},
{"rating": 5, "title": "Worth every penny", "review": "Superb phone", "verification": {"CERTIFIED_BUYER": true}, "date": "1 Jul, 2017", "reviewer": "Uttareshwar Patait"},
{"rating": 5, "title": "Highly recommended", "review": "Delivered before time. Exclusive flipkart packing. A must have phone. The display is such that it's hard to take your eyes off it. Awesome just awesome.", "verification": {"CERTIFIED_BUYER": true}, "date": "18 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Highly recommended", "review": "Fantastic phone.. Looks great. Good performance. Let's hope it remains like this for long time.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 May, 2017", "reviewer": "Amol Kinage"},
{"rating": 5, "title": "Classy product", "review": "Nice phone with cool look...", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2017", "reviewer": "Raju  Sahu"},
{"rating": 5, "title": "Samsung beats Apple in 2017...", "review": "Samsung amazes with s8 and flipkart continues the same with their delivery  and packaging...", "verification": {"CERTIFIED_BUYER": true}, "date": "2 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Highly recommended", "review": "Excellent piece of hardware... One of the best phones out there. Flipkart service was excellent and received the phone in a nice box along with a diary from flipkart.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 May, 2017", "reviewer": "RICHARD JAMES"},
{"rating": 5, "title": "Excellent Phone....", "review": "Awsome Display, Good Camera.... very good phone", "verification": {"CERTIFIED_BUYER": true}, "date": "2 May, 2017", "reviewer": "Ravi N P"},
{"rating": 5, "title": "Mind-blowing purchase", "review": "Fabulous smartphone experience. Appreciated more if it was Android 7.1 out of the box. \n\nJust got an sms confirmation from Samsung Shop that as part of pre book offer, the wireless charger has been dispatched too. Happy :-)", "verification": {"CERTIFIED_BUYER": true}, "date": "14 May, 2017", "reviewer": "Ujwal Reddy Konda"},
{"rating": 5, "title": "Super!", "review": "Never reviewed a phone although I have bought around 20 mobiles including Nexus series (everything except Apple) in 12 years. But couldn't stop myself from writing about Samsung S8. I am using this one as my primary driver since May 3. Waited till the wireless charger arrived as that would have been the  only bummer in my purchase. Now that I got the charger which works like a charm, I decided to write something about my experience with this ultimate Samsung marvel which I think can only be replicated by Samsung only.\nThis phone:\nIs a visual delight and a beauty to hold.\n\nHas worked fine till now(I don't play games on my S8) without a single glitch.\n\nHas a camera which produces photos unmatched with any phone I had( I also have the S7 Edge).\n\nHas finger print scanner (once you get used to it) and Iris scanner(Blazing fast even in theatre dark) which are 99% accurate along with face recognition.\n\nHas infinity display(don't have words to describe it's beauty). Just watch any HD movies on this and you get hooked to screen. I watched the entire India Pak match on S8.\n\nHas a new Experience UI which is much much much better than the TouchWhiz. The hidden tips and tricks videos on You Tube helps you unravel umpteen features in this ultimate phone.\n\nThe only drawback as per me is its battery life. Battery life on S8 is not that good for power users. The screen on time is around 3 and half hours with 4g network. But for that Samsung has provided fast charger which is very handy and charges the phone very quickly.\n\nI am glad I purchased this as I wondered after S7 Edge how can Samsung entice me to buy it's next flagship. It did.Kudos Samsung👍👍👍💖", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Jun, 2017", "reviewer": "Satya Mishra"},
{"rating": 5, "title": "Excellent", "review": "No one can match samsung S series...they were awesome earlier and they are beyond the expectations now with s8....amazing device\n\nAs a samsung lover I am 98% satisfied with s8\n\n2% is they could have bumped up the batttery capacity", "verification": {"CERTIFIED_BUYER": true}, "date": "23 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Excellent", "review": "Really amazing phone better than the iPhone", "verification": {"CERTIFIED_BUYER": true}, "date": "7 Jun, 2017", "reviewer": "KARAN SUNDA"},
{"rating": 5, "title": "Awesome", "review": "Stunning  phone", "verification": {"CERTIFIED_BUYER": true}, "date": "20 May, 2017", "reviewer": "Debo Pal"},
{"rating": 5, "title": "Must buy!", "review": "Excellent Mobile.. Galaxy S8 is the best phone right now!!!", "verification": {"CERTIFIED_BUYER": true}, "date": "16 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "A must buy product", "review": "A very beautiful and smooth device. Love the curved display and the infinity screen. The touch is smooth and sound quality is also good. Overall an awesome product. A must buy product.", "verification": {"CERTIFIED_BUYER": true}, "date": "16 May, 2017", "reviewer": "Abhishek Mittal "},
{"rating": 5, "title": "Really nice looking device.", "review": "Main thing for choose this device is smaller in size and bigger in display, that's give me huge space for do more work from small device, thank you flipkart for faster delivery! :)", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2017", "reviewer": "Ravi Dholakiya"},
{"rating": 1, "title": "Unsatisfactory", "review": "Uneducated, Pathetic, Mannerless guys you have, You people call them technician who don't even know how to turn on the phone, The person who hired them should get fired", "verification": {"CERTIFIED_BUYER": true}, "date": "18 Feb, 2018", "reviewer": "Adil Akhtar"},
{"rating": 5, "title": "Awesome Phone", "review": "Never expected such a slim beauty from Samsung. Phone was very slim and awesome. You won't regret your decision and go for it.\n\nThanks to Flipkart for delivering the product much before the promised date. I got mine of 1st April. And also for the the goodies came across with my mobile (Greeting Card and Note Book)\n\nThose complaining on Wireless charger, it was not the issue from Flipkart. This is the way the offer is framed by Samsung, so you should check all the terms and conditions before buying high end phones instead of blaming FK.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2017", "reviewer": "Karthik Kumar"},
{"rating": 5, "title": "Perfect product!", "review": "It was a great experience unboxing such a amazing gadget. iris recognition, finger print senser and camera is awesome. Infinite display provides it another achievement over other hi-fi smartphones.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2017", "reviewer": "Manish Vishwakarma"},
{"rating": 5, "title": "How to get Free Wireless harger", "review": "Pros- Looks (infinity Display is great), Iris Scanner (I liked the way how the phone unlocks when I just look at it albeit from a straight angle), Camera- Very nice camera from samsung to date. I have not used Pixek XL but this camera is not bad anyway.\n\nNow  for those of you worried on how to get wireless charger\n1) The conditions for the charger has been changed. You are no longer required to activate Samsung Pay.\n2) Download/Update My Galaxy app.\n3) Register with Phone number/Email ID used while ordering the phone\n4) Wait for 2 days\n5) Open the my galaxy app in that open the tab Coupons at the bottom of the screen. You will find inside the free coupon code and instructions to redeem. Follow it and you will get your wireless charger.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2017", "reviewer": "Shivaprasad"},
{"rating": 5, "title": "Amazing!!!!", "review": "What an experience Unboxing the #SamsungGalaxyS8. A wonderful packing from flipkart, timely delivery, an audio greeting welcoming you to the world of Infinity Display. It feels great having the Beast. If looks could really kill, YEAH!!!!! this is the phone that could do it. Awesome design, sleek, slim and beautiful. If you want to have a feeling of love at first sight, I'd say go for S8.\n\n Kudos to Samsung for building such an amazing device. Loved it. \n\n Really, as the greeting from flipkart says, 'settling for the best' is a wonderful feeling. \n\n #GoForIt :) #HatsOffSamsung _|..|", "verification": {"CERTIFIED_BUYER": true}, "date": "3 May, 2017", "reviewer": "saurabh khairnar"},
{"rating": 1, "title": "Phone awesome but Flipkart pathetic service", "review": "The phone is beautful from both inside and outside. However, Flipkart straight away sidelined it self from the pre-booking offer of free samsung charger. No coupon code recieved if booking through Flipkart. Better to buy from Samsung directly.", "verification": {"CERTIFIED_BUYER": true}, "date": "6 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Wonderful", "review": "The first time I took it out of the box, I knew instantly that it is nothing like I had ever seen before. The look amd feel of the device is just simply beyond words. I would advise everyone to go for the black variant as it blends seamlessly with the curved AMOLED display. Cameras are the best in the market and the display is better than anything else that is available in the market. The only downside is that the experience is not as fluid as it should be. The fingerprint scanner isn't that bad to be honest, but the battery life is below par. Flipkart delivered it within 22 hours so no complains there. Also my unit does not have any red tint issues fortunately.", "verification": {"CERTIFIED_BUYER": true}, "date": "2 Jul, 2017", "reviewer": "Saikat Kar"},
{"rating": 5, "title": "Awesome phone !", "review": "Don't really need to rate and review the best smartphone in the world. It is simply awesome. Fast, smooth, gorgeous and very different from the thousands of phones in the market. Flipkart also sent the phone on Day One of its launch, in an awesome gift box, with a fabulous planner diary bound in faux leather and  an offer for a free wireless charger :-)", "verification": {"CERTIFIED_BUYER": true}, "date": "11 May, 2017", "reviewer": "Subhobrata Sengupta"},
{"rating": 4, "title": "Pretty good", "review": "Let me state it at the onset...The S8 is a gorgeous device in an increasingly stale (look and form factor wise)  smartphone market bound to turn heads,draw 2nd glances and invite questions. But I had a bad experience within 2 weeks of purchase when all of the phone's sensors stopped working. Flipkart refused to replace. Had to approach the service center. They took 4 days to fix during which they replaced the motherboard. Has been running fine since then(fingers crossed), been around 3 months. Would have rated it a full 5 but for the bad experience at the onset. It's a great device, great look and feel, beautiful color, good battery, amazing screen but only about average software experience(in comparison to stock android or even oneplus or moto iterations), with occasional slight stuttering but has no other major issues . With S9 around the block, prices will go further down and will make it a better proposition and great value for money.", "verification": {"CERTIFIED_BUYER": true}, "date": "20 Jan, 2018", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Highly recommended", "review": "Good phone", "verification": {"CERTIFIED_BUYER": true}, "date": "2 May, 2017", "reviewer": "Aman Gour"},
{"rating": 1, "title": "Will never receive the Free Wireless charger.", "review": "Better wait and go for iPhone. I have got this mobile pre-booked the device on 20th May and got it on 2nd April but still now fighting with Samsung to get my wireless charger. But I have lost faith on Samsung and hence 1*. No complains on the phone but I will never buy a Samsung phone again.", "verification": {"CERTIFIED_BUYER": true}, "date": "21 May, 2017", "reviewer": "Suvendu  Swain"},
{"rating": 5, "title": "Excellent", "review": "Its very amazing phone\nNow samsung has the stuff against apple series. I have all phones from 4s to 7. But S8 is superb phone with all festures in dual sim 4 gb Ram camera excellent infinity display id gt8 view.\nI recommand it to all in cost effective prize only with Flipkart. \nDr Zahir Mansuri.", "verification": {"CERTIFIED_BUYER": true}, "date": "3 Jun, 2017", "reviewer": "Mansuri Zahir"},
{"rating": 4, "title": "Nice product", "review": "Product delivered before time so happy from service.\nThe product quality is amazing it gives you the luxury and premium feel without any doubt.\nIts been 2 days using this phone and seriously i found no cons about this phone.\nPeolpe talk about its wrong placement of fingerprint scanner but trust me its not an issue after few days of usage.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Jun, 2017", "reviewer": "Rohit Mishra"},
{"rating": 1, "title": "Unsatisfactory", "review": "No free wireless charge my phone plz my wireless charger to deliver", "verification": {"CERTIFIED_BUYER": true}, "date": "29 May, 2017", "reviewer": "Vishal Panchal "},
{"rating": 1, "title": "Very poor", "review": "Absolutely and utterly disappointed. When you pre order and pay 60k for a mobile phone as classy and beautiful as this, you also expected Samsung to deliver on its big promises. The One star rating is only for Flipkart on its delivery and the mobile phone. Samsung on its end has disappointed me beyond extent. Booked the phone on 20th April with the free wireless charger offer. Uptil now, due to a technical issue on their end, I am yet to receive my free wireless charger. If I'm paying 60k, I expect everything to be delivered. Even the promises. And Samsung has fallen way short of my expectations. It's been One and a half months now and all Samsung is doing is making me chase my own tail. They acknowledge their mistake, yet have not resolved the problem despite me providing all documents that they asked for. Rubbish. Samsung, you let me down. Totally. As a middle class guy buying his mother her first beautiful smart phone, I expected more from you on the promises you made as a company. \nRegarding the phone, it is beautiful. I've never seen my mother so happy. But as to the promises by Samsung, don't expect them to keep it. At all.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jun, 2017", "reviewer": "Srinath Nair"},
{"rating": 5, "title": "Fabulous!", "review": "Best Smartphone I have ever used. Looks stunning, Battery is also very good, normally gives 48 hrs in one charge. Camera is the best in market, both front and rear. The only problem is there should have been dedicated micro SD card slot. Otherwise the phone is best in Market. I have also got coupon code for Wireless Charger, a bit late but got it after follow up with Samsung, placed order n will soon get it.", "verification": {"CERTIFIED_BUYER": true}, "date": "11 May, 2017", "reviewer": "Anil Farkade"},
{"rating": 2, "title": "Wireless Charger was a Marketing gimmick & bad sound quality", "review": "Pros-\ngood infinity Screen \nWonderful Camera Quality\nIris Feature \n\nEverything else would be good because you have paid a bomb to Samsung EXCEPT\n\nCons-\n\nWireless Charger was a Marketing gimmick Because of there superb T&C of Samsung Very few people will qualify for the free wireless charger as there are many difficulties like it is not accepting my Dr card & saying to add other card( i tried two cards).\n\nVery bad sound quality while you hear songs on earphone(I phone 4s is thousand times better than this).\n\nBack side Finger sensor.", "verification": {"CERTIFIED_BUYER": true}, "date": "4 May, 2017", "reviewer": "yash gurudatta"},
{"rating": 5, "title": "Just wow!", "review": "Best mobail phone  on last all lunches  Samsung", "verification": {"CERTIFIED_BUYER": true}, "date": "16 Jan, 2018", "reviewer": "HUKAM SINGH RATHORE"},
{"rating": 5, "title": "Brilliant", "review": "I am giving this review after using this device almost for 20 days as I have prebooked it. About beautyand performance,  its exceptional there is no doubt in that and is the main source of attraction at any place. Experience UI looks very light and classy in comparison to the Samsung's earlier heavy Touchwiz. Battery backup is good. As i have noticed, 70% of charge lasts for entire day with 4G LTE and Location ON for messaging, browsing and with some VoLTE calls. Iris scanner response is incredible. Camera shots and videos mainly in low light is remarkable due to its bigger aperture. Touch response is amazing but gets degraded if Tempered Glass is used as it introduces some gap between the glass and the screen therefore, I removed it in the very 1st day. Now coming to Wireless charger, lookwise its good but it charges very slowly in comparison to wired one.\nOverall, as of now I have not come across any disappointing feature in S8. It gives a good value for money.", "verification": {"CERTIFIED_BUYER": true}, "date": "24 May, 2017", "reviewer": "Karthik Raju"},
{"rating": 5, "title": "Must buy!", "review": "Fully satisfied with product (best display have ever seen in a phone) as well as flipkart for once as the phone was delivered well before...thanx for that. Update: Received 2 codes... one code for tumi  case (received on 9 may) and the other for wireless charger today.", "verification": {"CERTIFIED_BUYER": true}, "date": "12 May, 2017", "reviewer": "Rahul Kasireddy"},
{"rating": 5, "title": "Simply awesome", "review": "Phone is absolute amazing but please don't get trapped into buying the default VR. It is not compatible with s8. It is only compatible upto s7 series. They are liars saying it is frequently bought along with the phone. I don't know if I'll be getting my refund or not.", "verification": {"CERTIFIED_BUYER": true}, "date": "25 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Brilliant", "review": "Product looks too amazing. Low light photography superb even at pitch black condition. Played asphalt 8 without any lag and experienced joy through great graphics. Associated head phone is of great quality than previous galaxy head phones. Two SIM slots one nano and the other slot can be used for wither micro SIM OR SD card. Edge display is top notch and attractive. Samsung pay app makes all heads turn in super markets. Felt like a celebrity. Go for it without second thought. Iris scanner, face recognition too.will again write back after some days of usage", "verification": {"CERTIFIED_BUYER": true}, "date": "29 May, 2017", "reviewer": "Flipkart Customer"},
{"rating": 1, "title": "Worthless", "review": "Paying the EMI, using the phone someone else..", "verification": {"CERTIFIED_BUYER": true}, "date": "8 Feb, 2018", "reviewer": "Partha  Ghosh"},
{"rating": 5, "title": "Must buy!", "review": "Great Phone!!", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Jun, 2017", "reviewer": "Prateek Garg"},
{"rating": 4, "title": "Good choice", "review": "Superb👌", "verification": {"CERTIFIED_BUYER": true}, "date": "13 Jun, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Great product", "review": "Awesome phone", "verification": {"CERTIFIED_BUYER": true}, "date": "23 May, 2017", "reviewer": "Satya Singh"},
{"rating": 3, "title": "Anyone able to get the promo code for wireless charger", "review": "phone is good but the process for ordering free wireless charger seems flawed. Did flipkart prebook the device with the mobile number mapped to my flipkart account ?", "verification": {"CERTIFIED_BUYER": true}, "date": "5 May, 2017", "reviewer": "ANUPAM SARSAR"},
{"rating": 5, "title": "Best in the market!", "review": "Nice phone", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Jan, 2018", "reviewer": "hussain 143"},
{"rating": 5, "title": "Classy product", "review": "awesome experience with flipcart...before time delivery", "verification": {"CERTIFIED_BUYER": true}, "date": "31 Dec, 2017", "reviewer": "Karamjeet Hora"},
{"rating": 4, "title": "Nice product", "review": "Well its good to hav it", "verification": {"CERTIFIED_BUYER": true}, "date": "30 Dec, 2017", "reviewer": "Navjot Singh"},
{"rating": 4, "title": "Delightful", "review": "Replaced my iPhone with Samsung galaxy s8...no regerets....happ with fast charging,,but took pretty much time to adjust from IPhone to galaxy.!!\nTy Flipkart for fast delivery!!", "verification": {"CERTIFIED_BUYER": true}, "date": "6 Dec, 2017", "reviewer": "Vinodh Reddy"},
{"rating": 3, "title": "Good", "review": "Nothing wrong with phone. Disappointed with flipkart service. The phone delivered was completely discharged. May be someone used it.", "verification": {"CERTIFIED_BUYER": true}, "date": "28 Nov, 2017", "reviewer": "Rohan Prakash  Diwate"},
{"rating": 5, "title": "Must buy!", "review": "It's just ask feeling to hold this phone.....thank u flipkart.....u never disappointed me....and all of the above always on time.", "verification": {"CERTIFIED_BUYER": true}, "date": "17 Nov, 2017", "reviewer": "Flipkart Customer"},
{"rating": 5, "title": "Fabulous!", "review": "Samsung s8 is simply superb with Bixby it is sure make the mobile operation smooth and easy.", "verification": {"CERTIFIED_BUYER": true}, "date": "15 Nov, 2017", "reviewer": "jayanth sinha"},
{"rating": 5, "title": "Terrific purchase", "review": "Perfect phone. Must buy !!!", "verification": {"CERTIFIED_BUYER": true}, "date": "14 Nov, 2017", "reviewer": "NIKHIL KIBE"},
{"rating": 5, "title": "Brilliant", "review": "Iphone killer phone. Best dislpay. Best camera. Best performance. Best battery.  5 of 5", "verification": {"CERTIFIED_BUYER": true}, "date": "11 Nov, 2017", "reviewer": "Sagar Patel"}
]